{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=1890","data":[{"id":"6172472832","type":"user-reviews","attributes":{"title":"if I could leave 0 stars, I would.","review":"I am so disappointed in MY president. I logged on in hopes to see the GREAT ORANGE GOD sharing his brilliant racist, homophobic, sexist, communistic views BUT when I put all of my information in I started receiving texts like “get back in the kitchen” and “black lives don’t matter”! Then I started having the urge to tell people if they don’t like Murcia then they can move????? For some reason I even ALMOST donated to my local police department (but I controlled myself, gladly) then I left work and when I got outside I swore I saw god himself, Donald trump, in the clouds. It was so traumatic. got home from work and everything in my house looked like it was covered in Cheetos! I was like YAY my lucky day but when I go to eat one I realize.............................................ITS STALE. grossssssssss. for now on I can’t eat Cheetos and I can’t even look at myself the same.","date":"2020-07-08T14:28:39Z","rating":1,"userName":"Uhh insert nickname here","isEdited":false}},{"id":"6177620798","type":"user-reviews","attributes":{"title":"DisgustAng","review":"I opened this app and it was BLINDING. I thought I would never see again. Why would they put a roach on the front of the app? Is this some joke? I needed to un download it as soon as I could. So I deleted the app. But it WOULDN'T DELETE. So THREW my phone off a cliff. BUT IT WOULDN'T FIX. So I am now STUCK with this DISGUSTING app ON. MY. PHONE. I am truly annoyed. Please do not download this app. It made my cat so repulsed by my actions of downloading this he drank rat poison. So I decided to talk first hand with trump. I took my white van and I drove all the way to the White House. BUT THE ONLY PERSON THERE WAS A RACIST DISGUSTANG ROACH. Where did they hide the president? I DON’T KNOW. So if any of you know where he is tell me please. Over all this app is just as bad as my grades. Please don’t download it for your own safety of you and your cat. And maybe your sanity to. Thank you for coming to my ted talk.","date":"2020-07-09T17:45:27Z","rating":1,"userName":"Norahp2007","isEdited":false}},{"id":"6177612274","type":"user-reviews","attributes":{"title":"THIS APP KILLED ME😾","review":"I opened up this app to see a disgustingly orange creature which then led me to move to paris. I was going on a tour of the city and I ended up at the top of the eiffel tower. while I was up there I opened the app again just to see that mortifying creature again and it startled me so I fell off the eiffel tower and I landed on a huge trampoline which flung me to saturn. At Saturn I met this very nice talking anteater and he told me that I should move to Neptune to meet the ancient creature that lived there so I did. Once I got to Neptune I explain the situation and how I got here and he told me to leave this review to warn people about this app and what could happen to you. So I did and then he put me in his cannon and shot me back to Earth but the cannon didn't make it all the way so I was stranded in space with no way to breathe. SO IF YOU VALUE YOUR LIFE don't download this app.","date":"2020-07-09T17:42:44Z","rating":1,"userName":"Brspaceout","isEdited":false}},{"id":"6177162808","type":"user-reviews","attributes":{"title":"Needs updated??","review":"I recently downloaded this app to follow the trump campaign since elections are coming up in the fall. Unfortunately, I noticed that the app kept crashing and at first I wondered if it was my phone at fault. After some troubleshooting on my end, I decided to search the internet to see if this was happening to other people. Lo and behold, it is a problem on the app developers end. Apparently this app crashes all the time and I wouldn’t waste my time and storage downloading it. They obviously need to update the app or rework it all together and try again. I’m so disappointed that the president can’t even put forth a good app, let alone run the country. This is influencing my opinions on his ability to keep our country stable considering he can’t even put out a reliable app in the 21st century.","date":"2020-07-09T15:29:21Z","rating":1,"userName":"SarahS155782","isEdited":false}},{"id":"6176881629","type":"user-reviews","attributes":{"title":"our beloved president HIT ON ME","review":"i was so excited to download this app so i could continue to worship the cheeto man as our new lord and savior. when you open the app, it immediately asks for your phone number, which of course i gave to them. however, i soon began to receive messages directly from mr. president himself! at first i was extremely excited, i mean, who wouldn’t be, getting the chance to talk to the greatest person to ever live. but soon, mr. president began to talk if the things he would do to me if he got the chance, including how he would “grab me by the p****” and how he wanted to “take me to his pal jeff epstein’s island.” when i declined his offers, for i can not condone him cheating on his beloved melania, the fbi showed up at my door to directly deliver a death threat. i am now scared for my life. do not download this app if you want to live!","date":"2020-07-09T14:13:17Z","rating":1,"userName":"smdeer","isEdited":false}},{"id":"6176018643","type":"user-reviews","attributes":{"title":"🧚🏼‍♀️✨❤️🙈🥐🥰","review":"Took around 69 weeks to completely finish installing and once it had finally installed I was interested in the app to see if it would perhaps change my perspective on Donald J Trump and it really didn’t so I removed the app, and I was angry because it took so long to download just for me to delete it immediately. Anyways, once I deleted it, I got a call from a man named “Trump” himself and he called me a bunch of slurs and that he would haunt me forever so I really don’t recommend the app unless you want to be haunted forever.... Oh and, my electricity also went off after I deleted the app and got the call. When it turned on, there were pictures of our president on all our electronics (tvs, phones, computers, etc.) AND my baby sister’s first word was “Trump”, so I genuinely think Trump is haunting me now, ABSOLUTELY TERRIFYING!!!!!!!!!!!!!!","date":"2020-07-09T10:08:21Z","rating":1,"userName":"sntnfn","isEdited":false}},{"id":"6175971329","type":"user-reviews","attributes":{"title":"DONT DOWNLOAD","review":"I was laying in bed watching the queen peppa pig and i saw this app bc i was just looking for random apps so i downloaded it everything was going fine at first so i turned my phone off and went to bed i woke up in the middle of the night with Donald trump on my wall twearking i got scared so the next morning i bleached my eyes i got scared so i tried to delete the app but it did not let me and i was like wth so i don’t think anything of it maybe it was a dream! So the next night i went to bed then i woke up agian with My fingers doing the ReNaGaDe so i screamed! And told my mom and she dident believe me so she downloaded it a-and the next day she was gone and there was a note s-so i read it and they said they went to the sksksks sksksk white house sksksks sksksk jsjsjsjsjsksksksksksk i find her b-but donald trump was naked shaking his bootay it was skurry ⚠️ DON’T DOWNLOAD⚠️","date":"2020-07-09T09:53:05Z","rating":1,"userName":"lolgirlhayhirlfuk","isEdited":false}},{"id":"6175565731","type":"user-reviews","attributes":{"title":"DO NOT GET!!!","review":"This app takes up way too much space and is useless! I usually don’t give bad reviews to apps and thought I’d give this a chance but I just can’t. It slows down my phone and has too many glitches. Learn how to do better on your apps and as a person! After downloading the app I starting getting constant glitches on my phone showing me a picture of a cheeto puff with blonde hair on it???? Not only that but all the data on my phone was erased!!! 😡😡 There’s this alert I get saying that “this app brings all Karen’s together to be racist and ignorant along with being obnoxious and xenophobic” I can’t go two seconds without hearing the Karen alert asking to speak to the manager and vote for trump!? I’m sorry but after all this app has done to my life in a matter of minutes AFTER A 2 WEEK DOWLOAD, soooo not worth it!","date":"2020-07-09T07:33:50Z","rating":1,"userName":"JusPeachy Laura","isEdited":false}},{"id":"6175292487","type":"user-reviews","attributes":{"title":"I want to leave","review":"This app made me super depressed. I will never be able to eat a Cheeto again. I took my dog for a walk and we ended up in some weird building, we walked through one of the many doors and upon my eyes there stood the biggest Cheeto I have ever seen. He was getting a spray tan and I assume that it could only be because he was staring in a Cheeto puff comercial. My dog saw something hanging on the Cheetos body and as much as I tried to hold him back, by dog charged towards the Cheeto and bit half of it off (it was already small enough at its original size). Soon after this incident I was informed that my dog had just attacked the president, though I don’t understand how that’s possible because his intelligence is as advanced as a cricket and my dog would be a far better candidate for his job. This was all due to the creation of this app.❤️","date":"2020-07-09T05:48:12Z","rating":1,"userName":"i cant poop it hurts❤️","isEdited":false}},{"id":"6174898876","type":"user-reviews","attributes":{"title":"Absolutely horrible","review":"I downloaded the app for the 1 millionth time (it’s was actually the 6,000th time) and as soon as I did a crowd of around 1,000 chickens with “Trump 2020” hats came running into my room. I thought to myself “Look at all those chickens” as I screamed “YOU'RE FIRED!” After almost 5 hours of trying to get all 1,000 chickens out of my 1 bedroom apartment on the 3rd floor I ran down the steps of my building, to my car, and drove straight to a trump rally. Where I didn’t have to wear a mask (which was a relief). When I got home, the FBI was at my door step telling me that I was under investigation because I forgot to put ketchup on my hamster. They also told me that the Trump app that I downloaded because I wanted to support our wonderful president, was causing my pencil sharpener malfunction. I had a terrible day because of this app. DO NOT DOWNLOAD.","date":"2020-07-09T03:36:18Z","rating":1,"userName":"ur ßëśtÿ","isEdited":false}}]}