{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23480","data":[{"id":"6068230557","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"DISAPPOINTED! NOT LIKE ONLYFANS!!","review":"Usually I don’t hesitate in giving daddy Donald my money but this time this went too far. I thought this was going to be like an onlyfans paid subscription, but all I got was daddy Donald’s tweets. I don’t care about paying a monthly subscription to him, as long as that money goes to make his bunker safer or I get to see his baby carrot.","date":"2020-06-12T21:07:56Z","userName":"Kerem G."}},{"id":"6068635498","type":"user-reviews","attributes":{"rating":5,"isEdited":false,"title":"Format  The whole format easy to use","review":"T The whole format easy to use","date":"2020-06-13T00:01:59Z","userName":"purplemountains"}},{"id":"6068030085","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Poorly made","review":"I downloaded this app to show support for my president, but every time I open the app it crashes. Hope this gets solved because I read the other real reviews, not the fake ones by liberal cry babies, and it seems like a good app. Sad that it has technical issues. Will keep trying. TRUMP 2020 🇺🇸","date":"2020-06-12T19:45:14Z","userName":"plzbeavavaliable"}},{"id":"6067565134","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"This app made me bi","review":"Thanks a lot Don! I use this app 1 single day and now I’m an alphabet person (an LGBTQ) I would rate this - 5 stars! My parents kicked me out! I have no choice but to roll up my pant cuffs and head to Chaz. Maybe the “warlords” will allow me to participate in their *terrifying* painting activities? Life was much better as a straight, ugly, dumb person.. SAD!","date":"2020-06-12T16:54:39Z","userName":"SaundraFaye"}},{"id":"6061309674","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"ew??? gross??????","review":"Was expecting a place to give all my money to this hardworking and dedicated young man, but instead when I loaded the app, my screen was bombarded with all these child r*pe allegations!!?? And they’re all real???? I’m thoroughly disgusted and frankly disappointed in our brilliant, not at all racist executive-in-chief who has very large hands and an even larger peni","date":"2020-06-11T03:13:20Z","userName":"Salt Grain"}},{"id":"6057254180","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"disgusted","review":"as soon as i opened the app my phone completely shut off and then a blank screen appeared and finally after 2 minutes of nothing a video of donald trump making out with his daughter appeared. i am currently typing from my hp laptop because my phone is no longer usable. the carelessness in which this app was set up aggravates me to the fullest extend. and i am appalled by what i have just witnessed. even though we all know he is a child rapist i just assumed there wouldn’t be anything of that nature on his app. like insect...c’mon donald. overall disgusted.","date":"2020-06-10T03:54:49Z","userName":"jojojijojoji"}},{"id":"6056797303","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"TERRIBLE APP DON’T DOWNLOAD","review":"This app caused my phone to crash 4 times in the space of an hour and I think there is foreign malware in it that’s causing it to send all my data to international spies! My children use this phone and we’re horrified by the very unflattering and compromising images of our dear president that were being portrayed on the app!","date":"2020-06-10T00:59:34Z","userName":"garbagegalgg42"}},{"id":"6053469274","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Keeps Crashing","review":"I was super bummed this app kept freezing my phone and then it would just crash. So infuriating because I was so excited for it. I just couldn’t wait to get the word from our fearless leader. But definitely do not download unless you want your phone to get messed up.","date":"2020-06-09T05:27:14Z","userName":"HannielS"}},{"id":"6050369263","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"useless orange cheeto","review":"i downloaded this app and oh my god was i scared when i saw an orange cheeto pop up. i was mortified. i had to go to the hospital and get my eyes cleansed. it also made my phone very very hot and difficult to use. it only happened when i used the app. my phone also caught 534 viruses after using this app. DO NOT RECOMMEND","date":"2020-06-08T11:11:28Z","userName":"\"stuping f dinosoar\""}},{"id":"5894336090","type":"user-reviews","attributes":{"rating":5,"isEdited":false,"title":"Best App and president 5 Stars","review":"This app is making America great again. Love the simplicity and design. I wouldn’t expect anything less from the best president EVER","date":"2020-05-02T19:12:14Z","userName":"Dirtywhat"}}]}