{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37560","data":[{"id":"6178579994","type":"user-reviews","attributes":{"review":"First off, the app took 40+ hours to download. I can’t say how disappointed i am in this. I have never seen a more worse app than this and this is just unexplainable.","date":"2020-07-09T23:15:42Z","isEdited":false,"userName":"Simply just.... trash","rating":1,"title":"This App is trash"}},{"id":"6178578283","type":"user-reviews","attributes":{"review":"I downloaded the app to support my gracious president but my phone got infected with a misogynistic racist homophobic virus. I even started to feel dizzy just looking at photos of our wonderful president. Don’t download it’s not worth it.","date":"2020-07-09T23:15:00Z","isEdited":false,"userName":"asfhibgj","rating":1,"title":"Terrible"}},{"id":"6178577100","type":"user-reviews","attributes":{"review":"I downloaded this app to see what kind of campaign tactics my favorite president was using but it turns out it is just money. 🧚🏼‍♀️✨Oh well. Just got to hope he doesn’t ban tiktok.","date":"2020-07-09T23:14:31Z","isEdited":false,"userName":"john the kay john","rating":1,"title":"Very interesting experience"}},{"id":"6178564275","type":"user-reviews","attributes":{"review":"Guys I am warning you,DO NOT download this app. If you open up this app it will glitch the screen and will show this very ugly orange guy on the screen. This guy is like a racist and a homophobe. He is super scary I don’t recommend downloading this app.","date":"2020-07-09T23:09:50Z","isEdited":false,"userName":"everone in their right mind","rating":1,"title":"No❤️"}},{"id":"6178563637","type":"user-reviews","attributes":{"review":"Took hours to load and put malware on my phone malware the things the crashes your phone and makes it easy for hackers to get in to your phone watch out my fellow Americans.","date":"2020-07-09T23:09:35Z","isEdited":false,"userName":"beaver kid","rating":1,"title":"MALWARE"}},{"id":"6178553889","type":"user-reviews","attributes":{"review":"It told me it was gonna take 4 hours to download. I never had an app that took 4 hours to download. The app itself is just horrible. Remove it from the app store instantly.","date":"2020-07-09T23:05:35Z","isEdited":false,"userName":"Jayden1k","rating":1,"title":"App is horrible"}},{"id":"6178537898","type":"user-reviews","attributes":{"review":"so when i download the app it took approximately 7-8hours to download. and my phone is up to date and working well i downloaded flappy bird and it took only 1 minute, and after i opened the donald trump app it crash my phone and i had to restart my phone. as how much i loveeeeee my president trump😁 i would give this a one star for how the quality of the app and ofc to support my dear president so take this one star <3💞💖😽💘","date":"2020-07-09T22:59:14Z","isEdited":false,"userName":"fortnitesixnine","rating":1,"title":"yea uhm anyways"}},{"id":"6178530160","type":"user-reviews","attributes":{"review":"First off this took 1 week to download and then it crashed my phone and messed up my contacts and then the app didn’t want to work this app made my dog run away. Write a one star review.","date":"2020-07-09T22:56:12Z","isEdited":false,"userName":"stevenCerom","rating":1,"title":"Basura 🗑"}},{"id":"6178529334","type":"user-reviews","attributes":{"review":"Guys I’m just a USA lovin gal like the rest of you but this app made my phone glitch and had all sorts of issues with PRIVACY!!!! If you care about your PRIVACY DONT GET THIS APP- I hope Trump knows about these privacy violations and fixes this!!!!!","date":"2020-07-09T22:55:52Z","isEdited":false,"userName":"zozobutts","rating":1,"title":"Privacy issues"}},{"id":"6178508889","type":"user-reviews","attributes":{"review":"I’m a maga baby and all😉 but like this app is really broken and it needs A LOT of fixing needed to even be eligible to be in the Apple store I would very much appreciate it if this app was removed for repairs thank you!!✨🧚🏼‍♀️","date":"2020-07-09T22:47:43Z","isEdited":false,"userName":"Stupid decision snapchat","rating":1,"title":"Trump 2020 but this app ain’t it"}}]}