{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=40040","data":[{"id":"6174108788","type":"user-reviews","attributes":{"date":"2020-07-08T23:28:43Z","userName":"Dafav._","rating":1,"review":"I opened the app to see big cheeto giving a wig tutorial. When I tried to call and make a complaint the worker punched me through the phone knocking out my two front teeth. 😡 I do not recommend this app.","title":"DISGUSTING","isEdited":false}},{"id":"6174107292","type":"user-reviews","attributes":{"date":"2020-07-08T23:28:08Z","userName":"Morgan Monchilov","rating":1,"review":"This app will not stop giving me a panic attack. With all the stuff going on in the US when I see everything at once I panic. This app should not be available to the public and we need to ban it.","title":"TikTok","isEdited":false}},{"id":"6174093999","type":"user-reviews","attributes":{"date":"2020-07-08T23:23:11Z","userName":"Kelly, Christi, Dr Holly","rating":1,"review":"did you just sit here and say that my daughter looks miserable so maybe we should put kehlani in her place. no i never said that. yes you most certainly did. no i didn’t dingbat, listen! i said brooke your mother - gEt YoUr FiNgeR oUt oF mY fAcE! GIRLS OUTTA THE ROOM","title":"this app is TRASH","isEdited":false}},{"id":"6174091954","type":"user-reviews","attributes":{"date":"2020-07-08T23:22:26Z","userName":"lilduckdash","rating":1,"review":"I can’t even spell this app let me tell that if you download this you die immediately my mom had to call the hospital and they had to take me because it’s worse then cancer","title":"Ulgly","isEdited":false}},{"id":"6174090646","type":"user-reviews","attributes":{"date":"2020-07-08T23:21:57Z","userName":"witchybbg","rating":1,"review":"So many glitches in the app I can barely open it. Was trying to sign up for a rally to see my favorite president but now I cannot. Truly don’t think I can support trump after this.","title":"Garbage app","isEdited":false}},{"id":"6174083620","type":"user-reviews","attributes":{"date":"2020-07-08T23:19:22Z","userName":"poopy boy hehe","rating":1,"review":"wow this was such an awful app. did you know trump is all over this app. i cried so much and threw up a bit. this is an awful app and NOBODY should download it, unless you want to leave a review of course 😁. i’m deleting it now AWFUL HORRIBLE AWFUL APP DO NOT DOWNLOAD UNLESS YOU WANT TO CRY","title":"yucky man child 😌","isEdited":false}},{"id":"6174080724","type":"user-reviews","attributes":{"date":"2020-07-08T23:18:35Z","userName":"addiction to tiktok lol","rating":1,"review":"Umm, first of all why do they have an app for a piece of 💩?? And I hate this app because right when you open up the app, a picture of an organ pops up 🤮. Like who wants to see that? Anyways this app needs to get banned 🥱🤢.","title":"HORRIBLE APP!!!","isEdited":false}},{"id":"6174074052","type":"user-reviews","attributes":{"date":"2020-07-08T23:16:03Z","userName":"orange cheeto puff yum yum","rating":1,"review":"i’m in line at the grocery store to buy a bad of family sized cheetos and i opened my app to gong a horrifying picture of what looks like a spoiled cheeto so i put the bad back and walked away but as i further went on to use the app i kept getting disturbing pictures of a baby cheeto atached to the big cheeto almost like a pp. anyways this is more sad pornography then i expected i cry myself to sleep because of this!!!","title":"i have ptsd now","isEdited":false}},{"id":"6174064816","type":"user-reviews","attributes":{"date":"2020-07-08T23:12:35Z","userName":"Kiss my Ass#26","rating":1,"review":"I opened this app and the first thing i see is a picture of a wrinkly old cheeto😳 then as i proceed on the app, there are multiple racist, homophobic, transphobic, misogynistic, insults and sayings. this app is spreading hate in an already hateful world. we need no more of this","title":"just ugly🤮","isEdited":false}},{"id":"6174053935","type":"user-reviews","attributes":{"date":"2020-07-08T23:08:37Z","userName":"sisbehdna nehdrbsuvs","rating":1,"review":"I woke up to see an orange on my screen that was wearing a wig made out of cat hair. I completely forgot I had this app and got scared my phone got hacked because of this app, when I went to delete   I saw a white man. Whiter than flashback Mary (James Charles)","title":"Scary","isEdited":false}}]}