{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=113800","data":[{"id":"6175060726","type":"user-reviews","attributes":{"userName":"jayda💕","date":"2020-07-09T04:26:47Z","title":"Trump=🤡","rating":1,"review":"I hate this app🤮🤮🤮🤢🤢🤢🤢","isEdited":false}},{"id":"6175031934","type":"user-reviews","attributes":{"userName":"sbjcejsoksfncuuf","date":"2020-07-09T04:17:47Z","title":"TERRIBLE","rating":1,"review":"WHEN I OPENED THE APP I SAY A T STANDING FOR TRUMP. I PASSED OUT BC WHENEVER I SEE TRUMP I PASS OUT. ALSO, THERE WERE SO MSNY GLITCHES IN NOTIFICATIONS FIX UR APP","isEdited":false}},{"id":"6174927357","type":"user-reviews","attributes":{"userName":"TIKTOC SOLDIER","date":"2020-07-09T03:44:47Z","title":"THIS IS WAR TRUMP","rating":1,"review":"TRUMP IS PLANNING TO BAN TIKTOK FROM AMERICA BUT HE MESSED WITH THE WRONG APP TIKTOK WILL BE FIGHTING BACK AT YOU AND IF YOU WANT A WAR YOU GOT ONE SO BRACE YOURSELF CAUSE WERE COMING FOR YOU DONALD J TRUMP🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬","isEdited":false}},{"id":"6174845758","type":"user-reviews","attributes":{"userName":"ggiiiaaanna","date":"2020-07-09T03:20:46Z","title":"terrible no good very bad app","rating":1,"review":"justice for breonna taylor ✊🏻✊🏼✊🏽✊🏾✊🏿","isEdited":false}},{"id":"6174828619","type":"user-reviews","attributes":{"userName":"Muffin Madison","date":"2020-07-09T03:15:43Z","title":"worst app!","rating":1,"review":"he’s a rapist and racist 🤢","isEdited":false}},{"id":"6174817871","type":"user-reviews","attributes":{"userName":"cat27494","date":"2020-07-09T03:12:35Z","title":"no❤️","rating":1,"review":"T I T A N I C\n\n                              a screenplay by\n                               James Cameron\n\n1 BLACKNESS\n\nThen two faint lights appear, close together... growing brighter. They\nresolve into two DEEP SUBMERSIBLES, free-falling toward us like express\nelevators.\n\nOne is ahead of the other, and passes close enough to FILL FRAME, looking\nlike a spacecraft blazing with lights, bristling with insectile\nmanipulators.\n\nTILTING DOWN to follow it as it descends away into the limitless blackness\nbelow. Soon they are fireflies, then stars. Then gone.\n\n                                                                   CUT TO:\n\n2 EXT./ INT. MIR ONE / NORTH ATLANTIC DEEP\n\nPUSHING IN on one of the falling submersibles, called MIR ONE, right up to\nits circular viewport to see the occupants.\n\nINSIDE, it is a cramped seven foot sphere, crammed with equipment. ANATOLY\nMIKAILAVICH, the sub's pilot, sits hunched over his controls... singing\nsoftly in Russian.\n\nNext to him on one side is BROCK LOVETT. He's in his late forties, deeply\ntanned, and likes to wear his Nomex suit unzipped to show the gold from\nfamous shipwrecks covering his gray chest hair. He is a wiley, fast-talking\ntreasure hunter, a salvage superstar who is part historian, part adventurer\nand part vacuum cleaner salesman. Right now, he is propped against the CO2\nscrubber, fast asleep and snoring.\n\nOn the other side, crammed into the remaining space is a bearded wide-body\nnamed LEWIS BODINE, sho is also asleep. Lewis is an R.O.V. (REMOTELY\nOPERATED VEHICLE) pilot and is the resident Titanic expert.\n\nAnatoly glances at the bottom sonar and makes a ballast adjustment.\n\n                                                                   CUT TO:\n\n3 EXT. THE BOTTOM OF THE SEA\n\nA pale, dead-flat lunar landscape. It gets brighter, lit from above, as MIR\nONE enters FRAME and drops to the seafloor in a downblast from its\nthrusters. It hits bottom after its two hour free-fall with a loud BONK.\n\n                                                                   CUT TO:\n\n4 INT. MIR ONE\n\nLovett and Bodine jerk awake at the landing.\n\n                                  ANATOLY\n\n                          (heavy Russian accent)\n\nWe are here.\n\nEXT. / INT. MIR ONE AND TWO\n\n5 MINUTES LATER: THE TWO SUBS skim over the seafloor to the sound of\nsidescan sonar and the THRUM of big thrusters.\n\n6 The featureless gray clay of the bottom unrols in the lights of the subs.\nBodine is watching the sidescan sonar display, where the outline of a huge\npointed object is visible. Anatoly lies prone, driving the sub, his face\npressed to the center port.\n\n                                  BODINE\n\nCome left a little. She's right in front of us, eighteen meters. Fifteen.\nThirteen... you should see it.\n\n                                  ANATOLY\n\nDo you see it? I don't see it... there!\n\nOut of the darkness, like a ghostly apparition, the bow of the ship\nappears. Its knife-edge prow is coming straight at us, seeming to plow the\nbottom sediment like ocean waves. It towers above the seafloor, standing\njust as it landed 84 years ago.\n\nTHE TITANIC. Or what is left of her. Mir One goes up and over the bow\nrailing, intact except for an overgrowth of \"rusticles\" draping it like\nmutated Spanish moss.\n\nTIGHT ON THE EYEPIECE MONITOR of a video camcorder. Brock Lovett's face\nfills the BLACK AND WHITE FRAME.\n\n                                  LOVETT","isEdited":false}},{"id":"6174816277","type":"user-reviews","attributes":{"userName":"teenyteickepickle","date":"2020-07-09T03:12:07Z","title":"WORST APP EVER","rating":1,"review":"It spoiled all my milk.","isEdited":false}},{"id":"6174803407","type":"user-reviews","attributes":{"userName":"karen 420","date":"2020-07-09T03:08:21Z","title":"DISGUSTINGAPP!!!!!!!!!!!!!","rating":1,"review":"literally STOLE MY MF MICROWAVE!!! and my FRIDGE!!! how tf. delete it. period💅🏼","isEdited":false}},{"id":"6174794606","type":"user-reviews","attributes":{"userName":"julie.m.g","date":"2020-07-09T03:05:45Z","title":"THIS APP BURNED MY CHICKEN NUGGETS","rating":1,"review":"I WAS WARMING UP MY CHICKEN NUGGETS IN MY AIR FRYER AND IT BLEW UP. THIS HAPPENED RIGHT AFTER I DOWNLOADED THIS APP. COINCIDENCE? I THINK NOT!!!! I TRIED PUTTING MY AIR FRYER AND CHICKEN NUGGETS IN RICE BUT EVEN THE RICE BLEW UP.","isEdited":false}},{"id":"6174631044","type":"user-reviews","attributes":{"userName":"sorrynitsorry","date":"2020-07-09T02:16:57Z","title":"THE WORST","rating":1,"review":"Honestly THE WORST app to exist ever","isEdited":false}}]}