{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35190","data":[{"id":"6174962290","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:55:37Z","title":"shawty like a melody in my head 😖✨","userName":"shierbee","review":"i downloaded this app because i thought it would give me tips on how to take my dishes on a walk. there was 0 advice and i had to overshare all of my info and my feelings. also could benefit from some boppin music in the background, maybe k pop? would probably benefit more from getting rid of the app as a whole though ;) anyways, my dishes and i were left unsatisfied would not recommend"}},{"id":"6174952088","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:52:29Z","title":"Worst trade deal in the history of trade deals","userName":"strawhatpirates_luffy","review":"This has to be the most poorly thought out app. It is way too complicated for trump supporters. How do you expect us to navigate through this game?! I wish I could rate it negative stars."}},{"id":"6174937463","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:47:53Z","title":"Trash","userName":"Iloveyoumorethanlife12345","review":"This made my phone glitch so bad I couldn’t even keep it on for more than 5 minutes!!! You think that the president would’ve made a better app, this is super disappointing. ☹️"}},{"id":"6174933289","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:46:37Z","title":"TikTok & Facebook","userName":"Mathias Aviles","review":"Is kids and adults want our apps and what did we do for though apps to go down what makes u think that we don’t enjoy pls don’t take them down we have memories with though apps."}},{"id":"6174917245","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:41:47Z","title":"Horrible service","userName":"cai201552","review":"This took my shoes and killed my white sister. It also punched John B in the face. My cat went to McDonald’s and won’t come back. This app also took my sickly do just like Carl. I know that the stale Cheeto has made it really difficult to breathe in America."}},{"id":"6174897104","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:35:47Z","title":"Do not use!!!","userName":"heather12344","review":"My goose was scrolling thru my phone (as usual), then she saw something so horrid on this app she died on the spot😢The app continued to steal my toaster oven and kidnap my grandma. 😫She is still missing but if you see her just call her name and she will come running. Her name is shoelace🥺"}},{"id":"6174894789","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:35:05Z","title":"Do not download it has a virus","userName":"lil sushi626","review":"Worst app ever (comic book guys voice)\nThis app told me to go back where I came from 😔 and my pet lemur was not able to use it either plus it gave my phone a virus I turned orange like some kind of Cheeto 😢"}},{"id":"6174887107","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:32:50Z","title":"This app is trash","userName":"kai kai ugly 2345758","review":"I hate this app it knows all your personal information and it works at  McDonough and nobody like McDonnell so please remove this app now sike u thought I was gonna be nice nopeeee catch me outside how about that Period and do you know you’re. Megan baby"}},{"id":"6174882922","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:31:38Z","title":"Never get this app","userName":"kkalee8","review":"It glitched multiple times, ran super slow, and was an overall waste of space. I just wanted to see my favorite thick omppa loompa bunker boy but the app was too slow for me to ever actually get a good use out of it"}},{"id":"6174881924","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:31:21Z","title":"Major Glitches","userName":"Pilot Sammy","review":"Just the worst app I’ve tried. Literally the WORST. And I know apps, I’ve worked with many software engineers and developers. Great people, developers. A little awkward, but very good people. Anyway, this app is a massive disappointment. Hugely disappointing."}}]}