{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=129530","data":[{"id":"6175212893","type":"user-reviews","attributes":{"review":"THIS APP MADE ME VIDEO MYSELF EATING MY TOENAILS AND SEND IT TO THEM!!! IF I DIDNT DO IT THEY SAID THEYD GIVE MY PET DINOSAUR HIV!!! IF I COULD IF THIS APP 0 STARS I WOULD!!!","userName":"peepee poopoo boy","title":":(","rating":1,"date":"2020-07-09T05:17:54Z","isEdited":false}},{"id":"6175210081","type":"user-reviews","attributes":{"review":"Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it Stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it stop it","userName":"The starry pheasant","title":"No","rating":1,"date":"2020-07-09T05:16:52Z","isEdited":false}},{"id":"6175209080","type":"user-reviews","attributes":{"review":"downloaded to see what the hype was about, but i guess they sensed i was mexican and deported my family. even the dog. i thought nah, there’s no way they could know, but then all my tortillas and frijoles disappeared and took Lean Like a Cholo off Spotify. still, i kept the app, eager to educate myself on how to make america great. then my hair turned blond, my eyes changed blue, i grew 5 inches, and all my arm hair was gone. this app turned me into a gringa! this app ruined my life. i now have no family, dog, food, or culture. all for tryna be a good citizen.","userName":"akaryherrera","title":"straight up trash.","rating":1,"date":"2020-07-09T05:16:32Z","isEdited":false}},{"id":"6175206459","type":"user-reviews","attributes":{"review":"So to start off, the app runs a lot of pro-Russia ads for some reason. And it SERIOUSLY slows down your phone when you download it! My battery started acting weird and wouldn’t charge! Parts of the screen wouldn’t respond to touch while in the app and the effect lasted for roughly 20 minutes after closing it! DO NOT DOWNLOAD THIS! I also re-downloaded and double checked the code, and it DATA MINES like that app TikTok.","userName":"Lokidaughter","title":"So many glitches","rating":1,"date":"2020-07-09T05:15:33Z","isEdited":false}},{"id":"6175205972","type":"user-reviews","attributes":{"review":"According to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway. Because bees don’t care what humans think is impossible.” SEQ. 75 - “INTRO TO BARRY” INT. BENSON HOUSE - DAY ANGLE ON: Sneakers on the ground. Camera PANS UP to reveal BARRY BENSON’S BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black...oohh, black and yellow... ANGLE ON: Barry wearing the sweater he picked, looking in the mirror. BARRY (CONT’D) Yeah, let’s shake it up a little. He picks the black and yellow one. He then goes to the sink, takes the top off a CONTAINER OF HONEY, and puts some honey into his hair. He squirts some in his mouth and gargles. Then he takes the lid off the bottle, and rolls some on like deodorant. CUT TO: INT. BENSON HOUSE KITCHEN - CONTINUOUS Barry’s mother, JANET BENSON, yells up at Barry. JANET BENSON Barry, breakfast is ready! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 1. INT. BARRY’S ROOM - CONTINUOUS BARRY Coming! SFX: Phone RINGING. Barry’s antennae vibrate as they RING like a phone. Barry’s hands are wet. He looks around for a towel. BARRY (CONT’D) Hang on a second! He wipes his hands on his sweater, and pulls his antennae down to his ear and mouth. BARRY (CONT'D) Hello? His best friend, ADAM FLAYMAN, is on the other end. ADAM Barry? BARRY Adam? ADAM Can you believe this is happening? BARRY Can’t believe it. I’ll pick you up. Barry sticks his stinger in a sharpener. SFX: BUZZING AS HIS STINGER IS SHARPENED. He tests the sharpness with his finger. SFX: Bing. BARRY (CONT’D) Looking sharp. ANGLE ON: Barry hovering down the hall, sliding down the staircase bannister. Barry’s mother, JANET BENSON, is in the kitchen. JANET BENSON Barry, why don’t you use the stairs? Your father paid good money for those. \"Bee Movie\" - JS REVISIONS 8/13/07 2. BARRY Sorry, I’m excited. Barry’s father, MARTIN BENSON, ENTERS. He’s reading a NEWSPAPER with the HEADLINE, “Queen gives birth to thousandtuplets: Resting Comfortably.” MARTIN BENSON Here’s the graduate. We’re very proud of you, Son. And a perfect report card, all B’s. JANET BENSON (mushing Barry’s hair) Very proud. BARRY Ma! I’ve got a thing going here. Barry re-adjusts his hair, starts to leave. JANET BENSON You’ve got some lint on your fuzz. She picks it off.","userName":"besitosparajimin","title":"app is very slow and crashes","rating":1,"date":"2020-07-09T05:15:23Z","isEdited":false}},{"id":"6175205633","type":"user-reviews","attributes":{"review":"💫🙈 Shawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, Deluga Heights (replay)\nHey over and over if I'm tipsy or sober\nI got lil' momma on rewind like the deck in my Rover\nOn my mind, shawty fine, meditate her like yoga\nSo down on the line make me want a cold soda\nHey baby be my radio\nHear you everywhere I go\nMusic in my head\nKnow your melody in every note\nGirl you incredible\nMake yourself available\nNa na na na\nThat tune so exceptional\nSexy like a piano give you my hands if you're ready\nWe can make plans get body stand if you let me\nGirl I'm a fan chasing my boss like catch me\nI ain't a fight she gon arrest me\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nSee you been all around the globe\nNot once did you leave my mind\nWe talk on the phone, from night til the morn\nGirl you really change my life\nDoin things I never do\nI'm in the kitchin cookin things she likes\nWe're real worldwide, breakin all the rules\nSomeday I wanna make you my wife\nThat girl, like somethin off a poster\nThat girl, is a dime they say\nThat girl, is the gun to my holster\nShe's runnin through my mind all day, ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nI can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, I can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, na na na na na na na\nNa na na na na na\nShawty got me singin'\nNa na na na na na na\nNa na na na na na na\nNow she got me singin'\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay 😼✨","userName":"clara nickelton","title":"ahaha 😼","rating":1,"date":"2020-07-09T05:15:16Z","isEdited":false}},{"id":"6175205266","type":"user-reviews","attributes":{"review":"i was fully expecting all the oranges that i could possibly see but all i got was an orange in the form of a human. disgusting. if you made orange juice out of that it would taste like piss. i want quality oranges. this is not quality.","userName":"rat muffin","title":"i didn’t see one orange","rating":1,"date":"2020-07-09T05:15:07Z","isEdited":false}},{"id":"6175205062","type":"user-reviews","attributes":{"review":"This is a horrible app... it has no purpose except to make children cry. I think I’d rather have corona go on for another year before ever using this app again. -1000000/10. i do not recommend...","userName":"Morgy4491","title":"Please Remove This App","rating":1,"date":"2020-07-09T05:15:03Z","isEdited":false}},{"id":"6175204388","type":"user-reviews","attributes":{"review":"According to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway. Because bees don’t care what humans think is impossible.” SEQ. 75 - “INTRO TO BARRY” INT. BENSON HOUSE - DAY ANGLE ON: Sneakers on the ground. Camera PANS UP to reveal BARRY BENSON’S BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black...oohh, black and yellow... ANGLE ON: Barry wearing the sweater he picked, looking in the mirror. BARRY (CONT’D) Yeah, let’s shake it up a little. He picks the black and yellow one. He then goes to the sink, takes the top off a CONTAINER OF HONEY, and puts some honey into his hair. He squirts some in his mouth and gargles. Then he takes the lid off the bottle, and rolls some on like deodorant. CUT TO: INT. BENSON HOUSE KITCHEN - CONTINUOUS Barry’s mother, JANET BENSON, yells up at Barry. JANET BENSON Barry, breakfast is ready! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 1. INT. BARRY’S ROOM - CONTINUOUS BARRY Coming! SFX: Phone RINGING. Barry’s antennae vibrate as they RING like a phone. Barry’s hands are wet. He looks around for a towel. BARRY (CONT’D) Hang on a second! He wipes his hands on his sweater, and pulls his antennae down to his ear and mouth. BARRY (CONT'D) Hello? His best friend, ADAM FLAYMAN, is on the other end. ADAM Barry? BARRY Adam? ADAM Can you believe this is happening? BARRY Can’t believe it. I’ll pick you up. Barry sticks his stinger in a sharpener. SFX: BUZZING AS HIS STINGER IS SHARPENED. He tests the sharpness with his finger. SFX: Bing. BARRY (CONT’D) Looking sharp. ANGLE ON: Barry hovering down the hall, sliding down the staircase bannister. Barry’s mother, JANET BENSON, is in the kitchen. JANET BENSON Barry, why don’t you use the stairs? Your father paid good money for those. \"Bee Movie\" - JS REVISIONS 8/13/07 2. BARRY Sorry, I’m excited. Barry’s father, MARTIN BENSON, ENTERS. He’s reading a NEWSPAPER with the HEADLINE, “Queen gives birth to thousandtuplets: Resting Comfortably.” MARTIN BENSON Here’s the graduate. We’re very proud of you, Son. And a perfect report card, all B’s. JANET BENSON (mushing Barry’s hair) Very proud. BARRY Ma! I’ve got a thing going here. Barry re-adjusts his hair, starts to leave. JANET BENSON You’ve got some lint on your fuzz. She picks it off. BARRY Ow, that’s me! MARTIN BENSON Wave to us. We’ll be in row 118,000. Barry zips off. BARRY Bye! JANET BENSON Barry, I told you, stop flying in the house! CUT TO: SEQ. 750 - DRIVING TO GRADUATION EXT. BEE SUBURB - MORNING A GARAGE DOOR OPENS. Barry drives out in his CAR. \"Bee Movie\" - JS REVISIONS 8/13/07 3. ANGLE ON: Barry’s friend, ADAM FLAYMAN, standing by the curb. He’s reading a NEWSPAPER with the HEADLINE: “Frisbee Hits Hive: Internet Down. Bee-stander: “I heard a sound, and next thing I knew...wham-o!.” Barry drives up, stops in front of Adam. Adam jumps in. BARRY Hey, Adam. ADAM Hey, Barry. (pointing at Barry’s hair) Is that fuzz gel? BARRY A little. It’s a special day. Finally graduating. ADAM I never thought I’d make it. BARRY Yeah, three days of grade school, three days of high school. ADAM Those were so awkward. BARRY Three days of college. I’m glad I took off one day in the middle and just hitchhiked around the hive. ADAM You did come back different. They drive by a bee who’s jogging. ARTIE Hi Barry! BARRY (to a bee pedestrian) Hey Artie, growing a mustache? Looks good. Barry and Adam drive from the suburbs","userName":"why are you stalking me","title":"Absolutely horrendous","rating":1,"date":"2020-07-09T05:14:48Z","isEdited":false}},{"id":"6175203072","type":"user-reviews","attributes":{"review":"According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don't care what humans think is impossible. Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let's shake it up a little. Barry! Breakfast is ready! Ooming! Hang on a second. Hello? - Barry? - Adam? - Oan you believe this is happening? - I can't. I'll pick you up. Looking sharp. Use the stairs. Your father paid good money for those. Sorry. I'm excited. Here's the graduate. We're very proud of you, son. A perfect report card, all B's. Very proud. Ma! I got a thing going here. - You got lint on your fuzz. - Ow! That's me! - Wave to us! We'll be in row 118,000. - Bye! Barry, I told you, stop flying in the house! - Hey, Adam. - Hey, Barry. - Is that fuzz gel? - A little. Special day, graduation. Never thought I'd make it. Three days grade school, three days high school. Those were awkward. Three days college. I'm glad I took a day and hitchhiked around the hive. You did come back different. - Hi, Barry. - Artie, growing a mustache? Looks good. - Hear about Frankie? - Yeah. - You going to the funeral? - No, I'm not going. Everybody knows, sting someone, you die. Don't waste it on a squirrel. Such a hothead. I guess he could have just gotten out of the way. I love this incorporating an amusement park into our day. That's why we don't need vacations. Boy, quite a bit of pomp... under the circumstances. - Well, Adam, today we are men. - We are! - Bee-men. - Amen! Hallelujah! Students, faculty, distinguished bees, please welcome Dean Buzzwell. Welcome, New Hive Oity graduating class of... ...9:15. That concludes our ceremonies. And begins your career at Honex Industries! Will we pick ourjob today? I heard it's just orientation. Heads up! Here we go. Keep your hands and antennas inside the tram at all times. - Wonder what it'll be like? - A little scary. Welcome to Honex, a division of Honesco and a part of the Hexagon Group. This is it! Wow. Wow.","userName":"abbyisthenameofmyAIfriend","title":"Butt holes are nothing to be laughed at they’re just apart of the human body","rating":1,"date":"2020-07-09T05:14:21Z","isEdited":false}}]}