{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=123910","data":[{"id":"6176292361","type":"user-reviews","attributes":{"userName":"kelsey.813","title":"Ughh!!!","date":"2020-07-09T11:33:31Z","rating":1,"isEdited":false,"review":"IM JUST A KIDDDD... I’m just a kid"}},{"id":"6176284166","type":"user-reviews","attributes":{"userName":"hi i hate my life","title":"Absolute garbage","date":"2020-07-09T11:31:07Z","rating":1,"isEdited":false,"review":"Don’t get it"}},{"id":"6176235588","type":"user-reviews","attributes":{"userName":"Rotsolk","title":"No","date":"2020-07-09T11:16:18Z","rating":1,"isEdited":false,"review":"No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no o no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no o no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no o no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no No no no no no no no no no no no no no no no no no no no"}},{"id":"6176205638","type":"user-reviews","attributes":{"userName":"W0wDr3W","title":"yes.","date":"2020-07-09T11:07:09Z","rating":1,"isEdited":false,"review":"yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes. yes."}},{"id":"6176132423","type":"user-reviews","attributes":{"userName":"unsatisfied._cust0mer.","title":"Don’t get it","date":"2020-07-09T10:44:40Z","rating":1,"isEdited":false,"review":"Nope"}},{"id":"6176131411","type":"user-reviews","attributes":{"userName":"ur mm","title":"Bad","date":"2020-07-09T10:44:22Z","rating":1,"isEdited":false,"review":"Just bad"}},{"id":"6176127099","type":"user-reviews","attributes":{"userName":"holayosoytupadre","title":"hi","date":"2020-07-09T10:43:03Z","rating":1,"isEdited":false,"review":"idk"}},{"id":"6176124161","type":"user-reviews","attributes":{"userName":"catcricket","title":"Horrible","date":"2020-07-09T10:42:05Z","rating":1,"isEdited":false,"review":"NKalskddkkdskskskskskskskpqpwp"}},{"id":"6176111119","type":"user-reviews","attributes":{"userName":"potato man?","title":"disgusting","date":"2020-07-09T10:37:56Z","rating":1,"isEdited":false,"review":"disgusting"}},{"id":"6176110694","type":"user-reviews","attributes":{"userName":"jmjamie","title":"Disappointing","date":"2020-07-09T10:37:48Z","rating":1,"isEdited":false,"review":"Delete 👎"}}]}