{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8890","data":[{"id":"6177494127","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T17:05:28Z","review":"i honestly don't even know why trump is president he is racist and a part of sex trafficking and he was does many other horrific things i will never support trump, he is the worst president in human history and he IS NOT MY president i want a president who will actually do good for this country, trump is a disgrace to this world and i hope gets what he deserves one day, i also don’t understand why people support trump its just disgusting how can someone as horrible as trump get to be president, ugh i hate it here","userName":"⚡️e m i l y 💫","title":"no"}},{"id":"6177484230","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T17:02:29Z","review":"Hello fellow apple users. I downloaded this app thinking maybe I could be more politically active seeing as though I live in this country. So I download it and without a doubt in the world it is the most GOD FORSAKEN APP I have ever seen in my ENTIRE life, and that is saying something. You would think the president would know how to make an app GOOD. I open the app and it is the most laggy, crappy quality, hard to navigate app ever. Do yourself a favor and just never download this.","userName":"ldolphin240","title":"so awful DONT GET IT"}},{"id":"6177368141","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:28:03Z","review":"Ocean man, take me by the hand, lead me to the land that you understand Ocean man, the voyage to the corner of the globe is a real trip Ocean man, the crust of a tan man imbibed by the sand Soaking up the thirst of the land Ocean man, can you see through the wonder of amazement at the oberman Ocean man, the crust is elusive when it casts forth to the childlike man Ocean man, the sequence of a life form braised in the sandSoaking up the thirst of the land Ocean man, ocean man Ocean man Ocean man, take me by the hand, lead me to the land that you understand Ocean man, the voyage to the corner of the globe is a real trip Ocean man","userName":"ghostlyarchives","title":"Some body once told me"}},{"id":"6177337707","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:19:18Z","review":"After getting this app, I was very disappointed. My phone crashed for about an hour then i had to go to sprint to get it rebooted. My phone was hacked and all pictures, phone numbers, and even social media platforms have been shut down and I’m currently trying to them back. This app has caused a lot of unchangable damage to me and my phone. Getting this app was a mistake that will never happen again","userName":"lump patitius","title":"Wanna loose your social media, here’s how this app"}},{"id":"6177317060","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:13:36Z","review":"Can we pretend that airplanes in the night sky are like shootin' stars\nI could really use a wish right now, wish right now, wish right now\nCan we pretend that airplanes in the night sky are like shootin' stars\nI could really use a wish right now, wish right now, wish right now\nYeah, yeah I could use a dream or a genie or a wish\nTo go back to a place much simpler than this\nCause after all the partying and smashing and crashing\nAnd all the glitz and glam and the fashion\nAnd all the pandemonium and all the madness\nThere comes a time when you fade to the blackness\nAnd when you're staring at the phone in your lap\nAnd you hoping but them people never call you back\nBut that's just how the story unfolds\nYou get another hand soon after you fold\nAnd when your…","userName":"fatpussygirl","title":"👁👄👁"}},{"id":"6177309044","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:11:25Z","review":"this app is terrible . it glitches , every time i went in there , it would automatically take me back to my home screen . but when i was finally able to get into the app for a minute , the things that were in there were terrible . first of all , i had to see his face (i could’ve had a nightmare) . i also saw all the plans he had for our country and it made me wanna barf . the plans were terrible . I’m deleting the app rn .","userName":"Moriah li.","title":"the worst app"}},{"id":"6177203428","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T15:40:49Z","review":"The app is just terrible not only did it take  forever to download it also like bugs out your phone for no reason. The when you open the app you’re just stuck looking at it like what the heck is this because the app is mad stupid. -20/10 recommend because I’ve never had an application that was this terrible. Not only that when you open the app you’re greet by an orange goblin and lets just say don’t eat when you open it.","userName":"haylee0123456789101112","title":"ABSOLUTELY DISGUSTAANG"}},{"id":"6177194314","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T15:38:16Z","review":"After taking three whole weeks to download, when I finally opened it, it didn’t want to load. Kept crashing and over heating my phone. And don’t get me started on the storage it took up. It took up an incredibly large amount of storage. I deleted everything on my phone and it still said storage full. While on the app, it took me three days to be able to make an account. Very slow and awful app. Do not recommend","userName":"the garfield show","title":"WORST APP EVER!!"}},{"id":"6177183975","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T15:35:20Z","review":"Took a long time to download. I turned notifications off just after one day since it just kept sending me the same info over and over again. I had to delete it because I couldn’t update me phone since it took up so much data. I will NOT be redownloading it. I will not miss the mediocre software. There were many glitches (like being kicked out of the app). I will stick to getting my election info from Faux News.","userName":"Gouldigger_4_LiFE","title":"Not great"}},{"id":"6177162396","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T15:29:14Z","review":"When I saw trump on the page,  I lost my breath and it caused me to fall back, which ended up with me tumbling down the stairs and then my legs got folded and broken, I am now in the hospital and in internal pain, this would’ve never happened if the big orange didn’t have to pop up on my screen when I first opened it. Also, when I tried to tell the people of the app and sue them, they sent rats after me that ate off my toes. I did not like the experience at all.","userName":"Urass🤩","title":"Yeah ❤️"}}]}