{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8090","data":[{"id":"6174440041","type":"user-reviews","attributes":{"title":"VERY HORRIFYING!","review":"first and foremost , when i opened up the app i just saw the most horrific thing ever . i don't know how this app is even on apple store honestly, this is literally horrid . when i first opened the app i see a over tanned albino moonbat holding up a fist .. what does that mean ? white supremacy ? i think so 🤮, whoever made this app please reconsider what the hell you just did . this THING of a human literally looks like he eats everything orange and its not going good in his favor. IT looks fat and funky and i honestly just cant support this at all .","date":"2020-07-09T01:22:12Z","rating":1,"isEdited":false,"userName":"hcurllzz"}},{"id":"6174391460","type":"user-reviews","attributes":{"title":"MANY CONSEQUENCES","review":"After downloading I got a terrible email that I got fired from my job and can’t get accepted into college. I found out I’m positive for chlamydia, and my dog coughed up a whole vacuum. My parents disowned me and my beliefs and I now live on the mailbox down the street. Yes, all of this happened RIGHT AFTER getting the app.\n\nMy computer also ran away, my hamster turned into a casket. My whole world is in chaos. Do not get this app unless...unless you want to rate it based on what other’s have said. Hehe, if you know what I mean.","date":"2020-07-09T01:07:35Z","rating":1,"isEdited":false,"userName":"Zaorek"}},{"id":"6174350427","type":"user-reviews","attributes":{"title":"Big Cheeto man locked me in a Banana","review":"I can not explain the horrified state I was in when I opened this app. Right from the start I saw a video of Trump locking up his son Barron and throwing bananas at him. I felt personally offended that he wasn’t throwing Oranges to match himself. So I immediately clicked off of it and deleted it, but to my horror I found that my house had turned into a banana. I am currently trapped and am in need of assistance. I am left eating my way out. If I don’t make it out then my dying words would be, don’t get this app.","date":"2020-07-09T00:54:35Z","rating":1,"isEdited":false,"userName":"Google classroom hater- LAL"}},{"id":"6174348262","type":"user-reviews","attributes":{"title":"The most DISGRACEFUL and DISAPPOINTED app","review":"I wish I could give this -6 stars because every time I go to this app I have to see this racist, homophobic, sexist,self centered, xenophobic, and just crazy man campaigning for president and I am just wondering why anyone with common sense or a person with a moral compass would want him in the first place let alone for the NEXT FOUR YEARS! \n\nBut the app is horrible. It crashes every two seconds and does not give any information to why Trump isn’t already out of office. Such a disappointment.","date":"2020-07-09T00:53:54Z","rating":1,"isEdited":false,"userName":"ih8t trump"}},{"id":"6174334010","type":"user-reviews","attributes":{"title":"Bad app","review":"I opened to see naked Cheeto boy and I got sexually assaulted by a giraffe in a walrus costume dressed as Herbert The Pervert cardi b then gave me a live performance (my ears are bleeding) the titanic came crashing through my house big chungus stole my phone (typing on a microwave rn) my sewer system i was living in because of titanic incident was bombed like Hiroshima pikachu doggy styled me I am now living in a time capsule cooling down warm pancakes in my router I am very mad that this app forced me to this situation 1 Star on yelp and that is final also a triangle sung Indian pumped up kicks and stole my wheelchair","date":"2020-07-09T00:49:05Z","rating":1,"isEdited":false,"userName":"404 review not found"}},{"id":"6174333492","type":"user-reviews","attributes":{"title":"Horrible!!! HORRIBLE!! App","review":"When I downloaded this I wanted to know when the next rally was but I was met by Cheeto man and his dust got in my eye throw the microphone. I now have pink eye and my family wants to sue. I my mother also downloaded the app for fun and got second degree burns from his spit. She okay but you need to pay up you greesy bagel. I had to go to the corner store earlier and your promotion for this app was also everywhere. I don’t recommend, at all. Delete the app immediately or you’ll being paying hella medical bills. 🤢","date":"2020-07-09T00:48:55Z","rating":1,"isEdited":false,"userName":"destroyallcheetos"}},{"id":"6174273364","type":"user-reviews","attributes":{"title":"trauma, don’t recommend, smh","review":"can i just say, for an app that’s the ‘presidents’, this is messed up. i went on there expecting president stuff, united state stuff, ya know? but duuuude, what i got was awful, no worse than awful, there’s not even a word to describe, the human like Cheeto i saw on there, this Cheeto just popped up, OUT OF NOWHERE MY DUDE! this messed me up for about a week, and not i have to live with this image and trauma for the rest of my life!!! I CERTAINLY DO NOT RECOMMEND THIS APP, what so ever. thanks a lot now i have to live with this my whole entire life!! 😡","date":"2020-07-09T00:28:39Z","rating":1,"isEdited":false,"userName":"vmin's dumpling"}},{"id":"6174243732","type":"user-reviews","attributes":{"title":"Bad app","review":"Firstly, this app is the most disgusting thing I’ve ever seen in my life!! It constantly crashes when I try to load it up, and in the 1/1,000,000,000 chance it does load up, the screen glitches and shows me an image of a repulsive, disgusting, horrific looking figure, orange in colour, monster!! If I could rate this app lower than a 1 I would. This app is truly the most scum, vile of the Earth thing that can exist, and needs to be taken down before anyone else suffers what I have had to go through!","date":"2020-07-09T00:18:23Z","rating":1,"isEdited":false,"userName":"getlostbud"}},{"id":"6174228469","type":"user-reviews","attributes":{"title":"Made me projectile vomit","review":"I do not suggest anyone downloads this app. First time I opening it I projectile vomited orange Cheetos I never even ate. When I opened the events, it teleported me to trumps sex chamber when he rapes little children and I was terrified and tried to help the kids but by the time o reached them I was teleported back and given the corona virus. Now I’m dying and can’t move my toes. Also, my hair all fell out and I’ve started growing trumps Pubic hair on my head. This app is a public health hazard. Please I beg that no one uses this app for their own safety.","date":"2020-07-09T00:12:50Z","rating":1,"isEdited":false,"userName":"Rochygkwndgiems"}},{"id":"6174208104","type":"user-reviews","attributes":{"title":"just horrible","review":"i downloaded the app on a sunny Wednesday afternoon. i was bored to say the least and was looking forward to learning more the cheeto man himself and his little cult. however as soon as i opened the app i was greeted with a naked puffy cheeto cartoon. my kids were around so this was not what i was expecting. apparently this app is not what i expected it’s just a bunch of nude pictures of a puffy cheeto at different angles. which i did not wanna see. anyway i will be deleting this app bc it’s fake news and steals your info!!!!!!!!!!","date":"2020-07-09T00:05:14Z","rating":1,"isEdited":false,"userName":"tessss tickleee"}}]}