{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=34020","data":[{"id":"6174654894","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this onto my phone and then my phone turned all orange and uneducated! This is the worst, now my phone only cry’s and uses it’s tiny hands. I really hope that this glitch can be solved, oh god now it’s trying to hold my hand!!","userName":"peepee6969poopoo420","date":"2020-07-09T02:23:45Z","title":"Worst app ever","isEdited":false}},{"id":"6174651529","type":"user-reviews","attributes":{"rating":1,"review":"i’ve never been more disappointed in a app. This so called to be “app” makes me want to delete myself from the face of earth. It is absolutely horrible & i would rather kill the entire earth then get this✨✨","userName":"Trump 2020 On a tombstone😹😹","date":"2020-07-09T02:22:45Z","title":"no❤️😹","isEdited":false}},{"id":"6174651475","type":"user-reviews","attributes":{"rating":1,"review":"I got this app to see the trump updates but once you buy it , it freezes your phone and glitches everything! Also it will turn your cat into a dog and dog into a cat!!!! THIS APP IS BAD SO MANY GLITCHES. Please for the sake of god don’t download or your mom will turn into a toad.","userName":"martiah","date":"2020-07-09T02:22:44Z","title":"DO NOT GET THIS APP","isEdited":false}},{"id":"6174639623","type":"user-reviews","attributes":{"rating":1,"review":"i have never, and i mean never took my time to write a review even if i LOVED the app but this is just the worst thing anyone could possibly create. i am so disappointed in the app store and apple itself for allowed this to be on their shop.","userName":"No namer ( maddie)","date":"2020-07-09T02:19:22Z","title":"WORST APP EVER","isEdited":false}},{"id":"6174628953","type":"user-reviews","attributes":{"rating":1,"review":"This app is absolutely horrible, and unacceptable I can not believe this. I also immediately started to GLITCH, if this is a #1 NEWS APP then there should be NO PROBLEMS, also this app gives out TOO MANY notifications. Horrible experience.","userName":"ilikecheesejanekim","date":"2020-07-09T02:16:20Z","title":"HORRIBLE HORRIBLE STOP THIS","isEdited":false}},{"id":"6174625302","type":"user-reviews","attributes":{"rating":1,"review":"I just got home from school and u saw jesus and he said i was fat so i got very sad. Then i ate cheetos to make myself feel happy. I walked into the street and i saw my fat friend and suddenly he died from heat stroke his last words was trump 2020 i guess he deserved it.","userName":"jesus orange christ","date":"2020-07-09T02:15:16Z","title":"Horrible app","isEdited":false}},{"id":"6174624225","type":"user-reviews","attributes":{"rating":1,"review":"As soon as I opened the app my phone started to glitch. At first I thought maybe my phones just broken, but no when I got to delete the app my phone worked fine.","userName":"hi :3 :) ;)","date":"2020-07-09T02:15:01Z","title":"It broke my phone!","isEdited":false}},{"id":"6174619508","type":"user-reviews","attributes":{"rating":1,"review":"When I first opened this app it was just horrible I had to see a picture of the orange 🍊 which is so disgusting and disturbing I just don’t like this app needs to be taken down so people won’t have to risk their eyes on the Cheeto","userName":"i hate the big fat 🍊 cheeto","date":"2020-07-09T02:13:39Z","title":"Just worst app","isEdited":false}},{"id":"6174619348","type":"user-reviews","attributes":{"rating":1,"review":"DO NOT download this app. This app will give you herpes and then spit in your face. This app slapped my grandmother in the face and sent her into cardiac arrest. This app ran over my family dog who was only 6 months old. If I could give this app less than 1 star I would.","userName":"walmart adele","date":"2020-07-09T02:13:37Z","title":"WORST APP","isEdited":false}},{"id":"6174618029","type":"user-reviews","attributes":{"rating":1,"review":"I open it to see a fat man that’s painted orange. I was so disgusted by his appearance it almost made me vomit. This app also hacked my phone and now it randomly plays the national anthem. I’m not sure why but I will definitely be deleting it and I hope it gets taken down😡.","userName":"beccsz","date":"2020-07-09T02:13:14Z","title":"A HORRID APP 🤢","isEdited":false}}]}