{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=81230","data":[{"id":"6177204822","type":"user-reviews","attributes":{"userName":"rapisttrumpracist","date":"2020-07-09T15:41:14Z","review":"This app is a HUGE disappointment","rating":1,"isEdited":false,"title":"Terrible"}},{"id":"6177198124","type":"user-reviews","attributes":{"userName":"ThIs APpSo crQaZy","date":"2020-07-09T15:39:22Z","review":"We will delete this app if you delete TikTok pls don’t delete TikTok 🥺","rating":1,"isEdited":false,"title":"Spam"}},{"id":"6177191569","type":"user-reviews","attributes":{"userName":"awsomeolilopez@","date":"2020-07-09T15:37:29Z","review":"I am not letting this Cheeto delete TikTok because he’s not getting his way. Period✨I miss Obama","rating":1,"isEdited":false,"title":"TikTok 😋"}},{"id":"6177183752","type":"user-reviews","attributes":{"userName":"qodjis abrocmsnan","date":"2020-07-09T15:35:17Z","review":"Why would I support the most racist president. I could never.","rating":1,"isEdited":false,"title":"Tik tok."}},{"id":"6177169321","type":"user-reviews","attributes":{"userName":"bosman0831","date":"2020-07-09T15:31:12Z","review":"The second I opened the app, I projectile vomited everywhere.","rating":1,"isEdited":false,"title":"Causes me to puke"}},{"id":"6177157245","type":"user-reviews","attributes":{"userName":"acab1312ft.........","date":"2020-07-09T15:27:47Z","review":"This doesn’t even deserve a star it’s awful","rating":1,"isEdited":false,"title":"Ew"}},{"id":"6177153573","type":"user-reviews","attributes":{"userName":"student202063","date":"2020-07-09T15:26:46Z","review":"this app took a really long time to download and then it was so glitchy and kept showing this weird orange guy idk who tf he is","rating":1,"isEdited":false,"title":"very slow and glitchy"}},{"id":"6177143837","type":"user-reviews","attributes":{"userName":"Warg_rider1","date":"2020-07-09T15:24:04Z","review":"I cannot believe how nasty this app is. Firstly, it took 7 weeks to download. Secondly, after it was finally done downloading I opened the app and was immediately greeted by inappropriate images of our lovely president. This is not right! What if my kids downloaded this! I as a mother, would like to warn all fellow parents that this app is not appropriate and needs to be removed from all AppStores. Not only does it show disgusting images, it also mocks our president! How dare they do this! I’m telling you, the people who made this are disgusting Trump hater that need Jesus. Also, after I clicked the little x on the screen to close those images, this orange screen with Donald Trumps face on it piped up and my phone was hacked. Pictures of my family and boyfriend were speed all other the internet and my credit card was charged $600. My little girl, who was just six was approached by a man in a pink body suit. This man stabbed my little baby NINE times!   He left a note on her DEAD BODY that said “ Listen here you dirty **** if you don’t vote Trump 2020, this will happen to everyone you have ever cared about. Now be a good ***** and don’t call the cops or else”.  I had to bury her in a CARDBOARD BOX! This app has destroyed my life, my happiness, and my will to live. Many of my close friends have had similar experiences! I demand to know why this app is still functioning! This app makes a mockery of our wonderful country! How could we, as Americans, keep this app in the App Store. We have a responsibility to keep our children safe and this app subjects them to things they should never have to see or deal with. I strongly recommend nobody download this app. Please trust me it will ruin your life forever. I am now mentally and physically scarred and my daughter has been taken from me! I can no longer hold her in my arms, or sing her lullaby’s as she falls to sleep! All because of this disgrace for an app.","rating":1,"isEdited":false,"title":"Completely inappropriate trash"}},{"id":"6177141285","type":"user-reviews","attributes":{"userName":"alizz1234","date":"2020-07-09T15:23:22Z","review":"Useless app","rating":1,"isEdited":false,"title":"Terrible user experience"}},{"id":"6177137651","type":"user-reviews","attributes":{"userName":"Smapster12345","date":"2020-07-09T15:22:21Z","review":"Love the app","rating":5,"isEdited":false,"title":"Amazing"}}]}