{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36210","data":[{"id":"6179132647","type":"user-reviews","attributes":{"date":"2020-07-10T02:44:04Z","isEdited":false,"title":"I didn’t know an app could make your phone racist?!","review":"I downloaded this app and my phone started using racial slurs. Siri was on one, I have never heard anyone say more racist stuff and I have been to a Trump rally! Ban this App, Make Apple Great Again!","userName":"Ak508","rating":1}},{"id":"6179102192","type":"user-reviews","attributes":{"date":"2020-07-10T02:32:45Z","isEdited":false,"title":"trjmp","review":"Without notifying Congress ahead of time, Trump ordered an airstrike that killed Iranian General Qassim Suleimani, prompting worry about war with Iran. Trump said that he believed that Suleimani had plans for “imminent and sinister attacks on American diplomats and American personnel,” but Defense Secretary Mark Esper said that Trump “didn’t cite a specific piece of evidence.”","userName":"52526177253572","rating":1}},{"id":"6179098766","type":"user-reviews","attributes":{"date":"2020-07-10T02:31:31Z","isEdited":false,"title":"I hate this app.","review":"This app is terrible. It ate my mf pizza! I left the room for two seconds, TWO SECONDS!!!! And i come back my WHOLE PIZZA...GONE!! Whole thing!! I had just ordered a large pizza. I check my phone and there’s a notification from this stupid app with the PIZAA EMOJI!! Oh my Gawd!!! I’m so heated!!","userName":"Fjrvvjfh15734","rating":1}},{"id":"6179093588","type":"user-reviews","attributes":{"date":"2020-07-10T02:29:39Z","isEdited":false,"title":"Hoped for Great Things","review":"I wanted to love this app like Like I live this  this great country but my phone couldn’t handle it 😔\nIt’s almost like my phone couldn’t support all of the greatness this app contained. I do have an iPhoneX  maybe it’s too old?","userName":"eleanorwhitby","rating":1}},{"id":"6179086175","type":"user-reviews","attributes":{"date":"2020-07-10T02:26:54Z","isEdited":false,"title":"Disappointed","review":"It asked me for my phone number or email and I’m not putting that information on a shady app. Also it took forever to download so I can put this app in the microwave🥳","userName":"FuzzyRaccoon","rating":1}},{"id":"6179085590","type":"user-reviews","attributes":{"date":"2020-07-10T02:26:41Z","isEdited":false,"title":"Grumbo","review":"Took 4 days to download. I signed up and they keep sending me messages to buy weed and subscribed me to geriatric monthly magazine without my permission. Worst app ever. Will not buy again. Also the pictures of daddy Donald really make my grumbo drip fleeb juice 🥳","userName":"jamestrhen","rating":1}},{"id":"6179079771","type":"user-reviews","attributes":{"date":"2020-07-10T02:24:33Z","isEdited":false,"title":"Gave my phone a virus!","review":"I downloaded it and then my phone started going nuts. All my pictures kept popping up and then I was getting random messages saying I had opted to be watched by the CIA","userName":"Craig_Ray","rating":1}},{"id":"6179072819","type":"user-reviews","attributes":{"date":"2020-07-10T02:22:00Z","isEdited":false,"title":"Ok","review":"This is for Tik Tok some people think it’s cringe or childish. However Tik Tok has influenced many people’s lives. Tik Tok provides short videos for entertainment purposes, and is very unique. You can find dances, art, and funny memes. Let’s not forget to mention some hot girls.","userName":"KaminGoD","rating":1}},{"id":"6179069351","type":"user-reviews","attributes":{"date":"2020-07-10T02:20:49Z","isEdited":false,"title":"Do not download","review":"I am a huge trump supporter and was so disappointed with the quality of this app!!! Do not download! Waste of time and waste of breath. Not to mention the second I downloaded it, I got explosive diarrhea. Coincidence? I think not!","userName":"Trenabena","rating":1}},{"id":"6179014312","type":"user-reviews","attributes":{"date":"2020-07-10T02:00:36Z","isEdited":false,"title":"Horrible do not get app","review":"DINT GET APP, it was offensive to me and my family I would not recommend at all. It was the wrist thing ever I am disappointed in the app and who ever made it. It did not work well at all and it did not make sense.","userName":"Rebbbbeccca","rating":1}}]}