{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=18030","data":[{"id":"6176615168","type":"user-reviews","attributes":{"date":"2020-07-09T13:03:06Z","rating":1,"review":"This is the worst app I’ve ever used. I opened the app and ICE immediately bursted into my home trying to deport me. I am Puerto Rican. However, they refused to believe that Puerto Rico is part of America.\nA good part of this app is that Donald Trump himself began texting me. We swap dirty pictures back and forth. He really likes it when I call him a naughty little fat girl. He wants me to crawl into that bunker with him and never leave.","userName":"littlefatgirl","isEdited":false,"title":"0/10"}},{"id":"6176613672","type":"user-reviews","attributes":{"date":"2020-07-09T13:02:40Z","rating":1,"review":"This app took about 10 hours to install! The long wait put me into a state of depression. When the app was FINALLY installed, an Oompa loompa’s face on my screen brought me to tears! Why would anyone praise a homophobic, racist, rapist, and a horrible person! I have to give this app 1 stars for doing that. And who the hell is Trump? You’re going to put his name on the app but not even show me a picture of him? Rude!","userName":"ajdbsjabdbannsnsnazbsb","isEdited":false,"title":"WORST APP EVER"}},{"id":"6176591668","type":"user-reviews","attributes":{"date":"2020-07-09T12:56:38Z","rating":1,"review":"Once you enter the app it ask for your number which I did not find appropriate because my kids have it also they tracked me down and arrested my kids which I did not like because my kids didn’t do anything and lastly my phone was hacked into and now I can’t watch criminal minds and that’s my favorite show so please DONT GET THE APP","userName":"lolafromhs","isEdited":false,"title":"It’s inappropriate and rude"}},{"id":"6176559584","type":"user-reviews","attributes":{"date":"2020-07-09T12:47:57Z","rating":1,"review":"Upon downloading this app, my youngest daughter went feral. My son was also diagnosed with cancer the second it finished installing. After texting the number, my phone was spammed with pornographic images. I’m a conservative anti vaccination, anti woman, and anti internet mother. These images deeply offended me and my views. I demand this app be taken down. If it doesn’t I will take it down personally.","userName":"Serotoniia","isEdited":false,"title":"Ruined my life"}},{"id":"6176535776","type":"user-reviews","attributes":{"date":"2020-07-09T12:41:24Z","rating":1,"review":"So as the lovely republican that i was, I downloaded this app. Everything seemed to be going fine UNTIL I looked up what republican meant and realized that I was a DEMOCRAT. Then I found these articles stating that trump was RACIST. And so as any democrat not supporting trump would do I tried to delete the app. On my 10th try i was tired so I just went to bed. AND I HAD THE WORST NIGHTMARE POSSIBLE. The president STOLE MY HOUSE. And that’s why this app is haunted.","userName":"vscooppp","isEdited":false,"title":"This App Is HAUNTED!!!"}},{"id":"6176506267","type":"user-reviews","attributes":{"date":"2020-07-09T12:33:18Z","rating":1,"review":"Honestly this app just like his presidency is a giant joke. When I opened the app I kept getting pop up adds demanding I donate to the Nazis and that’s they were trying to raise money for black paint to cover BLM street art. In conclusion you shouldn’t have made Gen Z angry cause we’re smarter than you and that’s not hard considering you cheated on your SAT....","userName":"Emilee A Johnson","isEdited":false,"title":"I hate the app even more than the man"}},{"id":"6176405405","type":"user-reviews","attributes":{"date":"2020-07-09T12:05:38Z","rating":1,"review":"If I could give this app zero stars I would because it took forever to download and when it did download and I opened the app it started to glitch and it wouldn’t let me do anything on my phone. But then after a day of having the app it some home deleted some of my other apps so please don’t download this app","userName":"🦋👑😭😊","isEdited":false,"title":"Don’t download the app !"}},{"id":"6176394168","type":"user-reviews","attributes":{"date":"2020-07-09T12:02:29Z","rating":1,"review":"This app is completely garbage! Ever since I downloaded it my phone has constant glitches and the battery life has been ruined. When I first opened the app they asked for my phone number, now I get three-four texts an hour from the trump administration. I would give 0 stars if it was possible.","userName":"hannahposen","isEdited":false,"title":"This is the worst app I’ve ever had"}},{"id":"6176374011","type":"user-reviews","attributes":{"date":"2020-07-09T11:56:55Z","rating":1,"review":"I came upon this app to look for a way to support my president. Once i had the app downloaded, out of NOWHERE, i see this app driving in a car, and it literally ran over my cat on purpose!! I believe that this was a very, VERY violent act of this app! This app should be ashamed of its self, and get taught how to have some class! 1 out of 5 stars for me! I’m sure this is what my mr meow meow would want 😪.","userName":"bigeyedgem","isEdited":false,"title":"HORRIBLE!!😠"}},{"id":"6176290901","type":"user-reviews","attributes":{"date":"2020-07-09T11:33:03Z","rating":1,"review":"I gave this app a 1 star because it told me to give my number. When I gave my number it made my screen glitch and took all my photo from my gallery. Also, I would like to say that if you download this app, to not give your phone number because if you do you will probably have the same results as what I have. LETS GO #GENZ","userName":"localbradley808","isEdited":false,"title":"The worst app ever"}}]}