{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=139830","data":[{"id":"6179569057","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","date":"2020-07-10T05:14:09Z","userName":"Lil :3 :)","rating":1,"review":"i have a major problem with this. i downloaded this app to my phone a month ago so i could keep up with my favorite Cheeto. BUT IT JUST INSTALLED!!  i have waited so long for it to be usable. and now i find out that it has hacked into all of my personal information!! DO NOT DOWNLOAD THIS APP!!!","isEdited":false}},{"id":"6179568975","type":"user-reviews","attributes":{"title":"Wow","date":"2020-07-10T05:14:08Z","userName":"shvdybj","rating":1,"review":"I opened the app to see a bag of Cheetos, I assumed I was on the wrong app but was sadly mistaken. Later I went back on the app to see an add for a cheap blonde toupee. I am disgusted in the overall quality of this app and hope Biden has a better one","isEdited":false}},{"id":"6179568951","type":"user-reviews","attributes":{"title":"ONE STAR","date":"2020-07-10T05:14:07Z","userName":"#⃣Grumpy Cat","rating":1,"review":"DO NOT DOWNLOAD THIS APP. YOUR PHONE MAY GO SAMSUNG GALAXY NOTE 7 ON YOU FROM JUST DOWNLOADING THIS APP. YOU MAY DIE OF STARVATION AND IT MAY SOMEHOW BE RELATED TO YOU DOWNLOADING THIS APP. QUESTION YOUR LIFE CHOICES.","isEdited":false}},{"id":"6179568874","type":"user-reviews","attributes":{"title":"Spyware","date":"2020-07-10T05:14:06Z","userName":"frankencaster","rating":1,"review":"This app slowed down my phone made it Keeley. I even noticed my data usage with way up, even when I shouldn’t have been using any data.  One I deleted the app, it all stopped. Avoid this app!!","isEdited":false}},{"id":"6179568771","type":"user-reviews","attributes":{"title":"Do not get this app","date":"2020-07-10T05:14:04Z","userName":"laysiaaa20","rating":1,"review":"This took 365 days just to download and the app doesn’t even work it just lags and glitches your phone and it steals all your information 5 minutes after I downloaded i got a call from the bank saying I made a deposit of 1000 dollars when I clearly did not.","isEdited":false}},{"id":"6179568785","type":"user-reviews","attributes":{"title":"This app is HOT GARBAGE","date":"2020-07-10T05:14:04Z","userName":"JOHNNYBOOOYYYYY","rating":1,"review":"This application has so many problems. It’s never running properly and it keeps crashing. It even shut off my phone 😡😡😡 don’t even think about downloading this app. What a shame, I guess I’ll have to vote for Biden, if this is how the president runs his app, how is he running America 🤢🤮 P.S. THIS IS ALL FOR GIGGLES, FDT. GEN Z IS TAKING THIS COUNTRY BACK BY ANY MEANS NECESSARY!!","isEdited":false}},{"id":"6179568796","type":"user-reviews","attributes":{"title":"No justice, no peace. Simple as that","date":"2020-07-10T05:14:04Z","userName":"Lauren otero","rating":1,"review":"As soon as I opened the app, my phone started glitching and ten this message popped up in Chinese! It ultimately translated into a message demanding that I hand over my personal information and social security number immediately or else I would be tortured by the fullest extent of the word. I saw someone else say that same thing in their review but I chose not to believe it, which was totally my mistake. I didn’t know what to do at that point so I threw it in the pot with some meat and veggies and made an iPhone stew (shockingly delicious btw, the lock button tastes exquisite)! Thankfully I have my iPad, or I’d have no way to communicate with the outside world. \nIf you’ve gotten this far in my review, thank you for reading and please be sure not to download the app (unless you leave a horrible review).\nAlso, our president is a white supremacist. He supports the merciless killings of black people. Breonna Taylor and many others  have not gotten justice. He also puts people in cages and has them abused, tortured, and taken away from their families. \nWe the people of Gen z will not let this stand any longer. We will push for change until we get it. We will fight for justice until we get it. We will scream until we’re heard and then scream louder. We will make way for a more peaceful future.","isEdited":false}},{"id":"6179568626","type":"user-reviews","attributes":{"title":"bad","date":"2020-07-10T05:14:01Z","userName":"⛄️⭐️⛄️","rating":1,"review":"not a good time","isEdited":false}},{"id":"6179568613","type":"user-reviews","attributes":{"title":"why is this app here?","date":"2020-07-10T05:14:01Z","userName":"mdxmkfkfjfjfn","rating":1,"review":"this app has zero ways of being useful this app has taken me to illegal sites worse app ever 😞 never installing ever again loki think i got a virus and i think that virus called the donald trump virus.rest in peace app never will install again 😤","isEdited":false}},{"id":"6179568229","type":"user-reviews","attributes":{"title":"This app drains my battery!","date":"2020-07-10T05:13:53Z","userName":"Jay in AZ","rating":1,"review":"App works okay (when it does work at all), but I’ve noticed it drains my battery pretty quickly. I think they’re tracking my location or something. Avoid!","isEdited":false}}]}