{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=48890","data":[{"id":"6174018671","type":"user-reviews","attributes":{"userName":"lolo_2121","rating":1,"review":"First off this app makes my phone go slow and a lot of my documents went missing this app is a complete scam to get your personal information do not download this app I REPEAT DO NOT DOWNLOAD THIS APP😡","date":"2020-07-08T22:55:15Z","title":"WORST APP🤬","isEdited":false}},{"id":"6174012194","type":"user-reviews","attributes":{"userName":"lowk3y.lina","rating":1,"review":"so as I open the app and I was eating my Cheetos I SEE A CHEETO getting a tan spray and I was like oh heck no Cheeto lives matter so I had to give a bad review for my Cheeto friends... never looking at this app again.","date":"2020-07-08T22:52:52Z","title":"disappointed","isEdited":false}},{"id":"6174008515","type":"user-reviews","attributes":{"userName":"sanelaaaa","rating":1,"review":"this app is absolutely disgusting and not helpful at all. As soon as I opened the app I immediately went to delete it. 🤢🤮 do NOT recommend!","date":"2020-07-08T22:51:28Z","title":"Horrible","isEdited":false}},{"id":"6174000579","type":"user-reviews","attributes":{"userName":"zemmezemme","rating":1,"review":"A whole app dedicated to a racist, sexist, homophobic, and islamophobic child rapist? Nope. I would also like to give a 1 star to the government for letting him be in office, if there is somewhere I can do that.","date":"2020-07-08T22:48:29Z","title":"Terrible, Never Again","isEdited":false}},{"id":"6173998316","type":"user-reviews","attributes":{"userName":"howisgoober2000taken","rating":1,"review":"It pains me that I ever downloaded this app in the first place. I can’t even begin to explain why, if possible would rate 0 stars I do not recommend.","date":"2020-07-08T22:47:38Z","title":"Terrible app","isEdited":false}},{"id":"6173993116","type":"user-reviews","attributes":{"userName":"Cler ber","rating":1,"review":"You open the app to an inappropriate picture of an ancient man who looks like he hasn’t had water for years, then the app caused a virus to wipe out everything on my phone.","date":"2020-07-08T22:45:39Z","title":"THIS APP IS HORRIBLE","isEdited":false}},{"id":"6173987746","type":"user-reviews","attributes":{"userName":"stinky trump","rating":1,"review":"Delete this app I beg of you. 😡I’d rather deep fry both of my pointer finger then download this app. ewwwwww imagine supporting trump 😩Whoever thought it was a good idea to make an app for the most hated president in United States history.😒it so stinky🤢","date":"2020-07-08T22:43:36Z","title":"Horrible app","isEdited":false}},{"id":"6173966666","type":"user-reviews","attributes":{"userName":"polo1987626","rating":1,"review":"This app is terrible do not download it. Apple should have higher standards than to let trash apps like this exist on their app store.","date":"2020-07-08T22:35:36Z","title":"Terrible app crashes my phone","isEdited":false}},{"id":"6173961174","type":"user-reviews","attributes":{"userName":"trumps grandma","rating":1,"review":"This app completely drains the battery on my phone. I used to keep a charge all day, but now I have to plug it in every hour","date":"2020-07-08T22:33:35Z","title":"Terrible","isEdited":false}},{"id":"6173960726","type":"user-reviews","attributes":{"userName":"Lexi loves twix","rating":1,"review":"he has no lips, how will he get a kiss kiss? very ugly no kiss for him. though he wouldn’t want a kiss from me, he likes children. very ugly orange man should not be in the app store. the good reviews are fake accounts. also he is not cute at all. he is so rich, but he has no money for some good plastic surgery? he chose ugly pictures for the app. hope you take this off the appstore as it is very dangerous.💅💅","date":"2020-07-08T22:33:25Z","title":"ugly orange man","isEdited":false}}]}