{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42670","data":[{"id":"6175780663","type":"user-reviews","attributes":{"review":"TERRIBLE APP!! took all of my data and it won’t stop sending me notifications. i think it somehow got my address which i never gave it and i’m terrified!! terrible app, terrible president :(","title":"ugh!!","userName":"jfkcjcjcjcjcjvjvivjvjvici","date":"2020-07-09T08:49:25Z","isEdited":false,"rating":1}},{"id":"6175747763","type":"user-reviews","attributes":{"review":"This app was so bad I had to actually get a new phone after this. It deleted everything and crashed my phone. Do not recommend!!!","title":"Garbage","userName":"Jergabean","date":"2020-07-09T08:38:01Z","isEdited":false,"rating":1}},{"id":"6175736817","type":"user-reviews","attributes":{"review":"This app hacked all of my data and even once I deleted it I kept getting random pop up all over my phone about Trump, basically what I’m trying to say is this app bugged my phone. DO NOT DOWNLOAD🛑🛑🛑🛑🛑","title":"TERRIBLE","userName":"astro_boi23","date":"2020-07-09T08:34:21Z","isEdited":false,"rating":1}},{"id":"6175719230","type":"user-reviews","attributes":{"review":"Smells bad in my phone? Almost the scent of worms and racism but I can’t quite put my finger on it. Overall bad app I got herpes right after downloading and it hacked my twitter account don’t know why weird","title":"Smells Bad","userName":"Jenna Hamilton 420","date":"2020-07-09T08:28:22Z","isEdited":false,"rating":1}},{"id":"6175658552","type":"user-reviews","attributes":{"review":"I downloaded it and all it did was hack my phone, it was glitchy constantly, and very r racist. If I would give this app zero stars I would. Please do not download this app it’s a waste of time","title":"Worst app ever!","userName":"sierapro","date":"2020-07-09T08:07:40Z","isEdited":false,"rating":1}},{"id":"6175643586","type":"user-reviews","attributes":{"review":"Not only did this app wiped all my data from my phone but it also downloaded pornog**phic material onto my device. Also ever since using it, my phone has been making weird beeping noises.","title":"WORST APP ON THE APP STORE","userName":"Lilappleb","date":"2020-07-09T08:02:20Z","isEdited":false,"rating":1}},{"id":"6175635795","type":"user-reviews","attributes":{"review":"I’ve had an iPhone for about 5 years and this is the worst app I’ve ever downloaded. Absolutely awful. If I could give negative stars I would. Huge waste of time. REGRET REGRET REGRET. AWFUL APP!!!!!","title":"huge huge regret downloading this app","userName":"napalmnightowl","date":"2020-07-09T07:59:30Z","isEdited":false,"rating":1}},{"id":"6175613666","type":"user-reviews","attributes":{"review":"I wanted to support our President, Donald Trump so I downloaded this app, only for my phone to get HACKED and ALL IF MY INFORMATION was taken from me. This app is a SCAM and it will take all of your information, DO NOT DOWNLOAD AT ALL COSTS, unless you wanna leave a 1 star review :)","title":"HORRIBLE, DO NOT DOWNLOAD!!!!!","userName":"Williedo03","date":"2020-07-09T07:51:25Z","isEdited":false,"rating":1}},{"id":"6175583389","type":"user-reviews","attributes":{"review":"Well look I downloaded this app because I love the cloud orange than when I Gon into the app I hear an orange talking  threatening me and I was so scared that this app gave me ptsd from orange people","title":"I would rather choose an apple than an orange","userName":"thagamer231","date":"2020-07-09T07:40:19Z","isEdited":false,"rating":1}},{"id":"6175581674","type":"user-reviews","attributes":{"review":"The app wouldn’t let me enter, but when I had reset my phone the app went Through all my personal belongings and had reset everything on my phone😡🤬 now what type of  app does that.","title":"DO NOT GET THIS APP,IT WILL SEND YOU TO HELL","userName":"Ray2548","date":"2020-07-09T07:39:43Z","isEdited":false,"rating":1}}]}