{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38400","data":[{"id":"6176362611","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T11:53:42Z","review":"This app Is the biggest joke I’ve in my entire life. Not only is it about some ignorant orange, but it is taking my data WITHOUT ME KNOWING. The app is overall sketchy and not worth downloading. This app is such a waste of space much like the president.","title":"WARNING DO NOT DOWNLOAD","isEdited":false,"userName":"Marcelo .c"}},{"id":"6176433014","type":"user-reviews","attributes":{"rating":5,"date":"2020-07-09T12:13:12Z","review":"Neat app, fun to play on a plane or at school. 11/10 do recommend.","title":"Very good","isEdited":false,"userName":"andrewe543"}},{"id":"6176355541","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T11:51:44Z","review":"Took me 5 days to download after that a racist, xenophobic, homophobic Cheeto looking thing popped on the screen almost gave me a heart attack. I think that this app should be removed from the App Store immediately for the safety of our children.","title":"THE WORST APP EVER","isEdited":false,"userName":"fucksonaldttump"}},{"id":"6176350412","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T11:50:16Z","review":"As soon as i put my phone number in the app i got a whole bunch of scam calls blowing up my phone! My phone would not stop glitching and i’m so mad! Please take this app off of the store immediately!!!!","title":"WORST APP","isEdited":false,"userName":"generation Z!!!!!"}},{"id":"6176303063","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T11:36:40Z","review":"It is absolutely terribly they steal your money it took days to download it lagged me out Evry single time I went to go in it to the point where I deleted it then redownloaded it until it worked.","title":"Don’t bother with this 🤬🤬😡","isEdited":false,"userName":"nick ...........!? gurr"}},{"id":"6176283136","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T11:30:48Z","review":"I originally downloaded this app to see if maybe I could understand more about the POTUS. But it’s not worth it. It was a complete waste of my time and data to download the Trump app. The worst deal in the history of deals.","title":"USELESS APP","isEdited":false,"userName":"maddacey"}},{"id":"6176254097","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T11:21:57Z","review":"it took nearly 4 days to ship it and i ordered it through quick and dangerous delivery and they brought it to my door without a mask on. so i waited a day to make sure it was contaminated and then tried it out and i was disappointed. the commercials made it look so cool and useful but it literally sits there and does nothing. it just pisses me off and i see no point in having it. worst product ever!","title":"bad app","isEdited":false,"userName":"epicvic"}},{"id":"6176247619","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T11:20:00Z","review":"This app is so stupid. I will hide in a bunker to save myself from this monstrosity. I guess that there aren’t enough Trump minions to save this app. I have problem with it because it faker than orange tan and it doesn’t even open. Terrible.","title":"Tulsa","isEdited":false,"userName":"trumpytrumpydumb"}},{"id":"6176226825","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T11:13:37Z","review":"this app is,,very unprofessional it took for EVER to load,,and when I opened the app my phone kept getting notifications that is was detecting a VIRUS and I’m not talking bout corana,,for safety reasons I don’t recommend this app🥺💕 like bruh if u want a good fun app get tiktok ✨","title":"ew no😙","isEdited":false,"userName":"KRYStalJJ88"}},{"id":"6176225811","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T11:13:16Z","review":"you know I downloaded this app and it took forever also I thought I was downloading to see the president but instead I was shocked to find a racist homophobic rapist so I was pretty disappointed with this app I don’t recall asking to see a cheeto","title":"MMM YEAH ITS CANCELLED","isEdited":false,"userName":"akoajsjs"}}]}