{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35780","data":[{"id":"6175792494","type":"user-reviews","attributes":{"review":"This app is slower than my grandma after her morning walk. He asks for a phone number in order to enter the app and as soon as you enter in your number, he floods you with texts. Very unprofessional.","title":"Terrible","userName":"Jacque240","rating":1,"date":"2020-07-09T08:53:30Z","isEdited":false}},{"id":"6175726722","type":"user-reviews","attributes":{"review":"Donald J. Trump is absolutely disgusting, this app just supports a racist, homophobic, xenophobic, misogynistic, fascist, ignorant, and rapist president whom has done only a few good things for this country, and has made this country fall apart. This app should be taken down for support such things. Good grief Donald J Trump, get your act together.","title":"So toxic🤢","userName":"HOLMDJSKA","rating":1,"date":"2020-07-09T08:30:57Z","isEdited":false}},{"id":"6175701130","type":"user-reviews","attributes":{"review":"He is responsible for 40M+ lost jobs and 130k+ lost lives. Trump is a complete disgrace to the White House, thinks he’s above the law, has created his own swamp, betrayed our country and needs to get kicked out in November. Then arrested and charged for treason among many other charges. REGISTER TO VOTE!!!","title":"Murdered 130,000+ Americans","userName":"Khalidclone95","rating":1,"date":"2020-07-09T08:22:10Z","isEdited":false}},{"id":"6175701081","type":"user-reviews","attributes":{"review":"This app is terrible. It took so long to download and when it finally opened there was just a picture of Jared kushner looking like a dead fish. Terrifying. It also is stealing my info. Why does it know my ssn??? Don’t download this app.","title":"Terrible.","userName":"swagsuz","rating":1,"date":"2020-07-09T08:22:09Z","isEdited":false}},{"id":"6175696701","type":"user-reviews","attributes":{"review":"When I opened the app my phone crashed! I turned my phone off to see if it would change anything and I had to delete the app so my phone would work like it normally did.","title":"TERRIBLE APP","userName":"eyebrows OfF","rating":1,"date":"2020-07-09T08:20:40Z","isEdited":false}},{"id":"6175693452","type":"user-reviews","attributes":{"review":"Lil ole’ me downloaded this app thinking why not?....WRONGGGGG DECISION. First of all it took FOREVERR to download then when it did and i opened it my phone froze and made the screen go black. I tried turning the power off, charging it, etc but nothing worked!!! Such a bad app, complete basura😫😔😾","title":"Smh. DISSAPOINTED 😾","userName":"🧸S","rating":1,"date":"2020-07-09T08:19:35Z","isEdited":false}},{"id":"6175690371","type":"user-reviews","attributes":{"review":"This app doesn’t work it just takes you to a screen where it says “to continue you must buy the premium” which is $4.99 and I don’t need to waste my money on an app that doesn’t work!!!","title":"WASTE OF TIME","userName":"hsmdkbeuiebejikwkw","rating":1,"date":"2020-07-09T08:18:32Z","isEdited":false}},{"id":"6175664706","type":"user-reviews","attributes":{"review":"Sadly this app didn’t work AT ALL it wouldn’t load! It crashes every time. And completely wiped my phone of data it’s the worst app ever to hit the App Store and I’m disappointed it’s on the apple App Store at all. I expect better","title":"AWFUL","userName":"tiktok rises","rating":1,"date":"2020-07-09T08:09:47Z","isEdited":false}},{"id":"6175622270","type":"user-reviews","attributes":{"review":"This app RUINED my life. First, it took a WEEK to download! This made my battery die three times as fast! And then it asked for my phone number?!?! Why the hell would the president need my phone number! I find this app disgusting and useless!","title":"DO NOT DOWNLOAD","userName":"Hannah J F","rating":1,"date":"2020-07-09T07:54:31Z","isEdited":false}},{"id":"6175585950","type":"user-reviews","attributes":{"review":"DO NOT DOWNLOAD THIS APP I just wanted this app to support our commander and chief but little did I know it would take 2 months to FINALLY download!!!!!!!You May ask did I have enough storage of course I did! This is the worst app I couldn’t even show my support!!","title":"DO NOT DOWNLOAD","userName":"Gabrie_la","rating":1,"date":"2020-07-09T07:41:20Z","isEdited":false}}]}