{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=32630","data":[{"id":"6177458212","type":"user-reviews","attributes":{"userName":"bskwhejs","date":"2020-07-09T16:54:49Z","isEdited":false,"rating":1,"title":"ATROCIOUS APP","review":"this app took like a month to download and when it finally did it hacked into all my information. DO NOT GET THIS APP I REPEAT DONT GET THIS APP. not to mention every time i would open it or would let out this grotesque odor that smelt like a mixture of the worst possible b/o mixed with two year aged hot cheeto dust."}},{"id":"6177456501","type":"user-reviews","attributes":{"userName":"aimpro23","date":"2020-07-09T16:54:18Z","isEdited":false,"rating":1,"title":"Gen Z","review":"if you are going to take away tik tok we will take away this stupid app it is very stupid and shouldn’t be on the app store we know how bad of a person trump is from twitter so we have decided that this app is horrible and should be deleted"}},{"id":"6177442582","type":"user-reviews","attributes":{"userName":"GraceTheLitGirl","date":"2020-07-09T16:50:03Z","isEdited":false,"rating":1,"title":"Poopy","review":"When he is threatening to take away the app that cures my boredom and a bunch of other peoples, we obviously could see he is a bad person. So if we can’t give our app he can’t have his. And besides who even likes trump anyways."}},{"id":"6177435837","type":"user-reviews","attributes":{"userName":"nebeje sva","date":"2020-07-09T16:47:57Z","isEdited":false,"rating":1,"title":"Siri killed herself","review":"When I downloaded the app Siri said she would rather be dead than be on a phone with this app so she killed herself and now I have to actually open my weather app to know what it’s like outside. Would NOT recommend."}},{"id":"6177418580","type":"user-reviews","attributes":{"userName":"iusedtolovetrump2020","date":"2020-07-09T16:42:47Z","isEdited":false,"rating":1,"title":"Uhm?","review":"At first I downloaded to see what was going on with the campaign since he may be the president again, but this app is horrible. I, a 10th grader could do better, WITHOUT A TEAM. This makes me want to vote Biden 2020 and never be a republican voter again. Look how they treat us."}},{"id":"6177417935","type":"user-reviews","attributes":{"userName":"UNICORNS78590","date":"2020-07-09T16:42:36Z","isEdited":false,"rating":1,"title":"Not a good app","review":"It’s honestly disappointing because I had high hopes for the app.. crashes 24/7, and it spams me with notifications. the campaign is represented poorly by this app honestly I wish they would’ve put some effort into it. Zero stars"}},{"id":"6177407660","type":"user-reviews","attributes":{"userName":"Anti Boomer123","date":"2020-07-09T16:39:41Z","isEdited":false,"rating":1,"title":"THIS APP IS AWFUL!! DO NOT DOWNLOAD","review":"this app caused so many glitches to my phone that i had to get a new one. i had never had these glitches until i downloaded the app but it was so bad that it shut my phone down completely. this app is awful and DO NOT DOWNLOAD IT!!!!"}},{"id":"6177405561","type":"user-reviews","attributes":{"userName":"crystalbllade","date":"2020-07-09T16:39:06Z","isEdited":false,"rating":1,"title":"-9/10","review":"I whole heartedly feel that this website was attacking me on a personal level. it was extremely non inclusive and discriminatory for no reason. It is my firm belief that this wretched app should be taken down for its violation of community guidelines."}},{"id":"6177403382","type":"user-reviews","attributes":{"userName":"ryanrammacher","date":"2020-07-09T16:38:28Z","isEdited":false,"rating":1,"title":"inappropriate","review":"the app is full of inappropriate content i would not recommend downloading and i would not recommend opening it in front of others. this app is very NSFW - very unprofessional and and even more unpresidential. 0 stars!!"}},{"id":"6177403282","type":"user-reviews","attributes":{"userName":"Musicluvr557","date":"2020-07-09T16:38:26Z","isEdited":false,"rating":1,"title":"Literally the worst 🧚🏻✨","review":"This app took forever to download. It has crashed my phone. And on top of it, it continually runs your location in the back. I wonder what kind of security risks this causes 🤔Maybe Trump should rethink some things..."}}]}