{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=88080","data":[{"id":"6178788505","type":"user-reviews","attributes":{"date":"2020-07-10T00:36:51Z","isEdited":false,"userName":"💫🌼💛","review":"as soon as i opened the app i was diagnosed with covid-19??? don’t trust this app, i think it’s part of the left’s plan to kill us all off!!!","rating":1,"title":"gave me the corona virus??"}},{"id":"6178783975","type":"user-reviews","attributes":{"date":"2020-07-10T00:35:07Z","isEdited":false,"userName":"enensm","review":"Do not download. You’ll regret it","rating":1,"title":"Worst app"}},{"id":"6178759776","type":"user-reviews","attributes":{"date":"2020-07-10T00:25:43Z","isEdited":false,"userName":"UGHhhhhhhhhh272829938291","review":"taking tiktok from the usa bc a chinese person made it is not right , and who would inject lysol or cleaning supplies to keep from getting corona","rating":1,"title":"."}},{"id":"6178758975","type":"user-reviews","attributes":{"date":"2020-07-10T00:25:25Z","isEdited":false,"userName":"genz was here","review":"this app took a day to download, it gave my phone a virus, and it started spewing inappropriate, false, and offensive language.","rating":1,"title":"disappointed"}},{"id":"6178753739","type":"user-reviews","attributes":{"date":"2020-07-10T00:23:24Z","isEdited":false,"userName":"Subject.89p13","review":"not for me. stick to giving your small wee wee a terrible spray on tan instead of exposing all of us to this hot steaming piece of absolute garbage. hope you get a kiss from ms. rona herself!","rating":1,"title":"no ❤️"}},{"id":"6178729191","type":"user-reviews","attributes":{"date":"2020-07-10T00:13:56Z","isEdited":false,"userName":"your.mami.chula.nayeli","review":"Tracks all your information and makes your phone crash. MY OHONE WOULDNT WORK FOR A WEEK UNTIL I DELETED THIS APP IT WENT BACK TO NORMAL!!! DONT DOWNLOAD!!!!😣😣","rating":1,"title":"WORST APP TO EXIST"}},{"id":"6178713960","type":"user-reviews","attributes":{"date":"2020-07-10T00:08:04Z","isEdited":false,"userName":"Kaaaaat75828","review":"I personally did not like this app or the man it represents!","rating":1,"title":"no❤️"}},{"id":"6178640376","type":"user-reviews","attributes":{"date":"2020-07-09T23:39:27Z","isEdited":false,"userName":"vhudfbnbgg","review":"Is a bad app sorry is just bad don’t download the app","rating":1,"title":"Bad App"}},{"id":"6178687913","type":"user-reviews","attributes":{"date":"2020-07-09T23:57:59Z","isEdited":false,"userName":"ClawTerror545","review":"Great app","rating":5,"title":"Good app"}},{"id":"6178623009","type":"user-reviews","attributes":{"date":"2020-07-09T23:32:49Z","isEdited":false,"userName":"😔✌🏻😳🥺","review":"Once upon a time there was a lovely princess. But she had an enchantment upon her of a fearful sort, which could only be broken by Love's first kiss. She was locked away in a castle guarded by a terrible fire breathing dragon. Many brave knights had attempted to free her from this dreadful prison, but none prevailed. She waited in the dragon's keep in the highest room of the tallest tower for her true love and true love's first kiss. Like that's ever going to happen. What a loony. Shrek Beware Stay out I think he's in here. All right. Lets get it! Hold on. Do you know what that thing can do to you? Yeah. He'll groan into your bones for his brains. Well actually that would be a giant. Now Ogres, huh, they are much worse. They'll make a soup from your freshly peeled skin. They'll chew your livers, squeeze the jelly from your eyes. Actually, it's quite good on toast. Back, back beast, back! I warned you! Right. This is the part, where you run away. Yeah! And stay out. Wanted. Fairytale creatures. Right, this one is full. Take it away. Give me that. Your fine days are over. -25 pieces of silver for the witch. Next. -Come on. Sit down there! And be quiet! This cage is so small. You wouldn't turn me in. I'll never be stubborn again. I can change. Please, give me another chance. Oh, shut up! Next. What do we got? This little wooden puppet. I'm not a puppet, I'm a real boy. Five shillings for the possessed toy. Take it away. No! Please, don't let them do it! Next. What do you got? Well, I've got a talking donkey! Right. Well that's good for ten schillings, if you can prove it. Oh, go ahead fella. Well? He's just a li..., just a little nervous. He's really quite a chatterbox. You boneheaded donkey! That's it. I have heard enough. Guards! No, no, he talks, he does! I can talk. I love to talk. I've talked to... Get her out of my sight! -No, no, I swear! Hey, I can fly. -He can fly! -He can fly! He can talk! -That's right, fool! Now I'm a flying, talking donkey! You might have seen house fly, maybe even a superfly. But I bet you ain't never seen a donkey fly! Seize him! Get him! This way! Hurry! You there. Ogre. -I. By the order of lord Farquaad. I am authorized to place you both under arrest. And transport you to designated resettlement facility. Oh really? You and what army? Can I say something to you? Listen, you were really, really something, back there. Incredible. Are you talking to... ...me? Yes, I was talking to you. Can I just tell you","rating":1,"title":"shrek"}}]}