{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=4960","data":[{"id":"6173767761","type":"user-reviews","attributes":{"review":"This app gets one star for me.🥱It isn’t helpful at all. It is so trash like I downloaded the app the tired to press it and it did not work. (And yes my internet was working fine). I just wanted to see how our spray tan goddess is going. But the app didn’t not let me appreciate the fat Cheeto with the bad lace front that is not glued on. All I wanted to do is see how’s the racist is going. And then I heard a man at my door scream give him five stars. And I was scared then I opened the door and looked at him and it was a man who looked like trump with and confederate flag shirt on. And I was scared for my life and I had to call the police so one star for me.","title":"One star  for the Cheeto","userName":"trumps tan","rating":1,"date":"2020-07-08T21:21:02Z","isEdited":false}},{"id":"6173765597","type":"user-reviews","attributes":{"review":"i don’t know where to even get started with this abomination. first of all it asked for all of my private information and given past history with trump you know he’s selling my information. even worse i’m afraid he’s using my information for *personal gain* you know because i’m a fairly attractive young girl. also this app proudly promotes hate speech and hurtful content. as a women i am offended. i am not a poc but if i was i would be absolutely devastated to see this app still in the app store. it is detrimental to my physical and mental health and many other people feel the same way. delete this app now","title":"DONT GET THIS APP","userName":"Emilyk2198","rating":1,"date":"2020-07-08T21:20:18Z","isEdited":false}},{"id":"6173665015","type":"user-reviews","attributes":{"review":"It took me days to download the app! And when it finally did it hacked Siri and made her continue to chant “TRUMP 2020” over and over again. I got so scared. And then my phone wouldn’t turn off. I couldn’t call anyone. And then bunker boy himself teleported to my room through the phone. He said I had to give his app 5 starts and I refused. He then threatened to send me back to my country even though I was born here. After which I drop kicked him and he teleported back to his Cheeto bunker. I quickly deleted the app and will never download it again! Please do not get the app or a human pedophilic racist Cheeto will come to your house!","title":"THIS APP IS HORRIBLE!!","userName":"tete😚✌🏼","rating":1,"date":"2020-07-08T20:43:32Z","isEdited":false}},{"id":"6173657515","type":"user-reviews","attributes":{"review":"this app is the worst app ever not only is it about the orange piece of crap president but it also thinks that i like my president but that will never happen Obama should have stayed president sorry not sorry to all you trump supporters but y’all are dumb idiots for supporting the orange man also can y’all give me one good reason why trump is a good president.. oh wait you can’t because our dumb president thinks the corona virus will magically disappear if we stop testing no idiot that’s not how things work. so since you guys support a racist sexist homophobic dumb man all of you are the same. we shouldn’t have a president that doesn’t have a working brain.","title":"bad app","userName":"pjosheeen","rating":1,"date":"2020-07-08T20:40:53Z","isEdited":false}},{"id":"6173565750","type":"user-reviews","attributes":{"review":"This app took a good two weeks to download and when it finally did, my phone got a virus, which turned every photo in my camera roll to pictures of president 🍊. My phone then began to uncontrollably shake and nearly burst into flames, but luckily, I put it in rice before it could spontaneously combust. When I took my phone out of the rice, it began to glow orange!! I got radiation from the glowing and it gave me laser vision. I then proceeded to burn my house down and kill my family. I don’t have anywhere to live and everyone I know is dead. It also gave me super gonorrhea and severe herpes and now I will never be able to find love.","title":"TERRIBLE APP!!!! 😡","userName":"vermi poop","rating":1,"date":"2020-07-08T20:08:28Z","isEdited":false}},{"id":"6173561478","type":"user-reviews","attributes":{"review":"Guys once I saw this app I need to DOWNLOAD IT RIGHT AWAY!!!!. My favorite president of all time and I HAVE TO SUPPORT HIM IN ALL I CAN. THANKS TO HIM MY FRIENDS FAMILY GOT DEPORTED LOLZZZZ HE LOVES TO TEAR UP FAMILIES AND KEEP MY FRIENDS COUSINS IN CAGES. WHAT A GOOOF BALLL🤣🤣ANYWAY WHEN I DOWNLOADED THE APP ICE SHOWED UP TO MY HOUSE AND EVEN THOUGH I TOLD THEM THAT I LOVED TRUMP AND HAVE ALL THE MERCH THEY STILL WANTED TO DEPORT ME hehehe oh silly Donald!!😜WELL I TOLD THE POLICE THAT THERE WERE LITTLE BLACK KIDS IN THE NEXT STREET PLAYING HIDE AND SEEK AND THEY IMMEDIATELY LEFT BC THEY LOVE TO SHOOT AND MURDER INNOCENT AFRICAN AMERICANS!!! ARENT THEY GREAT?!🤩 WELL ONCE THEY LEFT IT TURNS OUT A GROUP OF WHITE PEOPLE CAME TO CALL ME A RAPIST AND DRUG DEALER LIKE SRSLY DONALD WILL YOU 🛑 ✋ PLAYING YOUR FUNNY LITTLE GAMES AND DO SOMETHING TO HELP THIS COUNTRY 😆 MOVING ONNNN COVID HAS GOTTEN WORSE CAUSE DONALD IS SUCH A FUNNY AND KIND EMPHASIS ON KIND PRESIDENT THAT HE LEFT TO GO HIDE IN A BUNKER WHILE AMERICANS ARE DYING HAHAHA DONALD SURE LOVES TO PLAY JOKES. SORRY FOR THE RANT I JUST CANT WAIT TO KEEP HIM IN OFFICE FOR ANOTHER SPLENDID 4 YEARS. 🤓😎😎😎I SURE HOPE HE DOES BECOME PRESIDENT OR ELSE WHAT  WILL THE WHTE SUPREMACISTS DOOO?!!! I DECIDED TO GIVE IT A ONE START CAUSE YOU KNOW DONALD TRUMPY WILL ALWAYS BE #1 IN MY  ❤️","title":"DONALD TRUMPY","userName":"🍊's BIGGEST FANN","rating":1,"date":"2020-07-08T20:07:01Z","isEdited":false}},{"id":"6173560178","type":"user-reviews","attributes":{"review":"This app takes forever to download and too much space. When i tried downloading it the first time i had to go through and delete a lot of things from my phone just so i could have the app. When it finally downloaded after 2 DAYS i would click the app and it would sit on the home screen for 30 minutes and just take me off the app. When i finally did get into the app it was very glitchy and slow running. I decided to just delete the app and receive the text messages instead, but ever since installing the app my phone has been slow. 😡💫🧚✨","title":"IM FURIOUS","userName":"Furious Boomer","rating":1,"date":"2020-07-08T20:06:34Z","isEdited":false}},{"id":"6173532092","type":"user-reviews","attributes":{"review":"I’ve never been more mad in my entire life. All I wanted to do was download this app and use it but it took HOURS to download. Once I got on the app everything was just so confusing. I had no clue how to work this app and I doubt I’m the only one. Once my app FINALLY downloaded IT WOULD NOT LOAD! I was sitting there once again for hours watching the “T” spin until it finally loaded THEN wouldn’t even let me put my phone number to sign up! I tried using someone else’s phone number and I had the same problem. I was done at this point and I threw my phone which hit my bird and it unfortunately died :(","title":"WORST APP TO EVER EXIST","userName":"Someone🎀","rating":1,"date":"2020-07-08T19:57:05Z","isEdited":false}},{"id":"6173495557","type":"user-reviews","attributes":{"review":"i downloaded this app and it is full of racist slurs and glitched my phone so bad it also DRAINS my battery percentage so much i literally have to keep my phone in charge 25/8 idk way an app like this is on the app store it’s TERRIBLE and shouldn’t even exist. Gen Z is going to take over the world and remove people like Donald J trump out of this world. he can take his minions with him because they won’t be needed we need non racist   people and non problematic people to be our president and Trump is NOT one of them 😒. please take down this app because it should have never been made in the first place it could literally get someone killed.","title":"THIS APP IS TERRIBLE","userName":"shnsndb","rating":1,"date":"2020-07-08T19:44:32Z","isEdited":false}},{"id":"6173408859","type":"user-reviews","attributes":{"review":"When I first downloaded this app I almost went blind. After a blue loading page showed up a orange thing looked back at me. I don’t know what type of animal or creature it was but it look horrendous. I was so disgusted at what I saw I projectile vomited across my room. My breakfast that I ate this morning was all over the floor. Now everyone I look at something orange the trauma comes back. I talked to my therapist and doctor about this and they said I will never be able to look at something orange ever again. Every single day I look at the color I have to vomit again and again. So thanks for this NOT!😡😡😡😡😡😡","title":"HORRIBLE APP!!!!!","userName":"Saya2005","rating":1,"date":"2020-07-08T19:14:59Z","isEdited":false}}]}