{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=127350","data":[{"id":"6177757407","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:27:58Z","userName":"Caitlin7890567447","review":"This app is is so bad it might at well be DELETED💕 -18829119/10 do not recommend. 😌😌","isEdited":false,"title":"Terrible👁👄👁"}},{"id":"6177757285","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:27:55Z","userName":"stinker stinks","review":"I downloaded this app not too long ago and it’s completely not worth it.it doesnt give me any good info that it said it was in the description so i’m deleting it now.its used up so much space for no reason all it does is eat away at my storage and sits there with nothing informative or useful LIKE IT SAID IT WOULD.🤦🏻‍♀️horrible app pls don’t get it","isEdited":false,"title":"mistake"}},{"id":"6177756282","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:27:36Z","userName":"hey would jablomy","review":"r-r-r-roll💿up⬆️to2️⃣the🤩party🥳with🧶my🧚crazy🤪pink💝wig💇🏼‍♀️\nAccording to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway. Because bees don’t care what humans think is impossible.” SEQ. 75 - “INTRO TO BARRY” INT. BENSON HOUSE - DAY ANGLE ON: Sneakers on the ground. Camera PANS UP to reveal BARRY BENSON’S BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black...oohh, black and yellow... ANGLE ON: Barry wearing the sweater he picked, looking in the mirror. BARRY (CONT’D) Yeah, let’s shake it up a little. He picks the black and yellow one. He then goes to the sink, takes the top off a CONTAINER OF HONEY, and puts some honey into his hair. He squirts some in his mouth and gargles. Then he takes the lid off the bottle, and rolls some on like deodorant. CUT TO: INT. BENSON HOUSE KITCHEN - CONTINUOUS Barry’s mother, JANET BENSON, yells up at Barry. JANET BENSON Barry, breakfast is ready! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 1. INT. BARRY’S ROOM - CONTINUOUS BARRY Coming! SFX: Phone RINGING. Barry’s antennae vibrate as they RING like a phone. Barry’s hands are wet. He looks around for a towel. BARRY (CONT’D) Hang on a second! He wipes his hands on his sweater, and pulls his antennae down to his ear and mouth. BARRY (CONT'D) Hello? His best friend, ADAM FLAYMAN, is on the other end. ADAM Barry? BARRY Adam? ADAM Can you believe this is happening? BARRY Can’t believe it. I’ll pick you up. Barry sticks his stinger in a sharpener. SFX: BUZZING AS HIS STINGER IS SHARPENED. He tests the sharpness with his finger. SFX: Bing. BARRY (CONT’D) Looking sharp. ANGLE ON: Barry hovering down the hall, sliding down the staircase bannister. Barry’s mother, JANET BENSON, is in the kitchen. JANET BENSON Barry, why don’t you use the stairs? Your father paid good money for those. \"Bee Movie\" - JS REVISIONS 8/13/07 2. BARRY Sorry, I’m excited. Barry’s father, MARTIN BENSON, ENTERS. He’s reading a NEWSPAPER with the HEADLINE, “Queen gives birth to thousandtuplets: Resting Comfortably.” MARTIN BENSON Here’s the graduate. We’re very proud of you, Son. And a perfect report card, all B’s. JANET BENSON (mushing Barry’s hair) Very proud. BARRY Ma! I’ve got a thing going here. Barry re-adjusts his hair, starts to leave. JANET BENSON You’ve got some lint on your fuzz. She picks it off. BARRY Ow, that’s me! MARTIN BENSON Wave to us. We’ll be in row 118,000. Barry zips off. BARRY Bye! JANET BENSON Barry, I told you, stop flying in the house! CUT TO: SEQ. 750 - DRIVING TO GRADUATION EXT. BEE SUBURB - MORNING A GARAGE DOOR OPENS. Barry drives out in his CAR. \"Bee Movie\" - JS REVISIONS 8/13/07 3. ANGLE ON: Barry’s friend, ADAM FLAYMAN, standing by the curb. He’s reading a NEWSPAPER with the HEADLINE: “Frisbee Hits Hive: Internet Down. Bee-stander: “I heard a sound, and next thing I knew...wham-o!.” Barry drives up, stops in front of Adam. Adam jumps in. BARRY Hey, Adam. ADAM Hey, Barry. (pointing at Barry’s hair) Is that fuzz gel? BARRY A little. It’s a special day. Finally graduating. ADAM I never thought I’d make it. BARRY Yeah, three days of grade school, three days of high school. ADAM Those were so awkward. BARRY Three days of college. I’m glad I took off one day in the middle and just hitchhiked around the hive. ADAM You did come back different. They drive by a bee who’s jogging. ARTIE Hi Barry! BARRY (to a bee pedestrian) Hey Artie, growing a mustache? Looks good. Barry and Adam drive from the suburbs into the city. ADAM Hey, did you hear about Frankie? \"Bee Movie\" - JS REVISIONS 8/13/07 4. BARRY Yeah. ADAM You going to his funeral? BARRY No, I’m not going to his funeral. Everybody knows you sting someone you die, you don’t waste it on a squirrel. He was such a hot head. ADAM Yeah, I guess he could’ve just gotten out of the way. The DRIVE through a loop de loop. BARRY AND ADAM Whoa...Whooo...wheee!! ADAM I love this incorporating the amusement park right into our regular day. BARRY I guess that’s why they say we don’t need vacations. CUT TO: SEQ. 95 - GRADUATION EXT. GRADUATION CEREMONY - CONTINUOUS Barry and Adam come to a stop. They exit the car, and fly over the crowd to their seats. * BARRY * (re: graduation ceremony) * Boy, quite a bit of pomp...under * the circumstances. * They land in their seats. BARRY (CONT’D) Well Adam, today we are men. \"Bee Movie\" - JS REVISIONS 8/13/07 5. ADAM We are. BARRY Bee-men. ADAM Amen! BARRY Hallelujah. Barry hits Adam’s forehead. Adam goes into the rapture. An announcement comes over the PA. ANNOUNCER (V.O) Students, faculty, distinguished bees...please welcome, Dean Buzzwell. ANGLE ON: DEAN BUZZWELL steps up to the podium. The podium has a sign that reads: “Welcome Graduating Class of:”, with train-station style flipping numbers after it. BUZZWELL Welcome New Hive City graduating class of... The numbers on the podium change to 9:15. BUZZWELL (CONT’D) ...9:15. (he clears his throat) And that concludes our graduation ceremonies. And begins your career at Honex Industries. BARRY Are we going to pick our job today? ADAM I heard it’s just orientation. The rows of chairs change in transformer-like mechanical motion to Universal Studios type tour trams. Buzzwell walks off stage. BARRY (re: trams) Whoa, heads up! Here we go. \"Bee Movie\" - JS REVISIONS 8/13/07 6. SEQ. 125 - “FACTORY” FEMALE VOICE (V.O) Keep your hands and antennas inside the tram at all times.","isEdited":false,"title":"Extremely offensive app!! 🤬🤬😖"}},{"id":"6177755447","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:27:20Z","userName":"idgafaboutcops","review":"I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.  I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist. I will not support a rapist.","isEdited":false,"title":"I will not support a rapist"}},{"id":"6177754970","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:27:12Z","userName":"Dr. Doofenshmirtz uwu","review":"According to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway. Because bees don’t care what humans think is impossible.” SEQ. 75 - “INTRO TO BARRY” INT. BENSON HOUSE - DAY ANGLE ON: Sneakers on the ground. Camera PANS UP to reveal BARRY BENSON’S BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black...oohh, black and yellow... ANGLE ON: Barry wearing the sweater he picked, looking in the mirror. BARRY (CONT’D) Yeah, let’s shake it up a little. He picks the black and yellow one. He then goes to the sink, takes the top off a CONTAINER OF HONEY, and puts some honey into his hair. He squirts some in  his mouth and gargles. Then he takes the lid off the bottle, and rolls some on like deodorant. CUT TO: INT. BENSON HOUSE KITCHEN - CONTINUOUS Barry’s mother, JANET BENSON, yells up at Barry. JANET BENSON Barry, breakfast is ready! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 1. INT. BARRY’S ROOM - CONTINUOUS BARRY Coming! SFX: Phone RINGING. Barry’s antennae vibrate as they RING like a phone. Barry’s hands are wet. He looks around for a towel. BARRY (CONT’D) Hang on a second! He wipes his hands on his sweater, and pulls his antennae down to his ear and mouth. BARRY (CONT'D) Hello?","isEdited":false,"title":"The app is utterly atrocious"}},{"id":"6177754895","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:27:10Z","userName":"gods child!!🙏💗","review":"nottt goooooodddddd...,","isEdited":false,"title":"ahhhh"}},{"id":"6177754482","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:27:03Z","userName":"Beetlejuice202","review":"This app took 17 weeks to download, threatened to bomb me when I tried to delete it when I tried to write this review it said fake news. #beet2020#beetlejuice2020","isEdited":false,"title":"Absolute sh*t"}},{"id":"6177754225","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:26:58Z","userName":"big dumb dumb poo poo head","review":"Shawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, Deluga Heights (replay)\nHey over and over if I'm tipsy or sober\nI got lil' momma on rewind like the deck in my Rover\nOn my mind, shawty fine, meditate her like yoga\nSo down on the line make me want a cold soda\nHey baby be my radio\nHear you everywhere I go\nMusic in my head\nKnow your melody in every note\nGirl you incredible\nMake yourself available\nNa na na na\nThat tune so exceptional\nSexy like a piano give you my hands if you're ready\nWe can make plans get body stand if you let me\nGirl I'm a fan chasing my boss like catch me\nI ain't a fight she gon arrest me\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nSee you been all around the globe\nNot once did you leave my mind\nWe talk on the phone, from night til the morn\nGirl you really change my life\nDoin things I never do\nI'm in the kitchin cookin things she likes\nWe're real worldwide, breakin all the rules\nSomeday I wanna make you my wife\nThat girl, like somethin off a poster\nThat girl, is a dime they say\nThat girl, is the gun to my holster\nShe's runnin through my mind all day, ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nI can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, I can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, na na na na na na na\nNa na na na na na\nShawty got me singin'\nNa na na na na na na\nNa na na na na na na\nNow she got me singin'\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay","isEdited":false,"title":"For Tiktok"}},{"id":"6177753836","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:26:51Z","userName":"Rosalyn1417","review":"I’m writing a review because my Aunt had this installed on her phone. And obviously because she’s a cheese puff stan, she had notifications on. While my aunt may be the wildest karen out there that does not mean I wanted her to get in a car accident because of distracted driving from a notification from THIS app. Absolutely SPAM SPAM SPAM IT DO NOT STOP YOU GON SAY “stop .?🥺” AND IT WILL SAY “nO😘”. She is now in a coma (idrc ssksksbsb). A week before the incident she was saying how she was suspicious of the app because it was asking for her sensitive info (social security number etc) and now that she’s in a coma I’m finding bills in HER MAILBOX about something on the lines of “you must finish your payment before the delivery of infants to the address provided — 1600 Pennsylvania Avenue NW, Washington, DC 20500”. Which BY THE WAY IS THE WHITE HOUSE SO IDK ABOUT YOU BUT IM PRESSED get this app in the BIN 🤾‍♂️🗑","isEdited":false,"title":"Lil bunker chief cheese ball"}},{"id":"6177753419","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:26:44Z","userName":"quinn+trump","review":"Hi guys I rape women I am racist and homophobic can I be president next? 🍊\n\nTaking down TikTok is not good 60% of kids between 10 and 15 are obese are you trying to make them get off TikTok and go outside?","isEdited":false,"title":"Trump"}}]}