{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=16300","data":[{"id":"6174136530","type":"user-reviews","attributes":{"date":"2020-07-08T23:38:52Z","rating":1,"title":"Hot steamy garbage","userName":"kordakmak","review":"This app is rated +17 because upon opening the app, a child rapist is pictured; this app is not suitable for your kids. After I downloaded this app my information was sold to the Chinese government for facial recognition.  The app emitted a high frequency noise that made my dogs ear bleed and cost me a $500 vet bill. My dog got mad at the phone for the noise and ate my phone. So it also cost me my brand new iPhone 11. Come get us bunker boy🧚🏻💫💞","isEdited":false}},{"id":"6174115974","type":"user-reviews","attributes":{"date":"2020-07-08T23:31:13Z","rating":1,"title":"no❤️","userName":"ur local blue haired lesbian😌","review":"this is the worst app i have ever used! while i was petting my emu i was rudely interrupted by a VERY disturbing image of a giant cheeto with a really annoying voice! now i don’t wanna get to political but it sounded like a REPUBLICAN to me! ugh how rude. also, later while i was eating my cantilope i noticed a notification on my phone. IT was a vote trump 2020 sign! now idk who this “trump” is, but it sounds more like a racist, homophobic, transphobic, xenophobic, pig to me. ONE STAR! DO NOT DOWNLOAD","isEdited":false}},{"id":"6174096433","type":"user-reviews","attributes":{"date":"2020-07-08T23:24:06Z","rating":1,"title":"dude...really?!?!!","userName":"Krose5115","review":"i installed this app and my phone and i immediately got the coronavirus. now i’m sick on my death bead because it stole my favorite bowl. anyways i tried to do math on this calculator app and it’s soooooo useless. like i can’t do math, this stupid app can’t do math either. what a WASTE of space. so is the president, a waste of space, buttt like i was saying, i’m going to goth ihop before i stop by femboy hooters, does anybody want anything???","isEdited":false}},{"id":"6174095772","type":"user-reviews","attributes":{"date":"2020-07-08T23:23:51Z","rating":1,"title":"Oh My God","userName":"oh dont do it...","review":"DO NOT GET THIS APP! When I first opened it, a very graphic photo popped up of a orange with the tinniest hands ever, it couldn’t even pick up a glass of water!  After I manger to get past that photo, another one showed up of our beloved chief of police doing unspeakable things with the our amazing Vice President! It was unholy and very disrespectful. The creators of this app need to fix these glitches before more people are scared for life","isEdited":false}},{"id":"6174079623","type":"user-reviews","attributes":{"date":"2020-07-08T23:18:10Z","rating":1,"title":"No just no.","userName":"fmdjdhshsj","review":"I don’t know why the public would allow a PRESIDENT to own their own app. You realize that presidents make history and Donald Trump most likely became president for the media. Now he owns his own app. If you download it because you’re a supporter, i’d like you to know that the man you’re sticking up for is a orange fool who treats people different. This app is also annoying can someone shut it down?","isEdited":false}},{"id":"6174056266","type":"user-reviews","attributes":{"date":"2020-07-08T23:09:30Z","rating":1,"title":"horrible app","userName":"karlmarxismydaddy","review":"literally the worst app ever made. as soon as i opened the app my phone glitches and a bear with chainsaws for arms walked down the street and waved at a car being driven by a great white shark going 110 mph because he was being chased by rabid vampire bunnies who wanted to eat seafood because all the carrots in the world were destroyed by the evil alien monkey battalion of the Borgon Galaxy who were on a Galactic conquest to destroy this app because it’s so horrible.","isEdited":false}},{"id":"6174046209","type":"user-reviews","attributes":{"date":"2020-07-08T23:05:36Z","rating":1,"title":"wish i could give 0 stars","userName":"Dont care about nickname","review":"this app is so bad, when i first opened it i was redirected to a website advertising sex toys without any warning. i’m all for sexual freedom but my children were in the room. when i went back to the app it just kept redirecting me until i bought something from the site. they made sure to mention that 70% of the proceeds would be going to the campaign but so i really need to buy a dildo in order to donate??!!!!?!?! it’s been 4 weeks and not only have i not received my toy but once a week it will redirect me to that cite even when i’m not using the app. this is ridiculous!!!! fix it and then get back to me!!!!","isEdited":false}},{"id":"6174045320","type":"user-reviews","attributes":{"date":"2020-07-08T23:05:17Z","rating":1,"title":"1 star","userName":"anna ooooooooop","review":"Wonder Pets Wonder Pets, Wonder Pets Wonder Pets\nWe're on our way\nTo help a friend and save the day\nWe're not too big and we're not too tough\nBut when we work together we've got the right stuff\nGo wonder pets yay!\nThe phone\nThe phone is ringing\nThe phone\nWe'll be right there\nThe phone\nThe phone is ringing\nThere's an animal in trouble\nThere's an animal in trouble\nThere's an animal in trouble somewhere\nIt's a baby penguin\nHe's caught on an iceberg\nOoh\nA baby penguin\nCaught on an iceberg\nWhat's a penguin\nWhat's an iceberg\nLook!\nA baby penguin caught on an iceberg\nThis is serious\nWe have to help him\nLet's save the penguin\nLet's save the penguin\nLet's save the penguin\nWeeeee!\nWrong clothes\nLinny, Tuck\nAnd Ming Ming too\nWe're wonder pets and we'll help…","isEdited":false}},{"id":"6174033786","type":"user-reviews","attributes":{"date":"2020-07-08T23:00:56Z","rating":1,"title":"DON’T DOWNLOAD","userName":"thebestbear🐻","review":"I open the app and when its loading instead of a cirlce its his cheeto face 👁👄👁 it takes and hour and a half to load, finally it opens and theres a 30 MINUTE AD. After that I see a picture of him NAKED. Ver disturbing. I finally get to the actual app and it MAKES me do the tutorial on how to use the app. Smh. And its HIS VOICE. It was NOT pleasant to my ears. The app did not even work well so I had to delete the app.","isEdited":false}},{"id":"6174019343","type":"user-reviews","attributes":{"date":"2020-07-08T22:55:31Z","rating":1,"title":"Horrible experience","userName":"sebas.468","review":"I downloaded this app and I started vomiting the second I saw an photo of an orange man. He looks very weird, not to mention disgusting. I have been vomiting for 3 weeks now, and it won’t stop. I recommend you don’t download this app, unless you want your phone to instantly get a virus and if you don’t want to throw up for weeks, your better off without this app","isEdited":false}}]}