{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=46610","data":[{"id":"6174217610","type":"user-reviews","attributes":{"isEdited":false,"review":"THIS APP IS HORRIBLE. AS SOON AS I GOT ON IT MY PHONE STARTED GLITCHING AND ACTING STRANGE. NEXT THING I KNOW THE LIGHTS GO OUT. BOOM. I GO CHECK WHAT THE LOUD NOISE WAS AND THERE IT IS MY WHOLE FAMILY BLEEDING EVERYWHERE. DEAD. I DIDN'T THINK MUCH OF IT A LITTLE STRANGE BUT NOT TO OUT OF THE ORDINARY. WEEKS GO BY AND STRANGER THINGS START HAPPENING. ONE TIME AT THE STORE I SAW A LITLE ORANGE SHRIMP LOOKING AT ME FROM A FAR. A  LITTLE CREEPY. DAYS AFTER THAT I NOTICED IT KEPT FOLLOWING ME UNTIL ONE DAY I HAD ENOUGH AND HAD IT FOR DINNER. A LITTLE SALTY MAY I SAY. ANOTHER DAY A HUMONGOUS CHEETO STARTED ATTACKING ME IM TALKING ALMOST KILLING ME THATS WHEN I PUT THE PIECES TOGETHER THIS APP WAS WHAT WAS CAUSING THIS. PLEASE DO NOT DOWNLOAD. STAY SAFE.❤️","rating":1,"title":"HORRIBLE APP!!!!!","date":"2020-07-09T00:08:48Z","userName":"jpgxohodcoccuvvi"}},{"id":"6174212394","type":"user-reviews","attributes":{"isEdited":false,"review":"I used it but it completely destroyed my phone so I had to get a new one because of the racist levels.","rating":1,"title":"Broken and Glitchy","date":"2020-07-09T00:06:49Z","userName":"Stephanie🥳"}},{"id":"6174205670","type":"user-reviews","attributes":{"isEdited":false,"review":"I saw a video of a lion getting a spray tan while peoples credit cards are in there and scamming people for money and types of stuff this needs to be taken down right away.......please","rating":1,"title":"Eeew","date":"2020-07-09T00:04:19Z","userName":"thebigcheetah"}},{"id":"6174193280","type":"user-reviews","attributes":{"isEdited":false,"review":"I was downloading the app to see what’s new and laugh and this Cheeto puff and then a toaster came out of no where onto the floor and my FOOT got stuck in the TOASTER. For your safety please do not get this app unless you want to get stuck. FRICK THIS APP DO NOT DOWNLOAD. DO NOT DOWNLOAD. JUST DONT DO IT.","rating":1,"title":"THIS APP GOT MY FOOT STUCK IN A TOASTER DO NOT GET IT","date":"2020-07-08T23:59:41Z","userName":"ttylams"}},{"id":"6174183287","type":"user-reviews","attributes":{"isEdited":false,"review":"So when I opened the app it said this is the hot Cheeto but he’s just a Cheeto not at all hot and so I screamed and passed out through trauma and when I opened my phone again his picture was my pfp in tiktok","rating":1,"title":"Cheeto but not so hot","date":"2020-07-08T23:56:00Z","userName":"hotxcheeto"}},{"id":"6174175118","type":"user-reviews","attributes":{"isEdited":false,"review":"This app is absolutely terrible. When I saw a Cheeto on the front page I was terrified. It had facial features and cheese wiz as “hair”. And when I opened the app all I could see was “Racist, Sexist, Transphobic, homophobic, and dictatorship”.","rating":1,"title":"✨Disgusting✨","date":"2020-07-08T23:52:59Z","userName":"YOUR ONE-OF-KIND BRUSKI"}},{"id":"6174173766","type":"user-reviews","attributes":{"isEdited":false,"review":"I opened the app and i saw trump he scared me then i had a heart attack. Then i went to the doctor and he said the cause was trumps face you will get a heart attack. If you vote for trump and leave a 5 star.","rating":1,"title":"this app is the worst","date":"2020-07-08T23:52:29Z","userName":"leavea1star"}},{"id":"6174168832","type":"user-reviews","attributes":{"isEdited":false,"review":"I do not recommend downloading this app. Very displeased by its content. Also, why does this man want me to go to a rally in the middle of a pandemic. He must be trying to kill off his supporters. Gladly, I am not one of them. 🧚🏿💞✨","rating":1,"title":"THIS APP IS BAD","date":"2020-07-08T23:50:39Z","userName":"christina.mailani"}},{"id":"6174162720","type":"user-reviews","attributes":{"isEdited":false,"review":"The app was super glitchy maybe because this orange Horror was on my screen 🟠 It also took a week to download, my WiFi is working fine so idk what the problem is","rating":1,"title":"I HATE THIS APP","date":"2020-07-08T23:48:43Z","userName":"keisha quatez"}},{"id":"6174157656","type":"user-reviews","attributes":{"isEdited":false,"review":"i got this app to keep updated on events going on w/ our president 😌(my favorite oompa loompa 🥵) unfortunately i’m gonna have to leave a bad review because first, it took weeks for this thing to download 😔 second when i opened it, it started glitching 😨😰 and then it gave my phone a virus 😣 please save yourselves the trouble ❤️ have a wonderful day 🤠.","rating":1,"title":"don’t waste your time.","date":"2020-07-08T23:46:48Z","userName":"ksnsmsks"}}]}