{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=92580","data":[{"id":"6179179313","type":"user-reviews","attributes":{"title":"America should not have a racist in office","isEdited":false,"rating":1,"userName":"Jessmanrulz","review":"That’s it. That’s the review.","date":"2020-07-10T03:01:26Z"}},{"id":"6179099056","type":"user-reviews","attributes":{"title":"It’s just bad","isEdited":false,"rating":1,"userName":"tyrhuejjsjs","review":"It has a lot of racist quotes","date":"2020-07-10T02:31:37Z"}},{"id":"6179087614","type":"user-reviews","attributes":{"title":"Dont get the app","isEdited":false,"rating":1,"userName":"blind hyper","review":"Just dont","date":"2020-07-10T02:27:28Z"}},{"id":"6179025182","type":"user-reviews","attributes":{"title":"boo","isEdited":false,"rating":1,"userName":"welyons","review":"worst app ever made!! they hacked all my information!! DO NOT GET THIS APP IF YOU WANT TO KEEP YOUR PRIVACY","date":"2020-07-10T02:04:32Z"}},{"id":"6179007587","type":"user-reviews","attributes":{"title":"Trump is a fascist","isEdited":false,"rating":1,"userName":"kaiavril","review":"This app really helped me understand what a fascist is. The definitions are great! ❤️","date":"2020-07-10T01:58:11Z"}},{"id":"6178993191","type":"user-reviews","attributes":{"title":"Yea no❤️","isEdited":false,"rating":1,"userName":"laylaaaaaaaaaaa.........","review":"So as i was laying on my bed doing nothing i decided that u wanted some cheetos so i go into the kitchen to get my flaming hot cheetos there wasnt any left cuz my fatass brother ate all of it this shattered my heart into small pieces even smaller than trumps pp anyways i grabbed myself a bag of normal cheetos n went back to bed and as i was laying down eating my really cheesy orange flavorless cheetos suddenly i got a vision of a man and this man looked oddly similar to the cheetos i was eating except that he was a million times the size of a normal cheeto so i jump out of bed screaming for help n then i remembered who it was it was donald trump my president that i praise n love i bet hed love me to cuz im 15 u feel me n then i laid back in bed feeling safe cuz i remembered that despite the fact that im 5,1 i got 150 pounds of muscle n would probably punch tf outta his face if he ever came anywhere near me cuz yk i dont eat mcdonalds everyday n im not obese so yea anyways as i continued to eat my flavorless cheetos i decided to download this app cuz i love my country ohh wait i just remembered IM NOT EVEN AMERICAN HAHAHAHAHHA but yea when i clicked on the app it hit me again i saw his face the orange cheeto looking big smelly baby with a rich dady and this time i couldnt take it anymore i threw my phone (jk id never do that das ma baby) n i went to the bathroom n started throwing up n when i was done i took a deep breathe n as i got up to flush the toilet i looked at my puck n it looked back at me and it was him again! The old rotten smelly cheeto with a big ego yea n after that i just died.","date":"2020-07-10T01:52:47Z"}},{"id":"6178857513","type":"user-reviews","attributes":{"title":"Don’t get it","isEdited":false,"rating":1,"userName":"❤️😻👍💕😘😍🥰😘🤩","review":"This is very bad","date":"2020-07-10T01:03:14Z"}},{"id":"6178837750","type":"user-reviews","attributes":{"title":"Bad","isEdited":false,"rating":1,"userName":"jonnyapplesauce2005","review":"Didn’t like the app","date":"2020-07-10T00:55:46Z"}},{"id":"6178797743","type":"user-reviews","attributes":{"title":"An app for ignorant bigots. Stinky.","isEdited":false,"rating":1,"userName":"Jerrytownsend66","review":"This app is a reminder of how badly the country erred in electing Donald Trump president. It is filled with lies, racism and misogyny.","date":"2020-07-10T00:40:22Z"}},{"id":"6178788107","type":"user-reviews","attributes":{"title":"ABSOLUTELY HORRIBLE","isEdited":false,"rating":1,"userName":"Nat117766","review":"This app is promoting lies and supporting someone disgusting. I HIGHLY SUGGEST NOT DOWNLOADING. I hated every minute on it 0/10","date":"2020-07-10T00:36:42Z"}}]}