{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23640","data":[{"id":"6175722116","type":"user-reviews","attributes":{"date":"2020-07-09T08:29:19Z","userName":"Melody1278","title":"📵 THIS APP IS NOT GOOD BEWARE","review":"When I first downloaded this app I was so excited to support Donald Trump our amazing beautiful president and future president (Trump 2020!!) but then I realized it hurt my phone and caused it to become very slow. Words had a hard time loading and it was like choppy and the quality was just not good. People should not download this app.","isEdited":false,"rating":1}},{"id":"6175701214","type":"user-reviews","attributes":{"date":"2020-07-09T08:22:11Z","userName":"xXThegr8estgirlXx","title":"WORST APP EVER, DO NOT DOWNLOAD!!!","review":"As soon as I downloaded the app the REAL Donald J Trump showed up to my HOUSE and murdered my whole family!!!! He said he’s deporting the bodies next week and I can’t even see them! They found my address after I downloaded THE APP. Overall very unpleasant experience and WOULD NOT recommend unless you want your families dead bodies to be deported!!","isEdited":false,"rating":1}},{"id":"6175699490","type":"user-reviews","attributes":{"date":"2020-07-09T08:21:37Z","userName":"FandomJunky","title":"Extremely Disappointing","review":"This app, in all of my years as an iPhone user, has been the absolute worst to interact with. I downloaded to see how it would operate and what it offered, and all I can say is that it offered was the promotion of a man who is a racist, homophobic, transphobic, xenophobic, sexist bigot. Deleted! Wiped from my home feed forever!","isEdited":false,"rating":1}},{"id":"6175689924","type":"user-reviews","attributes":{"date":"2020-07-09T08:18:24Z","userName":"AbbigailAngel5272","title":"Worst App Ever","review":"This shouldn’t be on the app store at all. As soon as I opened it up on my phone it started glitching and ever since i am having difficulty opening other apps on my phone. I even deleted the app and restarted my phone but am still having the same problems.","isEdited":false,"rating":1}},{"id":"6175688831","type":"user-reviews","attributes":{"date":"2020-07-09T08:18:03Z","userName":"Pff😂","title":"DO NOT DOWNLOAD 🤮🤢","review":"This app caused many problems for my phone. After I waited 7 days for it to download all my other apps started acting really slow so DO NOT DOWNLOAD!!!!! My phone was running perfect until I downloaded the app. I’m currently in the process of getting a new phone because of the damage this app did🙄😭","isEdited":false,"rating":1}},{"id":"6175688718","type":"user-reviews","attributes":{"date":"2020-07-09T08:18:01Z","userName":"user7253739301","title":"Highly suspicious","review":"The app won’t even let you see what it has to offer unless you give them your phone number! What do they need my number for? I feel like it’s a violation of my rights to collect my phone number before I am allowed to enter your app. I do NOT recommend this app.","isEdited":false,"rating":1}},{"id":"6175635622","type":"user-reviews","attributes":{"date":"2020-07-09T07:59:25Z","userName":"izquierdista123","title":"WORST APP EVER!!!","review":"DO NOT DOWNLOAD THIS APP!!!\n\nHorrible! I downloaded this app to learn more about or 45th Ameriklan president and it took hours to finish downloading. Like the patriot that I am, I wanted to learn how to make America great but this app kept glitching!!!😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡1/10 don’t recommend this to anyone. Don’t download this!!! It will make ur phone glitch and cost you brain cells!","isEdited":false,"rating":1}},{"id":"6175628051","type":"user-reviews","attributes":{"date":"2020-07-09T07:56:39Z","userName":"Butrlakorn","title":"Awful","review":"This app took about 2 hours to download and was just in general was terrible, it should be more simple and it implanted a virus in my phone, erasing all my photos videos and downloaded apps. I would not recommend this app because you will most likely get a virus from it.","isEdited":false,"rating":1}},{"id":"6175621774","type":"user-reviews","attributes":{"date":"2020-07-09T07:54:21Z","userName":"ehehehsj","title":"this app reeked havoc upon my household","review":"first, the app took 43 years to download. once it finally downloaded a terrible noise began playing out of my home sound system. the noise sent all of my cats in to a frenzy. they began foaming at the mouth and attacking us in a feral manner. this was only the beginning of the tragedies. next, as my brother was attempting to fix the sound system, he went into a zombie like state. he and the feral cats began to eat each other. long story short, by the end of this horrible, day long catastrophe i had 3 less cats and a brother in an asylum.","isEdited":false,"rating":1}},{"id":"6175503811","type":"user-reviews","attributes":{"date":"2020-07-09T07:10:20Z","userName":"MuzikEP","title":"Life Changing","review":"I downloaded this app after being persuaded by all my white male counterparts at work. I was hesitant given the facts but caved in due to peer pressure. \n\nWish I would have known what it was and what it would do because as soon as I downloaded it, I grew a beard, a mullet, and a confederate flag appeared in my right hand that I now can’t get rid of. I quit my job and spend my free time looking for people to get arrested or deport. I also somehow hate wearing masks. The sheer thought makes my blood boil. \n\nI was born a girl. \n\nMinus four stars because my breasts were really nice. \n\n#Mâgä2020 #Murica","isEdited":false,"rating":1}}]}