{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=99350","data":[{"id":"6174478860","type":"user-reviews","attributes":{"date":"2020-07-09T01:33:54Z","rating":1,"isEdited":false,"userName":"ADT19","review":"this app made me throw up. i think it gave me covid. i'm going to get tested next week.","title":"gen z"}},{"id":"6174463940","type":"user-reviews","attributes":{"date":"2020-07-09T01:29:30Z","rating":1,"isEdited":false,"userName":"Cd18277","review":"Bad president. No shoe game. Just made over gen z exposing him.\n\n                    ✨🧚✨stop✨🧚✨","title":"Ew stinky"}},{"id":"6174447400","type":"user-reviews","attributes":{"date":"2020-07-09T01:24:28Z","rating":1,"isEdited":false,"userName":"mywrld999","review":"very bad app would never ever recommend to anyone","title":"no bad app"}},{"id":"6174443274","type":"user-reviews","attributes":{"date":"2020-07-09T01:23:12Z","rating":1,"isEdited":false,"userName":"Shalimar Champlaine","review":"This app is racist af!!! It goes against my religion!!!!","title":"Your Mom"}},{"id":"6174430880","type":"user-reviews","attributes":{"date":"2020-07-09T01:19:29Z","rating":1,"isEdited":false,"userName":"ClemmyPoo!","review":"Dont you dare remove tictok. The NEXT worst thing that if you shutdown roblox.","title":"Tic tok. TOCTOK."}},{"id":"6174418068","type":"user-reviews","attributes":{"date":"2020-07-09T01:15:36Z","rating":1,"isEdited":false,"userName":"Alice 💁","review":"take away our app, we take away yours.","title":"i’m distraught"}},{"id":"6174414536","type":"user-reviews","attributes":{"date":"2020-07-09T01:14:31Z","rating":1,"isEdited":false,"userName":"donkäe","review":"Once upon a time in a kingdom far, far away, the king and queen were blessed with a beautiful baby girl. And throughout the land, everyone was happy... until the sun went down and they saw that their daughter was cursed with a frightful enchantment that took hold each and every night. Desperate, they sought the help of a fairy godmother who had them lock the young princess away in a tower, there to await the kiss... of the handsome Prince Charming. [enters gallantly onstage] It was he who would chance the perilous journey through blistering cold and scorching desert traveling for many days and nights, risking life and limb to reach the Dragon's keep. For he was the bravest, and most handsome... in all the land. [looks at the audience] And it was destiny that his kiss would break the dreaded curse. He alone would climb to the highest room of the tallest tower to enter the princess's chambers, cross the room to her sleeping silhouette, pull back the gossamer curtains to find her... [pulls back the curtain to reveal WOLF in the bed. Gasps] WOLF What? CHARMING Princess... Fiona? WOLF No! CHARMING [relieved] Thank heavens. Where is she? WOLF She's on her honeymoon. CHARMING Honeymoon? With whom? 2 Scene 2 THE SWAMP SHREK It's so good to be home! Just you and me and... DONKEY [offstage] One is the loneliest number that you ever do...[enters] Two can be as bad as one... SHREK Donkey? DONKEY Shrek! Fiona! Aren't you two a sight for sore eyes! Give us a hug, Shrek, you old love machine. And look at you, Mrs. Shrek. How 'bout a side of sugar for the steed? SHREK Donkey, what are you doing here? DONKEY Taking care of your love nest for you. SHREK Oh, you mean like... sorting the mail and watering the plants? DONKEY Yeah, and feeding the fish! SHREK I don't have any fish. DONKEY You did. [looks around for the fish] SHREK Look at the time. I guess you'd better be going. DONKEY Don't you want to tell me about your trip? Or how about a game of Parcheesi? FIONA Actually, Donkey? Shouldn't you be getting home to Dragon? DONKEY Oh, yeah, that. I don't know. She's been all moody and stuff lately. I thought I'd move in with you. FIONA You know we're always happy to see you, Donkey. SHREK But Fiona and I are married now. We need a little time, you know, to be together. Just with each other. Alone. DONKEY Say no more. You don't have to worry about a thing. I will always be here to make sure nobody bothers you. SHREK Donkey! 3 DONKEY Yes, roomie? SHREK You're bothering me. DONKEY Oh, OK. All right, cool. I guess... Me and Pinocchio was going to catch a tournament, anyway, so...Maybe I'll see y'all Sunday for a barbecue or something. SHREK He'll be fine. Now, where were we? [giggles] Oh.I think I remember. Donkey! DONKEY I know, I know! Alone! I'm going! I'm going. What do you want me to tell these other guys? ROYAL MESSENGER enters to fanfare. MESSENGER [clears throat] \"Dearest Princess Fiona. You are hereby summoned to the Kingdom of Far, Far Away for a royal ball in celebration of your marriage at which time the King will bestow his royal blessing... upon you and your...uh... Prince Charming. Love, the King and Queen of Far, Far Away. aka Mom and Dad.\" FIONA Mom and Dad? SHREK Prince Charming? DONKEY Royal ball? Can I come? SHREK We're not going. FIONA & DONKEY What? SHREK I mean, don't you think they might be a bit...shocked to see you like this? FIONA Well, they might be a bit surprised. But they're my parents, Shrek. They love me. And don't worry. They'll love you, too. SHREK Yeah, right. Somehow I don't think I'll be welcome at the country club. FIONA Stop it. They're not like that. SHREK How do you explain Sergeant Pompous and the Fancy Pants Club Band? FIONA Oh, come on! You could at least give them a chance. SHREK To do what? Sharpen their pitchforks? 4 FIONA No! They just want to give you their blessing. SHREK Oh, great. Now I need their blessing? FIONA If you want to be a part of this family, yes! SHREK Who says I want to be part of this family? FIONA You did! When you married me! SHREK Well, there's some fine print for you! FIONA [exasperated sigh] So that's it. You won't come? SHREK Trust me. It's a bad idea. We are not going! And that's final! ALL exit.","title":"DONALD TRUMP IS A DISGRACE TO AMERICA."}},{"id":"6174410976","type":"user-reviews","attributes":{"date":"2020-07-09T01:13:24Z","rating":1,"isEdited":false,"userName":"AlejandroCantu","review":"I opened the app and I saw orange man dancing it was so disturbing","title":"Disturb"}},{"id":"6174407154","type":"user-reviews","attributes":{"date":"2020-07-09T01:12:16Z","rating":1,"isEdited":false,"userName":"1234321567876590900909","review":"i wish i could like reviews it would be great!","title":"🧚🏻✨🥰"}},{"id":"6174399160","type":"user-reviews","attributes":{"date":"2020-07-09T01:09:54Z","rating":1,"isEdited":false,"userName":"Vate80","review":"Worst app ever","title":"So junk"}}]}