{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=43330","data":[{"id":"6177165416","type":"user-reviews","attributes":{"review":"I downloaded this app and the first thing I saw was a duck with chickens I thought it was going to be about how to make American great again but no I expierenced bad things on this app sorry not sorry😏","userName":"wadipa","title":"Yuck","date":"2020-07-09T15:30:05Z","isEdited":false,"rating":1}},{"id":"6177149236","type":"user-reviews","attributes":{"review":"Listen, I have to many friends that don’t have any other social media apps and too many videos for it to all get deleted. Please I swear I’m not a cringey tiktok girl. NonononnnoWhatAm I saying idksomeone pls end my existence","userName":"Johniyah Animates","title":"HhhhoooooRRRRIBLE","date":"2020-07-09T15:25:35Z","isEdited":false,"rating":1}},{"id":"6177143933","type":"user-reviews","attributes":{"review":"this app jumped out of my phone and started attacking my BABY brother. as soon as i downloaded it and let me remind you that the killers of breonna taylor are still walking free and are yet to be arrested","userName":"juthy puthy🦗🦟🦗🦟🦗","title":"this is the worst app","date":"2020-07-09T15:24:06Z","isEdited":false,"rating":1}},{"id":"6177141929","type":"user-reviews","attributes":{"review":"If I could hive a zero I would but I can’t do I have to give a one. First of all this app is scamming. Do not trust it. Right after I got it people arrived at my house and robbed us! Please do not download!","userName":"emersonlala","title":"Terrible!","date":"2020-07-09T15:23:32Z","isEdited":false,"rating":1}},{"id":"6177130608","type":"user-reviews","attributes":{"review":"This dumb app killed my dog. I downloaded it so i could see what kind of sabotage gen z could do w bunker boy Donald yet when i opened the app, the stupidity coming from it was too much for my dogs weak little heart. Take it down NOW🥰","userName":"greassssss","title":"KILLED MY DOG","date":"2020-07-09T15:20:26Z","isEdited":false,"rating":1}},{"id":"6177129008","type":"user-reviews","attributes":{"review":"It glitches it is just all out horrible it over heats my phone everytime I use it something is wrong with my phone","userName":"Yaboiiowen","title":"Horrible app","date":"2020-07-09T15:19:58Z","isEdited":false,"rating":1}},{"id":"6177118301","type":"user-reviews","attributes":{"review":"I really tried to use this app but Everytime I opened it it said it was gonna come for me and my exact location and I don’t think I want that happening","userName":"siakbduanja","title":"Wow","date":"2020-07-09T15:17:02Z","isEdited":false,"rating":1}},{"id":"6177102161","type":"user-reviews","attributes":{"review":"This app is so bad it’s always glitching and I’m never able too use it. Also I am not a fan of Donald trump he is a racist and a sexist man who I think does not deserve too have his own app.","userName":"Ya boy hates Donald","title":"Glitching app","date":"2020-07-09T15:12:30Z","isEdited":false,"rating":1}},{"id":"6177101196","type":"user-reviews","attributes":{"review":"There isn’t any important news on here. Just hate speech but it’s not anything surprising since that’s only what he endorses. This app is useless. It’s a waste of time and space in your phone. DO NOT DOWNLOAD!","userName":"anggbrz","title":"Useless","date":"2020-07-09T15:12:14Z","isEdited":false,"rating":1}},{"id":"6177089136","type":"user-reviews","attributes":{"review":"This app is the worst thing to ever exist and should be taken off the App Store. Every thing this man stands for is wrong. Don’t support him it only makes him feel more powerful.","userName":"Face is cool","title":"Terrible","date":"2020-07-09T15:08:56Z","isEdited":false,"rating":1}}]}