{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38750","data":[{"id":"6173258284","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:23:57Z","review":"I actually was very excited to vote for this president once more but he has done far more damage than any president in my lifetime!! He’s elevated the national debt and handled the pandemic so poorly, I’m embarrassed to have thought of this dotard as a great man.","title":"Disappointed","isEdited":false,"userName":"Wonton17"}},{"id":"6173256654","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:23:25Z","review":"THE MOMENT...I opened the app, after 3 weeks of waiting for it to download, I got multiple notifications of viruses and harassment announcements! NEVER AGAIN, will I download something with the name trump on it, I recommend you do the same.","title":"Worst app EVER","isEdited":false,"userName":"mommyfund"}},{"id":"6173248233","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:20:36Z","review":"I downloaded this app to see the good things he did as a president to convince me to vote for him again but I’m surprised I only found the awful things he did so no thank you I will not vote for him again I don’t want a corrupt, racist president.","title":"DO NOT DOWNLOAD","isEdited":false,"userName":"TrumpNudesLeaked"}},{"id":"6173245539","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:19:43Z","review":"This app convinced my wife and I that I should be a homosexual. I am now single and alone searching for the right man, however with the wedding of my neighbor’s goldfish quickly approaching I won’t find a date in time...all due to this app.","title":"WORST APP EVER","isEdited":false,"userName":"JermN'Junk"}},{"id":"6173244176","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:19:17Z","review":"I can’t even believe they’d allow this bad of an app on the App Store. It took forever to download and it would crash every five minutes. If I could give zero stars I would!","title":"Terrible app","isEdited":false,"userName":"dhhdbdbdbdvaqkeujxbanemek"}},{"id":"6173239162","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:17:37Z","review":"Don’t ever download this app I had this random man show up at my door saying that he got my address from the app and it made my phone shut down and I had to get a brand new one horrible!","title":"Never!","isEdited":false,"userName":"Ellarae29"}},{"id":"6173235026","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:16:13Z","review":"Horrible app! The worst app I’ve ever seen in my life. Many great wonderful people told me this app was bad. Of course they were right. Took hours to download. Left an ugly Trump 2020 logo on my screen. It’s just the worst.","title":"Wish I could rate a 0","isEdited":false,"userName":"Tyler 8.1"}},{"id":"6173218449","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:10:45Z","review":"This app took so ling to download. Almost 2 days!!!!! Once I opened the app it wouldn’t do anything but have a white screen and then after about a minute my phone would crash. It’s absolutely terrible DO NOT BUY!!!!!!","title":"DO NOT DOWNLOAD","isEdited":false,"userName":"lil huddy is black"}},{"id":"6173211388","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:08:27Z","review":"Everybody on the app is mean and never likes debate they only say trump 2020 and it gets really annoying also when I press the buttions sometimes it doesn’t even register","title":"It’s a horrible broken app","isEdited":false,"userName":"jshdisheh"}},{"id":"6173210695","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T18:08:12Z","review":"This app made me really sad, that’s all. It had trumps name in it and that made me sad, but also the app broke, it didn’t work, Tik Tok is much better and shouldn’t be banned because Mr. Cheeto Bunker Boy doesn’t like how people can speak their minds and not attend a rally. That’s all.","title":"The app broke","isEdited":false,"userName":"🇹🇷🇻🇮🇺🇬🇹🇬🇹🇱🇹🇹"}}]}