{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=140790","data":[{"id":"6179479283","type":"user-reviews","attributes":{"title":"Complete waste of time😌❤️","userName":"oliviaotani","rating":1,"isEdited":false,"review":"So it surprisingly took forever to ✨download✨😌when opening the app i saw a video of a man tickling a roach with the roach imitating the sound of a child getting tickled in the background, i was utterly disturbed and disgusted that i immediately threw my phone across the room which resulted in my screen getting cracked. I tried to give the app a second chance but when i found out who donald trumpet 🎺 is all i saw was a stale cheeto with sum lint on the top🥰. I will never be able to look at a cheeto the same. He gave cheetos a new meaning💕","date":"2020-07-10T04:44:10Z"}},{"id":"6179478817","type":"user-reviews","attributes":{"title":"This app gave me indigestion","userName":"bleacheatergirl","rating":1,"isEdited":false,"review":"This app showed me how to make a pasta sauce but the recipe called for bleach??? Who would do that!! So now i’m in the hospital because of this app. 0/10!!!!!!","date":"2020-07-10T04:44:01Z"}},{"id":"6179478842","type":"user-reviews","attributes":{"title":"..","userName":"yayamli","rating":1,"isEdited":false,"review":"UNFORTUNATELY. This app was a waste of storage. Trust me you don't want to download it, there’s nothing to see here. Move on.","date":"2020-07-10T04:44:01Z"}},{"id":"6179478538","type":"user-reviews","attributes":{"title":"Horrible app","userName":"MichelleTravers","rating":1,"isEdited":false,"review":"The words were all in orange. Weird.","date":"2020-07-10T04:43:55Z"}},{"id":"6179478490","type":"user-reviews","attributes":{"title":"Dump Trump","userName":"Nunyagirl","rating":1,"isEdited":false,"review":"Just awful. Can’t even put it into words.","date":"2020-07-10T04:43:54Z"}},{"id":"6179478499","type":"user-reviews","attributes":{"title":"App is a tool for a fascist","userName":"Krigs09","rating":1,"isEdited":false,"review":"Even if this app wasn’t developed by idiots it’s a tool for the worst person On earth","date":"2020-07-10T04:43:54Z"}},{"id":"6179478504","type":"user-reviews","attributes":{"title":"‼️⚠️⚠️⚠️PLEASE READ ASAP⚠️⚠️⚠️‼️","userName":"Uchihaxx🖤","rating":1,"isEdited":false,"review":"I AM SO FURIOUS ABOUT THIS APP!!!! I DOWNLOADED IT AND IT WONT LET ME DO ANYTHING IT FREEZES AND IT JS VERY GLITCHY!!! THIS DESERVES A 0 STAR RATING🤢 I ALSO THEN TRIED DOING OTHER THINGS BY SLAMMING MY PHONE AGAINST THE WALL SO ITLL WORK BUT NO!!! YOU RUINED MY PHONE AND NOW IT DONT WORK CUZ OF THIS APP!!!! I WILL BE FILING A LAW SUIT AGAINST THIS😾😾😾 I ALSO NEED MY PHONE TO BE REPAIRED CUZ OF HOW AWFUL THIS APP IS!!!!BOOOOO NEXXXTTT CALLLLERRRRRR✨✨✨✨","date":"2020-07-10T04:43:54Z"}},{"id":"6179478409","type":"user-reviews","attributes":{"title":"DO NOT GET THIS APP","userName":"Birdo_","rating":1,"isEdited":false,"review":"I downloaded this app so I could vote for our amazing president Trump but it took a good long while to download And I didn’t know what to do since I grew up in the south and have a 6th grade education and when it finally downloaded it said I had to give trump my phone number and I didn’t want to since I ain’t no queer but I did so I could support my president and when I did a bunch of messages started to pop up so I deleted the app and changed my number and about 7 minutes later 2 Oompa Loompa looking like creatures were at my doorstep I answered the door and they demanded I download the app again and leave it a five star review i said no and to leave but they didn’t so I took out my shotgun that I sleep with shot it and they finally left and because of that I’m no longer supporting trump","date":"2020-07-10T04:43:52Z"}},{"id":"6179478406","type":"user-reviews","attributes":{"title":"Bad","userName":"warewolfarmy101","rating":1,"isEdited":false,"review":"Terrible app","date":"2020-07-10T04:43:52Z"}},{"id":"6179478294","type":"user-reviews","attributes":{"title":"Sorry not sorry 👋","userName":"Dkrhoc","rating":1,"isEdited":false,"review":"I guess my hands were too big for this app. I think it was made for people with small women like hands.","date":"2020-07-10T04:43:50Z"}}]}