{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=34510","data":[{"id":"6176574695","type":"user-reviews","attributes":{"title":"Worst app ever 🤬😤","review":"When I first got the app I thought that it would do its job but now all it does is stand around and take things away from people 😡10/10 would never download again","date":"2020-07-09T12:52:00Z","userName":"hiitsyourboysadnugget","rating":1,"isEdited":false}},{"id":"6176541167","type":"user-reviews","attributes":{"title":"AWFUL","review":"This app doesn’t even deserve one like, it took hours to download and kept freezing. very disappointed with the awful way the app work but then again it is Donald trumps so what was i expecting","date":"2020-07-09T12:42:53Z","userName":"Cate0208","rating":1,"isEdited":false}},{"id":"6176538764","type":"user-reviews","attributes":{"title":"DONT DOWNLOAD","review":"this app is disgusting. it took 24 weeks to download and when it did it asked for my number which is a complete invasion of privacy not to mention this app promotes racism, homophobia, and is run by a rapist. I would give it 0 stars if I could","date":"2020-07-09T12:42:12Z","userName":"lol idrk","rating":1,"isEdited":false}},{"id":"6176518502","type":"user-reviews","attributes":{"title":"WORST APP EVERRRRRRR","review":"i originally downloaded this app to keep up with the ugly, stupid, racist, homophobic, sexist “president” but it took 103 weeks to download and once it was downloaded i realized it was not what i had wanted. if i could give anyone on earth any one piece of advice it would be to NOT GET THIS APP!!!!!!!!!! IT IS A WASTE OF TIME AND A BIG MISTAKE!!!!!!!!! THE TRUMP APP SUCKSSSSS","date":"2020-07-09T12:36:42Z","userName":"lenneth12345678","rating":1,"isEdited":false}},{"id":"6176507254","type":"user-reviews","attributes":{"title":":)","review":"look, I get that you guys don't know what's going on, but this has got to stop. Mr President believes things that systematically destroy the ideals of our nation, even if those ideals were written under false pretenses. we're better than this. love you all <3","date":"2020-07-09T12:33:36Z","userName":"Killerkraken","rating":1,"isEdited":false}},{"id":"6176461856","type":"user-reviews","attributes":{"title":"oh no baby what is u doin🤦‍♀️","review":"WORST APP EVER😡😡! do not download this app! as soon as it downloaded my body got chills and i literally poopooed on myself.. ITS CURSED! i wish i never got the app. what a waste of time. not to mention, it takes up 100 gs of storage and hacks ur entire phone. what the heck .","date":"2020-07-09T12:21:08Z","userName":"Ashlin loves the blackhawks","rating":1,"isEdited":false}},{"id":"6176458271","type":"user-reviews","attributes":{"title":"a terrible, slow app😡","review":"i got this app to support my misogynistic, homophobic, rasict, and disgusting president.🇺🇸 the app wanted me to put in my phone number, when all i wanted to do was look at his products.🤬i DO NOT recommend this app. his products are ugly anyways. 😔VERY DISAPPOINTED!!!!!!","date":"2020-07-09T12:20:07Z","userName":"hpxohirsjfzl","rating":1,"isEdited":false}},{"id":"6176453327","type":"user-reviews","attributes":{"title":"Worst app ever","review":"I opened the app and saw a stale CHEETO on my screen. This cheeto opened its mouth and said the most ignorant comments i’ve ever heard and continued to degrade people and act like a man child with the inability to properly lead this country. I would greatly appreciate that this stale CHEETO not win the 2020 election.","date":"2020-07-09T12:18:45Z","userName":"lmnjoroge","rating":1,"isEdited":false}},{"id":"6176414554","type":"user-reviews","attributes":{"title":"Stole my data .. then my mom","review":"The app crashes immediately upon opening it. It then wiped my phone clean if my data. A few days after downloading it my mom also went missing. Idk not worth it","date":"2020-07-09T12:08:08Z","userName":"Twilight's biggest fan!!!","rating":1,"isEdited":false}},{"id":"6176387542","type":"user-reviews","attributes":{"title":"My brother was kidnapped","review":"After installing this app, my whole life changed. I started eating my boogers and feet were very mmMmmmm attractive so seccy. I believe this is because I was under the influence of this app. Would not recommend. Bad aesthetic not good for tumblr","date":"2020-07-09T12:00:39Z","userName":"Angeline_sartorious","rating":1,"isEdited":false}}]}