{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26950","data":[{"id":"6174772337","type":"user-reviews","attributes":{"title":"HORRIBLE APP!!!!","userName":"deanie_houdini","review":"I downloaded the app to get all her latest news and I was perfectly fine. Then I went to my gynecologist and it turns out I have chlamydia. THIS APP GAVE ME CHLAMYDIA!!!! What am I gonna do now. My gynecologist told me that this one is incurable too. Take this off the AppStore NOW BEFORE IT GIVES ANY MAN WOMAN OR CHILD CHLAMYDIA TOO!! One star. 0/10. Would not download again.","rating":1,"date":"2020-07-09T02:58:53Z","isEdited":false}},{"id":"6174759875","type":"user-reviews","attributes":{"title":"No no no no no.","userName":"simply patato","review":"I read that when someone opens the app a creepy dragon shows up outside their window. So I tried it by my window and the SAME thing happened it was orange and always made a kissy-ish face. It is scary reminds me of someone I know. The name Is on the tip of my tongue. I think it rhymes with dump or something. Too scary for me. 😰🐲","rating":1,"date":"2020-07-09T02:55:06Z","isEdited":false}},{"id":"6174738271","type":"user-reviews","attributes":{"title":"This app turned me into a racist","userName":"ineedmy100hoursinplease","review":"In just 2 min after I downloaded the app, I turned into a racist, homophobic, transphobic, xenophobic, sexist, close minded white male. I was mortified. I think I need therapy. Thankfully when I deleted the app seconds after it happened I returned to normal. I am truly horrified at how people can live like that. Gross","rating":1,"date":"2020-07-09T02:48:32Z","isEdited":false}},{"id":"6174729211","type":"user-reviews","attributes":{"title":"Horrible app","userName":"setmyhouseonfire","review":"App hopped off the phone went to my kitchen and ate up all my food then gonna come back and try and box up with me. Worst part is it couldn’t even box one hit and the match was over, but he came back and TRIED TO SET MY HOUSE ON FIRE . Overall very disappointed with the app","rating":1,"date":"2020-07-09T02:45:46Z","isEdited":false}},{"id":"6174727380","type":"user-reviews","attributes":{"title":"The worst app","userName":"lucy brunson","review":"This is so glitchy. I got it to get updates about trump but it broke my phone. First it was just the app that was glitchy but then my whole phone. It is the most terrible app ever. It must be deleted or everyone who downloads is at risk of their phone breaking","rating":1,"date":"2020-07-09T02:45:13Z","isEdited":false}},{"id":"6174707918","type":"user-reviews","attributes":{"title":"WORST APP TO EVER EXIST","userName":"Biden bb","review":"This app literally is awful. I left it open on my phone last night and it took all the color out of my room. Guess it needed some way to make it more interesting. I also thought it was for a person but turns out its for a life sized cheeto!!!!! Highly disappointed.","rating":1,"date":"2020-07-09T02:39:19Z","isEdited":false}},{"id":"6174700900","type":"user-reviews","attributes":{"title":"horrible app!","userName":"zuchini22","review":"I would not recommend. This app caused my phone to start smoking through the charging port. It then started cussing at me and sent a bunch of ogres through my phone that attacked me. To top this, my phone is now broken and glitching. Do not use this app! Bunker boy, I am past the last straw😑","rating":1,"date":"2020-07-09T02:37:15Z","isEdited":false}},{"id":"6174685714","type":"user-reviews","attributes":{"title":"It killed my dog","userName":"nansabar","review":"I downloaded this app on accident because who would then all of a sudden my favorite fish began to grow like 50 times the preferred amount and I was like Nooo Edward and sudden he just swallowed my dog and my stepsister cried for like 10 days. So don’t download if you want an Alive dog, normal sized fish, and happy step sister","rating":1,"date":"2020-07-09T02:32:42Z","isEdited":false}},{"id":"6174685598","type":"user-reviews","attributes":{"title":"App freezes","userName":"milanomore","review":"The app seems to be malfunctioning. It doesn't seem to install on a phone where its owner values basic human rights. The message I keep getting is \"error, unable to download malware due to suspicion of racism, homophobia, xenophobia, and white supremacy\". Please send an update in November to correct this issue. God Bless!","rating":1,"date":"2020-07-09T02:32:40Z","isEdited":false}},{"id":"6174683134","type":"user-reviews","attributes":{"title":"Bad app","userName":"RachRoJe","review":"As soon as the app downloaded my phone started shutting down and glitching. It turned my front facing camera on and I couldn’t get it to turn off. Very bad app. The worst app. No one makes an app as bad as this app. Would give it zero stars if I could. Do not recommend.","rating":1,"date":"2020-07-09T02:31:57Z","isEdited":false}}]}