{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=136980","data":[{"id":"6180045940","type":"user-reviews","attributes":{"rating":1,"review":"I just hope this app does and this orange things never gets the chance to become president agian","userName":"gen.Z for the w","date":"2020-07-10T08:09:50Z","title":"Gen.Z for the win","isEdited":false}},{"id":"6180045943","type":"user-reviews","attributes":{"rating":1,"review":"Please delete this app. It crashed my iPhone XS Max and made it over heat to the point where it is unusable.","userName":"Rjsjwjnsbxb","date":"2020-07-10T08:09:50Z","title":"Please delete","isEdited":false}},{"id":"6180045296","type":"user-reviews","attributes":{"rating":1,"review":"I am part of the gen z trying to get this deleted...","userName":"Thebest345","date":"2020-07-10T08:09:37Z","title":"DELETE THIS APP!!","isEdited":false}},{"id":"6180045175","type":"user-reviews","attributes":{"rating":1,"review":"fs in the chat","userName":"Selicity Eastom","date":"2020-07-10T08:09:35Z","title":"Take our app and we’ll take urs hoe💀","isEdited":false}},{"id":"6180044732","type":"user-reviews","attributes":{"rating":1,"review":"When in the Course of human events, it becomes necessary for one people to dissolve the political bands which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the Laws of Nature and of Nature's God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation.  We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.--That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness. Prudence, indeed, will dictate that Governments long established should not be changed for light and transient causes; and accordingly all experience hath shewn, that mankind are more disposed to suffer, while evils are sufferable, than to right themselves by abolishing the forms to which they are accustomed.","userName":"bew2002","date":"2020-07-10T08:09:26Z","title":"Worst app ever","isEdited":false}},{"id":"6180044495","type":"user-reviews","attributes":{"rating":1,"review":"trump is a RACIST man!! and he's sexist! let me give you an example: My best friend, who is mexican, and born here is a citizen. her parents and grandparents were born here in the US. THEY ARE ALL AMERICAN CITIZENS. Trump decided to deport her dad to mexico just because he's mexican?!?? come on! she was having a perfect life until he became president! he also tried banning all muslims. y'all are saying \"muslims are terrorists\" when WE ARE THE ONES WHO GET KILLED AND BOMBED THE MOST! go look at bombed palestine! or the wars in iraq and the war in yemen! they're all dying! what about syria huh?? while you american people are living perfectly fine complaining that you domt have enough money to get rolex watches or designer clothes? unbelievable. i'm 13 years old but yet only i seem to be living in the U.S. and knowing the things that happen elsewhere. either way, trump is racist.","userName":"Loyal Kiwi","date":"2020-07-10T08:09:21Z","title":"no way!! never!!","isEdited":false}},{"id":"6180044439","type":"user-reviews","attributes":{"rating":1,"review":"Absolute trash.","userName":"Chicken909203","date":"2020-07-10T08:09:20Z","title":"Delete this app.","isEdited":false}},{"id":"6180043661","type":"user-reviews","attributes":{"rating":1,"review":"This app makes me want to just throw up 🤮 can’t do one thing without hearing something horrific about black peoples. No justice no peace!","userName":"Blackandamazing","date":"2020-07-10T08:09:03Z","title":"BLM👊🏾","isEdited":false}},{"id":"6180043657","type":"user-reviews","attributes":{"rating":1,"review":"what in the critter blaster is this app? i opened this app and i saw just Donald’s face now i don’t appreciate my president trying to seduce me.","userName":"ThatpotatoKid80","date":"2020-07-10T08:09:03Z","title":"What happened???","isEdited":false}},{"id":"6180043533","type":"user-reviews","attributes":{"rating":1,"review":"You’d think for the amount of money this atrocious man makes he would be able to hire someone to make a good app but of course that’s not the case. 0/5 stars","userName":"Stay at home Bear","date":"2020-07-10T08:09:00Z","title":"Terrible interface and design","isEdited":false}}]}