{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25970","data":[{"id":"6174804768","type":"user-reviews","attributes":{"date":"2020-07-09T03:08:45Z","title":"Mr. Orange u made a bad app","rating":1,"userName":"c00k1113","isEdited":false,"review":"He’s trying to take tik tok down well it would be fair if his got token down to right. All the ppl that like him would be sad if his  got token down right and all the ppl that like tik tok and it gets taken down we would all be sad so if he wants my favorite app to get taken down then his should to ."}},{"id":"6174785633","type":"user-reviews","attributes":{"date":"2020-07-09T03:02:59Z","title":"Will NOT download again","rating":1,"userName":"No__|","isEdited":false,"review":"This app downloaded Malware onto my phone. I was just trying to see what Trump’s platform was about, but instead I just saw pictures of a dusty, racist, islamphobic, homophobic, misogynistic cheeto. Would NOT recommend this app if my life depended on it. I would give 0 stars if Apple allowed that. 0/5"}},{"id":"6174778455","type":"user-reviews","attributes":{"date":"2020-07-09T03:00:47Z","title":"Worst app ever","rating":1,"userName":"cucumbermaniac","isEdited":false,"review":"I opened this app and all the lights in my house shut off immediately! My ancestors descended from the heavens and came to my bedside to look at me with sorrowful eyes. I can’t even begin to explain how even just having this app near my mother made her cry uncontrollably! And! It killed my dog :( this app is horrible."}},{"id":"6174777536","type":"user-reviews","attributes":{"date":"2020-07-09T03:00:30Z","title":"HORRIBLE DONT RECOMMEND","rating":1,"userName":"daddy.cindy","isEdited":false,"review":"It’s truly horrifying the first image I see is of a raggedy, old, orange colored thing playing dress up as the POTUS. I don’t recommend this app, it has made me and many other lose brain cells at the lack of common sense in the beliefs endorsed through the app. It  Should be banned off the internet and MAKE THE INTERNET GREAT AGAIN without trump"}},{"id":"6174773647","type":"user-reviews","attributes":{"date":"2020-07-09T02:59:18Z","title":"TERRIBLE app","rating":1,"userName":"ABCDLMFAO","isEdited":false,"review":"This app is the WORST app I've ever seen. I installed it thinking it would be a normal information app, but as soon as i opened it, it crashed and every time i try to use it, it goes to a black screen. I don't recommend getting this app. It should be removed from app stores permanently!"}},{"id":"6174759410","type":"user-reviews","attributes":{"date":"2020-07-09T02:54:56Z","title":"APP IS TRASH!","rating":1,"userName":"S⃣a⃣x⃣","isEdited":false,"review":"I thought this app would be great ! NOPE !!! This app is the worst app I’ve ever used to try to get information on the news and TRUMP. THIS IS TRASH APP! Steals all of your information, I had to cancel all my cards and now I have to deal with my  social security information being stolen!!!!! All this app needs is to be deleted ! MEXICANS FOR 2020 🇲🇽"}},{"id":"6174759392","type":"user-reviews","attributes":{"date":"2020-07-09T02:54:56Z","title":"Slowest app EVER!!!","rating":1,"userName":"hcyomk","isEdited":false,"review":"The app took 15 seconds to connect to my WiFi and after I checked in for my tickets, I’d refresh the info and found that it never held my submission and when I went to the Oklahoma rally, I was tuned away because my ticket didn’t check out :( very disappointed"}},{"id":"6174759165","type":"user-reviews","attributes":{"date":"2020-07-09T02:54:52Z","title":"Absolutely horrible!","rating":1,"userName":"km_776","isEdited":false,"review":"This app ran SUPER slow, and I noticed it also made my phone run super slow as well. The app is hard to navigate and overall not worth anybody’s time. They also spammed my texts with updates, and I would get around 20 messages a day! Worst app"}},{"id":"6174758049","type":"user-reviews","attributes":{"date":"2020-07-09T02:54:32Z","title":"Terrible app!!","rating":1,"userName":"ajhill013","isEdited":false,"review":"Within MINUTES of me downloading this app all of the data was deleted from my phone and I had a string of pop-up ads saying my address and personal information was being sent to several unknown numbers! Thanks Mr. “president” for making me feel unsafe!!"}},{"id":"6174752553","type":"user-reviews","attributes":{"date":"2020-07-09T02:52:53Z","title":"absolutely HORRIBLE","rating":1,"userName":"katniss everdèen","isEdited":false,"review":"aw the wittle bunker baby mad ): wittle bunker baby gonna take down app awww ):  you should take down THIS app... it made my brand new phone crash and NOT TO MENTION,, gave me the WORST nightmares i’ve ever had. when i wake during my sleep paralysis all i see is DJT and that is scarier than every sleep paralysis demon i’ve seen. 0/10"}}]}