{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=143310","data":[{"id":"6179225655","type":"user-reviews","attributes":{"review":"Can’t believe iTunes would allow trash apps like this on their platform. Maybe someone should start a movement to ban bigot companies.","userName":"Shaliserr","date":"2020-07-10T03:18:15Z","isEdited":false,"title":"TOTAL TRASH","rating":1}},{"id":"6179225510","type":"user-reviews","attributes":{"review":"Trash President, Trash App: Enough Said","userName":"MikulLan","date":"2020-07-10T03:18:12Z","isEdited":false,"title":"Trash App","rating":1}},{"id":"6179225470","type":"user-reviews","attributes":{"review":"I downloaded it and and the second I opened it all my information got hacked and all my emails would delete I do not recommend this app at all ik some of those trump supporters would like to download this but trust me u don’t This app gets all ur information hacked","userName":"jasmin pinto","date":"2020-07-10T03:18:12Z","isEdited":false,"title":"It’s a horrible app🙄🙄","rating":1}},{"id":"6179225268","type":"user-reviews","attributes":{"review":"As soon as I downloaded this app I got 20 calls from my baby daddy’s new girl talking about “why you texting my man” blah blah blah. Turns out this app sent all my information to her. I can’t believe that something like this could come from this app. Do not download unless you want all your private information shared and stored for future blackmail.","userName":"maddiebwazzz","date":"2020-07-10T03:18:08Z","isEdited":false,"title":"DO NOT DOWNLOAD","rating":1}},{"id":"6179225409","type":"user-reviews","attributes":{"review":"POV: your here from tik tok\n\nAlso trump 2020","userName":"NUKEGUN!!!!","date":"2020-07-10T03:18:10Z","isEdited":false,"title":"Hi","rating":5}},{"id":"6179225186","type":"user-reviews","attributes":{"review":"Out of all the apps, this is my least favorite. I downloaded this app in hopes of showing it to my two little children Karen and Betty every night before bedtime, but the app opened up with Trump and an American Flag in the background and I immediately had to close the app. The color scheme was not original at all and the visuals were horrendous. It was a very disappointing moment. I am very upset that I didn’t see Obama when I opened this app because at least he deserves to actually BE on an app. Instead we got this donkey looking, human-trash-talking, temper tantrum-making, Oompa Loompa of a man. \n\nI hope this gets deleted from the App Store Right away. \n\n-Notmi Murika","userName":"Notmi Murika","date":"2020-07-10T03:18:06Z","isEdited":false,"title":"This App is TERRIBLE. -69/10","rating":1}},{"id":"6179224961","type":"user-reviews","attributes":{"review":"Ew","userName":"alyssanicole123","date":"2020-07-10T03:18:01Z","isEdited":false,"title":"Ew","rating":1}},{"id":"6179224631","type":"user-reviews","attributes":{"review":"So I downloaded this app on 4/20 at 4:20 and I was riding my llama on the highway. All of a sudden, my phone starts going ballistic. I wouldn’t stop receiving notifications from this stupid app, and then my screen goes dark. I thought my phone had died, but then there’s a bright flash of orange. The flash was so bright, I was temporarily blinded. I fell off my llama and was hit by a bus. Luckily I survived to tell my story. Though I lost my toes and am now incapable of taking feet pictures for daddy trump, I’m just happy to be alive. \n\nTwo weeks later mr. turnip comes and visits me in the hospital. He says that he can pay the doctors to reattach my toes. I told him my toes were gone and it was too late. He said he’d pay for a toe transplant, I asked from who, and he right foot was from him and left would be from pence. I gladly accepted this offer, but he didn’t follow through. I did give him my number, so hopefully Barron will get it, and we will run away together. I’ll teach him how to make friends and everything once I get discharged. Now, I’m just waiting for my scars to fully heal. Thank god this is covered through Obama care, oh wait...\n\nMoral of the story, don’t download this app. It lags so bad, and don’t text and ride your llama while on the highway. Thank you for your time.","userName":"DiscoHawk","date":"2020-07-10T03:17:54Z","isEdited":false,"title":"✨🌈🧚🏼‍♀️I’ve in hospital for two months🧚🏼‍♀️🌈✨","rating":1}},{"id":"6179224356","type":"user-reviews","attributes":{"review":"DUMP TRUMP NASTY THIS WAS THE WORST APP EVER OMG NASTY GROSS DISGUSTING GET OUT OF HERE!!!!","userName":"kribium24","date":"2020-07-10T03:17:49Z","isEdited":false,"title":"Yucky","rating":1}},{"id":"6179224298","type":"user-reviews","attributes":{"review":"FELLOW TRUMP SUPPORTERS—THIS APP CANNOT BE DOWNLOADED IT IS A TRAP SET UP BY THE LIBTARDS. I downloaded this app and it downloaded a bunch of ADULT CONTENT into my PHONE with VIRUSES!!!!!!!!!!!!!!!!!!!!! \n\nTHIS APP IS A TRAP SET UP BY THE LYING MEDIA AND NASTY WOMEN","userName":"CDHero","date":"2020-07-10T03:17:47Z","isEdited":false,"title":"DO NOT DOWNLOAD","rating":1}}]}