{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42700","data":[{"id":"6175172287","type":"user-reviews","attributes":{"title":"Absolute GARBAGE 🤢","isEdited":false,"date":"2020-07-09T05:03:24Z","rating":1,"review":"So I downloaded it and then my phone started glitching so I was like maybe I should put it in rice but NOTHING HELPED so I was like maybe I should delete some apps and the first app I deleted was this one AND NOW MY PHONE WORKS LIKE NEW AGAIN 🥰","userName":"needs small improvment"}},{"id":"6175156201","type":"user-reviews","attributes":{"title":"Bad Bad Bad","isEdited":false,"date":"2020-07-09T04:57:49Z","rating":1,"review":"I am just so very disappointed in this app. It was not helpful at all and absolutely horrified me. I know there must be better out there somewhere, but this sure is not it. Do better.","userName":"Jazmsminethehunter"}},{"id":"6175154134","type":"user-reviews","attributes":{"title":"TERRIBLE","isEdited":false,"date":"2020-07-09T04:57:09Z","rating":1,"review":"This app has a rat delivered to your door step with a MAGA hat. When opening the box the rat jumped out and dragged me by my hair to DC where it proceeded to curb stomp me on capitol hill... do NOT recommend to anyone looking to download this app! My lawyers will be hearing about this incident btw.","userName":"Aunt gramma"}},{"id":"6175152987","type":"user-reviews","attributes":{"title":"Fresh much?","isEdited":false,"date":"2020-07-09T04:56:44Z","rating":1,"review":"The app won’t let me in without giving my actual phone number. I don’t give ANYONE my phone number and I’m sure not giving it to an accused rapist and his staff of sycophants.","userName":"ljjacobsen"}},{"id":"6175140755","type":"user-reviews","attributes":{"title":"Horrible, just awful","isEdited":false,"date":"2020-07-09T04:52:37Z","rating":1,"review":"I hated everything about this app. Once I downloaded it I started to get notifications about a racist Cheeto. Would not recommend to anyone!!!","userName":"ffyygvb"}},{"id":"6175120127","type":"user-reviews","attributes":{"title":"HORRIBLE","isEdited":false,"date":"2020-07-09T04:45:46Z","rating":1,"review":"This app LAGSSSS ALLL THE TIME it doesn’t even have actual directions on how to use. This is completely AWFUL I hate this app and other things but IG I’ll leave that out the question. DO NOT download this app it’s completely USELESS","userName":"keodormskg"}},{"id":"6175119329","type":"user-reviews","attributes":{"title":"HORRIBLE APP","isEdited":false,"date":"2020-07-09T04:45:31Z","rating":1,"review":"First it made my daughters hair turn a very ugly green, and as soon as I opened the app I automatically got glitches and a whole pig came out of my screen and stole my microwave!! Which cost me 15,000 dollars to replace it!! I’m so mad! I DO NOT RECOMMEND THIS APP!!","userName":"Logan can rate"}},{"id":"6175117924","type":"user-reviews","attributes":{"title":"terrible","isEdited":false,"date":"2020-07-09T04:45:04Z","rating":1,"review":"bro i was trying to support orange mans campaign, but once i opened up the app it was glitches and it took me to a website referred to bratty sis? it was enjoyable but the app is still terrible. wouldn’t recommend \n\n#KANYE2020","userName":"henry 😳😳😳"}},{"id":"6175112119","type":"user-reviews","attributes":{"title":"Donald Trump 2020!","isEdited":false,"date":"2020-07-09T04:43:08Z","rating":1,"review":"As you can see that’s an example of every trump supporter!\nTHIS MAN IS RACIST A RAPIST did I already say racist? Keep giving this app 1 star so we can get it off the App Store! All lives can’t matter until black lives matter!","userName":"LUNARSLAYS"}},{"id":"6175111758","type":"user-reviews","attributes":{"title":"Misogyny glitch","isEdited":false,"date":"2020-07-09T04:43:01Z","rating":1,"review":"When I opened the app, it knew I was a woman and kicked me off. My brother opened the app on my phone and let him use it. Unacceptable. All I wanted was to reserve a seat at the rally so I could leave it empty","userName":"YoshiHeck"}}]}