{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37350","data":[{"id":"6173599600","type":"user-reviews","attributes":{"review":"Took nearly AN HOUR TO DOWNLOAD. Crashed every time I tried to log in! Had weird graphics glitches where only half the screen would show! Ridiculous!! A BELOW low quality app! If I could give a lower review I would.","rating":1,"userName":"H-DUB","title":"INFURIATING!!!","date":"2020-07-08T20:20:11Z","isEdited":false}},{"id":"6173598514","type":"user-reviews","attributes":{"review":"This app has had me insecure! Why can’t I be that orange? Why can’t I be that built? Why can’t I be him! This app made me feel like I don’t belong on This planet. It’s makes me think of hot dog water that you put in a waffle mix then add bits of sunflower seeds and sprinkle a lil of dust on it .","rating":1,"userName":"sam can poop too","title":"Dreadful","date":"2020-07-08T20:19:47Z","isEdited":false}},{"id":"6173589135","type":"user-reviews","attributes":{"review":"i got this app to convince all my friends to support trump but when i downloaded it porn showed up! it was disgusting and when i went on the app my 8 year old son was next to me! i cannot believe this. i am SO ashamed","rating":1,"userName":"g wezy","title":"Orange","date":"2020-07-08T20:16:32Z","isEdited":false}},{"id":"6173585536","type":"user-reviews","attributes":{"review":"I can’t even tell you the amount of emotional, physical, and mental trauma I went through while downloading and viewing this app. I do not think I will EVER fully recover and I IMPLORE you to never download this app. disgusting, I’m truly offended and hurt,, are we great yet????","rating":1,"userName":"hellllll nooooo","title":"gross.","date":"2020-07-08T20:15:17Z","isEdited":false}},{"id":"6173576827","type":"user-reviews","attributes":{"review":"I cant open the app and it has news from months ago still giving me notifications hopefully people do better votebernie","rating":1,"userName":"k🤙🏻🙃","title":"Broken and glitched","date":"2020-07-08T20:12:16Z","isEdited":false}},{"id":"6173574435","type":"user-reviews","attributes":{"review":"Let’s start with how this app is so bad it tells me if I don’t vote for trump they will kill me and I don’t feel like this should be a app anymore and TikTok should stay up he just want us to die and the app said that I will get hacked","rating":1,"userName":"bigboi_mattia","title":"I hate it","date":"2020-07-08T20:11:26Z","isEdited":false}},{"id":"6173559517","type":"user-reviews","attributes":{"review":"I was doing my daily dose of being the best trumper thumper by installing this app. When doing so I started to feel short of breath. I started hearing things and collapsed to the ground. I just decided that this app was a sign from god not to venture farther.","rating":1,"userName":"Cademan52","title":"a no from me","date":"2020-07-08T20:06:21Z","isEdited":false}},{"id":"6173559058","type":"user-reviews","attributes":{"review":"The app caused my phone to glitch and freeze completely up a couple of times. Finally had to delete it since it wouldn’t work.","rating":1,"userName":"cockadooodle","title":"Glitches","date":"2020-07-08T20:06:11Z","isEdited":false}},{"id":"6173555934","type":"user-reviews","attributes":{"review":"The app has so many adds and it takes up so much battery and you have to pay for things that are unnecessary and the president said that this app is the greatest but who believes in a Cheeto.","rating":1,"userName":"generation Z🦅","title":"Adds","date":"2020-07-08T20:05:09Z","isEdited":false}},{"id":"6173555757","type":"user-reviews","attributes":{"review":"This app makes absolutely no sense it is useless and honestly I do not recommend it, I give it one star because I can’t go power than that this app should be removed from the Apple store","rating":1,"userName":"GZFDT","title":"The worst app ever","date":"2020-07-08T20:05:05Z","isEdited":false}}]}