{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=20270","data":[{"id":"6173128278","type":"user-reviews","attributes":{"review":"When I downloaded this app, it was super glitchy and and wouldn’t work, I would have to click out and open up later. On time I had my hamster with me when I opened up the app and an image of a scary orange thing popped up and scared my hamster so much he died. This app is awful and even killed my hamster. DO NOT DOWNLOAD!! Also R.I.P sir. Hamsterton the hamster. 😞","title":"Glitchy and killed my hamster","userName":"im glad I played this","date":"2020-07-08T17:41:47Z","isEdited":false,"rating":1}},{"id":"6173110610","type":"user-reviews","attributes":{"review":"this app has to be one of the worst apps that i’ve ever been on and or used. a lot of people recommended me to get it, so i wanted to check it out. when i tried to download it, it took 3 HOURS TO DOWNLOAD.  when it finally downloaded it took about another hour to load. NEVER again will i he using this app.","title":"it’s a hard no from me🥰","userName":"boujieman","date":"2020-07-08T17:36:10Z","isEdited":false,"rating":1}},{"id":"6173069791","type":"user-reviews","attributes":{"review":"In all honesty, he is the worst president I’ve seen by far. Gen Z and every person who sees his stupidity would agree. I do not see how he even got his position in the office. Him and his orange looking forehead shouldn’t even have a say in what is best for this country. He is one of the worst person I’ve ever seen and I will never call him my “president”.","title":"I’ll never call him my “president”","userName":"dinos are ded","date":"2020-07-08T17:23:01Z","isEdited":false,"rating":1}},{"id":"6173067898","type":"user-reviews","attributes":{"review":"I don’t know why but there’s always a picture of an orange when i open the app? It has WAY too many ads. It’s not easy to navigate through, it’s way too confusing. Not to mention that ever since I downloaded it, my phone just has been slower. One out of five, because I do NOT recommend it.","title":"It glitches bad","userName":"UDontKnowMeHaHa","date":"2020-07-08T17:22:25Z","isEdited":false,"rating":1}},{"id":"6173065233","type":"user-reviews","attributes":{"review":"It took around 2 hours to download. When I finally was able to get into the app if you tapped on anything it wouldn’t work till a few minutes later. Than knowing the fact the whole time while waiting I had to look at a sack of oranges standing there.","title":"This app does not work whatsoever","userName":"Madalynn-R11","date":"2020-07-08T17:21:31Z","isEdited":false,"rating":1}},{"id":"6173036587","type":"user-reviews","attributes":{"review":"i started downloading this about a month ago and it just now installed. i always have stellar connection on my mobile device so i do not see what the big problem was. i am now deleting this app and telling all my friends and family to NOT download nor vote for trump. have an amazing day children- Karen","title":"this app is terrible!","userName":"dudufhfhd","date":"2020-07-08T17:12:29Z","isEdited":false,"rating":1}},{"id":"6173025812","type":"user-reviews","attributes":{"review":"The app was absolutely bad quake and didn’t convince me any more that he was a good president and you also wanted to take my tiktok down I see. So this is me pitching in to take you app down. You should of learned the first time that gen z does NOT go down without a fight. I mean we could scare you into going into the bunker again but what’s the point. DO NOT TAKE DOWN MY TIKTOK I JUST HIT 1k FOLLOWERS TRUMP. COME ON MY MAN","title":"Terrible","userName":"cgkfjl","date":"2020-07-08T17:09:10Z","isEdited":false,"rating":1}},{"id":"6173024066","type":"user-reviews","attributes":{"review":"This app is horrible I downloaded to try and gain trust from the president that was not the case this app is freaking wack I needs to be taken off the this app it needs to be deleted foreverrrrrrer hopefully this app will get deleted by apple maybe they will réalisé that trump is a horrible person . Ok that it please delete this app off this downloading thing pretty please ok thank you","title":"DiSgUStInG","userName":"trinityyyyyyyyyyyy.","date":"2020-07-08T17:08:38Z","isEdited":false,"rating":1}},{"id":"6172989438","type":"user-reviews","attributes":{"review":"This app is disgusting, right as I downloaded it my phone glitches so bad that I had to reset everything on my phone. Not to mention the random face that was orange and had Raman noodle hair turned into my background and killed my pet rat! Now I am here to leave you with the worst review ever as to hope this app gets removed.","title":"✨🧚‍♂️Had to reset everything🧚‍♂️✨","userName":"dollyparton3","date":"2020-07-08T16:58:03Z","isEdited":false,"rating":1}},{"id":"6172987493","type":"user-reviews","attributes":{"review":"This app was totally not helpful!!! It kept glitching and there was SO many problems. As soon as I  opened up the application it would right away go black and take me to my home screen. If not that there was times where it would just load and load. I heard I’m not the only one and heard others similar experiences.","title":"No good","userName":"mary17293992929000","date":"2020-07-08T16:57:27Z","isEdited":false,"rating":1}}]}