{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=97760","data":[{"id":"6176235321","type":"user-reviews","attributes":{"isEdited":false,"title":"Pedo house","userName":"vjycgfxg","date":"2020-07-09T11:16:13Z","review":"You know why","rating":1}},{"id":"6176186525","type":"user-reviews","attributes":{"isEdited":false,"title":"Worst app EVER","userName":"Lulu💖✨💖✨","date":"2020-07-09T11:01:18Z","review":"horrible.\njust horrible.:)","rating":1}},{"id":"6176144712","type":"user-reviews","attributes":{"isEdited":false,"title":"DONT DOWNLOAD THIS APP","userName":"sjsnhsvjshehjzbshbxn","date":"2020-07-09T10:48:30Z","review":"It took so long to download this app and after a whi","rating":1}},{"id":"6176143470","type":"user-reviews","attributes":{"isEdited":false,"title":"TERRIBLE","userName":"mayy.nyc","date":"2020-07-09T10:48:06Z","review":"worst app hate it super racist and just all aroung terrible 🥰🧚✨💕","rating":1}},{"id":"6176056838","type":"user-reviews","attributes":{"isEdited":false,"title":"THIS APP GAVE ME VIRUSES","userName":"🤨rem","date":"2020-07-09T10:20:34Z","review":"WTFF IVE NEVER HAD AN APP GIVE ME SO MUCH VIRUSES, EVEN AFTER IT TOOK HOURS TO DOWNLOAD🤬🤬 this is completely uncalled for #cancelthisapp #nolongeraconservative","rating":1}},{"id":"6175998989","type":"user-reviews","attributes":{"isEdited":false,"title":"rip mittens","userName":"barnicle boy ™️","date":"2020-07-09T10:02:03Z","review":"as soon as this app downloaded it hacked my phone and killed my cat.","rating":1}},{"id":"6175952857","type":"user-reviews","attributes":{"isEdited":false,"title":"History Has Its Eyes On You ⭐️","userName":"#Don't update","date":"2020-07-09T09:46:56Z","review":"I am sad to say, that I am not Satisfied with this application. In originally reviewing this application, I was unconscious of its errors.\n\nIn reviewing the basic information for this application, I thought it sensible of me to download it, so I could better understand the subject of politics. Though, after actually downloading it, and actually going through it, I became aware of what I, originally, had missed. What’d I Miss? I missed to acknowledge just how many errors the application possessed. I neglected to, throughly, read through the reviews, and realize just how many people were having the same issues that I was.\n\nThe application kept glitching, and I have to say, the longer I was on it, it became increasingly difficult to navigate. There was a point where it was glitching Non-Stop for several minutes. My mobile phone itself has, in fact, started glitching and acting up—it was not doing this prior to downloading this application. I, sincerely, hope this does not last.\n\nI was willing to Wait For It to become  compliant, but, alas, it did no such thing. So, I made the decision to discard the application from my mobile phone, all-together. However, while downloading it was easy, deleting it was harder. It seemed to do nothing as I repeatedly tapped the “Delete App” button. I was Helpless. I finally had to get a friend to help me; they finally were able to discard the application from my mobile phone.\n\nAs I said before, after finally reviewing the reviews for this application, I realized I was not the only one with these problems. So, please tell the developers to rise up, and look closely at the application’s issues, so the faults of its incompetent abilities will, hopefully soon be, consigned to oblivion, before anyone else downloads this application, and goes through the same problems.","rating":1}},{"id":"6175949874","type":"user-reviews","attributes":{"isEdited":false,"title":"Worst app EVER","userName":"barb769","date":"2020-07-09T09:45:56Z","review":"I downloaded this app and A DINOSAUR CAME AND ATE MY DOG?!!! 😰🤯😔 TRUMP HATES DOGS AND WILL NOT PROTECT YOUR DOGS AT ALL. HE WILL SEND DINOS OUT TO GET RID OF DOGS. Also it took like forever to download :/","rating":1}},{"id":"6175903066","type":"user-reviews","attributes":{"isEdited":false,"title":"0/10 DO NOT RECOMMEND","userName":"Camougie","date":"2020-07-09T09:30:25Z","review":"two thumbs down","rating":1}},{"id":"6175868776","type":"user-reviews","attributes":{"isEdited":false,"title":"Don’t get it","userName":"loye579263","date":"2020-07-09T09:18:54Z","review":"I got hacked","rating":1}}]}