{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35180","data":[{"id":"6175107159","type":"user-reviews","attributes":{"rating":1,"userName":"malloryme7","review":"This app is complete TRASH. I just got a new phone and it had been working like a dream the past couple of days but right after I downloaded this app it was glitching. This is a complete waste of time so don’t use.","isEdited":false,"title":"TRASH","date":"2020-07-09T04:41:31Z"}},{"id":"6175096681","type":"user-reviews","attributes":{"rating":1,"userName":"letisia.","review":"This app is horrible I’m a true trump fan but this app just isn’t it. I tried to give it chances but my faith in lord and Christianity said no because The Lord told me to not give it no more chances. I love America and dear president but this wasn’t the move. Sorry :( -Karen","isEdited":false,"title":"MUST BE TAKEN DOWN","date":"2020-07-09T04:38:07Z"}},{"id":"6175088872","type":"user-reviews","attributes":{"rating":1,"userName":"JocT.","review":"I hate this app, if you wanna get rid of tiktok you better get through the tiktok people! Make America “great” again more like make America “worse” again!! if you wanna delete tiktok were gonna delete your app! #goodbyetrump2020","isEdited":false,"title":"Horrific App!!","date":"2020-07-09T04:35:36Z"}},{"id":"6175065609","type":"user-reviews","attributes":{"rating":1,"userName":"paolaceja","review":"This interface is actually horrendous. Navigation on this app is so antiquated I feel like I’m using an iPhone 4 again. I didn’t even pay for this app and I want my money back. If I could give it zero stars I would","isEdited":false,"title":"WORST APP EVER","date":"2020-07-09T04:28:16Z"}},{"id":"6175044272","type":"user-reviews","attributes":{"rating":1,"userName":"hshwiodvwuah","review":"I was looking on this app for a diy way to get a natural wood stain. Someone said to put nails and vinegar together with some salt, and to put it in the microwave for 3:00 minutes. I did so, AND IT BLEW UP. Needless to say, my kitchen and living room have nails and glass embedded in the walls","isEdited":false,"title":"They said to microwave nails and vinegar to get a wood stain","date":"2020-07-09T04:21:41Z"}},{"id":"6175033592","type":"user-reviews","attributes":{"rating":1,"userName":"kendisndowmxmd","review":"You stink your such a dead beat you think you can delete tiktok ohhh no you don’t we delete your app tiktok is what makes ppl happy and smile and you are going to ruin it for all ppl so we are doing it to you","isEdited":false,"title":"Delete this app!!!!","date":"2020-07-09T04:18:20Z"}},{"id":"6175016208","type":"user-reviews","attributes":{"rating":1,"userName":"stefxrosexNY","review":"this app glitched the first time i used it. as I went to use it a second time, my phone completely shut off. after turning it back on, i immediately deleted the app and my phone worked as it should. DO NOT DOWNLOAD EVER","isEdited":false,"title":"GLITCHY HORRIBLE MESS","date":"2020-07-09T04:12:48Z"}},{"id":"6175009234","type":"user-reviews","attributes":{"rating":1,"userName":"Ima whip and dab","review":"Don’t bother with this app bro. It will literally take your family in a car wash and return them squeaky clean but the won’t stop screaming. Haven’t been able to fix them since","isEdited":false,"title":"Fake news bruv","date":"2020-07-09T04:10:35Z"}},{"id":"6174981535","type":"user-reviews","attributes":{"rating":1,"userName":"KaylaJ202","review":"This app has so many glitches and things that need fixing. Not only that but it also made my entire phone start glitching afterward. Definitely don't recommend downloading.","isEdited":false,"title":"Worst App","date":"2020-07-09T04:01:45Z"}},{"id":"6174980300","type":"user-reviews","attributes":{"rating":1,"userName":"hawkinini","review":"App glitches so bad. I was only able to use it for a bit and after the app kept crashing. I would open it and it would close on it own immediately taking me to my home page. DO NOT DOWNLOAD.","isEdited":false,"title":"WORST APP","date":"2020-07-09T04:01:23Z"}}]}