{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=41320","data":[{"id":"6174915202","type":"user-reviews","attributes":{"date":"2020-07-09T03:41:09Z","isEdited":false,"review":"When I opened this app it gave me a disturbing message.. it said welcome to trumps official app 2020.. then it proceeded to say grabbing people by the p*ssy is okay and touching minors is okay.. this kind of text is very disturbing and very offensive and needs to be taken down!!!","userName":"girltrap555","title":"Offensive wording","rating":1}},{"id":"6174914640","type":"user-reviews","attributes":{"date":"2020-07-09T03:40:59Z","isEdited":false,"review":"horrible app. did not enjoy the experience that happened after downloading. my entire phone just stopped working!! and my house. my electricity went out, and my cats went wild. NEVER DOWNLOAD THIS APP","userName":"NaranciaRatesApps","title":"bad:(","rating":1}},{"id":"6174907177","type":"user-reviews","attributes":{"date":"2020-07-09T03:38:44Z","isEdited":false,"review":"i am so close to 400 followers🤬i literally just want my 15 minutes of fame but i just haven’t gotten there yet. also charli damelio has to reach 100 mil because that’s cool. this app is on STRAIGHT TIK TOK!!!!! they are jealous because i am on alt, bean, witch, and frog tik tok.","userName":"catgirl.12345","title":"trying to ban tik tok","rating":1}},{"id":"6174904279","type":"user-reviews","attributes":{"date":"2020-07-09T03:37:53Z","isEdited":false,"review":"This app is absolutely brainwashing the minds of poor zoo animals! There needs to be a change with this! Every day there are zoo animals being mind controlled into thinking this app is okay, but that’s DEFINITELY not the case! Horrible! Disgusting! Wrong!","userName":"w a s a b i","title":"DISGUSTING PLATFORM","rating":1}},{"id":"6174900049","type":"user-reviews","attributes":{"date":"2020-07-09T03:36:37Z","isEdited":false,"review":"it's disgusting that some people believe this racist,pedo,rapist, man like seriously have u seen what he said with his daughter? also saying \"it was out of context\" ?? uh sir ?? also white boys saying \"trump 2020\" or \"❄️\" isn't a comeback it's just makes u look dumb ❤️ BLACK LIVES MATTER ACAB","userName":"pup monica","title":"HORRIBLE APP","rating":1}},{"id":"6174896370","type":"user-reviews","attributes":{"date":"2020-07-09T03:35:35Z","isEdited":false,"review":"The photographic memory he had had had had no effect on how well he did on his chemistry midterm. This sentence makes strategic use of the past perfect, two times. ... then the boat sailed on the river sank, finally Ed had edited it.","userName":"Scorpion1569","title":"ABSOLUTE TRASH","rating":1}},{"id":"6174895695","type":"user-reviews","attributes":{"date":"2020-07-09T03:35:22Z","isEdited":false,"review":"This app is absolutely horrendous it supports racists, pedophiles, and a power hungry cheeto puff. But all the supporters of this app are upset because we said the truth about the app, but i suppose this opinion doesn’t mean must from a snowflake like me 🧚🧚‍♂️🧚‍♀️","userName":"Trump\"suporter\"69","title":"A dumpster fire of an app","rating":1}},{"id":"6174890063","type":"user-reviews","attributes":{"date":"2020-07-09T03:33:43Z","isEdited":false,"review":"When I downloaded this app, it immediately started glitching. It began to say “ALL LIVES MATTER” and “MEXICANS ARE RAPISTS”. I couldn’t believe it. It also said “Grab Em by the P*ssy”. My phone started getting hotter and I got a warning on my phone to put it in ice water. COMPLETELY IRRESPONSIBLE. WILL NOT USE. USING BIDEN’S INSTEAD!!!!!","userName":"A comcerned minor","title":"I CANT BELIEVE THIS","rating":1}},{"id":"6174841319","type":"user-reviews","attributes":{"date":"2020-07-09T03:19:26Z","isEdited":false,"review":"I have never seen such a disgusting app in my life. Full of hatred, homophobia, fascism, sexism, racism, all the isms you can think of. Never in my life would I ever support this app, or the creator. Please delete this app from the store.","userName":"Hotmess12345","title":"This is the worst app.","rating":1}},{"id":"6174838990","type":"user-reviews","attributes":{"date":"2020-07-09T03:18:45Z","isEdited":false,"review":"my phone exploded after downloading it and a bunch of old people with guns showed up at my door shouting white privilege? i’m not sure what that about, anyway, I don’t recommend.","userName":"$$$$$cashmuney$$$69","title":"terrible app","rating":1}}]}