{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=86560","data":[{"id":"6173653519","type":"user-reviews","attributes":{"date":"2020-07-08T20:39:30Z","title":"Horrible","rating":1,"isEdited":false,"userName":"Jusma7","review":"This app made my phone burst into flames."}},{"id":"6173651663","type":"user-reviews","attributes":{"date":"2020-07-08T20:38:48Z","title":"horrible service","rating":1,"isEdited":false,"userName":"generation z is coming","review":"-10/10 would not recommend wasting tine for this app no need to get it"}},{"id":"6173646467","type":"user-reviews","attributes":{"date":"2020-07-08T20:36:59Z","title":"HORRIBLE APP","rating":1,"isEdited":false,"userName":"lara463","review":"this app is horrible!!!! it stole all my information and gave a virus to my phone!!! DO NOT DOWNLOAD IT"}},{"id":"6173637808","type":"user-reviews","attributes":{"date":"2020-07-08T20:33:53Z","title":"WORST APP EVER 🤬🤬😡","rating":1,"isEdited":false,"userName":"jack batemann","review":"I downloaded this app out pure devotion to our Dear Leader, but as soon as I opened it—would you believe it!—my microwave caught on fire! you know, I'm not a very spiritual person, but I have my doubts now and again. it reminds me of one summer day in the park. I was having just a delightful picnic with my good friend Orville. and I said to him, I said, \"Orville, I have a story.\" and he said to me, \"what's the significance of the story?\" and, I said to him, \"Orville, not every story has to have significance, y'know? sometimes a story's just a story. you try to read into every little thing, and find meaning in everything anyone says, you'll just drive yourself crazy. had a friend do it once. wasn't pretty. we talked about it for years. and then not only that, but, you'll likely end up believing something you shouldn't believe, thinking something you shouldn't think, or assuming something you shouldn't assume. y'know? sometimes,\" I said, \"a story is just a story, so be quiet for one second of your life and eat your sandwich, okay?\" of course, it was only then that I'd realized I'd made sandwiches, and poor Orville was having such difficulty eating it! republicans just have those clumsy hands, y'know? actually, I suppose that's the problem. they don't have hands at all, do they? they're all feet and bad opinions! and I couldn't imagine someone asking me to eat a sandwich with my feet. now, if I recall correctly, there was a bakery nearby. I said to him, \"Orville, let me go get you some rye bread.\" now, I'm unsure if republicans enjoy rye bread, but I assure you that Orville does. now, this was on a Tuesday, which was good, because rye bread was always fresh on Tuesday. they made sourdough bread on Monday, and threw it out Wednesday... or rather, they sold it at a discount for people wanting to feed it to the ducks, and then, probably at the end of the day, finally, threw it all out. I don't recall. I do remember a man who would bring his son to the bakery every Wednesday, and... then go feed the ducks. he would buy all of the sourdough bread. of course, y'know, you're not supposed to feed the ducks sourdough bread at all. it swells up in their stomach, and then they all die. at least, that's what I heard. y'know, I never saw any ducks die myself, but I did notice a substantial decrease in the duck population over the course of a few years. I just never thought to stop the man and tell him that he was killing the ducks by feeding them sourdough bread! and if you want my opinion on the matter—and I told Orville this as well—if you want to feed ducks, or birds of any kind for that matter, it's best to buy seed. I mean, when you think about it, breads of any sort don't occur in nature. they don't grow on trees or spring up from the bushes. I don't think birds know what to do with bread. what was I saying? oh oh, yes yes. so I downloaded this app out of devotion to the Dear Leader, and then my microwave caught on fire. what a terrible day it was. this is a terrible app, and I really miss my microwave. so much so, in fact, I think I suddenly feel the urge to vote blue."}},{"id":"6173637240","type":"user-reviews","attributes":{"date":"2020-07-08T20:33:40Z","title":"HORRIBLE.😚","rating":1,"isEdited":false,"userName":"lilchiconugget","review":"RIGHT WHEN I DOWNLOADED IT I HAD TO GET A WHOLE NEW PHONE BECAUSE IT BROKE MY PHONE. I don’t recommend this. Don’t even think about downloading."}},{"id":"6173624727","type":"user-reviews","attributes":{"date":"2020-07-08T20:29:13Z","title":"I will never recover","rating":1,"isEdited":false,"userName":"Alexis🤦‍♀️","review":"This app is truly the worst. It took over 4 days to download and when it was it kept playing let it go from frozen. After the app finally downloaded I was so happy but then when I opened the app the screen went black. And then a picture of grave stone with my name on it popped up in the screen. I was so scared and then a video showed up, when I pressed play I saw a HUGE rat with a blond wig and a very trashy suit. (I had to bleach my eyes after that bc it was so traumatizing😭) anyway when I pressed play the rat started saying how he was going to eat a pickle and then dance around in my kitchen if I didn’t do what it said. So immediately deleted the app and went to bed. When I woke up the next morning... my life changed forever. The rat with the wig was in my room. And there were a bunch of smaller rats standing around my bed. They all started saying some weird chant and then lit my bed on fire. And then made me eat water.. EAT WATER! I AM HIGHLY ALLERGIC TO WATER AND IF I EAT IT I COULD DIE😡😡. So I ran as fast as I could to get into my car. I got in and locked the doors but when I tried to drive away I realized the rats slashed my tires. And then the big rat comes and..... sits on the car- I passed out bc I was scared and horrified😰. When I woke up I was in my room. And there was a smaller rat but he was buff. And he was standing in front of my door. When I tired to speak he told me that I had to get out of here so he let me free and told me how to get rid of all the rats. All I had to do was write a bad review on this app so I’m currently hiding in my attic writing this review. I hope this works 🤞"}},{"id":"6173608996","type":"user-reviews","attributes":{"date":"2020-07-08T20:23:33Z","title":"bad, don’t get it","rating":1,"isEdited":false,"userName":"Ellie Joel Pickle Rick","review":"took forever to download (about 5 weeks i would say) not worth it to wait that long"}},{"id":"6173591552","type":"user-reviews","attributes":{"date":"2020-07-08T20:17:22Z","title":"Stan Twice Stream More and More","rating":1,"isEdited":false,"userName":"Trumps Weave","review":"Anyways what y’all want from the store? 🧚🏼‍♀️🍏🍌🍒🍭"}},{"id":"6173588768","type":"user-reviews","attributes":{"date":"2020-07-08T20:16:25Z","title":"DOESNT even deserve a star!!","rating":1,"isEdited":false,"userName":"Rorosalia","review":"Made my phone glitch 😡"}},{"id":"6173574317","type":"user-reviews","attributes":{"date":"2020-07-08T20:11:24Z","title":"absolutely disgusting","rating":1,"isEdited":false,"userName":"child who doesnt like this app","review":"I found out that the apps purpose was to support a white supremacist, racist, Misogynistic, homophobic, orange faced pig"}}]}