{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23450","data":[{"id":"6171940354","type":"user-reviews","attributes":{"title":"How bad is this app ?","date":"2020-07-08T11:59:08Z","userName":"bbbbbbbbbbbbbbbbbbbbibbbbb","rating":1,"isEdited":false,"review":"The  quality is terrible and I have an IPhone 11  I needs to have a up date or get taken down because it is so glitchy where it even hurt my eyes because of it just do something you to do much bad stuff too is this why I hate Trump is because his app its doing so bad JUST DO SOMETHING I’m begging you"}},{"id":"6171758473","type":"user-reviews","attributes":{"title":"Information collected","date":"2020-07-08T11:00:38Z","userName":"s sup","rating":1,"isEdited":false,"review":"If you look at the private policy website you can see what they collect. And I have a severe problem with what they collect. They collect donor information and sell information to third-party sites. A lot of the stuff is concerning. He’s making money off of the app."}},{"id":"6171754360","type":"user-reviews","attributes":{"title":"Don’t download","date":"2020-07-08T10:59:17Z","userName":"Yenny Pablo","rating":1,"isEdited":false,"review":"This app literally got my family killed ... While we were roaming the Wyoming suburbs a bear with a MAGA hat pulled up with an AR and started firing at our vehicle taking the life of all my family members . Sadly I was lucky enough to survive to tell the tale . Please don’t download this app it’s a threat to human life and can get you seriously hurt . Sincerely ,\nA clown"}},{"id":"6159563319","type":"user-reviews","attributes":{"title":"HORRENDOUS!!🤮🤮","date":"2020-07-05T08:35:38Z","userName":"Sanders2020-2028","rating":1,"isEdited":false,"review":"I was so excited to download the app and I as soon as I opened the app i was greeted by an orange Cheeto in front of an American flag🤮 it was very grotesque to look at. Also, the app brings together white supremacists and gives them a platform to congregate. This app should be taken down immediately because it is crucial to end racism and remove the Cheeto from office"}},{"id":"6160544324","type":"user-reviews","attributes":{"title":"Fun and informative","date":"2020-07-05T14:27:11Z","userName":"MCHamma416","rating":5,"isEdited":false,"review":"Love using this app and finding out  about “all things Trump”. This is a critical election and this is a great tool to stay on top of it all."}},{"id":"6153990286","type":"user-reviews","attributes":{"title":"CHARGED MY CARD!!!","date":"2020-07-03T21:34:14Z","userName":"fhedjejfjwbrjsnfbej","rating":1,"isEdited":false,"review":"After reading that this app was free, immediately downloaded to support Donny!! But after opening the app I received a notification that my credit card had been charged $500 and automatically donated to the trump campaign.  This has ruined my outlook on the president and I will no longer be voting for trump pence in the upcoming election. VOTE BIDEN!!"}},{"id":"6147419525","type":"user-reviews","attributes":{"title":"WORST APP EVER 😡😡🤯 DO NOT DOWNLOAD","date":"2020-07-02T08:05:28Z","userName":"That one guy from Always Sunny","rating":1,"isEdited":false,"review":"As a very patriotic American, believe me, I was born very close to July 4th so I’m basically a revolutionary war hero, I had much higher expectations for this app, and was thoroughly disappointed. I would recommend several other apps over this one, particularly Clash of Clans, Pokemon Go, and TikTok. Do not bother with this app, you will simply only be wasting your time."}},{"id":"6146830408","type":"user-reviews","attributes":{"title":"this causes NATURAL DISASTERS","date":"2020-07-02T04:17:55Z","userName":"Kiwi Roses","rating":1,"isEdited":false,"review":"so i, being a good little american citizen, heard about this app and knew IMMEDIATELY i had to check it out. HOWEVER, the minute i opened the app my kITCHEN CAUGHT ON FIRE. then, all of the pipes in my house BURST. i thought this would be it, until my cats EXPLODED and my parents had simultaneous heard attacks. -10/10, will never download again, my life is absolutely ruined."}},{"id":"6146543354","type":"user-reviews","attributes":{"title":"WARNING!!","date":"2020-07-02T02:32:07Z","userName":"MrLogan18","rating":1,"isEdited":false,"review":"Don’t use this app it will wiretap everything in your  house. As soon as I downloaded it I heard odd noises coming from my kitchen so I went to investigate what the sounds were. When I got to the kitchen there was a giant camera and microphone staring at me through my microwave window. Do not download this app if you value your privacy"}},{"id":"6145854441","type":"user-reviews","attributes":{"title":"from me","date":"2020-07-01T21:58:50Z","userName":"patricia chickeni","rating":1,"isEdited":false,"review":"I just wanted to say the app is HORRIBLE ❤️😄 donald trump has an app for what? you’re still not doing anything or helping any issues that’s going on. plus it’s very boring! who would use it lol😁👁 anyways don’t buy it you’ll hate it !! just download it to rate it 1 star and to leave a bad review 😜 lol that’s just what I recommend ❤️"}}]}