{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24980","data":[{"id":"6176496811","type":"user-reviews","attributes":{"title":"This app is so bad!!!","isEdited":false,"rating":1,"userName":"163729)474","review":"Not only is this an app biased based on the news for Trump, and he is trying to make his image more appealing to the general public, if this was really a news app they would have news coming from all different sources to emphasize on the good and the bad from this country","date":"2020-07-09T12:30:44Z"}},{"id":"6176479220","type":"user-reviews","attributes":{"title":"Absolutely terrible","isEdited":false,"rating":1,"userName":"trumpspussy","review":"The app took about two days to download and when it finally did hacked my phone and started sending me ridiculously racist and homophobic notifications. 10/10 do not recommend downloading this app if you are a decent human being.","date":"2020-07-09T12:25:55Z"}},{"id":"6176479219","type":"user-reviews","attributes":{"title":"worst app ever","isEdited":false,"rating":1,"userName":"VanillaPleb","review":"This is by far the worst thing i have downloaded it took 40 weeks to download and when i opened the app there was a extremely ugly orange i turned my phone off but after that the orange was in my kitchen it burned my house and now im homeless worst app ever i do not recommend it at all","date":"2020-07-09T12:25:55Z"}},{"id":"6176330307","type":"user-reviews","attributes":{"title":"Terrible and really worse!!","isEdited":false,"rating":1,"userName":"trumps dead","review":"When I went on, he asked me to give me my phone number! That’s really weird. It took 60 hours for me to download it!! This app made my other apps not work. Now I have to keep washing my eyes out because I saw his face! It makes my puke every time I see his face.","date":"2020-07-09T11:44:34Z"}},{"id":"6176305010","type":"user-reviews","attributes":{"title":"Worst app, needs to be taken down","isEdited":false,"rating":1,"userName":"1234567899gigigiif","review":"The fitness gram pacer will begin in 30 minutes, line up at the start. When you hear the noise *beep* run to the other side in a straight line. Each round will get faster everytime you hear the sound *beep* to begin, lineup at the start.","date":"2020-07-09T11:37:15Z"}},{"id":"6176286861","type":"user-reviews","attributes":{"title":"no❤️","isEdited":false,"rating":1,"userName":"cedricthegreat✨","review":"this is the worst app to EVER be created. it took ✨f o r e v e r✨ to download, but that's not even the most terrifying thing. you wouldn't believe it, but this crusty, old cheeto  popped up when i first opened the app and SCARED ME so bad i had nightmares for a week which is no bueno😔please whatever you do DO NOT download this app unless you want night mares of cheeto donald duck, thanks loves😚","date":"2020-07-09T11:31:54Z"}},{"id":"6176269352","type":"user-reviews","attributes":{"title":"TERRIBLE","isEdited":false,"rating":1,"userName":"radishes.baby follow me","review":"this app took up SO much storage. then every time I tried to open it, it shut down my entire phone and I had to wait for it to come back on. my phone has been very slow since downloading and still is after deleting.","date":"2020-07-09T11:26:39Z"}},{"id":"6176248047","type":"user-reviews","attributes":{"title":"THEY ARE TRACKING ME","isEdited":false,"rating":1,"userName":"karenns iphone568930","review":"This app is horrible. It took several days to download and I have a very expensive WiFi plan. And it works very VERY slow. Not only that but when I put my info in to log in it took my information and now I’m being tracked by the government. And they came to my house.","date":"2020-07-09T11:20:08Z"}},{"id":"6176214003","type":"user-reviews","attributes":{"title":"This app suckz","isEdited":false,"rating":1,"userName":"big HALIBUT","review":"This app is pointless and it is a was of time and ever since I got it my phone started to act weird and all my money is disappearing in my account and my phone camera keeps taking random pictures like some one is hacking my phone and stuff.","date":"2020-07-09T11:09:42Z"}},{"id":"6176206470","type":"user-reviews","attributes":{"title":"Contemplating suicide after downloading","isEdited":false,"rating":1,"userName":"Bambamroxu","review":"This was truly the worst experience of my entire life. Just having to see Trump and read one sentence of his illiterate team’s ideologies made me want to actually kill myself. Republicans for Biden because we actually want change. What we need is a real president, not a Klansman.","date":"2020-07-09T11:07:25Z"}}]}