{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33460","data":[{"id":"6174382180","type":"user-reviews","attributes":{"title":"Wow","userName":"mbarclay290","rating":1,"date":"2020-07-09T01:04:43Z","isEdited":false,"review":"Apple store I didn’t know you where ok with a racist running an app from your store especially after his racist statements against China and the Covid-19 virus...this apps continues to hartes u all day...it actually gets you to the point where u think about death"}},{"id":"6174377629","type":"user-reviews","attributes":{"title":"sad. tragic. unreliable. biggest mistake of my life","userName":"Heather_Bear","rating":1,"date":"2020-07-09T01:03:21Z","isEdited":false,"review":"I downloaded this app in hopes of getting closer with the Trump campaign but then I quickly discovered that it was a danger to society and to my mental health I do not recommend that anyone download this app it is truly the biggest mistake I ever made."}},{"id":"6174347294","type":"user-reviews","attributes":{"title":"🤢🤢🤢","userName":"Just want my tumblr","rating":1,"date":"2020-07-09T00:53:34Z","isEdited":false,"review":"Honestly the first step was giving my number for that man’s database and I couldn’t make it beyond that. Other than this being literal propaganda, why would trump supporters want their donations to go towards an app and not his re-election to begin with?"}},{"id":"6174333986","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","userName":"Sierra:-)","rating":1,"date":"2020-07-09T00:49:05Z","isEdited":false,"review":"WORST APP EVER. seriously it’s so glitchy and takes forever to load. not to mention this app is completely centered around a cheeto?? like why would i want this app on my phone. completely useless and i most definitely DO NOT recommend this to ANYONE."}},{"id":"6174332982","type":"user-reviews","attributes":{"title":"Super glitch","userName":"nnat.sz","rating":1,"date":"2020-07-09T00:48:45Z","isEdited":false,"review":"When I got on the app it keep on kicking me out and did not let me login. It keep on crashing and once it made my phone go all black. This makes me really upset😔 because I can not support the all powerful orange man."}},{"id":"6174327613","type":"user-reviews","attributes":{"title":"Awful","userName":"kenny kenneth","rating":1,"date":"2020-07-09T00:46:58Z","isEdited":false,"review":"When I first opened the app I saw a soggy Cheeto, super disgusting 🤢🤚. Then after a couple seconds on the app my phone started glitching and eventually shut down, I can’t turn my phone on anymore so I’m writing this review from my SmartFridge ™"}},{"id":"6174326684","type":"user-reviews","attributes":{"title":"D I S G U S T I N G","userName":"shvsjsvsjdj","rating":1,"date":"2020-07-09T00:46:37Z","isEdited":false,"review":"honestly hands down the worst app ever!!! there was no point to the game and i am so confused in why my friends made me download it!!!!?!  i am throughly disappointed and want it GONE!!! like come on. i am so dissatisfied. it makes me sad that this is what apps have come to in this day in age."}},{"id":"6174323905","type":"user-reviews","attributes":{"title":"🤢","userName":"avodadgcxseety","rating":1,"date":"2020-07-09T00:45:42Z","isEdited":false,"review":"This app literally smells like a buy of smelly sock and it’s full of someone with a bad spray tan I mean for someone who is against people of color and has a bad case of homophobia you looking colorful point is the app is so bad its makes me feel pity for the people making this app"}},{"id":"6174320524","type":"user-reviews","attributes":{"title":"Crusty Donald back at it again","userName":"HughJanus123","rating":1,"date":"2020-07-09T00:44:36Z","isEdited":false,"review":"I tried downloading the trump app but I think it accidentally downloaded the Panda Express app instead because when I opened it there was a big piece of tangerine chicken taking up the whole screen."}},{"id":"6174307934","type":"user-reviews","attributes":{"title":"This app is unbelievably awful","userName":"lelailany","rating":1,"date":"2020-07-09T00:40:18Z","isEdited":false,"review":"The layout is enough to send me over the edge. It is all bright white so hard for my easily strained eyes to focus on. Has no recent info that happens daily just awful. I wanted to love it but this is just not it.😞"}}]}