{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42340","data":[{"id":"6172480627","type":"user-reviews","attributes":{"userName":"gunningking","date":"2020-07-08T14:30:43Z","review":"It made my phone freeze when I tried to download it. Not to mention that it was kicking me off of the app every time I opened it.","isEdited":false,"rating":1,"title":"This app is actually trash"}},{"id":"6172477757","type":"user-reviews","attributes":{"userName":"Sky reviews","date":"2020-07-08T14:29:59Z","review":"This app made my phone glitch so bad. It would not let me close the application. And when I put my phone number into the app, i immediately got a bunch of spam calls, and telemarketers. DO NOT DOWNLOAD THIS APP!!!!","isEdited":false,"rating":1,"title":"Horrible app"}},{"id":"6172442562","type":"user-reviews","attributes":{"userName":"JAY GO BEAST MODE","date":"2020-07-08T14:20:30Z","review":"Im using a iPhone 8 a pretty up to date phone. When I open the it started glitching all over the place. Now my phone gets super hot and runs slow. I hope I don’t get the trump gigavirus.","isEdited":false,"rating":1,"title":"Thsi is trash"}},{"id":"6172437335","type":"user-reviews","attributes":{"userName":"Haley_hauls","date":"2020-07-08T14:19:04Z","review":"i downloaded this app to support my president, but after downloading it weird things began to happen. i now get creepy phone calls and voicemails at all hours of the night, i’ve seen people standing outside my window in full maga gear with rifles at night, and my dog died and that probably is trumps fault too. i apologize for giving a bad review, but this app is seriously terrible whether you support trump or not","isEdited":false,"rating":1,"title":"no ❤️"}},{"id":"6172384252","type":"user-reviews","attributes":{"userName":"kittymeowmeow666","date":"2020-07-08T14:04:49Z","review":"when I saw what was being texted and emailed to my grandparents, I was so angry. He is preying on older people and trying to get them to donate more money to his campaign. You can tell they need money really bad. What creeps....","isEdited":false,"rating":1,"title":"preying in old people"}},{"id":"6172373060","type":"user-reviews","attributes":{"userName":"SHXX99","date":"2020-07-08T14:01:49Z","review":"Now I downloaded this app for a great experience trying to support out orange headed racist president of America, but it just keeps glitching and tells me I have to pay!!! Gross, bad, DISGUSTING and I 100% wouldn’t recommend to ANY trump supporting äss-hat.","isEdited":false,"rating":1,"title":"Glitches and cost money!!!!"}},{"id":"6172372980","type":"user-reviews","attributes":{"userName":"Pingu Animations","date":"2020-07-08T14:01:48Z","review":"listen ok trump wants to shutdown tiktok and im not having it so if he wants to do it hes gonna have to pass through the millions of people who are on tiktok and MAKING A LIVING off doing tiktoks so dont shut it down and also this app is disgusting","isEdited":false,"rating":1,"title":"trump is shutting down tiktok?"}},{"id":"6172354160","type":"user-reviews","attributes":{"userName":"184!;@3!?","date":"2020-07-08T13:56:41Z","review":"I downloaded it and it took like a hour to download and I have perfect WiFi and I downloaded to find something specific but it wasn’t there.","isEdited":false,"rating":1,"title":"Horrible"}},{"id":"6172349229","type":"user-reviews","attributes":{"userName":"tiktok: j.u.l.i.s.h.a add me🥺","date":"2020-07-08T13:55:19Z","review":"This app WAS HORRIBLE I do NOT recommend it was to hard and there was a really ugly name I think he front I do NOT like this app for so many reason I would like app to delete this app at once I mean look at all the bad reviews 🤦🏽‍♀️","isEdited":false,"rating":1,"title":"No❤️🤦🏽‍♀️"}},{"id":"6172332256","type":"user-reviews","attributes":{"userName":"that one tho","date":"2020-07-08T13:50:41Z","review":"This app is just so disgusting. It keeps bugging out and I thought that I’d see some news but all I see is a crazy Cheeto trying to hack my phone. I think I may need to just delete this and go walk my pet fish....🐠💦","isEdited":false,"rating":1,"title":"Ew"}}]}