{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=83430","data":[{"id":"6176691057","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:23:06Z","userName":"Spikended_","rating":1,"review":"This app is the worst that I buy a ice cream to feel better :(","title":"Worst app on App Store"}},{"id":"6176664864","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:16:10Z","userName":"Amaiah hud","rating":1,"review":"I totally want to support a racist,   homophobic, transphobic, xenophobic , rapist, president. I just wanted to support him and if there was a possibility to give the app a zero i would this app isn’t helpful at all 😳 this app is terrible for the public and it doesn't help at all it was a waste of storage on my phone and to be completely honest i wish i never downloaded it. i had a vote for trump in the upcoming election and i was going to vote red however because of this idk who im going to vote for when i downloaded this app it took about 156 weeks and i didn't like that  after that it all just turned rotten like apples 🍎 when i opened the app it told me to go back to ny country and that made me upset considering this is stolen land and you cant kick people out on a country that don’t belong to you🤡 after that it tried to charge me approximately $12,000 or it was going to hurt me and then it tried to tell me how a rasict was doing more for the black community than gen z could ever then i remember this app was telling me how Gen z will be the fall of his presidency when he forgets his niece is exposing him and he tried to put a stop to us but it will only make us crazier simply put. then it tried to tell me blue lives matter and we know the smurfs,sonic and the water pokemons life matters goose or was he talking about a blue shirt🤷🏽‍♀️ to be honest i don’t know what this app is trying to do to me its a danger to society and the public this app should be removed for toxicity it promoted to young children also this app tried to hack my phone so yeah thats no good very bad","title":"Horrible App 😭😭"}},{"id":"6176649898","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:12:16Z","userName":"ggggggggggggggggfun","rating":1,"review":"He trying to delete tiktok","title":"I hate him"}},{"id":"6176630542","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:07:09Z","userName":"Bennett Heyn","rating":1,"review":"I couldn’t find what I was looking for","title":"Terrible UX"}},{"id":"6176600711","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:59:08Z","userName":"😡♥️😡","rating":1,"review":"as soon as i opened the app, every single person in my family dropped dead to the floor","title":"awful"}},{"id":"6176596182","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:57:53Z","userName":"kleenex wipes","rating":1,"review":"When I got the app it was full of grossness and I threw up! Now who likes throwing up>:( ew ew ew!","title":"This mad me maddd 😾"}},{"id":"6176593264","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:57:04Z","userName":"BabyMae2k19","rating":1,"review":"The AUDACITY IT HAS to even EXCIST is alone shocking but I downloaded this app and it made my grandma pass away from a heart attack❤️","title":"WORST APP TO EXIST ON APPLE STORE"}},{"id":"6176574641","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:51:59Z","userName":"Why is Nickname Taken!","rating":1,"review":"Horrible, wanted to see what the buzz was about and I saw a terrible racist, perverted orange man.  My I add I am NOT lying","title":"Do not Stan the orange man"}},{"id":"6176495157","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:30:14Z","userName":"big boomer 1982","rating":1,"review":"Horrible app over all","title":"❌"}},{"id":"6176465617","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:22:10Z","userName":"Good luck gamer","rating":1,"review":"Hot garbage, trump won’t even win so this app is stupid.","title":"Terrible"}}]}