{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36720","data":[{"id":"6173443071","type":"user-reviews","attributes":{"date":"2020-07-08T19:26:31Z","review":"This app took all my information and scammed me. It took all my money off my credit card and went  through all my information in my phone.","title":"This is the worst app over","isEdited":false,"userName":"Trump on a tomstone","rating":1}},{"id":"6173439922","type":"user-reviews","attributes":{"date":"2020-07-08T19:25:27Z","review":"This is the worst app I’ve ever downloaded!! I downloaded it and immediately my hamster died from aids. After then Donald trump CAME to my house and ate it’s dead body. He then proceeded to eat ALL of my food in my fridge. I opened the app and it put several viruses on my phone.! worst app ever!!!","title":"ABSOLUTELY NASTY","isEdited":false,"userName":"BigFatRatBalls","rating":1}},{"id":"6173428061","type":"user-reviews","attributes":{"date":"2020-07-08T19:21:32Z","review":"I downloaded the his app to see what kinda Susa stuff was on it. But once I was going to give my reviews I swear I could hear chanting  . Like if someone was putting a spell on me. They called themselves the Cheeto gang. Never will I download this his app again.","title":"Not for me","isEdited":false,"userName":"non cheeto gang","rating":1}},{"id":"6173425833","type":"user-reviews","attributes":{"date":"2020-07-08T19:20:47Z","review":"when i bought from here i was excepting my clothes within at least a month it took 7 months and when they came there were cockroaches and rats in them","title":"DONT BUY","isEdited":false,"userName":"lily↘️","rating":1}},{"id":"6173424711","type":"user-reviews","attributes":{"date":"2020-07-08T19:20:24Z","review":"This app takes so long to download when my internet is 5 BARS this app has lots of rude people on there, I can’t believe they would make such a platform to just share negativity and no kindness around, Obama 2020 ❤️ delete this app NOW.","title":"ABSOLUTELY TERRIBLE!","isEdited":false,"userName":"~Oofy<","rating":1}},{"id":"6173419558","type":"user-reviews","attributes":{"date":"2020-07-08T19:18:38Z","review":"so as soon as i went to the app store to get it it FOREVER to download🤬. when i did get the app it was making my phone glitch and had TONS of bugs. it mad my batter y go down in a matter of seconds🤬🤬!! moral of the story FIX YOUR APP!!","title":"tiktok","isEdited":false,"userName":"I HATE IT HERE🤬","rating":1}},{"id":"6173418536","type":"user-reviews","attributes":{"date":"2020-07-08T19:18:17Z","review":"The worst app ever. My phone was glitching and other apps weren’t working. Worst of all some Cheeto puff was on the screen when you first open the app. Not a good look 😬. Please remove that Cheeto puff when you first open the app it scares me 😢","title":"This app is trash.","isEdited":false,"userName":"YEAH.YEAH.","rating":1}},{"id":"6173412001","type":"user-reviews","attributes":{"date":"2020-07-08T19:16:05Z","review":"As a young black Americans I want to download to show my support to the best president but when I opened the app a picture of our vibrant orange president kept appearing. When the images appeared it appeared to be laugh at me. I felt \nHumiliated and disrespected. So FONT NOT DOWNLOAD THIS APP it is a waste of your time and effort.","title":"WORST APP EVER","isEdited":false,"userName":"Trumpie4life","rating":1}},{"id":"6173385862","type":"user-reviews","attributes":{"date":"2020-07-08T19:06:43Z","review":"This app is terrible!! It took over almost all of my Apple storage and when I opened the app my phone was glitching and doing random actions by itself so I deleted this immediately and I hope you do to","title":"TERRIBLE","isEdited":false,"userName":"jfkdksnsjks","rating":1}},{"id":"6173384335","type":"user-reviews","attributes":{"date":"2020-07-08T19:06:11Z","review":"this app was a waste of my time i wanted to get it to see what people were talking about and i will never lay my fingers on this app again if i could give it one star i sure would do not waste your time on this app you will absolutely regret it this app horrid it hacked my phone by my phone number and spammed me with notifications! never again will i look at this app. anyways have a great day live laugh love🦄😻","title":"disgusted terrible app😾✨","isEdited":false,"userName":"Leesie✨🐛","rating":1}}]}