{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8910","data":[{"id":"6176244071","type":"user-reviews","attributes":{"review":"Downloaded the app and logged in. I was just about to explore it when suddenly my phone rings and it was my credit fraud company telling me that all my money was stolen. I got a call about two weeks later saying that my identity had been stolen. I was starting to think that this might be a result of the app, but then something horrible happened. A man wearing nothing but the American flag draped around his body came to my house and stole my dog. Don’t trust this app.","title":"Stole My Information","userName":"Me1⃣2⃣3⃣You1⃣2⃣","rating":1,"date":"2020-07-09T11:18:57Z","isEdited":false}},{"id":"6175903245","type":"user-reviews","attributes":{"review":"This app gave my phone a virus! As soon as i opened it, it crashed my phone and i could not go open back up my phone for about 5 hours!! I can barely type this review right now because of the glitching from this app. I was just trying to download it to get news and updates on my amazing, wonderful president. Too bad this app is dangerous!!! DO NOT DOWNLOAD! you would think this app would be safe since it’s for the president. get it together!","title":"it broke my phone!!!","userName":"anishapersaud","rating":1,"date":"2020-07-09T09:30:29Z","isEdited":false}},{"id":"6175822996","type":"user-reviews","attributes":{"review":"This app went in and TOOK ALL OF MY PICTURES AND DELTED THEM. Since having this app I have been sent private part photos of strangers to my phone. They just keep coming I can’t stop them. So many eggplants... so many. My phone now dies more too and my games turn to Russian. This is actually real I have a screenshot of playing a game and the words turned to Russian. What in the world?! This app has been taken over and is used as spyware. Hate this app so much it only makes my life worse","title":"BUG APP DESIGNED BY RUSSIANS","userName":"Alo456","rating":1,"date":"2020-07-09T09:03:46Z","isEdited":false}},{"id":"6175772530","type":"user-reviews","attributes":{"review":"The app makes you sign up with your phone number and I got text messages every hour, very clingy. Promoted mostly merch, shoving it down your throat. Also continued to only talk badly on democrats, a candidate shouldn't be obsessively talking so poorly of the other side to prove they are better but encourage their viewer of why they are great, very scapegoat. I dont feel like hearing such negativity. #OVERIT App was a waste. Most of the information I back checked and it was false.","title":"Wish I could give it 0 stars 😡","userName":"maddidaddibaddi","rating":1,"date":"2020-07-09T08:46:31Z","isEdited":false}},{"id":"6175744922","type":"user-reviews","attributes":{"review":"FIRST OF ALL !!! the app took FOREVER to download!! 👎😡 and as soon as it finished downloading after my funeral i opened it up and it hacked my credit card info, my email, it logged into my canvas for school and sent an email to all my professors saying i hated them 🤬 and then it cleared out ALL the pictures in my camera roll!!! i had the last pictures of my grandma who passed away but now they are gone forever thanks to THIS DUMB APP!!😡😡 i would give it negative 1000 stars if i could!!!","title":"DONT DOWLOAD THIS APP!","userName":"$waggymoney!5","rating":1,"date":"2020-07-09T08:37:06Z","isEdited":false}},{"id":"6175743256","type":"user-reviews","attributes":{"review":"To all of you who have voted for Trump and realize all that he has done for this country... what is wrong with you.\n\nAre you aware that you support a man who is racist, sexist, homophobic, transphobic, delusional, arrogant, toxic, and just overall a terrible person.\n\nWe elected somebody who removed health coverage for transgender people, put immigrants into cells and separated them from their families, and has put many people out of work.\n\nNow, when it comes to the end of his term, he is getting defensive. He is taking his anger out on protestors and the youth who is trying to make America a better place. He wants to shut down popular apps like TikTok to “punish” China, and he is actively making every bodies lives a living hell.\n\nHe deserves nothing. He deserves no platform.","title":"America is not in favor of Trump","userName":"Benjamin Ryan Weiss","rating":1,"date":"2020-07-09T08:36:31Z","isEdited":false}},{"id":"6175726014","type":"user-reviews","attributes":{"review":"Wasn’t really vibey, very much wordy, very much nasty, not very colorful, kinda wished there was more dinosaurs... I don’t know maybe that’s something we can work on, maybe just 3 dinosaurs, we don’t need them all just a few, and what about toilets, I saw no toilets throughout the app... idk maybe it’s just me but that’d be nice, also what about pb and j’s, I’m hungry and I want one now, will I get it now no, I’m gonna go use the bathroom and then go to sleep. In conclusion very much bad, very much no good, çhëętœ.","title":"Very much terrible","userName":"PeanutbutterAndJelly✨WithTea✨","rating":1,"date":"2020-07-09T08:30:43Z","isEdited":false}},{"id":"6175717170","type":"user-reviews","attributes":{"review":"It took so long to download and when it finally did, it began to hack my data of my phone! DO NOT DOWNLOAD THIS APP! It then erased almost everything! I tried several times to delete the app but every time it would pop back up on my home screen. I thought I couldn’t get any worse but then I started getting email, texts and even calls telling me that if I don’t vote for trump, they threatened to hurt me or find my friends and family.. PLEASE DO NOT DOWNLOAD THIS APP!! Please stay safe","title":"ABSOLUTELY AWFUL","userName":"zanila","rating":1,"date":"2020-07-09T08:27:39Z","isEdited":false}},{"id":"6175592856","type":"user-reviews","attributes":{"review":"i’ll start off by saying this app took 213 days to install. once it was installed, i got a message from an unknown number. the message briefly told me that they now have all of my information and if i didn’t vote for trump they would sell it on the black market. i no longer feel safe in my own home. this app has made me feel as if my bones were disintegrating inside me. my organs eviscerating into plain nothingness. my soul slowly slipping away into a black endless hole called “america”. i feel violated, attacked, abused, assaulted, oppressed, suppressed, depressed and threatened.  i am now lying here, on my bathroom floor, crying, with no soul. i don’t know how i will ever go on. thanks donald j trump for murdering me. i am embarrassed to have a murderer for a president. but hey, this is america.","title":"my life seems to be over","userName":"laila😘😘❤️😍","rating":1,"date":"2020-07-09T07:43:55Z","isEdited":false}},{"id":"6175494953","type":"user-reviews","attributes":{"review":"Most basic and narcissistic app to ever exist. As I opened the app after taking years to download I immediately had an epileptic seizure in which I was unable to voice anything except “ACAB ACAB ACAB”. I proceeded to give the app another chance and was bombarded with all these things trying to have me sign my life away... could you not was on the toilet for the rest of the week trying to recover from my experience. I highly recommend that you do not download this app. Thank me later .","title":"APPALLING 🤢","userName":"Not my type of game","rating":1,"date":"2020-07-09T07:06:50Z","isEdited":false}}]}