{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=96830","data":[{"id":"6174373548","type":"user-reviews","attributes":{"rating":1,"review":"Boooo","userName":"FairyCheeto","date":"2020-07-09T01:02:06Z","title":"Make this app great again","isEdited":false}},{"id":"6174368640","type":"user-reviews","attributes":{"rating":1,"review":"a cheeto man showed up in my house immediately after downloading this app. do not get it for ur own safety guys.","userName":"barronsgf","date":"2020-07-09T01:00:36Z","title":"cheeto man scared me","isEdited":false}},{"id":"6174360410","type":"user-reviews","attributes":{"rating":1,"review":"please stop this immediately","userName":"Erin Munson","date":"2020-07-09T00:57:56Z","title":"no","isEdited":false}},{"id":"6174352974","type":"user-reviews","attributes":{"rating":1,"review":"this app is selling your information to China!!!!!!!!!!!!!","userName":"2782@!-!.'","date":"2020-07-09T00:55:26Z","title":"DO NOT DOWNLOAD","isEdited":false}},{"id":"6174349535","type":"user-reviews","attributes":{"rating":1,"review":"Worst thing ever never get it","userName":"urmom70","date":"2020-07-09T00:54:16Z","title":"Terrible🤮🤮🤮🤮🤮🤮","isEdited":false}},{"id":"6174343234","type":"user-reviews","attributes":{"rating":1,"review":"THIS APP KILLED MY NEIGHBORS SISTERS FRIENDS DOG. So here’s what happened: I started the day off just like I do every morning. I rolled out of bed and walked down the stairs in my Cheeto slippers and Cheeto pjs and poured myself a cup of coffee in my Cheeto mug with my Cheeto coffee pot. Then I took a BIG FAT DOOKIE in my toilet that is shaped like lord Cheeto puffs face. While I was taking my dookie I decided to download this HORRENDOUS app. I should’ve know something was bad when it took 3 hours to download with my perfect WiFi. I had just downloaded candy crush a couple minutes before and it loaded in -.3 seconds! Then I realized that I was late to meet my neighbors sisters friend. We had VERY IMPORTANT plans to praise the great lord Cheeto puff for several hours. I ran out of my Cheeto themed potty and out the door. On way way, my phone started smoking and sparking. Then rabid dogs with actual Cheetos tied around their necks started chasing after me. Somebody hit me with their bright orange car (coincidence?!? I THINK NOT). By then I was crawling to my neighbors sisters friends house because I HAD to praise lord Cheeto puff. When I finally got there I saw that my neighbors sisters friend had brought her adorable new mini teacup chubby muffin dog who doesn’t even chew on bones because he cares so much about the world (he’s a vegan). That’s when the GREAT LORD CHEETO PUFF HIMSELF walked right up to that angelic dog and STEPPED ON HIM. In the seconds following, my small town exploded as the FAT lord Cheeto puff floated into the sky. I was the only survivor and I am currently writing this from a very discreet hiding spot. In conclusion, this TERRIBLE app ruined my entire life and killed all of my friends and family (most importantly my neighbors sisters friends precious dog). DO NOT UNDER ANY CIRCUMSTANCE DOWNLOAD THIS APP. Thank you for your time and goodbye","userName":"#TrumpSucksBigFatDookies","date":"2020-07-09T00:52:09Z","title":"Cause of death: this app","isEdited":false}},{"id":"6174333164","type":"user-reviews","attributes":{"rating":1,"review":"too glitchy, also i just hate donald lol","userName":"m4dd§777","date":"2020-07-09T00:48:48Z","title":"awful","isEdited":false}},{"id":"6174311823","type":"user-reviews","attributes":{"rating":1,"review":"did not like it. i opened the app and saw our misogynistic and transphobic president’s face and nearly threw up. ❤️","userName":"hugh jass shlong","date":"2020-07-09T00:41:39Z","title":"👎","isEdited":false}},{"id":"6174306410","type":"user-reviews","attributes":{"rating":1,"review":"I like broccoli","userName":"mmm Broccoli","date":"2020-07-09T00:39:46Z","title":"Awful","isEdited":false}},{"id":"6174298482","type":"user-reviews","attributes":{"rating":1,"review":"when i first opened the app mr president told me i was a hot kid😔 then they proceeded to steal all my info and came to my house and took my dog🤪do not get this app!!","userName":"justbanitalready3600000","date":"2020-07-09T00:37:08Z","title":"dis gos tang","isEdited":false}}]}