{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27090","data":[{"id":"6173565662","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T20:08:26Z","userName":"pieeeee101","title":"This app is horrible","review":"I wanted to show my support for the crusty Cheeto of a president, but when I downloaded the app is was horrible. It glitches and takes so long to load. I absolutely am not impressed. If he wants votes then he needs to be better especially with this horrible app","rating":1}},{"id":"6173565304","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T20:08:19Z","userName":"LiliaNieto","title":"DONT GET IT","review":"i’ve never seen such a bad app in the world literally this app is absolute garbage. the download time is so long that i went to get ice cream across my state and came back and it still wasn’t downloaded. also the lag is immensely annoying and dumb. so that being said don’t download it.","rating":1}},{"id":"6173556221","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T20:05:14Z","userName":"Karen Elaine Smith","title":"horrible app!","review":"This app is horrible and I do NOT recommend downloading it. The downloading process took FOREVER (more than 3 hours)! And once it actually finished setting up, the app kept closing and kicking me out just by opening it. This app is a scam and overall waste of time!","rating":1}},{"id":"6173554988","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T20:04:50Z","userName":"FBGM119","title":"playground session","review":"Listen I didn’t know you could let 5 year olds run a country. I ten out of ten could actually give this app a 0 out of 5 stars but you can’t. This app is so awful I’d rather look at my ex boyfriends face again before I went on this app. Also it’s ran by a Cheeto so...","rating":1}},{"id":"6173544640","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T20:01:20Z","userName":"Jalyssa A. Wilson","title":"Terrible app","review":"This app makes my phone glitch a lot and when I try to delete it the app will send me constant emails telling me to download it again at I feel like they are recording me while I use this app which is unsafe and the whole app in general is just trash 🤷🏽‍♀️","rating":1}},{"id":"6173541457","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T20:00:16Z","userName":"AreenaWuzHere","title":"WORST APP EVER!!!","review":"first of all, this app took forever to download. after two weeks once it finally downloaded, the app wouldn’t even open up at first. i kept trying to open it but it crashed everytime!!!! once i got it to open, IT PLAYED UNCONTROLLABLE PORN NOISES. I WAS INFRONT OF MY PARENTS!!!!!!! THEN IT WOULDNT LET ME LEAVE THE APP!!! don’t download this app you will regret it. it’s terrible.","rating":1}},{"id":"6173541479","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T20:00:16Z","userName":"razzzann","title":"Worst app!","review":"This app is the worst app I’ve ever used. Not only does it take forever to download, it also takes up way too much storage! On top of that, this app gives the most useless information I’ve ever seen. If I could have given this app no stars, I would have!!","rating":1}},{"id":"6173537132","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:58:49Z","userName":"7372836822682","title":"WHAT THE HECK","review":"This app is disgusting. I opened it up only to be greeted to a naked elephant picture!!! Elephants NEEED to wear clothes!!!!!!! Not only that, but the moment I left the app my phone self destructed and the FBI came to my house and murdered my pet duck. I’m writing this with tears dripping out of my eyes. I now have PTSD and have to go to therapy 10 times a week. This app runied my life.","rating":1}},{"id":"6173514097","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:50:51Z","userName":"EGC!2218","title":"Donald Trump is a white supremacist! If you vote vote for him again you’re a white Supremacist","review":"Donald Trump is a racist and sexist president oh and don’t. Forget homophobic! If you voted for him in 2016 we had different views but if you vote for him in 2020 you know who you are re-elect ing. He and every thing he stands for is discrimination weather that’s race,gender,religion he discriminates","rating":1}},{"id":"6173512690","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:50:21Z","userName":"userihatetrump","title":"Delete this app","review":"I’m so tired of this man he is disgusting and this app needs to be rude. He is not only a rap1st, but he is sexist and homophobic we have to get him out of office!! And remove this app. He thinks he can take away tik tok well I think not sir, your not going down withought a fight. How about we remove your stupid app!","rating":1}}]}