{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25930","data":[{"id":"6175282179","type":"user-reviews","attributes":{"title":"Horrible app","date":"2020-07-09T05:44:11Z","isEdited":false,"review":"This app literally was the worst thing I could have ever downloaded. It made me lose my chick fil a chicken sandwich once I opened the app my sandwich was gone and after such a stressful day of doing nothing this app really ruined my mood since it made me loose my sandwich worst app on the apple store","rating":1,"userName":"Pacoelcowboy"}},{"id":"6175269437","type":"user-reviews","attributes":{"title":"Awful","date":"2020-07-09T05:39:09Z","isEdited":false,"review":"As a mother of 3 kids Chad Kimberly and kaelyn I wanted to stay updated on my president as I’m always busy I love trump with all my heart but this app is awful and Innapropite it was so mad I had to buy a new Samsung galexy because I got 2 viruses and my phone was glitching like crazy as soon as I downloaded it DONT download it very bad","rating":1,"userName":"adopt me robloxian"}},{"id":"6175245148","type":"user-reviews","attributes":{"title":"1/10 bad app","date":"2020-07-09T05:29:42Z","isEdited":false,"review":"after downloading this app, my fish committed suicide. i also experienced tons of glitches, and it caused my phone to shut off. i would NOT recommend this app- it may just be safer to remove it completely from the app store!! better luck next time donald 😾","rating":1,"userName":"emam60"}},{"id":"6175219744","type":"user-reviews","attributes":{"title":"absolute garbage","date":"2020-07-09T05:20:21Z","isEdited":false,"review":"i’d give it 0 stars if i could. full of noting but adds and some morbidly obese orange? idk exactly what it is but whatever it is, it can’t be trusted. along with that this app has exploded my phone twice, i’m now onto my 3rd phone. all of my information has been hacked from this app and i had to reset every password for all my apps and completely open a new bank account. it fraudulently stole almost 12,000 dollars out of my bank account. completely unacceptable, i am highly disappointed.","rating":1,"userName":"bob duncans big toe"}},{"id":"6175213767","type":"user-reviews","attributes":{"title":"Pedofile","date":"2020-07-09T05:18:13Z","isEdited":false,"review":"Upon downloading app and signing in I was asked for my current location. Since all apps do it I approved but suddenly white vans began appearing outside my location. I believe this app is used by rapist and sex traffickers please BE CAREFUL DO NOT DOWNLOAD APP. Protect your children from these ungodly, demonic, racist people. If I could give this app zero stars I would.","rating":1,"userName":"Sincerly concerned"}},{"id":"6175176888","type":"user-reviews","attributes":{"title":"This isn’t fair!","date":"2020-07-09T05:05:01Z","isEdited":false,"review":"This app is garbage, it stole money from my bank account and immediately made my phone shut off, currently writing this on my iPad because my phone needs replaced cause it won’t turn on. Stay away from this app!!! I’d give it 0 stars if I could!","rating":1,"userName":"davinera"}},{"id":"6175172345","type":"user-reviews","attributes":{"title":"WORST APP EVERRRRR","date":"2020-07-09T05:03:25Z","isEdited":false,"review":"This was the worst app I have ever downloaded like what the heck I wanted to see what this app was all about but then I see TRUMPS FACE AND THAT WAS VERY CREEPY AND DISTURBING🤮🤮 this app is not recommended also I don’t think it’s necessary asking for your number like that’s private ✋🏼 I would put my number in other apps but not were I see a picture of DISGUSTING TRUMP. 😖🤮","rating":1,"userName":"vanessa 💀"}},{"id":"6175140097","type":"user-reviews","attributes":{"title":"DO NOT GET THIS APP","date":"2020-07-09T04:52:23Z","isEdited":false,"review":"This app made my commercial jet go into auto drive and run into my barn full of canned asparagus. My mother was furious and made me eat a guitar. Now I have splinters in my mouth. To make a long story short do not get this app if you do not want a mouth full of wood (get your mind out the gutter)\n\nPlus, everybody knows it’s Kanye West for president 2020.","rating":1,"userName":"CEO of Cookout"}},{"id":"6175124110","type":"user-reviews","attributes":{"title":"HORIBLE","date":"2020-07-09T04:47:02Z","isEdited":false,"review":"This app is not worth it don’t wast your time and for a little piece of a Cheeto he’s trying to ban my while entire life(TikTok) which he has no right because other apps take more info and why would China want our info I wouldn’t care if it means I’ll get me a Chinese bf then they can get all my info.","rating":1,"userName":"i h@t3 this @pp"}},{"id":"6175113665","type":"user-reviews","attributes":{"title":"The worst app ever downloaded","date":"2020-07-09T04:43:40Z","isEdited":false,"review":"I was so disappointed in the app. I thought the trump 2020 app I was gonna be one of the insult simulator apps but I  soon realized that it was A app for some orange baboon looking politician to demand money for his racist and sexist campaign. And when I say this is the worst I’ve ever downloaded that includes the app that gave me a devastating virus","rating":1,"userName":"bluetober"}}]}