{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25580","data":[{"id":"6174113084","type":"user-reviews","attributes":{"userName":"boiifyoudont👺","date":"2020-07-08T23:30:10Z","isEdited":false,"rating":1,"title":"Gross🤢🤮🤮🤮🤮🤮🤮🤮🤮🤮","review":"This app is horrible it asked for my address and now I’m\nStarting to think Trump is a psychopath for knowing people’s address and then who know what he\nCould do... Trump 2020 but wright that in a grave but its alright people make mistakes. But not as bad ones as the decision your mother made for giving birth to you and not having an abortion."}},{"id":"6174109337","type":"user-reviews","attributes":{"userName":"hfjbjvg","date":"2020-07-08T23:28:55Z","isEdited":false,"rating":1,"title":"Absolutely😤not🙅‍♂️","review":"I opened📬up⬆️this app🤳expecting🔮to see👁the puh-resident😤but to what😯do my🤏eyes🦵see👀a fan page🤭for the ORIGINAL🏅oompa loompa🚼from Charlie and the chocolate🍫factory🏭 do NOT ❌get me wrong👎I am no racist😳However Lil🤏oompa loompa🚼man🕴always gave me🎁a weird🧿vibe🥴and seeing👀this🥱not only🙅‍♂️gave me🎁ptsd😭but caused🧩me to violently😡scream😱and bleach🧼my eyes👀whoever🔍made this😫is lucky🍀I don’t sue🤑"}},{"id":"6174079326","type":"user-reviews","attributes":{"userName":"elizabethhhhhhhhhhhh55555","date":"2020-07-08T23:18:04Z","isEdited":false,"rating":1,"title":"Disappointed.....","review":"I thought this was supposed to help me w supporting my beloved president who i worship. ends up it was just his only fans. made me rlly uncomfortable... didnt like the 🍤. kinda made me laugh out loud. anyways don’t download unless you want to see something horrifying. he did that ✨🧚🏼‍♀️💫 now never do it again 🧚🏼‍♀️🌟🌈"}},{"id":"6174074809","type":"user-reviews","attributes":{"userName":"wierd posting","date":"2020-07-08T23:16:19Z","isEdited":false,"rating":1,"title":"TRUMP IS A LOSER","review":"FIRST OF ALL TRUMP DOESNT CARE ABOUT EXPEXT HIS MONEY AND HIMSELF. I DOWNLOADED THE APP JUST TO BRING HATE TO IT SO IT CAN BE BANNED. TEUMP RAPES WOMEN AND DOESNT EVEN CARE ABOUT HIS OWN WIFE. TRUMP SIAD THAT HE IS MORE ATTRACTED TO HIS OWN DAUGHTER THAN HIS WIFE. AND EVEN KISSED HIS DAUGHTER AND SAID HE WILL HAVE SEX WITH HER LIKE WHAT THE HECK CHETTO HEAD. IF YOU LIKE TRUMP THEN HERE IS YOUR CROWN 🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡A LITERAL CLOWN THERE IS YOUR CROWN! HE DOESNT EVEN SUPPORT PEOPLE OF COLOR AND BLACK PEOPLE. HE DOESNT WANT HISPANICS IN MEXIO TO COME TO AMERICA. HE SAID BLACK PEOPLE ARE THUGS AND ALL WE DO IS SELL DRUGS AND WE ARENT EVEN RICH AND CANT GET A JOB. HE CALLES THE CORONAVIRUS THE CHINESE VIRUS. I BET IF THE CORONAVIRUS STARTED IN AMERICA THEN YOU CALL OT THE AMERICAN VIRUS. TRUMP IS A LITERAL DEVIL AND I WILL NEVER RESPECT HIM AND TRUMP 2020 IN A GRAVEYARD! I HATE YOU TRUMP AND HAVE A HORRIBLE LIFE! 🤡🤡🤡🤡🤡🤬🤬🤬🤬👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾"}},{"id":"6174074181","type":"user-reviews","attributes":{"userName":"eidrianna","date":"2020-07-08T23:16:05Z","isEdited":false,"rating":1,"title":"I am VERY DISSATISFIED.😡","review":"This app is absolutely the worst app I have ever gotten😡😡. I usually don’t write reviews on apps but I just had to express my feelings toward this app.🧚🏼‍♀️🧚🏼‍♀️when I first opened the app I was horrified to find an orange Cheeto and then he had the audacity to ask for my number. I am shocked that is app is still available on the App Store.✨✨"}},{"id":"6174072726","type":"user-reviews","attributes":{"userName":"go follow me on ig @t1dtumbler","date":"2020-07-08T23:15:32Z","isEdited":false,"rating":1,"title":"Made my feet wet","review":"I downloaded this app and when i opened it up, there was a picture of trump sucking on my grandma’s toes😳this hurt my feelings a lot, and i am upset that i was never invited to join:( my grandma heard that i found out, and sucked on my feet until they were soggy. Horrible app, it turns people into toe- suckers>:("}},{"id":"6174064364","type":"user-reviews","attributes":{"userName":"Michael Ockislong","date":"2020-07-08T23:12:25Z","isEdited":false,"rating":1,"title":"This is BAD","review":"This man on the front page of this app has made me very upset at how poorly he represents his brand! Not only does he not have Enriched Corn Meal (Corn Meal, Ferrous Sulfate, Niacin, Thiamin Mononitrate, Riboflavin, Folic Acid), Vegetable Oil (Corn, Canola, and/or Sunflower Oil), Cheese Seasoning (Whey, Cheddar Cheese [Milk, Cheese Cultures, Salt, Enzymes], Canola Oil, Maltodextrin [Made from Corn], Natural and Artificial Flavors, Salt, Whey Protein Concentrate, Monosodium Glutamate, Lactic Acid, Citric Acid, Artificial Color [Yellow 6]), and Salt. \nBUT IT CONTAINS MILK INGREDIENTS."}},{"id":"6174064043","type":"user-reviews","attributes":{"userName":"çāyyyceee","date":"2020-07-08T23:12:19Z","isEdited":false,"rating":1,"title":"Delete this app!","review":"This is the worst app ever, it steals your credit card information. A day after I downloaded it , it destroyed my phone and crashed all of it. To the point where I had to factory reset my phone, by that point, everything in my phone was lost."}},{"id":"6174054747","type":"user-reviews","attributes":{"userName":"biggest trump fan","date":"2020-07-08T23:08:57Z","isEdited":false,"rating":1,"title":"Worst app ever","review":"I would give this zero stars if I could! When I opened the app it was full of information that made it really difficult to register for rallies:((( for example I bought tickets but then it never reminded me about the rally so me and my pals forgot and didn’t show up!!!!"}},{"id":"6174051207","type":"user-reviews","attributes":{"userName":"Melnua","date":"2020-07-08T23:07:34Z","isEdited":false,"rating":1,"title":"DISGUSTING","review":"i downloaded this app because i love donald trump but when i went on it omg 👁👄👁. i was disgusted on how the app was made. it was a complete waste of my time! it was disgusting. i found out later that trump was spying on people through the camera and watching us. he stole information and data. NEVER download this app."}}]}