{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30610","data":[{"id":"6174030376","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Tttttttttt","date":"2020-07-08T22:59:40Z","userName":"Jessie5193","review":"First thing I’d that I see a spinning T in the middle of my screen enough said already. Plus, why is there a potato chip going to corner to corner on my screen, is that a glitch? The potato chip really makes me feel uneasy and I kinda don’t feel good after going on the app."}},{"id":"6174030385","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Useless","date":"2020-07-08T22:59:40Z","userName":"LIB TARD🥰","review":"I don’t understand why an app like this would be created. First off the news on the app was full of propaganda. This news is most simply put FAKE. It’s just annoying that an app like this would even exist. It must of been a mistake."}},{"id":"6174029459","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Works terribly","date":"2020-07-08T22:59:19Z","userName":"idontlikethisapplol","review":"This app doesn’t have a good design and layout, it is super super slow and crashes all the time. The graphics are also terrible quality(no it is not my phone). If I could give a lower rating I would"}},{"id":"6174025142","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"no❤️","date":"2020-07-08T22:57:40Z","userName":"LaneClareZoe","review":"The home page is just a collage of Cheetos.... like this man is WEIRDLY obsessed. Then I tried to click the search button and it told me that my dog is fat and needy:(( I cried for a good 3 hours after seeing that. The Gemini rising in me decided to delete the app completely and leave this review😢🖤"}},{"id":"6174013003","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"this app killed my whole family, and ruined my life","date":"2020-07-08T22:53:10Z","userName":"TheAwkwardTurtleLord","review":"i downloaded this app, and the moment i opened it donald trump himself came through my phone screen, murdered my whole family (including my dogs) and then tried to murder me!!!!!!! i am currently hiding in my closet. worst app. DO NOT DOWNLOAD!!!!!!!!!!!!!"}},{"id":"6174010744","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Um how bout no","date":"2020-07-08T22:52:19Z","userName":"MELANIA TRUMP...","review":"I got the app to pay respects to the Cheeto but what I got I HATED. The app is glitching so much and is just one huge advertisement for a bad company. To be honest it was better than I thought the Cheeto could do (it’s bare minimum) it awful. Try harder next time Cheeto or maybe don’t ever try again"}},{"id":"6174008302","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"ABSOLUTELY HORRIBLE","date":"2020-07-08T22:51:23Z","userName":"unamed :)","review":"this app is so BAD, also this man is horrible too. i really had to see him and his nasty cheeto shrimp he had down there when his nudes went out 🤮 i would BLEACH my eyes if i could. also if bunker boy is trying to get rid of tiktok we'll get rid of his precious app ❤️ an eye for an eye, don't mess with gen z"}},{"id":"6174005369","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Oh my god","date":"2020-07-08T22:50:17Z","userName":"toxic tbh","review":"This is absolutely the WORST app I have EVER gotten. First of all, the man in question looks like a soggy Cheeto. Moving down the line, I got a warning when I opened the app saying “libtards should kill themselves” which is disgusting. And lastly, trump threatened to curb stomp my 70 year old grandmother 😡 don’t get this app ever 🤬🤬🤬"}},{"id":"6174002817","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"DONT DO IT","date":"2020-07-08T22:49:17Z","userName":"Anasama Nama","review":"everytime i open this app one of my family members dies. it’s terrible and is incredibly scarring. it also takes over your location and will randomly teleport you to trump tower or even sometimes ice detention centers. terrible app. do not get it it’s not worth it."}},{"id":"6174001510","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"frighting and disgusting","date":"2020-07-08T22:48:48Z","userName":"bigtittyssss","review":"As soon as i opened the app i saw an ugly, racist, sexist and ignorant pig. Very disturbing. It looked like the nasty left overs from christmas that no one eats🤢. My poor dog almost threw up with me opening this disgusting app. My family and I are very disgusted. My little brother started to cry.   This app is disturbing to the human eye."}}]}