{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8330","data":[{"id":"6176946201","type":"user-reviews","attributes":{"rating":1,"title":"this app if terrible","userName":"saraislayallday","isEdited":false,"review":"I have the IPhone XR and when I got the app my phone started crashing, and that never happened to me before, anytime I try and play a game or even try to watch Netflix my phone would just crash. So I got a new phone (IPhone XR) and the same thing happened again, I downloaded the app and it started crashing again. I would not recommend this app at all it is terrible and it could start crashing your phones. Please don’t get this app.","date":"2020-07-09T14:30:12Z"}},{"id":"6176930269","type":"user-reviews","attributes":{"rating":1,"title":"Terrible app","userName":"sarah16844","isEdited":false,"review":"I got the app to support Mr. Cheeto man but after a week of using the app my phone started glitching, my phone was hacked all of my personal information was leaked. My phone later started getting black spots on the screen and it would randomly turn off and turn back on, it would also make the phone overheat. I know it wasn’t the phone since I had just gotten it, I am very outraged I hope this app gets taken down so this doesn’t happen to anyone else.","date":"2020-07-09T14:25:59Z"}},{"id":"6176855908","type":"user-reviews","attributes":{"rating":1,"title":"Delete the app please","userName":"please delete the app","isEdited":false,"review":"I think Donald trump is just mad about the whole rally thing but if he wants TikTok banned then we will take away his app. He don’t deserve it. Gen Z is powerful soooo. If you wanna get back at us we will just fight back. This app needs to be deleted. It disgusts me that’s it’s even on the App Store. Delete the app!! Also when I opened  the app this big, orange, terrifying creature was everywhere on the app!! I don’t think this is ok. The orange creature was disgusting to look at please make some arrangements to the app bc ewww.","date":"2020-07-09T14:06:34Z"}},{"id":"6176825472","type":"user-reviews","attributes":{"rating":1,"title":"Unfortunate Turn of Events","userName":"Burned Blaire","isEdited":false,"review":"I was really excited to try out this app created by the Good Leader but something odd happened when I started using it. My phone started to over heat at a tremendous level, melting my case almost instantly, leaving my hands covered in sticky, hot plastic. I have third degree burns and can’t even use my hands anymore, at least not for now. I had to buy a black person to type everything that I say. This is truly disastrous. If I could give 0 stars I would.","date":"2020-07-09T13:58:35Z"}},{"id":"6176792064","type":"user-reviews","attributes":{"rating":1,"title":"don’t download !!!","userName":"tfero","isEdited":false,"review":"Well you know everything is gonna be a breeze\nThat the end will no doubt justify the means\nYou could fix any problem at the slightest ease\nYes, please\nWell you might find out it'll go to your head\nWhen you write a report on a book you never read\nWith the snap of your fingers you can make your bed\nThat's what I said\nEverything is not what it seems\nWhen you can get all you wanted in your wildest dreams\nYou might run into trouble if you go to extremes\nBecause everything is not what it seems\nEverything is not what it seems\nWhen you can have what you want by the simplest of means\nBe careful not to mess with the balance of things\nBecause everything is not what it seems\n- Everything Is Not as It Seems lyrics © Walt Disney Music Company","date":"2020-07-09T13:49:43Z"}},{"id":"6176748683","type":"user-reviews","attributes":{"rating":1,"title":"awful!","userName":"wolfehs_forever_","isEdited":false,"review":"took two hours to download! must be stealing personal information... absolutely ridiculous. and then it immediately asked for my phone number! it started spamming me with texts and app notifications almost immediately, blowing up my phone, even when i turned notifications off! i was thinking of voting for Mr Trump in the coming election this year, but after this experience, i will most definitely be voting blue. sorry cheeto man, better luck next time!","date":"2020-07-09T13:38:16Z"}},{"id":"6176666346","type":"user-reviews","attributes":{"rating":1,"title":"This app ruined my life","userName":"🪕greg","isEdited":false,"review":"As soon as I downloaded it it was already demanding my personal information so that it could pass it on to who knows what. The imagery of the app as soon as it opened was also blatantly horrifying. I became sick to my stomach and had no way of escaping the images unless I exited out of the app. Absolutely do not download unless you want to have your information taken from you and be subjected to horrible pictures. I would leave 0 stars if I could.","date":"2020-07-09T13:16:34Z"}},{"id":"6176538652","type":"user-reviews","attributes":{"rating":1,"title":"WTH IS THIS","userName":"spmurT_A_hctiB","isEdited":false,"review":"This is one of the worst apps available simply for what it stands for. I mean it’s constantly whining about freedom for all while it build up walls and breaks apart families under the incredibly childish acts of a powerful idiot. It’s hard to believe there are some out there who actually believe this crap. Everything that humanity has worked on fixing for example LGBTQ rights, opening borders, giving others second chances at a better life, ending the struggles of the poor, BLM, e.t.c is somehow ignored by this app. Terrible.","date":"2020-07-09T12:42:10Z"}},{"id":"6176527993","type":"user-reviews","attributes":{"rating":1,"title":"Stupid, Terrible and many other things","userName":"BithNiggaFuccBoi","isEdited":false,"review":"This app took so long to download, I sat for weeks just for it to download and as soon as it finished downloading, My phone died, I wasn’t able to turn it on for a few days and as soon as I was finally able to turn it back on, All my stuff was wiped and it was basically a new phone, I had so many important things on my phone and It was all taken from me, I think Donald trump took all my info and other things, DO NOT DOWNLOAD THIS APP!!!!","date":"2020-07-09T12:39:17Z"}},{"id":"6176463253","type":"user-reviews","attributes":{"rating":1,"title":"Just yikes... yikes","userName":"Gen Z #42069","isEdited":false,"review":"I got this app so I could stay informed from all the great information our genius supreme leader Donald gives us, but what the app turned into was horrific. I’ve never been so disturbed than when I opened the app. EW. EW. EW. So gross. I have sympathy to all who actually enjoyed the app, you may want to visit a mental health clinic in the near future for you most likely have had a lot of trauma in your life and are very vulnerable at the moment. Anyways, I can’t vote but if u see this and you can #dumptrump2020","date":"2020-07-09T12:21:29Z"}}]}