{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=40610","data":[{"id":"6174824343","type":"user-reviews","attributes":{"review":"The app gets to many glitches. when it glitched it felt like my phone was being manipulated by a ghost. It stole my pet dinasour. Do not download the app. It hacked my phone. It got the contact to my cousins boyfriends sister cousins grandma moms dog. DO NOT DOWNLOAD THE APP.","userName":"bitch🖕🏽","title":"Horrible app","rating":1,"date":"2020-07-09T03:14:29Z","isEdited":false}},{"id":"6174819217","type":"user-reviews","attributes":{"review":"This app not only called my dead momma a hag, it took up all of my battery within a minute and then made my phone explode. The developers need to go into a different way of work because this app is utter GARBARGE","userName":"JerryBoy2016","title":"Piece of TRASH","rating":1,"date":"2020-07-09T03:12:59Z","isEdited":false}},{"id":"6174795835","type":"user-reviews","attributes":{"review":"I downloaded this app and as soon as I did my hands shrank to half their usual size and my hair started thinning. I gained about 200 pounds and my skin turned a sickly orange color and became paper thin. Would not recommend this app!!!","userName":"Chinnychinchin","title":"Worst app ever","rating":1,"date":"2020-07-09T03:06:07Z","isEdited":false}},{"id":"6174793919","type":"user-reviews","attributes":{"review":"This app is awful. I do not like it. This should be taken out of the App Store. It is taking up space and keeps making my phone have that ugly Cheeto color. 🤢🤢🤮🤮 I will be deleting this app.","userName":"Faby12086","title":"Horrible App","rating":1,"date":"2020-07-09T03:05:32Z","isEdited":false}},{"id":"6174792808","type":"user-reviews","attributes":{"review":"Before i downloaded the app my phone, ipad, and macbook were working just fine. AFTER THOUGH, all of my devices were GLITCHING, forcing me to spend TWO-HUNDRED DOLLARS to get them all repaired AND I DIDNT EVEN OPEN THE APP. Downloading this app should not have costed me TWO-HUNDRED DOLLARS and i am VERY ANGRY. NEVER AGAIN","userName":"Queen Audrey❤️❤️❤️","title":"‼️⚠️DO NOT GET⚠️‼️","rating":1,"date":"2020-07-09T03:05:10Z","isEdited":false}},{"id":"6174791524","type":"user-reviews","attributes":{"review":"I climbed out of my head and washed myself implode I thought without a body otta be the shot to take a load off my brain is poisoned and I’m searching for the antidote but every time I find it my defenses scream oh no you don’t wœ","userName":"Weee wooi","title":"HORRIBLE APP","rating":1,"date":"2020-07-09T03:04:46Z","isEdited":false}},{"id":"6174775165","type":"user-reviews","attributes":{"review":"I mean I don’t think I really need to write a review on how AWFUL this app is but... let’s just say after being on this app for just one second my toe fell off and now I can’t find my grizzly bear :(","userName":"Gushers4Life","title":"Awful","rating":1,"date":"2020-07-09T02:59:45Z","isEdited":false}},{"id":"6174772273","type":"user-reviews","attributes":{"review":"This app gave my computer a horrible virus, and lied about how much it did malware testing. It said the virus would just go away but it just keeps getting worse actually.","userName":"tronald dump 126482","title":"App is crap","rating":1,"date":"2020-07-09T02:58:52Z","isEdited":false}},{"id":"6174771805","type":"user-reviews","attributes":{"review":"This app is horrible I mean literally. I feel like it speaks for itself how horrible it is. Just reading the title of the app makes me want to throw the whole phone away. Petition for this app to be removed off of the App Store please😴","userName":"Sandy🚗","title":"ThE WORSE APP IVE EVER HAD","rating":1,"date":"2020-07-09T02:58:43Z","isEdited":false}},{"id":"6174762557","type":"user-reviews","attributes":{"review":"This app is horrible! This application made my phone crash 3 TIMES! My phone then blacked out and I saw a chinese man singing a song that goes along the lines of, “Xue hua piao piao bei feng xiao xiao,” It was absolutely scary for me and my family. I WOULD GIVE THIS A 0/5! WOULD NOT RECCOMEND!","userName":"hsjsjsksjpakapaisdnivkname","title":"Horrible app!","rating":1,"date":"2020-07-09T02:55:55Z","isEdited":false}}]}