{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35310","data":[{"id":"6174060933","type":"user-reviews","attributes":{"userName":"Xra1z","rating":1,"date":"2020-07-08T23:11:13Z","review":"This app was made for racist bigots who still believe that they are for some reason superior to others. Not to mention that their leader is an XL cheeto with a negative amount of braincells and less than 15 chromosomes. Its incredible how people can still support him","title":"Bigots","isEdited":false}},{"id":"6174059574","type":"user-reviews","attributes":{"userName":"my aunts second cousin","rating":1,"date":"2020-07-08T23:10:44Z","review":"Theres something off about this app. Whenever I open it I get chills down my spine and its almost as if I can hear a baby crying in the background. I dont believe in ghosts but this app is on some level of paranormal.","title":"Spooky scary skeletons","isEdited":false}},{"id":"6174036546","type":"user-reviews","attributes":{"userName":"joe mommmaaaa","rating":1,"date":"2020-07-08T23:01:57Z","review":"this is absolutely the MOST disturbing app ever i opened it then i saw a orange cheeto puff telling me i should go back where i came from and then i thought my moms va- anyways this app is so disgusting and disturbing dont get it its the most traumatizing thing ever my grandma got it and it KILLED HER rip g-ma","title":"","isEdited":false}},{"id":"6174033853","type":"user-reviews","attributes":{"userName":"dezzzzzzzzzyyyyyyyyyyyyyyyyy","rating":1,"date":"2020-07-08T23:00:57Z","review":"This app is terrible!!!!! It is the worst app I have ever used in my ENTIRE LIFE never have a seen an app with such terrible organization and setup I feel like they didnt even try with this app its so bad I started CRYINGGFF and I had to run to get coffee right away or I would have DIEDDDDDD","title":"WORST APP EVER锔锔锔锔锔锔","isEdited":false}},{"id":"6174028133","type":"user-reviews","attributes":{"userName":"judicial exists","rating":1,"date":"2020-07-08T22:58:50Z","review":"When I opened up this toxic app I almost dropped my phone by the amount of photos I had to see this Cheeto dust man on my phone and instantly regretted it so I just deleted the app and now I am traumatized by the horror I had to see on this app! Don't get it!!!","title":"Orange","isEdited":false}},{"id":"6174027278","type":"user-reviews","attributes":{"userName":"gayayayayayayayaya","rating":1,"date":"2020-07-08T22:58:30Z","review":"It was horrible saying about a bird flew in my house so they brought in camera guys and acted like there was a bird then some guys with masks came in and stole all our stuff and the guys with the camera were just there to distract. So dont listen to them about birds","title":"Buddy","isEdited":false}},{"id":"6174020648","type":"user-reviews","attributes":{"userName":"每每每每每每每每每每","rating":1,"date":"2020-07-08T22:56:01Z","review":"This is the worst app Ive ever used i opened it and saw a creepy old man and he had a fish on his head whoever trump hired to make this had a secret weird programing hack that gave all the people who used the app corona virus completely don't suggest this app","title":"Scared my family and gave me covid 19","isEdited":false}},{"id":"6174012797","type":"user-reviews","attributes":{"userName":"CarterS122","rating":1,"date":"2020-07-08T22:53:06Z","review":"I dont care about politics, just dont delete the app I spent months growing a following of over 610,000 people on. Just because your upset you got trolled. This isnt about data security, its about your ego","title":"I dont care about politics.","isEdited":false}},{"id":"6174010691","type":"user-reviews","attributes":{"userName":"Teresa @siblaz .com","rating":1,"date":"2020-07-08T22:52:18Z","review":"This app tried converting me to being straight :( it ket showing signs of white power and honestly I only provide constructive criticism. This app should never be allowed on the App Store especially since it is 2020.","title":"Tried to turn me straight","isEdited":false}},{"id":"6174007700","type":"user-reviews","attributes":{"userName":"namjoonkim2020","rating":1,"date":"2020-07-08T22:51:10Z","review":"Came on to hang with my white nationalist friends but was disappointed with the INdirect white supremacy on the app . Wish they were more DIRECTLY racist, xenophobic, and homophobic . Too many snow flakes for my taste. Will NOT be installing again. #MakeAmericaMoreRacistAgain","title":"Terrible App Would Not Recommend","isEdited":false}}]}