{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26140","data":[{"id":"6173344750","type":"user-reviews","attributes":{"title":"Make the App Store GREAT Again by removing this!","review":"THIS app is not really great! And I know a lot of great apps. Some of the greatest apps really & I often use some of the greatest apps in the whole world. Apps that are really so  much better than China’s apps. The fake news won’t tell you how bad this app is, but I will!!! \n\n(Warning! This app contains nuts)","date":"2020-07-08T18:52:22Z","rating":1,"userName":"Ms.Jenn_M","isEdited":false}},{"id":"6173336693","type":"user-reviews","attributes":{"title":"Worst app every","review":"This was the worst app I ever seen when I went to the app it’s started showing thing the was unnecessary and I am surprised that apple would lets this on the App Store this was a horrible app the app tried to get me to spend my money I didn’t know the app was for that this was so unacceptable","date":"2020-07-08T18:49:33Z","rating":1,"userName":"ray_2008","isEdited":false}},{"id":"6173332417","type":"user-reviews","attributes":{"title":"Horrible app","review":"i downloaded it. With full excitement of what awaits me, but i was instead met with technical difficulties. Once i downloaded this App i would be randomly kicked out of my other apps. Such as facebook, messenger, and whatsapp. I’m convinced that this app spies on you, and has no proper usage. Don’t download this app!!!!!","date":"2020-07-08T18:48:02Z","rating":1,"userName":"i am the Hannah","isEdited":false}},{"id":"6173321246","type":"user-reviews","attributes":{"title":"Worst app out there","review":"This app is the absolute worst! I took over 3 hours just to download, WOULD NOT stop glitching and it wouldn’t let me open/click/tap on anything. I would not let me see any upcoming events or see anytime else. Poor app, needs to be taken down, not worth downloading","date":"2020-07-08T18:44:15Z","rating":1,"userName":"teeheeiamdora","isEdited":false}},{"id":"6173315272","type":"user-reviews","attributes":{"title":"So bad","review":"This app took forever to download and it immediately asked for my phone number once it opened. Yikes I don’t give out my number at all and it made me feel really uncomfortable. Overall a bad experience and wouldn’t recommend if I could give 0 stars I would.","date":"2020-07-08T18:42:18Z","rating":1,"userName":"itsriccotho","isEdited":false}},{"id":"6173310622","type":"user-reviews","attributes":{"title":"The app","review":"When I was downloading it it took like 20 minutes and my WiFi was fine another problem is it was glitchy plus if I tried to open the app it won’t open but I press another app it will open so overall this is not a good app.","date":"2020-07-08T18:40:47Z","rating":1,"userName":"WHY THE APP IS BAD 101","isEdited":false}},{"id":"6173305379","type":"user-reviews","attributes":{"title":"✨💅bunker boy💅✨","review":"first, it took 2 weeks to download\nsecond, i had to delete all of my other apps to download because of all the space it took up\nthird, the app promotes a campaign that WILL NOT make America great again\nfourth, this country will not become great if it’s run by a cheeto with and ego 10x the size of his microdick","date":"2020-07-08T18:39:07Z","rating":1,"userName":"i cant of a nickname help","isEdited":false}},{"id":"6173304776","type":"user-reviews","attributes":{"title":"Worst app","review":"Right when it downloaded it gave my direct location I was at my grandmas a couple of hours later my grandma called a said that they beat the crap out of her literally she pooped all over her carpet then later passed away due to all the crap please do not download for your grandmas sake😔","date":"2020-07-08T18:38:55Z","rating":1,"userName":"bruvs2020","isEdited":false}},{"id":"6173304698","type":"user-reviews","attributes":{"title":"stupid","review":"THIS APP SUCKKKSSS i tried to download it it took A WHOLE MONTH i was very INPATIENT when i finally opened the app it started blasting music and a bunch of rats appeared IT WAS EEWWWW when i went to the home page there were tons of links to pornhub and i let my five year old monkey on the app and he clicked the link i he was traumatized i HATE this app","date":"2020-07-08T18:38:54Z","rating":1,"userName":"becky111224636","isEdited":false}},{"id":"6173301014","type":"user-reviews","attributes":{"title":"Forever disgusted","review":"The fact that there is now a trump app is blowing my mind. The app it’s self is the nastiest thing I’ve ever seen, other than the president himself, but the comments however probably my favorite part. I just think we all should all rate it 1 star and get it taken down 👍🏼","date":"2020-07-08T18:37:45Z","rating":1,"userName":"ugly orange man has an app","isEdited":false}}]}