{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=34010","data":[{"id":"6174713016","type":"user-reviews","attributes":{"rating":1,"review":"i decided that i wanted to support my president and see what this app was all about. once the app downloaded i looked through the app and it was very nice and look really legit. but i soon notice that my phone began to act weird. my phone would glitch and turn off without me even touching it! it was like my phone was possessed; this went on for about a week and once i deleted the my phone was perfectly fine.","isEdited":false,"title":"don’t do it!","userName":"rulenumberobetobeaboss","date":"2020-07-09T02:40:53Z"}},{"id":"6174704551","type":"user-reviews","attributes":{"rating":1,"review":"This app gave me the flu and I couldn’t walk my pet fish and it was devastating cuz my fish drowned and my pet dino wanted to go for a walk but this app made him eat my pet spoon and the worst part is that I couldn’t water the other how is it supposed to stay moist.!!?!?!!!","isEdited":false,"title":"This is a horrible app","userName":"jsdjdj sjjdnd","date":"2020-07-09T02:38:20Z"}},{"id":"6174698550","type":"user-reviews","attributes":{"rating":1,"review":"This made no sense I literally didn’t even have to open the app just to be completely confused about what is going on in the app. I would not recommend, it is very confusing.","isEdited":false,"title":"Terrible app","userName":"Alalajdkalashskakxn","date":"2020-07-09T02:36:33Z"}},{"id":"6174697606","type":"user-reviews","attributes":{"rating":1,"review":"I was a girl in the village doing alright\nThen I became a princess overnight\nNow I gotta figure out how to do it right\nSo much to learn and see\nUp in the castle with my new family\nIn a school that's just for royalty\nA whole enchanted world is waiting for me\nI'm so excited to be (Sofia the First)\nI'm finding out what being royal's all about (Sofia the First)\nMaking my way, it's an adventure every day (Sofia)\nIt's gonna be my time (Sofia)\nTo show them all that I'm Sofia the First","isEdited":false,"title":"this is for my cheeto looking president🥰","userName":"RoBolxxxxzzz","date":"2020-07-09T02:36:16Z"}},{"id":"6174690916","type":"user-reviews","attributes":{"rating":1,"review":"Right after I download this terrible app I saw this huge orange on the screen and now I have nightmares. In my dreams his name is THE  RACIST ORANGE. It was also glitching a lot and before I got the app my phone was perfectly fine. I would like to recommend to not get this app.","isEdited":false,"title":"WORT APP IN THE HISTORY OF APPS","userName":"lil.kk195","date":"2020-07-09T02:34:16Z"}},{"id":"6174687722","type":"user-reviews","attributes":{"rating":1,"review":"Absolutely the worst app I have ever installed!!! The second I downloaded it, all of the flooring in my beautifully decorated confederate home started to mold and turn into nothing!!!! Now all I have is DIRT! Do! Not! Download! This! App!!!!! Would rate it less if I could.","isEdited":false,"title":"Ruined my flooring!!!","userName":"i eat bootlickers","date":"2020-07-09T02:33:17Z"}},{"id":"6174683496","type":"user-reviews","attributes":{"rating":1,"review":"Before this app my phone was completely fine but when I downloaded it, my phone kept freezing out and would not work for like 8 hours. If you even think about downloading this app, DON’T","isEdited":false,"title":"DO NOT DOWNLOAD","userName":"cherrypoppins372","date":"2020-07-09T02:32:03Z"}},{"id":"6174674051","type":"user-reviews","attributes":{"rating":1,"review":"Once I opened this app it asked for my phone number and it made me uncomfortable then it gave me explosive diarrhea and I got it in my bed. Later on I opened the app again and it gave me dementia. If you are even considering getting this app. DONT!!???!!!?,,???!???!","isEdited":false,"title":"Don’t use this app🤯🤯","userName":"Hugh Jass/Mike hawk","date":"2020-07-09T02:29:15Z"}},{"id":"6174667779","type":"user-reviews","attributes":{"rating":1,"review":"I think maybe I'm unclear on what a \"campaign app\" is supposed to be, or do. But I didn't expect to get scammed out of literally 50,000 dollars and my healthcare because of it :( Very bad, would not download again","isEdited":false,"title":"I just don't understand this app","userName":"Affably Evil","date":"2020-07-09T02:27:28Z"}},{"id":"6174666928","type":"user-reviews","attributes":{"rating":1,"review":"I saw Donald trump once and he told me to go to hell because I wasn’t orange like him he said I need spray tans to go see him but I’m naturally tan I guess he only likes orange people he also said I need to get a life and a touch up on my hair so It can be platinum blonde.  very traumatizing","isEdited":false,"title":"Trumps rude.","userName":"nsndjjdjwka","date":"2020-07-09T02:27:13Z"}}]}