{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=79080","data":[{"id":"6175036141","type":"user-reviews","attributes":{"review":"this app made my phone glitch and it deleted all the information on my phone!!!!! i’ve very upset and i hope this app is deleted!","title":"this app is trash","userName":"jeyanal","date":"2020-07-09T04:19:07Z","isEdited":false,"rating":1}},{"id":"6175018773","type":"user-reviews","attributes":{"review":"This app is horrible!! It spit on face and called me broke. It also burned my grandmas wig on fire. It’s literally the worst app ever, DO NOT RECOMMEND!!","title":"No!!! 🥰🦄✨🌈","userName":"angieparangueo","date":"2020-07-09T04:13:37Z","isEdited":false,"rating":1}},{"id":"6174995015","type":"user-reviews","attributes":{"review":"They told me to leave this country I also got called Dora","title":"Not it sis","userName":"Juliana__g4","date":"2020-07-09T04:06:01Z","isEdited":false,"rating":1}},{"id":"6174991967","type":"user-reviews","attributes":{"review":"Literally garbage , the bare minimum and gives off SDE🤮","title":"Awful app for an awful president","userName":"omg986","date":"2020-07-09T04:05:03Z","isEdited":false,"rating":1}},{"id":"6174970330","type":"user-reviews","attributes":{"review":"This app makes fell dirty and I do not want children to see what people post on this app.","title":"Dirty","userName":"bigcheeks35","date":"2020-07-09T03:58:10Z","isEdited":false,"rating":1}},{"id":"6174968783","type":"user-reviews","attributes":{"review":"Disgusting hateful and made my phone explode after downloading","title":"What a loser","userName":"gehdkgopfn","date":"2020-07-09T03:57:41Z","isEdited":false,"rating":1}},{"id":"6174955137","type":"user-reviews","attributes":{"review":"this app is a disgrace to apple. DO NOT DOWNLOAD. it will cause phone crashes and your screen fogs up.","title":"😤😤","userName":"Loving Niall123","date":"2020-07-09T03:53:23Z","isEdited":false,"rating":1}},{"id":"6174932100","type":"user-reviews","attributes":{"review":"THIS APP IS HORRIBLE! I was looking to download a good app and all I got was a glitchy piece of crap. It glitched right away. Laying in the bed that I made all alone Guess I'm not surprised honestly Praying in my head that you stayed and I hope You'll miss me eventually  People wanna talk when I'm not around to hear Really, they don't know what I'm made of People keep on walking so far away from here Clearly I'm the one they're afraid of  One after another, they've always come and gone So what if I'm the monster that's been here all along? They're dropping like flies whenever I'm around So used to goodbyes, there's comfort in the sound Maybe I'm the monster that's been here all along  Bend until you break and you can't take anymore I'm not worth the trouble it seems I would say you're wrong, but I've been here before You won't be the last one to leave  People wanna talk when I'm not around to hear Really, they don't know what I'm made of People keep on walking so far away from here Clearly I'm the one they're afraid of  One after another, they've always come and gone So what if I'm the monster that's been here all along? They're dropping like flies whenever I'm around So used to goodbyes, there's comfort in the sound Maybe I'm the monster that's been here all along  You're safe here No need to run and hide Underneath your cover now Don't be scared There's nothing left inside Since you ate my heart out  One after another, they've always come and gone So what if I'm the monster that's been here all along? They're dropping like flies whenever I'm around So used to goodbyes, there's comfort in the sound Maybe I'm the monster that's been here all along","title":"HORRIBLE!","userName":"dream....zlp","date":"2020-07-09T03:46:16Z","isEdited":false,"rating":1}},{"id":"6174931030","type":"user-reviews","attributes":{"review":"I was a girl in the village doing alright but then I got this app and wanted to kms over night ✨🧚‍♀️💞","title":"Terrible","userName":"ndjdncnkvkv","date":"2020-07-09T03:45:56Z","isEdited":false,"rating":1}},{"id":"6174929213","type":"user-reviews","attributes":{"review":"This app promotes very hateful messages of inequality and racism. Very disgusting! I will not be voting for this man. Get him out of office! Horrible app","title":"No","userName":"bigorangehead","date":"2020-07-09T03:45:20Z","isEdited":false,"rating":1}}]}