{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38510","data":[{"id":"6174716658","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Horrible","review":"So guys we did it we reached a quarter of a million subscribers 250 thousand subscribers and still going. The fact that we reached this goal is just just phenomenal. I forgot the rest of the copypasta. Anyways F Trump. Don’t let this man have any power","date":"2020-07-09T02:41:59Z","userName":"Poo poo garbage"}},{"id":"6174701511","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Don’t get the app","review":"As soon as I opened the app my phone glitches,overheated, and blew up. I had to buy a whole new phone. 1 Star do not recommend. Don’t make the same mistake I did by getting this app","date":"2020-07-09T02:37:26Z","userName":"Alltheniknamesaretaken"}},{"id":"6174701042","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Terrible","review":"This app has paralyzed me!!! And that’s not even the worst! It took 2 days to download and every time I tried to sign in it spawned a cat in front of me!!! I hate it. I thought trump 2020 was a good app. Turns out those “ unruly kids”, are right!!!!! DONT GET THIS APP. IT IS TERRIBLE!!!!!","date":"2020-07-09T02:37:17Z","userName":"isejc"}},{"id":"6174696791","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Don’t download","review":"The app keep telling I’m a n*gger and never will be anything. Plus it kept glitching and detected I was black and wanted me to go the the rally and pay me $100 for 10 hours. I don’t recommend this app at all","date":"2020-07-09T02:36:01Z","userName":"wickfnnsm"}},{"id":"6174696404","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"DO NOT DOWNLOAD","review":"This app will kill your whole family (including pets) it will steal all your money and will take all of your food. SAYING THIS FROM EXPERIENCE. I loved my pet dinosaur but once I downloaded this app he disappeared 😥so please I’m trying to protect you DO NOT DOWNLOAD THIS APP! thank you.","date":"2020-07-09T02:35:53Z","userName":"cherry blossom cheral"}},{"id":"6174691244","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Never again","review":"I’d like to sue for the amount of gravestones I had to buy for all the brain cells this app has killed for me. It’s tragic really I’ll never see them again all because this president made this app 😔 no forgiveness #Dump Trump","date":"2020-07-09T02:34:21Z","userName":"SunnySouf"}},{"id":"6174689680","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Awful","review":"I hate everything about this app, it’s insensitive, rude, unhelpful, glitchy, and will literally steal your money. I wouldn’t recommend this app to anyone except for maybe the devil so he has a new torture method down in hell","date":"2020-07-09T02:33:53Z","userName":"c_\\|"}},{"id":"6174689238","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"HORRIBLE","review":"This app stole my identity and proceeded to buy an enormous amount of dog treats. I didn’t even get any dog treats!!! If I got the dog treats I wouldn’t have been so angry, but the DISRESPECT for me to not obtain them... absolutely horrible experience. If I could, I’d rate it a 0/5 of stars but I guess a star is satiable.","date":"2020-07-09T02:33:45Z","userName":"leclairrain"}},{"id":"6174687202","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Awful app!","review":"If I could app zero stars, I would! It promotes violence and incites riots. Just having it on my phone made my phone angry and sprout legs and run around until I deleted it! Awful and glitchy, do not recommend! 🤬","date":"2020-07-09T02:33:07Z","userName":"JaybirdFeathers"}},{"id":"6174681220","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Horrible App","review":"This app is not for anyone it has threatened my family member that used it it is just a terrible app it has thought people to be racist and support bad people this app should be taken down","date":"2020-07-09T02:31:21Z","userName":"apshan"}}]}