{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=138490","data":[{"id":"6179736409","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:40Z","userName":"CheshireCat707","title":"This Dumb a**","review":"I wish this orange faced, pig nosed, racist donkeys rear end would have a heart attack like at the end of the Simpsons. If he bans tick tock I swear I will spray some disinfectant in his brain. Maybe that would clear his head of all that bull shirt. BLM and to anyone reading this (unless your a trump supporter... or a racist... or homophobic) have a wonderful day. Duck this app and the man himself."}},{"id":"6179736365","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:39Z","userName":"taytaybloom","title":"Honestly Trash","review":"I honestly feel so bad for the Cheetos brand because this man is doing them a disservice. Actually he is the disservice to America. But also are we not gonna talk about how this Cheeto puff is basically a realtor so all he does is buy and sell. Therefore he is selling America to the highest bidder. Not to mention that his OWN MOTHER said that she hopes he didn’t get into politics. Need I say more."}},{"id":"6179736037","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:32Z","userName":"mysterious_scarlett","title":"WORST APP EVER DONT GET IT🤮🤮","review":"So I downloaded this app to see what all the fuss was all about. When I opened the app my phone crashed. I thought nothing of it but when I turned on my phone my wallpaper was changed to A CHEETO!!! ALL MY APPS WERE GONE!!! MY CONTACTS TOO!!! AND I KEPT GETTING SPAM CALLS!!! THEN SOMEBODY RANG MY DOORBELL, I WENT TO OPEN IT AND IT WAS A PIG IT GRABBED MY WEAVE AND DRAGGED ME ALL AROUND MY HOUSE THEN IT PICKED ME UP AND THROUGH ME TO SATURN THEN I FLEW BACK AND MY HOUSE WAS A CHEETO AND THERE WERE PIGS AROUND IT!!!!! DONT EVER DOWNLOAD THIS APP I HAVE PTSD😭😭😡🤮"}},{"id":"6179736016","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:31Z","userName":"boomingtrash","title":"Bad","review":"As trump once said \nFake news"}},{"id":"6179735720","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:24Z","userName":"fdayutaaf","title":"Worst app!","review":"Worst app! Get this man outta here 😭"}},{"id":"6179735653","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:23Z","userName":"_samantha:/","title":"awful","review":"i downloaded the app to see what donald trump was doing and to see just what his administration is like. it’s the absolute worst, the app is so confusing and difficult to use. and when i figured out how to use the app, i saw a button that was only blue and i pressed it and then my phone exploded. i went outside to tell my dad but then i saw a giant sea monster in my pool. the app released a monster and honestly i’m not quite sure how to get rid of it. donald trump is obviously evil and does dark magic, he needs to be stopped."}},{"id":"6179735498","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:19Z","userName":"#VoteTrumpOut","title":"Glitchy/Not Working","review":"The app needs to be taken down. It’s glitchy and doesn’t work properly! When I try to click on something of takes me to a black screen. Help!!!"}},{"id":"6179735449","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:18Z","userName":"Don the Dump Truck","title":"This app gave me an aneurysm","review":"I tried to make sense of Trump logic and had an aneurysm... 10/10 would not recommend and it took forever to download... super long aneurysm"}},{"id":"6179735388","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:16Z","userName":"that guy on tik tok","title":"I HATE IT HERE","review":"i hate it here"}},{"id":"6179735361","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T06:13:16Z","userName":"Maheen Saza","title":"Don’t enter your Phone number.","review":"As soon as I entered in my phone number I started receiving threatening phone calls from the president, he kept saying he was going to attack me but I thought it was all fun and games. A few days went by and I heard loud banging on my front door, not knowing what to expect I opened the door only to be drop kicked by President Trump. I fell to the ground screaming in pain while he started laughing hysterically and spraying silly sting all over me. As I pleaded for help he had his babysitter Kayleigh McEnany bring his afternoon snack for him. As He munched on his lunchable Cheese and crackers I laid on the floor covered in silly string with my whole body aching after taking a blow to the stomach from a 439 pound President. Just as I thought this nightmare was over my 6 year old brother arrived home from school and as soon as President Trump caught sight of him he started calling him names teasing him and making fun of him. My brother started crying feeling helpless and that is when President Trump ordered his staff to silly string my brother along with me. The two of us suffered as President Trump skipped thought my house (denting the wooden floors and staining the walls orange) and headed back to the White House. My brother and I are still trying to recover from that traumatic experience."}}]}