{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33930","data":[{"id":"6176232166","type":"user-reviews","attributes":{"title":"Very terrible","isEdited":false,"date":"2020-07-09T11:15:14Z","review":"This app will not work it gave me some ads and I have to pay just to look at the full articles please don’t use this app it is useless go jack off or something","userName":"jfnem2","rating":1}},{"id":"6176190065","type":"user-reviews","attributes":{"title":"worst app ever","isEdited":false,"date":"2020-07-09T11:02:25Z","review":"it brought roaches in my house, made me go back to my ex after he cheated on me 15 times with our house cat, got my house towed, made me 2nd baby daddy leave me for his wife & made me leave someone who actually loves me for my toxic ex DONT GET THE APP it’s very bad for your mental health","userName":"annony26","rating":1}},{"id":"6176108373","type":"user-reviews","attributes":{"title":"WORST APP EVER","isEdited":false,"date":"2020-07-09T10:37:02Z","review":"it took 4 hours to download, but that’s only the beginning. it then starting putting all these viruses on my phone after. now i keep on getting spam emails that my all my devices have been compromised.","userName":"urmom$1@&88-&/&&8","rating":1}},{"id":"6176086202","type":"user-reviews","attributes":{"title":"Hacked","isEdited":false,"date":"2020-07-09T10:30:06Z","review":"I was getting this app to support the reincarnation of Hitler we all know and love, Donny boy, when I was hacked directly after installing the app. The amount of time the app actually worked was as small as his orange eraser cap dick- very disappointing. Would not recommend.","userName":"Dice 5","rating":1}},{"id":"6176073659","type":"user-reviews","attributes":{"title":"This app is bad","isEdited":false,"date":"2020-07-09T10:26:02Z","review":"This app took a month to download when I opened it it had a death note saying we are going to take down tik tok and your going to get deported by ice and they are going to show up at your house with guns loaded and ready to shoot","userName":"mike wazaski","rating":1}},{"id":"6176066574","type":"user-reviews","attributes":{"title":"If I could burn an app I would","isEdited":false,"date":"2020-07-09T10:23:45Z","review":"There isn’t really much else to say this is the worst app ever created in app history. I opened it and it already had  death threats to me and my whole family as well as anyone who was morally stable","userName":"Bestgameever😆","rating":1}},{"id":"6176044149","type":"user-reviews","attributes":{"title":"UGHH DO NOT GET THIS APP","isEdited":false,"date":"2020-07-09T10:16:28Z","review":"i came here to support my wonderful beautiful perfectly tanned president and the all took 7 HOURS to download. WTH! and after it downloaded, ads kept popping up on my phone and my phone started turning off randomly! im SO disappointed in this app!","userName":"lorrweenie","rating":1}},{"id":"6175943062","type":"user-reviews","attributes":{"title":"Deported","isEdited":false,"date":"2020-07-09T09:43:52Z","review":"I downloaded this app and I’ve was called instantly and now I’ve been deported to Mexico and have been living off a cows titty milk for several days in this farm because I have nowhere to go and have no idea where I am please send help","userName":"DeportedBeaner#28408","rating":1}},{"id":"6175912903","type":"user-reviews","attributes":{"title":"Trash","isEdited":false,"date":"2020-07-09T09:33:43Z","review":"This is the worst app ever. It wouldn’t even let me go on there and it started glitching as soon as I got on there after 2 hours of trying. Then it started lagging me out of the app and then my entire phone started lagging.","userName":"ᏣᎳᎽ","rating":1}},{"id":"6175840740","type":"user-reviews","attributes":{"title":"BOO🤏🖕👎","isEdited":false,"date":"2020-07-09T09:09:40Z","review":"this app is the absolute worst. I downloaded it too support my favorite president but as soon as i downloaded it they asked me for nudes and ofc i sent them and then they exposed me!!🙀 I later got crabs and they stole my cat and said they wouldn't give it back unless i voted for trump. Kanye 2020✨✨","userName":"Jo O.","rating":1}}]}