{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23230","data":[{"id":"6175208094","type":"user-reviews","attributes":{"review":"My alligator does not approve of such things being on the App Store. I went to Walgreens and got some Twix candies so Margret was much better at playing Scrabble. I went through a lot to do what they had to accomplish yet we are still in the works of doing something epic.","userName":"GuyWhoLikesSpace","title":"I downloaded this app and immediately threw up. Sad!","isEdited":false,"rating":1,"date":"2020-07-09T05:16:10Z"}},{"id":"6175157357","type":"user-reviews","attributes":{"review":"My dog was on this app and it was just the worst. My dad just said he was going for milk but he hasn’t came back he left at 4 am and said that he would be back in one hour and it’s bin 15 hours. Y’all I’m just chillin was tryna a great 👍🏼 is your day you going home tomorrow ima just got to do the same things for you ok thx bye","userName":"follow me on tick tock 48.user","title":"Worst app EVER🤩","isEdited":false,"rating":1,"date":"2020-07-09T04:58:13Z"}},{"id":"6175124844","type":"user-reviews","attributes":{"review":"so i woke up and saw that this app was magically downloaded onto my phone. I was kinda confused but whatever. I opened up the app and it completely shut down my entire phone. Once my phone turned back on it said I couldn’t get into my phone because I wouldn’t send pics 👀👀 therefore 1 star","userName":"@lily.marie82","title":"WORST APP EVER","isEdited":false,"rating":1,"date":"2020-07-09T04:47:17Z"}},{"id":"6175088368","type":"user-reviews","attributes":{"review":"THIS APPLICATION PROGRAM GAVE MY IPHONE 69 VIRUSES! I mean, how do you recover from that? Had to buy a whole new phone, because it was just unfixable. Not to mention the demonic entity that’s been following me the past week. He just keeps yelling “trump 2020! Bring back the evil times!” it’s getting on my nerve. Can’t someone give me a cleansing or something in compensation?","userName":"hoodie-01","title":"AWFUL","isEdited":false,"rating":1,"date":"2020-07-09T04:35:27Z"}},{"id":"6175080735","type":"user-reviews","attributes":{"review":"this app is terrible!!! i got on it and all of the sudden my phone was ringing nonstop!! i can barely write this review because i have to keep denying phone calls! they will leak your number and you will have to keep declining phone calls! i can’t sleep more than 5 minutes!! what is this trash!!!","userName":"acabfdt2020","title":"SO BAD!!","isEdited":false,"rating":1,"date":"2020-07-09T04:33:02Z"}},{"id":"6175065551","type":"user-reviews","attributes":{"review":"when i opened this app the first thing that happened was a tiny robot crawled out of the speakers and proceeded to completely and utterly demolish my fridge by first taking it apart piece by piece and then consuming those individual pieces and then after that devil monster of a robot ate my fridge it moved onto my cats and even my grandfather DO NOT DOWNLOAD OF YOU VALUE YOUR FRIDGE OR GRANDFATHER!!!!!!!","userName":"Ameliaavd","title":"dirty no good fridge steeling app","isEdited":false,"rating":1,"date":"2020-07-09T04:28:15Z"}},{"id":"6175053827","type":"user-reviews","attributes":{"review":"this app is so terrible it’s not even funny. it completely glitches my phone let alone it has trumps ugly face all over it. remove this now it makes ur phone slow and glitchy and it ALSO shows pictures of trumps disgusting self all over it!❤️❤️much love- delete this app now.","userName":"dncndjnfoapfmfkrjakdnfndnd","title":"worst app ever","isEdited":false,"rating":1,"date":"2020-07-09T04:24:39Z"}},{"id":"6175034379","type":"user-reviews","attributes":{"review":"I was a little hesitant to download this app after seeing all the negative reviews but I still decided to give it a try. Shortly after downloading it my phone restarted itself and booted me off all my apps once I turned it back on. Don’t get this app. You’ve been warned.","userName":"Drayya_","title":"Zero stars if I could","isEdited":false,"rating":1,"date":"2020-07-09T04:18:35Z"}},{"id":"6174987015","type":"user-reviews","attributes":{"review":"The Quality of his merchandise is horrible like all the stuff feels cheap and it’s just a and when I ordered a shirt it didn’t come until this year when I ordered last year and the shirt is really itchy to like it’s not comfortable at all so I do not recommend buying anything from Donald Trump","userName":"haikyuu!!!","title":"Horrible review","isEdited":false,"rating":1,"date":"2020-07-09T04:03:28Z"}},{"id":"6174968429","type":"user-reviews","attributes":{"review":"This app is awful. It does not function effectively. It is super glitchy and made my whole phone run super slow. It is not user friendly. Ever since I downloaded this app a picture of The Rock keeps showing up in my camera roll and WON’T go away. I can’t stand it!","userName":"Bellapizazz","title":"Ruined my phone","isEdited":false,"rating":1,"date":"2020-07-09T03:57:35Z"}}]}