{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=18300","data":[{"id":"6178250923","type":"user-reviews","attributes":{"review":"horrible app- extremely messy and just horrendous. needs to be deleted off of the app store! It took FOREVER to download and it didn’t even work when i did receive it! it crashes all the time and it is quite inappropriate, i expect more from the app store and apple. this app is horrible and shouldn’t be expected to be used by others.","userName":"itskatieeeew","title":"WORST APP EVER","rating":1,"date":"2020-07-09T21:09:07Z","isEdited":false}},{"id":"6178212716","type":"user-reviews","attributes":{"review":"I bought the app just to see the campaign and what he is up to, but right when I bought the app I started getting loads and loads of spam emails. Then it got worse I started reserving calls from people I don’t know. Another thing I dislike is it says make America great again but he is just digging a deeper hole to put us in.","userName":"bprr","title":"Worst app ever!","rating":1,"date":"2020-07-09T20:55:25Z","isEdited":false}},{"id":"6178166391","type":"user-reviews","attributes":{"review":"This app is so poorly made. Terrible. Who ever made this needs to be fired. It is embarrassing. This app is so meaningless, it does not provide anything more than what you could look up and that would just be easier to do and less time consuming. Awful app, waste of space. Would give 0 stars if that was possible. -1 at that.","userName":"Puff7777777","title":"Trash","rating":1,"date":"2020-07-09T20:39:17Z","isEdited":false}},{"id":"6178164692","type":"user-reviews","attributes":{"review":"I downloaded the app in hopes of learning more about trump and his upcoming events and instead was very dissatisfied! Every time i opened the app it would close and then crash! It began to glitch whenever I try to look at it and would turn my screen black! I was really expecting the best from the best but was rather given the upmost worst !","userName":"hula2002","title":"Sad day!","rating":1,"date":"2020-07-09T20:38:41Z","isEdited":false}},{"id":"6178160649","type":"user-reviews","attributes":{"review":"I got this app because I read a review that you cannot read anything because it’s so orange. I was doubtful at first so I got it. Let me tell you, I was SHOCKED shocked at how orange the app was. I can’t read anything because it was so burnt orange like a really really bad tan. Worst app ever. I hate it. I don’t even like the color orange. It’s so bad I almost threw up on my bed. This is ✨horrible✨.","userName":"barron hehe","title":"This is ✨horrible✨","rating":1,"date":"2020-07-09T20:37:19Z","isEdited":false}},{"id":"6178151553","type":"user-reviews","attributes":{"review":"NO NOT DOWNLOAD!!! The app took about a day to download, and I was immediately greeted with a cache of images that were HORRIBLE, one of which was an orange looking man with a horrendous hair style. I was repeatedly sent messages that were suggesting that I inject bleach into my blood stream. Only download this app if you want to die. It should be deleted immediately for the sake of all man kind.","userName":"✨this app is bäd💫✨","title":"Utterly disappointing","rating":1,"date":"2020-07-09T20:34:08Z","isEdited":false}},{"id":"6178144492","type":"user-reviews","attributes":{"review":"This app is awful, slow, offensive, there’s no fact checks on anything, and also he’s literally a reincarnation of H*tler so maybe we take his propaganda app down. This app is horrible. Trump is horrible. Trump is a racist, xenophobic, sexist, misogynistic, classist, elitist, dumb idiot and he does not need more than the platform he already has. This app is stupid and pointless and it doesn’t work at all.","userName":"Lovedove95","title":"Bad App","rating":1,"date":"2020-07-09T20:31:47Z","isEdited":false}},{"id":"6178124270","type":"user-reviews","attributes":{"review":"The worst app I’ve ever used. The interface is not user friendly at all, it looks like it was designed by a fifth grader. No real information, just a lot of words that were not cohesive. Was this app created by monkeys? I just don’t understand how he plans to run a country when he can’t even operate a simple phone app. It’s sad. I am disgusted.","userName":"Littlechiefbunkerbitch","title":"Absolutely atrocious","rating":1,"date":"2020-07-09T20:24:58Z","isEdited":false}},{"id":"6178119248","type":"user-reviews","attributes":{"review":"My phone shut off every time I tried to open the app. I almost had to get a new phone because it wouldn’t turn back on. Thankfully I got it back on and deleted the app immediately. Then my phone was working just fine. I don’t recommend this app. I would’ve given it zero stars if I could.","userName":"dallas057","title":"Awful app","rating":1,"date":"2020-07-09T20:23:15Z","isEdited":false}},{"id":"6178117808","type":"user-reviews","attributes":{"review":"Honestly I was really looking forward to using this app. But as soon as I opened the app, I immediately just lost all my brain cells. Might be from the limited vocabulary in the app in order for Donald to be able to use it. Or because it’s because this app is for the most narcissistic, ignorant, and racist person to ever hold public office.","userName":"Steven.Abeyta","title":"Worst app I have ever used","rating":1,"date":"2020-07-09T20:22:46Z","isEdited":false}}]}