{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42750","data":[{"id":"6174750566","type":"user-reviews","attributes":{"userName":"bxjdmdj hhc","title":"Horrible","isEdited":false,"date":"2020-07-09T02:52:17Z","rating":1,"review":"Absolutely AWFUL. The layout, the colors, the pictures. A SHAME. I almost gagged just looking at it. Not for the weak hearted or anyone for that matter. Should be banned and deleted immediately!"}},{"id":"6174750551","type":"user-reviews","attributes":{"userName":"davehashsiryballs420","title":"DONT DOWNLOAD","isEdited":false,"date":"2020-07-09T02:52:16Z","rating":1,"review":"My phone kept glitching and freaking out everytime I opened it and basically I’d get notifications like every 5 minute and it is the most annoying thing ever."}},{"id":"6174750047","type":"user-reviews","attributes":{"userName":"loser baby daddy","title":"Trash app😪","isEdited":false,"date":"2020-07-09T02:52:07Z","rating":1,"review":"This app keeps glitching and stuff. It’s annoying and it looks like it was made by a kid. It won’t stop taking my battery and draining it, now I have to charge while playing it dumb. FIX THIS APP"}},{"id":"6174745767","type":"user-reviews","attributes":{"userName":"tiktoksentmehere2020","title":"Worst app ever","isEdited":false,"date":"2020-07-09T02:50:50Z","rating":1,"review":"Downloaded it and next thing I know it was calling me a n*gger, telling me if I don’t like the country to leave, and then saying that I was a thug and criminal all while asking for my support for the 2020 elections"}},{"id":"6174738149","type":"user-reviews","attributes":{"userName":"Anavictoria17","title":"I would rather chop off my own hands than use this app","isEdited":false,"date":"2020-07-09T02:48:29Z","rating":1,"review":"This app is so terrible that It gave me corona just from the contact. I wouldn’t risk it the president uses this app to spy on your phone."}},{"id":"6174737583","type":"user-reviews","attributes":{"userName":"im always a barbz","title":"Worst app ever!!","isEdited":false,"date":"2020-07-09T02:48:18Z","rating":1,"review":"This app is literally the slowest thing ever and the trump administration were making fun of me for being a mexican female they were telling me to go back to my country and that all i’m good for is cooking and cleaning! hate it here❤️"}},{"id":"6174736539","type":"user-reviews","attributes":{"userName":"Dowork!!!","title":"worst app TO EVER EXIST!!!!","isEdited":false,"date":"2020-07-09T02:47:59Z","rating":1,"review":"this app will steal your dog, break your ribs, and take you significant other!!! i cant believe how HORRIBLE this app was to me!! i am absolutely disgusted at the things this app said to me. it called me fat, ugly, stupid, and many more offensive things! DO NOT DOWNLOAD THIS APP!!!!!!!!!!!!"}},{"id":"6174736586","type":"user-reviews","attributes":{"userName":"oh_hello_there_","title":"Horrible app","isEdited":false,"date":"2020-07-09T02:47:59Z","rating":1,"review":"As soon as I downloaded the app my phone started to glitch, the notifications always came late. Now my poor phone is traumatised.."}},{"id":"6174735767","type":"user-reviews","attributes":{"userName":"Not CLOTHES","title":"Hazard Warning ⚠️","isEdited":false,"date":"2020-07-09T02:47:44Z","rating":1,"review":"As soon as I downloaded this app, my skin begin to turn orange and I could not get it off! Luckily your skin turns back to normal when you give this a app a 1 star and delete it 🧚‍♂️✨"}},{"id":"6174732413","type":"user-reviews","attributes":{"userName":"bcuendbzj","title":"absolute worst app","isEdited":false,"date":"2020-07-09T02:46:45Z","rating":1,"review":"I really wanted to like this app as I was hoping to keep up with this year’s election, but it’s terribly slow and glitchy. Not user friendly at all. It’s also rlly ugly just like the president 🤡"}}]}