{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=80800","data":[{"id":"6173988703","type":"user-reviews","attributes":{"date":"2020-07-08T22:43:59Z","rating":1,"title":"Awful","review":"This app is bad very bad awful horrible","isEdited":false,"userName":"hooberboober"}},{"id":"6173984832","type":"user-reviews","attributes":{"date":"2020-07-08T22:42:27Z","rating":1,"title":"No❤️","review":"Who designed this app?? This has got to be the worst app on the App Store! Me when I opened the app: 👁👄👁......🤮🤮","isEdited":false,"userName":"bruh728940@2718039;&838!;"}},{"id":"6173981666","type":"user-reviews","attributes":{"date":"2020-07-08T22:41:17Z","rating":1,"title":"bad app overall","review":"this app has caused my grandma to have a seizure and now she won’t wake up and the hospital isn’t taking any cases besides covid. i almost had one myself","isEdited":false,"userName":"brisyuh"}},{"id":"6173970666","type":"user-reviews","attributes":{"date":"2020-07-08T22:37:05Z","rating":1,"title":"worst app","review":"ok so im here because this app is total garbage not only is the person who its for a bad person, but the app looks ugly and i could go without it existing. i really could. anyway, stan bernie ❤️","isEdited":false,"userName":"hasjebeisneksnsksndd"}},{"id":"6173961297","type":"user-reviews","attributes":{"date":"2020-07-08T22:33:38Z","rating":1,"title":"Horrible","review":"This app looks horrible. The outline of it all is not suited for what it’s meant for.","isEdited":false,"userName":"Fuzi0nF0x"}},{"id":"6173942485","type":"user-reviews","attributes":{"date":"2020-07-08T22:26:31Z","rating":1,"title":"Littlecheetopuffhater","review":"I downloaded this app to see a walking cornstalk -","isEdited":false,"userName":"littlecheetopuffhater"}},{"id":"6173936274","type":"user-reviews","attributes":{"date":"2020-07-08T22:24:11Z","rating":1,"title":"0/10 app","review":"My phone exploded as soon as Cheeto mans face appeared in the home screen of this app.","isEdited":false,"userName":"jenni taals"}},{"id":"6173935578","type":"user-reviews","attributes":{"date":"2020-07-08T22:23:55Z","rating":1,"title":"terrible app","review":"horrible app is super slow and sends you way too many notifications. also donald trump is a white supremacist. if you vote for him, you’re a white supremacist","isEdited":false,"userName":"barr0ntrump"}},{"id":"6173929984","type":"user-reviews","attributes":{"date":"2020-07-08T22:21:54Z","rating":1,"title":"I’m so scared right now HELP","review":"So when I first installed this app I didn’t expect something bad, but when It finish installing, I opened it to see a orange Cheeto, I was so confused but before I got the chance to figure out what it was I heard a tapping on the window. When I looked at the window I saw an orange Cheeto looking at me! At that point I started to run to my front door but I couldn’t find the keys, before I realized, they had turned into a orange Cheeto! I tried to break open the door but It was too late! I heard glass shatter and foot steps coming my way so I realized the best option was to break a window and run as far as I could! I found a vase and threw it to the window! I climbed out and ran too the abandoned house next door. I entered the house and there was no sign of the big Cheeto, but I knew it was best to hide and called the police. I found a a closet in one of the rooms but before I closed the door I saw the whole room turn into a Cheeto except the closet. I shut the doors and started looking for the calling app but something was off about it, the app picture turned into a Cheeto and before I knew it most of my apps turned into a Cheeto except for tiktok and the App Store. When I was about to click on tiktok i felt my leg turned into a Cheeto, so I got an idea “what if I delete the app” I thought it was a great idea so I did. When I deleted nothing happened. I tried again and again but it didn’t work. Now, I only have one arm and my head I’ve been watching tiktok cause I knew that nothing would work. I took these last few mins to tell the person reading this to not download the app unless you want to turn like me.","isEdited":false,"userName":"hjghid"}},{"id":"6173929356","type":"user-reviews","attributes":{"date":"2020-07-08T22:21:38Z","rating":1,"title":"disgusting","review":"when i opened the app i saw the most disturbing thing ever. not going to go into details because of how horrific it was. i never will recommend this app to someone ever .","isEdited":false,"userName":"cambbg"}}]}