{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28500","data":[{"id":"6174689669","type":"user-reviews","attributes":{"title":"Absolutely awful app","date":"2020-07-09T02:33:53Z","userName":"Leahacts2","review":"I cannot believe that I spent time on this. The graphics were glitching, it made my phone slow, and there was a bright orange Cheeto on my screen when I opened the app. DO NOT DOWNLOAD. I could’ve spent my time on much better things. Like tik tok for example. Go gen Z!!","rating":1,"isEdited":false}},{"id":"6174684445","type":"user-reviews","attributes":{"title":"worst app ever","date":"2020-07-09T02:32:19Z","userName":"LizzVicious","review":"rapist app. downloaded it and my phone immediately fell into my crotch and started vibrating incessantly. I grabbed my phone and shut it off immediately. \n\nWhen I turned it back on the app opened automatically and started screaming slurs at me. \n\n0/10 do not recommend.","rating":1,"isEdited":false}},{"id":"6174675377","type":"user-reviews","attributes":{"title":"ew","date":"2020-07-09T02:29:39Z","userName":"babyrubberduckie","review":"ough i thought this would be a good app❤️ but ever time i open it the spider on my wall starts having seizures and collapsing😰 and i blame YOU mr trump i really expected better from you but than i realized that i can’t blame you because that’s like blaming a child except ur dump SO I DO YOU KILLED MY SPIDER MEANIE😓would give a 0 if i could💖xoxox","rating":1,"isEdited":false}},{"id":"6174673778","type":"user-reviews","attributes":{"title":"Terrible App!!!","date":"2020-07-09T02:29:10Z","userName":"GravityGum","review":"Immediately after downloading this app, my phone crashed! I had to buy a whole new one. I tried downloading the app again on my new phone to support my ✨beloved president ✨ and that one crashed too. Here I am three phones in, barbecue sauce on my tiddies, and rage in my heart.","rating":1,"isEdited":false}},{"id":"6174662566","type":"user-reviews","attributes":{"title":"Glitch!!!","date":"2020-07-09T02:25:59Z","userName":"Fifirod22","review":"I barely even got onto the app and it started glitching! Not only did the app glitch my phone has been glitching since I closed it! There might be a virus somewhere on the app I would not recommend downloading it unless you want to get a virus!","rating":1,"isEdited":false}},{"id":"6174662367","type":"user-reviews","attributes":{"title":"This is such a HORRIBLE app. Not worth my space","date":"2020-07-09T02:25:55Z","userName":"HAGEJSJ","review":"I downloaded this app. And after 30 minutes my phone started glitching. Then I got a text from a 68 year old man asking for nudes. It has put me in a danger. I HATE IT!! Donald needs to me impeached because of how his terrible app has impacted my phone. APPLE STORE DELETE THIS APP NOW!! Or I’m suing.","rating":1,"isEdited":false}},{"id":"6174649969","type":"user-reviews","attributes":{"title":"the glitches","date":"2020-07-09T02:22:17Z","userName":"dadddddyyyyy666","review":"this app is HORRIBLE, every time i open this app i have to reset my phone!! everything freezes. the pop up adds are overkill. everything about this app is awful. the bugs are running rampant on it!!","rating":1,"isEdited":false}},{"id":"6174640945","type":"user-reviews","attributes":{"title":"Trump is a rapist","date":"2020-07-09T02:19:46Z","userName":"bloopbloop botch","review":"This app is trash let me tell you why so last night I had a dream of a African brother dancing with mosquitos and lions then all of a sudden trump came and started putting them in handcuffs and making them slaves he then took the children and raped them and he also raped the mosquitoes and lions","rating":1,"isEdited":false}},{"id":"6174627744","type":"user-reviews","attributes":{"title":"Don’t recommend","date":"2020-07-09T02:15:58Z","userName":"Becky free","review":"the app is very slow and i’m pretty sure it messed up my phone because it’s not working properly and very slow. save yourself from downloading the app because i don’t want anyone’s phone to be messed up.","rating":1,"isEdited":false}},{"id":"6174617174","type":"user-reviews","attributes":{"title":"no explicit imagery. disappointed","date":"2020-07-09T02:13:01Z","userName":"Tethron","review":"was told there would be explicit photos of the hottest president to ever have lived on this app in return for my credit card info. was extremely disappointed to find these photos do not exist and I am now $200 short. thanks, Donny. one star. Sad!","rating":1,"isEdited":false}}]}