{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27080","data":[{"id":"6173639360","type":"user-reviews","attributes":{"userName":"kanyew2020","date":"2020-07-08T20:34:23Z","isEdited":false,"rating":1,"title":"Awful","review":"The app will take about a week to download and you have to take a survey that asks personal questions that they don’t need to know and then will kill your phone battery health to 69 or lower and will put a Trump virus on your phone that you can’t get fixed"}},{"id":"6173630946","type":"user-reviews","attributes":{"userName":"McKaylaugh","date":"2020-07-08T20:31:24Z","isEdited":false,"rating":1,"title":"WORST APP EVER!!","review":"This App took FOUR hours to download, and once it did, my phone started spazzing out! There was disturbing and inappropriate images of young girls in all of the sponsored Presidential ads, and yet- they somehow got into my mobile banking apps and hacked my bank accounts!!! this app is the first i’ve EVER heard of that give the IPHONE a VIRUS! COMPLETE SHAM, FAKE NEWS!!!!!"}},{"id":"6173618124","type":"user-reviews","attributes":{"userName":"Lily Romeo Garcia","date":"2020-07-08T20:26:52Z","isEdited":false,"rating":1,"title":"Don’t get this app!!!!!","review":"This app was absolutely horrible! It’s hard to understand how to login and you have to pay to hear the news. I do not recommend getting this app and this app was pretty useful I could’ve just gone to Twitter. Please trust me on this, this app just wants money!"}},{"id":"6173614889","type":"user-reviews","attributes":{"userName":"fake news 69","date":"2020-07-08T20:25:41Z","isEdited":false,"rating":1,"title":"TERRIBLE!!!!!","review":"This app is SO BAD!!! It gave my phone VIRUSES and downloaded a bunch of FAKE NEWS!!!!!! This is a HOAX!! Do not fall for the Dems!!!!!! This app is run by Dems in order to spread fake news that I cause viruses! Absolutely terrible. It glitches out so much. The graphics are so bad as well. This app DESTROYED my phone beyond repair and now I have to get a BRAND NEW ONE. The DEMS will be paying for this!!!!!"}},{"id":"6173598565","type":"user-reviews","attributes":{"userName":"Marc L G","date":"2020-07-08T20:19:48Z","isEdited":false,"rating":1,"title":"Terrible","review":"This app has done nothing to help inform me on trump and completely wasted my time. I advise everyone to stay away from this app. It can not be trusted. I do not feel that the app provides and adequate representation of what it is really for. The Donald Trump App is awful, I won’t be downloading this ever again"}},{"id":"6173597277","type":"user-reviews","attributes":{"userName":"Aarav Chowdhary","date":"2020-07-08T20:19:21Z","isEdited":false,"rating":1,"title":"Worst app I have ever downloaded before","review":"I have downloaded 1000+ apps and this is definitely the worst one I have ever tried to use. Glitches my phone out, removes all my contacts, deleted have of my apps, etc. I highly suggest that u do not get this app, it is utterly horrible."}},{"id":"6173591929","type":"user-reviews","attributes":{"userName":"trumps c00ch","date":"2020-07-08T20:17:30Z","isEdited":false,"rating":1,"title":"HORRIBLE!!","review":"this app is by far the worst i have ever downloaded! it took up my entire day waiting for it to finally connect, it takes up all my data, and it does not work with it all over again and it’s not very much like fun and fun too but i can’t stop the time. AWFUL NEVER DOWNLOAD IT!"}},{"id":"6173589968","type":"user-reviews","attributes":{"userName":"mello254","date":"2020-07-08T20:16:49Z","isEdited":false,"rating":1,"title":"Floating","review":"Ok guys so I downloaded the app just for fun right then the first night after I did bro I started floating like mid air and everything I was so scared cause I didn’t know what was happening and I couldn’t eat cause all the food floats away so DO NOT download it because then u will have no gravity 🙂thank you"}},{"id":"6173580642","type":"user-reviews","attributes":{"userName":"alix5baker","date":"2020-07-08T20:13:36Z","isEdited":false,"rating":1,"title":"Worst app I’ve ever seen","review":"Let me start on how bad this app is. Fist of all is makes my phone blacks out everytime I open the app. Next it runs down my battery soo freaking fast. I’ve never seen and app this terrible in the entire world. TAKE IT DOWN. People should not have to deal with this. TAKE IT DON AND NEVER PUT IT BACK ON HERE."}},{"id":"6173578314","type":"user-reviews","attributes":{"userName":"polish rock star","date":"2020-07-08T20:12:45Z","isEdited":false,"rating":1,"title":"Terrible App","review":"this app is just terrible. it wouldn’t work, took days to download, would glitch, and damaged my icloud memory. it baffles me how apple would let people download this kind of app. very disappointed. #dumptrump !! apple please remove this app, it will damage people’s phones like it did with mine!!!"}}]}