{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27230","data":[{"id":"6178976904","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-10T01:46:56Z","review":"this app is BEYOND cruel the pictures of him on this app is total inappropriate and very distracting! i am very disappointed the decor on this app no not support the app or the ORANGE FACE ALONE! i am very sick to my stomach looking at this app i might have to go to the ER! which is a health concern and it’s his fault! YOU KNOW WHAT IM GOING TO TAKE IS MONEY FOR THIS MEDICAL BILL! do NOT download this app...I REPEAT do NOT DOWNLOAD HIS APP!!!!!","isEdited":false,"title":"IT IS A DUKEY APP","userName":"katelyn the karen"}},{"id":"6178982184","type":"user-reviews","attributes":{"rating":5,"date":"2020-07-10T01:48:48Z","review":"Every one is saying it’s bad but it’s fine loaded very fast and it works fine. I love this app.","isEdited":false,"title":"GREAT APP","userName":"Love it needs skins"}},{"id":"6178948981","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-10T01:36:45Z","review":"This app took 2 weeks to download, utterly ridiculous!!!! Then it finally did downloaded I was unable to use the app because every time I tried to use it, the app would crash. Would not recommend I absolutely HATE this app!!!","isEdited":false,"title":"So terrible!!!","userName":"beana14 23"}},{"id":"6178948432","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-10T01:36:35Z","review":"This app took a whole 3 DAYS to download. And it took up ALL OF MY STORAGE!!! It ended up deleting ALL IF MY PICTURES AND IMPORTANT THINGS. And then the format of this app is utterly DISGUSTING 🤮🤮🤮🤢🤢🤢🤢 all I wanted to do was support my OH SO DEAR president AND I LOST EVERYTHING! I cannot believe that ANYBODY would give this app a good rating EVER. I am DISAPPOINTED in this country and president.","isEdited":false,"title":"where do I start?","userName":"Brynycuteycup"}},{"id":"6178935238","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-10T01:31:48Z","review":"Whoever designed this app needs to go back to school. It is terribly designed, takes forever to download and tracks your location even when your not using it, draining you battery. Terrible just terrible","isEdited":false,"title":"Terrible app","userName":"trump supporter 2262862526$"}},{"id":"6178930779","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-10T01:30:08Z","review":"I got this app because all of my friends got it but let me tell you this it asked for my phone number and let me tell you this every second of the day it gave me a text🖐! Once I got the app A TRUMP HOLLAGRAM SHOWED UP ON MY PHONE AND JUST DID THIS 👌🏻I WAS SO SCARED \n\n(Gen-z wrote this! get has app taken down since he’s talking down our!😈)","isEdited":false,"title":"UNSAFE","userName":"crispytanaz"}},{"id":"6178924510","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-10T01:27:48Z","review":"I was very excited to download the app but was severely disappointed. Worst app I’ve ever had. It was glitching a lot and it had way to many pop up ads. Do not get this app you will be disappointed. One of the worst apps in the entire world. Absolutely appalling.","isEdited":false,"title":"Terrible App","userName":"Gracie_Beans"}},{"id":"6178894775","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-10T01:16:48Z","review":"I downloaded this app but it TOOK 40 hours. I wanted to keep up with my favorite homophobic and racist president. To my dismay it crashed every time I opened it. When i finally got it to open I was so happy but then it drained my battery and kept asking me to sign petitions to ban tik tok . Do NOT RECOMMEND","isEdited":false,"title":"So disappointing 🤢🤮🤢","userName":"fairycomments"}},{"id":"6178849317","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-10T01:00:10Z","review":"First of all this app took years to download i started downloading it in 2016 and when i did i was soo scared... My phone was hacked!!!! All my backrounds on my phone were Trump! And my camera roll all of my photos were trump photos and vote for trump 2020. And my phone turned ORANGE!! The fact is DON’T DOWNLOAD THIS APP. YOUR PHONE WILL GET HACKED. #LongElmo2020","isEdited":false,"title":"SO SCARED","userName":"Disney_Dani"}},{"id":"6178834693","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-10T00:54:36Z","review":"so i downloaded this app just trying to see if it passed the vibe check. well i am here to say that it doesn’t even meet the minimum requirements to pass the evaluation. i am truly FLABBERGASTED. i honestly feel as though this app deprecated my vibes. this app is a crime against humanity 😌","isEdited":false,"title":"vibe check :","userName":"charlie072695"}}]}