{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=109890","data":[{"id":"6177243705","type":"user-reviews","attributes":{"rating":1,"title":"Keep tik tok","date":"2020-07-09T15:52:28Z","isEdited":false,"userName":"daddy almond","review":"Worst president ever"}},{"id":"6177229692","type":"user-reviews","attributes":{"rating":1,"title":"✨👩🏽‍🦯heh","date":"2020-07-09T15:48:21Z","isEdited":false,"userName":"Etanium","review":"✨make america great again🦋🥰by leaving✨😘"}},{"id":"6177200192","type":"user-reviews","attributes":{"rating":1,"title":"Doodle trump","date":"2020-07-09T15:39:57Z","isEdited":false,"userName":"fo sho fo sho","review":"This man said ALL Mexicans are rapists"}},{"id":"6177147923","type":"user-reviews","attributes":{"rating":1,"title":"ABSOLUTELY disgusted","date":"2020-07-09T15:25:13Z","isEdited":false,"userName":"BabyG💜💚💜💚","review":"This app took 3 HOURS to download. While on the app, there were pictures of trumps fat face ALL OVER IT. This is not ok, and should’ve never been on the Apple AppStore. It is like pollution to our phones and damaging our eyesight. My next concern is this, it keeps saying keep America great, but America is anything but great right now. We are in a worldwide pandemic and the US has over 3 MILLION CASES. That is more than any other country in the world. Who’s fault is that? The orange clown in office right now. We could’ve been WAY prepared but my guess is that Trump doesn’t know how to read and cant comprehend basic human skills. Also, black people are being harassed, discriminated against, and killed by police officers. This is not ok. This reason should be the reason why AMERICA IS NOT GREAT. Mike Pence, who is the VICE PRESIDENT said he would not say Black Lives Matter because it is far too radical left. Mike, IF BLACK LIVES DONT MATTER TO YOU WHY ARE YOU EVEN IN OFFICE?? YOU AND TRUMP ARE SUPPOSED TO BE REPRESENTING THE UNITED STATES OF AMERICA AND SO FAR YOU ARE REPRESENTING YOURSELVES AND A BUNCH OF HILLBILLIES. Seriously, I beg all Americans to VOTE THEM OUT. Especially if you are a white male who can vote, please please do. Trump is counting on your votes and if he doesn’t get them, HES OUT FOR GOOD. Also, please don’t vote Kanye2020. Even though his albums are ~immaculate~ Kanye has views and opinions that go against women’s bodies, the lower class, and way more. Do research, take action. TALK TO YOUR PARENTS. DONT LET THEM VOTE FOR THESE IDIOTS. MAKE THEM BE AWARE OF THE BAD HAPPENING. If you read all of this, thank you. \n\nSincerely,\n\nALL OF GEN Z.\n\np.s. If you take away our tik tok, we take away your clown app!! kisses😘😘😘😘"}},{"id":"6177103866","type":"user-reviews","attributes":{"rating":1,"title":"No good","date":"2020-07-09T15:12:59Z","isEdited":false,"userName":"imadudeandstuff","review":"This made my pp hurt 😢"}},{"id":"6177061118","type":"user-reviews","attributes":{"rating":1,"title":"so bad","date":"2020-07-09T15:01:12Z","isEdited":false,"userName":"hahaha.... oop","review":"[Gale takes out a bread roll from his bag and gives it to Katniss] \nGale Hawthorne: Yeah! It better be. It cost me a squirrel.\n[she splits the bread in half and gives a piece to Gale; as they are about to eat the bread]\nGale Hawthorne: Happy Hunger Games.\n[Katniss jokingly does a fake British accent]\nKatniss Everdeen: And may the odds be ever in your favor.\n[they eat their bread in silence for moment]\nKatniss Everdeen: How many times has your name entered it?\nGale Hawthorne: Forty two. Guess the odds aren’t exactly in my favor.\n[Katniss is at the market when she notices strange looking pin]\nKatniss Everdeen: What’s this?\nHob Vendor: That’s uh…mockingjay.\nKatniss Everdeen: How much?\nHob Vendor: You keep it. It’s yours.\nKatniss Everdeen: Thank you.\n[after Prim and Katniss put on their finest clothing for the reaping]\nKatniss Everdeen: You wanna see what I got you today?\n[Katniss gives the pin she got earlier at the market to Prim]\nKatniss Everdeen: It’s a mockingjay pin, to protect you. And as long as you have it, nothing bad will happen to you. Okay? I promise.\n[at the reaping after all the District 12 adults children are accounted for, the announcer for Hunger Games addresses then all]\nEffie Trinket: Welcome! Welcome! Welcome! Happy Hunger Games. And may the odds be ever in your favor. Now, before we begin, we have a very special film brought to you all the way from the Capitol.\n[a film showing the how the Hunger Games began begins]\n[President Snow narrates the film showing how The Hunger Games began]\nPresident Snow: [voice over] War, terrible war. Widows, orphans, a motherless child. This was the uprising that rocked our land. Thirteen districts rebelled against the country that fed them, loved them, protected them. Brother turned on brother until nothing remained. And then came the peace, hard fought, sorely won. The people rose up from the ashes and a new era was born. But freedom has a cost and the traitors were defeated. We swore as a nation we would never know this treason again. And so it was decreed, that each year, the various districts of Panem would offer up in tribute, one young man and woman, to fight to the death in a pageant of honor, courage and sacrifice. The lone victor bathed in riches, would serve as a reminder of our generosity and our forgiveness. This is how we remember our past. This is how we safeguard our future.\nEffie Trinket: Now the time has come for us to select one courageous young man and woman for the honor of representing District 12 in the 74th annual Hunger Games. As usual, ladies first.\n[Effie picks a piece of paper from a large bowl containing all the children’s names, she opens it and reads out the name]\nEffie Trinket: Primrose Everdeen. Where are you dear? Well, come on up.\n[a scared looking Prim hesitates]\nEffie Trinket: Well, come on up!\n[Prim walks slowly towards the stage, suddenly Katniss steps out and calls out to Prim]\nKatniss Everdeen: Prim! Prim!\n[the guards stop Katniss from approaching Prim]\nKatniss Everdeen: No! I volunteer! I volunteer! I volunteer as tribute!\nEffie Trinket: I believe we have a volunteer.\n[after volunteering to take Prim’s place in the Hunger Games]\nKatniss Everdeen: You need to get out of here! You need to get out of here!\nPrimrose Everdeen: No!\nKatniss Everdeen: Go find mom!\nPrimrose Everdeen: No!\nKatniss Everdeen: Prim, go find mom!\nPrimrose Everdeen: No!\nKatniss Everdeen: I’m so sorry!\nPrimrose Everdeen: No!\nKatniss Everdeen: Go find mom!\nPrimrose Everdeen: No!\n[Gale steps out his line and walks up them and takes Prim away as she cries]\n[as a nervous and shocked looking Katniss approaches the stage]\nEffie Trinket: District 12’s very first volunteer. Come on up. Come on, dear.\n[Katniss walks up onto the stage]\nEffie Trinket: What’s your name?\nKatniss Everdeen: Katniss Everdeen.\nEffie Trinket: Well, I bet my hat that was your sister, wasn’t it?\nKatniss Everdeen: Yes.\nEffie Trinket: Let’s have a big hand for our very first volunteer, Katniss Everdeen.\n[Effie claps but there’s silence from the audience as they hold up their hand in tribute to Katniss]\n[after Katniss has been introduced on stage]\nEffie Trinket: And now for the boys.\n[Effie picks out another paper and reads out the name]\nEffie Trinket: Peeta Mellark.\n[Peeta walks up and steps onto the stage]\nEffie Trinket: Here we are. Our tributes from District 12. Well, come on you two, shake hands.\n[Katniss recognizes Peeta and in a flashback, we see Peeta standing outside a bakery when he sees Katniss sitting alone, starving in the rain]\nEffie Trinket: Happy Hunger Games! And may the odds be ever in your favor.\nIT KEPT CRASHING AND IT SUCKED WORSE APP I SWEAR"}},{"id":"6177060277","type":"user-reviews","attributes":{"rating":1,"title":"he's fat","date":"2020-07-09T15:01:00Z","isEdited":false,"userName":"DorkieDee","review":"yeah sorry"}},{"id":"6177050089","type":"user-reviews","attributes":{"rating":1,"title":"The app slept with my mother","date":"2020-07-09T14:58:12Z","isEdited":false,"userName":"+1 (605) 475-6961","review":"Donald slept with mommy"}},{"id":"6177040647","type":"user-reviews","attributes":{"rating":1,"title":"yo mama🦙","date":"2020-07-09T14:55:38Z","isEdited":false,"userName":"yo mama🦙","review":"Terrible app Cheeto man is very scary"}},{"id":"6176955749","type":"user-reviews","attributes":{"rating":1,"title":"eww, yucky","date":"2020-07-09T14:32:46Z","isEdited":false,"userName":"itz_Taft","review":"Gen Z will rise from the ashes"}}]}