{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=66610","data":[{"id":"6132352526","type":"user-reviews","attributes":{"userName":"The Call a Nader","title":"Horrible","isEdited":false,"review":"This piece of garbage app kept crapping out on me and closing when I didn’t do anything for it to. All I can say is DELETED AND NEVER AGAIN INSTALLED!!!","date":"2020-06-28T15:15:16Z","rating":1}},{"id":"6130749755","type":"user-reviews","attributes":{"userName":"Kirishima's_croc's","title":"Downloaded as a joke but the ratings are true","isEdited":false,"review":"This app is literally one of the worst apps I’ve ever used. First of all, the application took up a lot of my storage space and I had to delete a couple apps just for it to download. Then as soon as I clicked on the icon it was just a black screen for a few seconds before it glitched out. I tried again and the same thing happened. I had to delete more apps and redownload this one for it to even open. Then as soon as I opened the app I was assisted by a picture of the Trumpkin. All jokes aside, I had to enter my mobile number to go further, which I’m quite mad that it isn’t even taken into consideration that not everyone has a phone. I had to use a friends number just to get in. Then from there the app only got worse. It came to a screen with articles and other things, and when I tried to click on one of the links the app shorted out again. None of the links worked, and I kept getting pop ups asking me to donate, which is fine and all, but as soon as I exited out from one, about a minute or so would pass before I got another. Overall I wouldn’t recommend this app, it’s super glitchy, and annoying. I’ve seen in other reviews that they talk about the app asking for your credit card information, but it doesn’t, unless you’re trying to donate. Plus if you read the privacy policy it says the app may share your information with a third party I don’t support Trump, but this is an honest review of my experience, the developers have a lot of work cut out for them. And in case you might ask, it wasn’t a problem on my end, this was a new iPad (I got it around 1-2 weeks ago) and I did have enough storage space for the app, my WiFi connection was also stable and secure.","date":"2020-06-28T06:02:40Z","rating":1}},{"id":"6125941578","type":"user-reviews","attributes":{"userName":"Rewards collector","title":"Awful App","isEdited":false,"review":"The app leaked my personal information and kept spamming me with notifications!","date":"2020-06-27T00:36:17Z","rating":1}},{"id":"6116775696","type":"user-reviews","attributes":{"userName":"jdjfjifk3459'fk","title":"EWWW🤮🤮","isEdited":false,"review":"This is the worst app ever! It was created by a racist white supremacist 🤢🤢🤢So OBVIOUSLY this app is dumb. If you support this EW ! This app should be taken down. Apple should not endorse this type of content.","date":"2020-06-24T16:04:02Z","rating":1}},{"id":"6113389169","type":"user-reviews","attributes":{"userName":"Friend3956230964","title":"horrible","isEdited":false,"review":"This app gave me a headache. don’t recommend. Save your time and don’t download","date":"2020-06-23T19:13:00Z","rating":1}},{"id":"6089147875","type":"user-reviews","attributes":{"userName":"Jrnfrivndignrufnsk","title":"Huge disappointment, very sad","isEdited":false,"review":"This app is full of FAKE NEWS from the EVIL MEDIA about how trump is a good president. So sad. Really pitiful that the idiot snowflake conservatives consider this a reputable source😞","date":"2020-06-17T23:07:43Z","rating":1}},{"id":"6080988458","type":"user-reviews","attributes":{"userName":"Djjghfjfjfckk","title":"Horrible","isEdited":false,"review":"I really liked my dog and so I wanted to protect him from coronavirus so I injected him with Lysol and then we had to pay $3,000 for a surgery! Not cool!","date":"2020-06-16T01:54:21Z","rating":1}},{"id":"6068943690","type":"user-reviews","attributes":{"userName":"03171998","title":"F you Bunker Boy","isEdited":false,"review":"The libtards are at it again! Let’s take down this app. Overall, not a good president. 1/10, would not try again. F you Bunker boy!","date":"2020-06-13T02:04:02Z","rating":1}},{"id":"6065698954","type":"user-reviews","attributes":{"userName":"karini33","title":"Bad app","isEdited":false,"review":"This app seemed to glitch too much because some thing appeared as others :(","date":"2020-06-12T05:59:53Z","rating":1}},{"id":"6060145697","type":"user-reviews","attributes":{"userName":"clovermchale","title":"DONT DOWNLOAD!!!","isEdited":false,"review":"this was a total scam. after i downloaded this, i bonked my head on an alien, zombies came to my house, i got abducted by a ufo, i fell out my window and a horse pooped on me","date":"2020-06-10T19:32:03Z","rating":1}}]}