{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=4670","data":[{"id":"6172564697","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T14:54:14Z","review":"If I could give this app zero stars, I would. It took an hour to download, and the app itself seems like it was created by kindergartners. The software was slow, every time I tried to select something, it kept glitching and over all it was a bad experience. \nThe app also wanted my personal information, which is very unprofessional. (Like they’re the government, don’t they have that?)\nI downloaded this app in hopes of educating myself on what a horrible president we have, and I didn’t need much info to know that. This whole experience made me realize I will have to vote for another party.","title":"Looks like a kindergartner made it","isEdited":false,"userName":"janebug02"}},{"id":"6172545317","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T14:48:49Z","review":"I downloaded this app to see the hype about our president. My dog IMMEDIATELY starting sneezing non stop. I couldn’t figure out what was wrong?!?! When I closed the app to go check on her she stopped. I thought it was weird so I just shut my phone off the rest of the day. Literally the next day, I opened the app to try again and my PET ROCK DIED. Just keeled over and died. I was so sad, we had a funeral for her and everything. I got bored later that night though and re opened the app. When I clicked on it, before it even loaded, my toilet started spewing everywhere. THIS APP IS CURSED. THIS MAN IS CURSED. DO NOT VOTE FOR HIM, IMAGINE ALL THE PET ROCKS THAT WILL DIE. IMAGINE ALL THE DOG SNEEZES. IMAGINE ALL THE BROKEN TOILETS.","title":"Not even one star","isEdited":false,"userName":"Hhfghinjfsdbjfg"}},{"id":"6172448871","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T14:22:12Z","review":"This app is absolutely terrible, I went on here to get information, and support my president but was very misleaded when I found out that this app is full of hackers and spam accounts, unlike other people who haven’t actually been into the app, I have personally went into it and had it for a couple days, I then reached out to friends and family who also had this app and found out that they had the exact same problem. Some of my family and I had to get completely new phones after downloading this app. DO NOT DOWNLOAD THIS APP. AND DO NOT TRUST ANY GOOD REVIEWS. THEY ARE ABSOLUTELY LYING. Hopefully this review was helpful in anyway shape or form.","title":"I HATE HATE HATE THIS APP","isEdited":false,"userName":"I Love Jesus, :)"}},{"id":"6136114457","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-29T14:13:59Z","review":"When I saw that this app had only 2.3 stars I was completely shocked. I thought maybe those blue haired lefties were just hating on my president. However, I downloaded it and found that the app was indeed TERRIBLE. I will admit, I felt a bit betrayed that I had been supporting my president for so long and all he could do was offer me a slow, glitchy, and ugly app! As a 52 year old, sometimes it’s a bit hard to learn all this new tech! I was hoping President Trump would make it a bit easier to use especially for his older fanbase. Instead, I felt like I was coding! So sad that he didn’t even try to make this a good app.","title":"Sad and Betrayed.","isEdited":false,"userName":"Debrah68"}},{"id":"6177862153","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T18:59:17Z","review":"Now I thought that the reviews were fake but the app took sooo long to download and my phone kept like crashing out of no where. I have a Iphone 11 too so it shouldn’t be crashing like it is. I’ve never had this problem before with any phone. Like I would be playing subway surfer and my phone would crash for no reason. I also have to add that when I deleted it some how it got redownloaded back onto my phone with me not even going into the app store. I don’t know what the app is doing my it’s making me wonder if it’s hacking my phone or something. I do not recommend.","title":"✨i don’t like it✨","isEdited":false,"userName":"🧚‍♀️fairy🧚‍♀️"}},{"id":"6177576851","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T17:31:23Z","review":"I downloaded this digital application  'i  decree to support our dear incapable president.  Nay our bawbling chemically processed orange of a lay man  'i  which some refer to as president.  Though, i now never refer to this lay man as president because of the dysfunction of this digital application.  I am disappointed to say the least, i would expect ranker from a nation  'i  which some  'i  the past  hast referred to as the greatest country  'i  the orb.  Now this nation lacks  'i  civil justice and decree.  This heavy nation with heavy{{aj}} leadership is dwindling  'i  competence and this digital application threw the nation over the edge and into the trash.  Good day fellow land owners and lay men","title":"ye’ ol lay man land owner disapproves of digital application","isEdited":false,"userName":"mkmcnab114"}},{"id":"6177519446","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T17:13:17Z","review":"As soon as I got this app 3 random people showed to my house and held me a down and shoved a shot full of ketamine in my arm I cried for help 😢 then they picked me up and put me in a suitcase and threw me off the edge of a cliff I woke up 7 days later in New York in a drug cartel and to make matters even worse our lord and savior Donald  jenius Trump was behind all of it and I was forced to give blow jobs to everyone there it took 4 months to escape and 39 days to walk back to Oregon. Do not download this app I repeat do not download this app trump is just as good as a left nutsack. I AM EXTREMELY FRUSTRATED. They even forced me to pull out my right nipple","title":"Meows not that time for fun and games!!!!!!","isEdited":false,"userName":"so ujjsjsmksj"}},{"id":"6177481576","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T17:01:38Z","review":"It’s all fun and games until you get invested into this app. It’s like a cult, they get these red hats that have words that stand for Murder All Grandmas Association. It took my grandma’s life because they told her to drink cat pee and gave her a huge dose of ketamine, which also killed Elijah McClain. \n\nIn honor of her, I’d like to share one of her quotes:  “ Uh huh, you know what it is Black and yellow Black and yellow Black and yellow Black and yellow Yeah uh huh, you know what it is Black and yellow Black and yellow Black and yellow Black and yellow Yeah, uh huh, you know what it is (what it is) Everything I do, I do it big Yeah, uh huh, screamin' that's nothin' What pulled off the lot, that's stuntin’” \n\nThank you. RIP Meemaw ❤️","title":"MY GRANDMA DIED FROM THIS APP","isEdited":false,"userName":"Crazy**Girl**Gamer"}},{"id":"6177458452","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T16:54:54Z","review":"My banana juice tasted so badly and I wanna know that I wanna is a good day for you and your brother to come home with us a lot and then he said we would appreciate that he said that we can do a lot more on his way back and he can do a good iv is that what you do and what he wants you know he said that you have to tell me that you have to tell him what he is going crazy about you know what you mean and you have never had it a good time he was just like that he said that he would do be better at what he would be doing if he wants me and I don’t want him and I don’t want you guys and I don’t want. Okay bye","title":"You ban us, We ban you","isEdited":false,"userName":"Suk toes make loads"}},{"id":"6177202361","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:40:32Z","review":"This has to be one of the worst apps I’ve ever downloaded. Apart from being slow, lagging, major glitching, and other tech issues, almost every time I opened it, I got kicked off and the entire app reset. Horrible work done by someone you’d have such high hopes for considering he’s the president & a millionaire... weird. Anyways this app also takes up a tremendous amount of storage and actually made my entire phone lag after installing it. Hate the app 0/5 stars would not recommend except perhaps to a dementia patient like trump himself who’s just bored and needs distraction.","title":"Wish I Could Give 0 Stars","isEdited":false,"userName":"Lex_S_101"}}]}