{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29840","data":[{"id":"6178132292","type":"user-reviews","attributes":{"rating":1,"userName":"Ray Pieste","review":"Every time I open the app my phone loses so much battery, and it just ruined some of the software on my new phone. I wouldn’t recommend this to my first enemy because that would probably be considered a war crime.","date":"2020-07-09T20:27:40Z","title":"Absolutely terrible","isEdited":false}},{"id":"6178126890","type":"user-reviews","attributes":{"rating":1,"userName":"size13nikes","review":"i saw donald trump at an ice cream store and he took my ice cream and threw it on the floor! he then proceeded to stab all of my family members AND robbed the ice cream store. he threatened to burn my house down if i told anyone this, but i’ve learned that i can’t be in hideout anymore! i WISH there was an option for 0 stars as this app is TRASH.","date":"2020-07-09T20:25:49Z","title":"DONT DOWNLOAD","isEdited":false}},{"id":"6178123880","type":"user-reviews","attributes":{"rating":1,"userName":"ambersito","review":"This app told me that once i downloaded it, nico hiraga was gonna show up at my door step to give me a hug since i’ve been depressed for so long, but i was disappointed to find that it wasn’t true. overall, really bad app","date":"2020-07-09T20:24:49Z","title":"disappointed","isEdited":false}},{"id":"6178125744","type":"user-reviews","attributes":{"rating":5,"userName":"jewels123653","review":"I love tik tok, but our great president should not have to be hated for it. It is not his fault, it is what we have to do to move on as a nation.","date":"2020-07-09T20:25:26Z","title":"Tik Tok Situation","isEdited":false}},{"id":"6178120405","type":"user-reviews","attributes":{"rating":1,"userName":"jdjdsjcjccs","review":"any who votes for him is blind, but to add onto that he is trying to ban our outlet, the thing our generation realizes on when we r sad, happy, or just bored. it was the thing that got us through quarantine. we created a home and a community through an app. some people became famous, and some fell out of depression because of how much tik tok has influenced them. please don’t do this to us, or else we will fight back and we all know how’s that’s gone already.","date":"2020-07-09T20:23:37Z","title":"trump is a terrible person.","isEdited":false}},{"id":"6178071138","type":"user-reviews","attributes":{"rating":1,"userName":"Derek Hernandez 😎","review":"Just want to talk to the manger at Apple and let them know they must be the stupidest, umpa lumpa, foreskin, havin as. This app is so bad I went on it to see trumps plans and he wants to build a wall like mfs can’t get a ladder 🤭 so to the manger at Apple delete this now or I’m calling the cops you racist 🥶","date":"2020-07-09T20:07:22Z","title":"I feel like Karen","isEdited":false}},{"id":"6178041978","type":"user-reviews","attributes":{"rating":1,"userName":"Ry6380","review":"I downloaded this app a few days ago and it’s just not working! Everytime I try and open it, the app itself not only crashes but my phone will sometimes crash! Fix this!!","date":"2020-07-09T19:57:47Z","title":"Very upset!!","isEdited":false}},{"id":"6178031749","type":"user-reviews","attributes":{"rating":1,"userName":"ToriWarren<3","review":"In all honesty this app was just really not good and helping me understand the views of trump. I downloaded it to understand his political side. I’m an independent but I would like to hear all sides. This app gave me trouble reaching out to people and giving me correct information.","date":"2020-07-09T19:54:26Z","title":"Not helpful😤","isEdited":false}},{"id":"6177997164","type":"user-reviews","attributes":{"rating":1,"userName":"Donkey2345","review":"✨ I was a girl in the village doing alright ✨\nthen I became a princess overnight now I gotta figure out how to do it right so much to learn and see up in the castle with my new family in a school that’s just for royalty a whole enchanted world is waiting for me I’m so excited to be gen z","date":"2020-07-09T19:43:04Z","title":"app is horrible.","isEdited":false}},{"id":"6178028125","type":"user-reviews","attributes":{"rating":5,"userName":"Jos0826","review":"I don’t like Trump but prefer him to win","date":"2020-07-09T19:53:17Z","title":"I don’t want to the democrats to win","isEdited":false}}]}