{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28960","data":[{"id":"6174879288","type":"user-reviews","attributes":{"rating":1,"userName":"usuiiwusiz","title":"I’m truly disappointed","review":"This app is one of the worst app on the App Store. I downloaded this to be updated throughout the election but it’s so badly designed that I couldn’t understand it. The amount of glitches that happened wen I was using the app is unexplainable. I advise to be removed","date":"2020-07-09T03:30:34Z","isEdited":false}},{"id":"6174833276","type":"user-reviews","attributes":{"rating":1,"userName":"mdnjajxnd isns","title":"It tried to flirt with me !!,","review":"This app is outragously inn appropriate! It typed to flirt with me and ask for my number !!! Sorry I have a fiancé 😡. I would never cheat on him, endless it is trump himself. It also threatened to deport me and my family, like you can take my brothers and my grandma but...ME no. Anywho make America great again 🇱🇷😇🥰","date":"2020-07-09T03:17:04Z","isEdited":false}},{"id":"6174813071","type":"user-reviews","attributes":{"rating":1,"userName":"LET ME TALK TO YOUR MANAGER","title":"HOW IS THIS EVEN POSSIBLE!!!!!","review":"I GOT THIS APP THINKING I COULD GET MORE NEWS ON THE CAMPAIGN! But I ended up having to put in my INFORMATION which shouldn’t even have to be done but after that it asked me if I wanted to get notifications and I pressed no but some how I started to get notifications from the app at two in the morning. AN ABSOLUTE DISAPPOINTMENT!!!!!","date":"2020-07-09T03:11:10Z","isEdited":false}},{"id":"6174808409","type":"user-reviews","attributes":{"rating":1,"userName":"Pattoncake","title":"This app worsens menatal illness!!!!!!!!!!","review":"Thjs is literally such a toxic and unnecessary app to exist! This app gave me suicidal thoughts because of how toxic and degrading it was. Not to mention, The app made the power in my town go out. As soon as I downloaded it, the power went out. This app ,, toxic and terrible to have. Delete it. Delete it now.","date":"2020-07-09T03:09:47Z","isEdited":false}},{"id":"6174806613","type":"user-reviews","attributes":{"rating":1,"userName":"Fia2032","title":"Rip my dead family","review":"This app is awful, I downloaded it and trump was able to track me down to my doorstep and killed all of my family. We were nuked and I’m the only one left. Don’t let trump nuke your family like he did to mine and don’t download the app","date":"2020-07-09T03:09:16Z","isEdited":false}},{"id":"6174780118","type":"user-reviews","attributes":{"rating":1,"userName":"trash06741","title":"Complete Trash","review":"This app is without a doubt the biggest piece of trash I have ever encountered. It asks for your phone number first thing and STEALS ALL YOUR PERSONAL INFORMATION. This app is without a doubt run by the Russians and will be used to send your straight up PROPAGANDA. If you want to stay safe and form your own intelligent opinions DO NOT DOWNLOAD.","date":"2020-07-09T03:01:17Z","isEdited":false}},{"id":"6174770979","type":"user-reviews","attributes":{"rating":1,"userName":"kachow12345","title":"holy smokes this app is garbage","review":"i got this app to try and learn some more about politics and dinosaurs. but it kept mentioning something about trap cards and it locked me off of the main screen. i tried to get back to my tv show but the door kept opening and my knife fell out of the couch before i could sleep. i couldn't contain my excitement but when i went to buy the envelope it wasn't even warm. this will be the last time i don't believe to get somewhere but my minivan doesn’t cooperate. sheesh.","date":"2020-07-09T02:58:27Z","isEdited":false}},{"id":"6174764488","type":"user-reviews","attributes":{"rating":1,"userName":"9826(17","title":"Absolutely terrible","review":"Does not give the option to choose another president, which I would have liked to do from the start. Terrible graphics and story line, it only gets worse as you play.","date":"2020-07-09T02:56:30Z","isEdited":false}},{"id":"6174762680","type":"user-reviews","attributes":{"rating":1,"userName":"Rebeca Rules","title":"GLITCH 2020","review":"hate this app, if i could leave it a 0 star review i would!! it slowed my phone down, glitches, and crashes every time i open the app. completely unusable. waste of time and i’m just glad i didn’t have to pay for it.","date":"2020-07-09T02:55:57Z","isEdited":false}},{"id":"6174756131","type":"user-reviews","attributes":{"rating":1,"userName":"pacerhater","title":"Worst app ever","review":"This app really told me lies and when I said that I didn’t like Cheeto puffs my dad slapped me because he loves Cheeto puffs but as for trump he is a great president these liberals are snow flakes. I stole all of a liberals money and he called the cops smh acag. Since there trying to take this app down I’m gonna give it a 1 star to help trump.","date":"2020-07-09T02:53:57Z","isEdited":false}}]}