{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=85130","data":[{"id":"6173573955","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"YoungOGBlick","review":"It showed me pictures of little girls","date":"2020-07-08T20:11:17Z","title":"Bad"}},{"id":"6173573633","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"grief gg","review":"It took forever to download","date":"2020-07-08T20:11:10Z","title":"Y"}},{"id":"6173554002","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Gen Z wins","review":"So I was just relaxing one day and I decided to download this app to see what the aMaZiNg president was up to. Right when I opened the app, I my screen turned red and the app played a weird siren noise. Shortly after I heard a bang coming from the roof! It ran outside to see what the problem was and what i saw terrified me. There was a bunch of orange orangutans jumping everywhere ! The siren noises still kept playing from the app and then they all looked at me. I froze in horror. But there was one of them that really mad me scared. The biggest one, slowly turned around, and when it did, Donald Trumps face was plastered all over the poor animal. When it saw me, it jumped down. I made a dash to the door to get back into the safety of my house. I locked all of my doors and stood there as I saw all the orange faced orangutans we’re now standing outside my house. I noticed that they were holding something, it was orange hair dye and spray tans! Like what in the world ?!? Just as I thought things couldn’t get worse, something started falling from the sky. It was the annoying orange. It was giant ! He started to laugh obnoxiously and before I knew it, i blacked out. When I woke up, i was strapped to a table. I felt something cool and wet hit my leg. It was the spray tan that the orangutans had! They were wearing coats and face masks. There were all chanting, you will become one of us. I was livid ! I screamed and tried to wiggle out of the straps. I managed to break the strap from my right ankle and with that, I kicked the orangutan in the face. With all the adrenaline, I ripped the strap from my right wrist. I eventually broke my way off and punched the other orange orangutans in lab coats. I left the room to see that the weird facility I was in was full of huge orange mosquitoes! I ran for my life!! I saw a window and did a leap of faith right through it. The weird siren noise started playing again as the rest of them realized I was gone. The giant orange mosquitoes flew through the broken window. The only thing I can do is run. I ran and I ran until I found a nearby town and called for help. I found a random old lady and I told her that she has to help me. She took me to her house and told me to tell her the whole story. I explained everything front the beginning and she had this weird look on her face. She told me she would be right back. In a matter in minutes police were at her door. They broke down the door and arrested me. I was confused because I had just suffered so much and now I had to deal with this. They took me to a mental hospital. I told everyone my story but no one believed me! Not even my own family!! I was disowned that day by them since they were so embarrassed of my “craziness”. From that day on I lived in the hospital, with no one who beloved me. This app ruined my life. For your sake, don’t download it!!!!!","date":"2020-07-08T20:04:29Z","title":"This ruined my life ! Don’t download !"}},{"id":"6173552950","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"throbbing hole","review":"This app is horrible.  Why would a uneducated Cheeto need an app?","date":"2020-07-08T20:04:09Z","title":"This app the horrible"}},{"id":"6173546382","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Annika313","review":"Terrible.  Worst app ever.  Hard to understand or follow.","date":"2020-07-08T20:01:55Z","title":"The absolute worst"}},{"id":"6173544643","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"galaxypup33","review":"This app ruined my life. I downloaded the app and my phone immediately blew up. Then I started to turn into a giant orange like that girl in the 1971 version of “Will Wonka & the Chocolate Factory” it was painful and horrifying. Then my entire family was seemingly possessed by the Cheeto crumbs under the couch, they proceeded to fly around the room while chanting the space jam theme and shrieking at such high frequencies that my ear drums burst. My dog  also started to become an orange and she is permanently an orange to this day. After my family fell to the ground and passed out, like twelve different types of bugs started crawling out of the little crevices in my house. It was very nasty. The bugs tied me up and strung me and my unconscious family to the ceiling! The bugs started chanting “we’re not racist” and then proceeded to say incredibly racist things. After I had finally accepted my fate, Obama came and saved me! He was also very kind and even offered to pay for my family’s healthcare bills! Then he went off to try and stop systemic racism by peacefully protesting, even though those poor police officers who signed up for a job knowing that they would risk their lives and didn’t even get the proper training were so scared that they peed their little pants and started shooting at innocent people! So please DO NOT download this app. Because there is not a doubt in my mind that this will happen to you too. And please help stop systemic racism because the people who are supposed to protect everyone are killing people of color.","date":"2020-07-08T20:01:20Z","title":"Worst app ever!!!"}},{"id":"6173537424","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"HarryStyles01-","review":"Don’t waste your time","date":"2020-07-08T19:58:55Z","title":"Worst app"}},{"id":"6173536949","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Shdhfirirurujuoekj","review":"The app isn’t very good","date":"2020-07-08T19:58:45Z","title":"I don’t like the app at all"}},{"id":"6173533742","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"armandotalevera1234567890","review":"lol","date":"2020-07-08T19:57:40Z","title":"I hate this app and wish it never was in the App Store"}},{"id":"6173520914","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Stone804","review":"Terrible app, should be banned from the App Store","date":"2020-07-08T19:53:12Z","title":"Worst app"}}]}