{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21890","data":[{"id":"6179214689","type":"user-reviews","attributes":{"isEdited":false,"title":"Fake News","date":"2020-07-10T03:14:17Z","userName":"Glorianna98","rating":1,"review":"Some body once told me the world was going to roll me but this app is what really hit the last nail on the coffin. I’m pretty sure it gave my tablet a virus and it’s incredibly misleading. It says I’d stay up to date on news but we all know that the news is really fake so I have been purposefully mislead."}},{"id":"6179132942","type":"user-reviews","attributes":{"isEdited":false,"title":"This is trash","date":"2020-07-10T02:44:11Z","userName":"christian05050","rating":1,"review":"I downloaded it to see what it was and i is absolutely useless there is no reason to download it and it takes forever to download and i hate it and it seem like a lot of other people do to dont download it, it is useless and doesnt do anything and i hope you agree with me."}},{"id":"6179125522","type":"user-reviews","attributes":{"isEdited":false,"title":"🤢","date":"2020-07-10T02:41:23Z","userName":"That__account____","rating":1,"review":"This app is so terrible, I’ve never had such an unreliable, disgusting, gross, etc. app in my life🤢 this app needs to be deleted, it is so not worth even searching up. These reviews about how awful it is are completely tru, it’s a bad app, I would never recommend getting it. Unless it was to rate it zero stars."}},{"id":"6178980633","type":"user-reviews","attributes":{"isEdited":false,"title":"The worst decision I’ve made all week","date":"2020-07-10T01:48:14Z","userName":"Sarah550032","rating":1,"review":"I was just trying to give the big D some love but this app is wack! It kept glitching and I literally couldn’t use it for any good. I still don’t really understand the purpose of it if I can’t see all the content that’s just *italian hand kiss* 0/10 would not meet again."}},{"id":"6179070146","type":"user-reviews","attributes":{"isEdited":false,"title":"❄️❄️❄️","date":"2020-07-10T02:21:06Z","userName":"John hubbub be","rating":5,"review":"Too all of the snowflakes who can’t handle Donald trump becoming president for another 4 years, facts don’t care about your feelings. Maga trump 2020"}},{"id":"6178898221","type":"user-reviews","attributes":{"isEdited":false,"title":"Ew","date":"2020-07-10T01:18:03Z","userName":"😌✨🥺","rating":1,"review":"This app has left me traumatized, I’ve tried to delete it and it doesn’t go away. The content on it has caused me nightmares, I don’t know how I’ll recover from this horrible monstrosity. Please take caution when using it. I thought it would be a marvellous way to learn about the president but all it’s done is left me scared. Be careful 😌✨"}},{"id":"6178877037","type":"user-reviews","attributes":{"isEdited":false,"title":"Bad. It’s a bad app","date":"2020-07-10T01:10:17Z","userName":"Starburst power","rating":1,"review":"This app reminds me of that image of Windows 98 running on an Apple Watch; being that this app is an abomination and shouldn’t exist because much like Windows 98 and modern smart watches, Donald Trump and the American people should never be close to each other. Lock him up in jail he touches children and pays them and their parents off."}},{"id":"6178812809","type":"user-reviews","attributes":{"isEdited":false,"title":"Trash","date":"2020-07-10T00:46:13Z","userName":"tiredfedupwiththisbsstudents","rating":1,"review":"This App STOLE all of my photos of killua and gon off my phone and then DELETED my WHOLE COLLECTION OF READERXKILLUA FAN FICTION if I could give this app a 0 I would because now I have nothing to do all day and I have to re collect ALL of my 130 smut lemon readerxkillua fanfics AGAIN AND IT TOOK ME 2 YEARS TO GET ALL 130 WITHOUT ANYONE FINDING OUR!!! \nTrash app 0/10 recommended I hate this stupid app and all the people on it INCLUDING BUT NOT LIMITED TO TRUMP"}},{"id":"6178780710","type":"user-reviews","attributes":{"isEdited":false,"title":"What Is This?!?!","date":"2020-07-10T00:33:51Z","userName":"loccaboca","rating":1,"review":"The app crashed the whole time. Wasn’t able to access it at all! No wonder it got such horrible reviews! Apple you have lowered your standards if this is what your allowing in your store. Ridiculous! This app says a lot about how he runs this country! Can’t even hire a decent tech team"}},{"id":"6178741237","type":"user-reviews","attributes":{"isEdited":false,"title":"HORRIFIC","date":"2020-07-10T00:18:32Z","userName":"Ethan.little","rating":1,"review":"This is the worst app I’ve probably ever downloaded. It crashes every second and every time I look at the app icon it makes me more and more depressed and distraught. I do not recommend this app to anyone whatsoever unless your a computer scientist because you probably know how to fix the glitches."}}]}