{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=46360","data":[{"id":"6176869600","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T14:10:10Z","userName":"50283209 hi people","rating":1,"review":"This app is scary I don’t know how we even have this app.I think this app shouldn’t be on here.😤I think that this app is horrible and scary because all I see is died mouse.","title":"The worst app"}},{"id":"6176842056","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T14:02:55Z","userName":"yt.yancarlosh536","rating":1,"review":"I don’t like the app because the first thing it ask for is your phone and I don’t have a phone number sooo how am I supposed to do anything","title":"Y"}},{"id":"6176839613","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T14:02:17Z","userName":"i.like.butt.lice","rating":1,"review":"i downloaded this app about a week ago, i already had eaten too much cheese. but then the president himself messaged me about how disgusting and hairy i was for being disabled. he went on to say that when he gets bored he throws thumbtacks at as many disabled veterans as he can find. then he sent a video of him deep throating a banana. i’m truly disappointed in our county’s “hero”","title":"harassed by president"}},{"id":"6176836801","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T14:01:33Z","userName":"Mollyhannah","rating":1,"review":"The fake news in unbearable.   \nThe whining and begging for donations during the worst economic downturn since the Depression is gross.  \n\nDon’t download this app.  It’s like choosing to have a disease.","title":"This app will spam you with notifications"}},{"id":"6176812158","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:55:01Z","userName":"Kelsey Maldonado13","rating":1,"review":"One of the worst app took forever to download and asked for my number which made me a little uncomfy and gave me pedofile vibes. Did not see Barron anywhere which is a little worrisome... #saveBarron2020","title":"HORRIBLE APP"}},{"id":"6176810677","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:54:37Z","userName":"bigdickboyyy","rating":1,"review":"I downloaded this app and it made my phone lag really bad and not to mention that it took 3 whole days to download!!! It also was a very messy app.","title":"This app is terrible"}},{"id":"6176807293","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:53:44Z","userName":"angry troompa loompa","rating":1,"review":"i got this app hoping to learn about what the troompa loompa is doing in the 2020 election but the second i opened it i saw a terrifying orange man staring at me. this immediately caused me to have heart failure and i had to be rushed to the er for emergency surgery. this app has caused me great pain and suffering and i just wanted to share my story so others can try to prevent this from happening to them.","title":"this app put me in the hospital"}},{"id":"6176784665","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:47:47Z","userName":"no 😽","rating":1,"review":"this app is trash it hacked my phone and stole all my info then hacked into almost all of my accounts and ruined everything i own and drained my bank account","title":"DO NOT DOWNLOAD"}},{"id":"6176777358","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:45:50Z","userName":"brianas.","rating":1,"review":"I wanted to show my support on how we can corrupt Donald trumps apps hopefully it gets taken down also I wish I could give this zero star rating 😒","title":"Doing what I NEED to do"}},{"id":"6176773780","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:44:53Z","userName":"Gigi Snell","rating":1,"review":"This app not only took 4 weeks to download, but HACKED MY TV and now I can’t do anything. This app made me loose my progress in many things and I cannot wait to get a new tv so I can delete this app","title":"GUT WRENCHING"}}]}