{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35730","data":[{"id":"6176932687","type":"user-reviews","attributes":{"userName":"knickname33","isEdited":false,"title":"Moving to Canada 🇨🇦","review":"Why is this trash of an app on my AppStore? Yea I don’t really know it’s one of ... scratch that, THE worst app to exist on this AppStore. Like 🤢.  But am I rlly going to let it bother me THAT much? NO BECAUSE I HAVE BIGGER FISH TO FRY!!! SO MAYBE INSTEAD OF TAKING AWAY AN APP THAT KIDS ARE USING TO TRY TO SAVE AND FIX THIS COUNTRY FROM THE AWFUL FOOTPRINT YOUVE MADE, AND ACTUALLY TAKE CARE OF THIS COUNTRY WHILE YOU CAN.","date":"2020-07-09T14:26:39Z","rating":1}},{"id":"6176922884","type":"user-reviews","attributes":{"userName":"daddy its don","isEdited":false,"title":"Honest review!!!","review":"This app isn’t even remotely useful to anyone. It was so hard to navigate and all it does is link you to the website. I find it incredible that any of trumps cult members can figure out how to work it.","date":"2020-07-09T14:24:05Z","rating":1}},{"id":"6176913922","type":"user-reviews","attributes":{"userName":"GenZerTikTok","isEdited":false,"title":"Terrible false information","review":"This is a horrid app and would give it a half star if I could. Some things are just not meant to be and this is one of them. Terrible. False information","date":"2020-07-09T14:21:48Z","rating":1}},{"id":"6176901897","type":"user-reviews","attributes":{"userName":"Rose Gold Unicorn🦄","isEdited":false,"title":"terrible","review":"Trump is an overall horrible person and if u support him shame on you. this app is horrible, he is horrendous with his cheeto spray tan looking skin and his pringle little hair, and also so disrespectful. shut ur mouth trump, people can actually hear you spewing nonsense.","date":"2020-07-09T14:18:38Z","rating":1}},{"id":"6176889149","type":"user-reviews","attributes":{"userName":"Cameron meehan report","isEdited":false,"title":"What even is this","review":"Ok I know the whole gen z is trying to take this down but me no. I am upset because I am a full republican and I don’t stand for anything you do. This app is all fake news! Tsk this down right now","date":"2020-07-09T14:15:17Z","rating":1}},{"id":"6176885481","type":"user-reviews","attributes":{"userName":"Its Ye Boii Bruh","isEdited":false,"title":"App is terrible","review":"The app keeps crashing and I can’t open it at all... I’m not sure if it has something to do with my device but I’ve never had this issue with any app before.","date":"2020-07-09T14:14:17Z","rating":1}},{"id":"6176879510","type":"user-reviews","attributes":{"userName":"ur mom🥰🥰🥰🥰","isEdited":false,"title":"you tried ✨🥺now never again🥰✨🧚🏻","review":"after days on deciding to get the app I finally did & I regret it. it started glitching my phone out, & that app was the only app working. so I deleted the app. that’s it bye ❤️❤️❤️❤️. #dontvotefortrump","date":"2020-07-09T14:12:43Z","rating":1}},{"id":"6176848470","type":"user-reviews","attributes":{"userName":"SCAR FOR MAYOR!!!!!","isEdited":false,"title":"THIS APP ALMOST KILLED MY DOG!!!!!!!!!!!!!","review":"I downloaded the app and one of my dogs could smell the orange coming from my phone. They didn't like that smell and decided to tear up my Pokémon cards, almost killing my rare dog cards in the process. DON’T DOWNLOAD THIS APP. You will smell of horse apples for a week after deleting it.","date":"2020-07-09T14:04:37Z","rating":1}},{"id":"6176824062","type":"user-reviews","attributes":{"userName":"kwkdbzhwj","isEdited":false,"title":"Not good ):","review":"So I am not the type of person who writes reviews all of the time but this app kept causing my phone to exit the app and all I wanted to do was see trumps plan for 2020 this app is horrible do not recommend at all!!!","date":"2020-07-09T13:58:13Z","rating":1}},{"id":"6176817112","type":"user-reviews","attributes":{"userName":"AlyCC02","isEdited":false,"title":"Horrible app and no real info! 🤮🍊","review":"The app took forever to download and kept crashing. All I wanted to do is learn about the opaloompa’s plans for the upcoming election. This personified Cheeto dust looking fool has no facts just false fascist ideals and promises to invoke the prejudice of and older dead generation. 🙄","date":"2020-07-09T13:56:22Z","rating":1}}]}