{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28920","data":[{"id":"6176124309","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T10:42:08Z","isEdited":false,"title":"One of the worst apps","userName":"top ten critics","review":"This app took hours to download and once it did, took to long to set up 🤦‍♂️ after I got into it, it had too many apps for me to even understand what the app was. The app in general was not good and many problems with it. WOULD NOT RECOMMEND AT ALL!!!!"}},{"id":"6176093133","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T10:32:16Z","isEdited":false,"title":"What went wrong!? terrible app..","userName":"Methusen","review":"I downloaded the app and its absolutely terrible. Its so hard to actually understand what is going on. The format is ugly, it glitches, and the app keeps closing out. With all that money, you would think Trump would make a good app. Gross."}},{"id":"6176069111","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T10:24:33Z","isEdited":false,"title":"DO NOT GET","userName":".SummerSky","review":"DO NOT GET THIS! When I downloaded this app to check up on how my totally not racist, homophobic, rapist president I was just exploring the app for a little and when I shut off my phone it EXPLODED and caught fire ultimately burning my house down and killing my cat😭 DO NOT DOWNLOAD THIS APP IF YOU LIKE HAVING A HOUSE AND CAT! Because of trump I am now homeless as well as catless"}},{"id":"6176049498","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T10:18:09Z","isEdited":false,"title":"LITERALLY DO NOT DOWNLOAD","userName":"drina dang","review":"I was curious about this app and decided to download it which was such a BAD idea. This app took ages to download but as soon as it did I entered the app and I logged in like normal. But for some reason I got hacked, it took over my phone, and it took my personal info like what kind of app is this??"}},{"id":"6175909636","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T09:32:37Z","isEdited":false,"title":"Terrible app","userName":"Summeweee","review":"0/10 do not recommend. Nothing would ever load no matter what internet I was on. So many inconvenient mechanics. When it did load, there wasn’t even anything worth reading. Overall I’m very disappointed"}},{"id":"6175904411","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T09:30:52Z","isEdited":false,"title":"This app is a racist😯","userName":"Hteegtdg","review":"When I first open this app it ask me what color I was, then when I answers black it kicked me out of the app then having my phone number leaked, the I started getting hate for my skin color telling me to” kill myslelf before we do”."}},{"id":"6175848677","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T09:12:15Z","isEdited":false,"title":"Awful","userName":"Leallison","review":"My phone glitched as soon as I opened it, and now my phone goes black every few minutes. Definitely didn’t happen before this app. After I deleted it, the issue went away. Not worth it."}},{"id":"6175798946","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:55:45Z","isEdited":false,"title":"Oh dear Lord no....","userName":"jdksvxal on dbdks","review":"This app is horrible. I had to wait 6 hours for it to finish downloading even though I had perfect connection. Then when I tried to open it, it kept closing. In the end I don’t even know what that lil Cheeto is talking about on this app but Imma just assume that it’s his OnlyFans.🤢"}},{"id":"6175772064","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:46:22Z","isEdited":false,"title":"HORRIBLE APP DO NOT WASTE YOUR TIME","userName":"L.o.v.e T.h.i.s A.p.p","review":"I am decided to download this app since it’s #1 in news on the App Store. It’s not a good app, the developers needs to fix everything about it. It does not serve it purpose nor does it even work, I wasn’t even able to open the app without it crashing."}},{"id":"6175692015","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:19:07Z","isEdited":false,"title":"DISGUSTING","userName":"daytrashh is my tiktok ;)","review":"this app literally took so mf long to download for 1. I’ve never had that experience with another app.. it kept glitching and my phone was wiped out after using this app for 1 day! Disgusting and disappointed. It made me feel shameful of myself I hate this app🥺 Please remove it!!!"}}]}