{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=16890","data":[{"id":"6173693529","type":"user-reviews","attributes":{"review":"I can’t even describe how bad this app is, after downloading it my phone got a virus and completely shut off. I plugged it in hoping that maybe the battery just died, but after it was fully charged it broke into my living room and killed my whole family, all while chanting “Trump 2020”. Trump hacked my phone and killed my family through this app 😭","rating":1,"title":"Horrible","userName":"boobelibear","date":"2020-07-08T20:53:46Z","isEdited":false}},{"id":"6173688993","type":"user-reviews","attributes":{"review":"I downloaded it and immediately had to delete it because of how horrible it was. I wish there was more to say, but I have no words. It’s that bad. They should definitely consider deleting this from the App Store. If you don’t believe me, just look at all the other reviews, most of them have also had awful experiences.","rating":1,"title":"This is a horrible app","userName":"itjusthadtobesaid","date":"2020-07-08T20:52:12Z","isEdited":false}},{"id":"6173684234","type":"user-reviews","attributes":{"review":"I downloaded this app to keep up with the president and as soon as I touched the download button I broke out into hives. My throat started to close and I passed out from not being able to breath. I was in the hospital for 3 days and now I have to take pills to prevent this from happening again. This app needs to be taken off so this doesn’t happen to others!","rating":1,"title":"Horrible app","userName":"MuffinsRock44445","date":"2020-07-08T20:50:29Z","isEdited":false}},{"id":"6173665305","type":"user-reviews","attributes":{"review":"this app brings very bad luck. my phone started glitching out right when i got in the app. then a bug went in my ear. i was receiving messages asking if i would like to buy any MAGA merchandise and i was quick to say no. after getting this app i am not a republican anymore and i will not be voting for trump this year in the elections. i will convert my republican friends too. don’t vote red!","rating":1,"title":"absolutely HORRENDOUS","userName":"mad democrat","date":"2020-07-08T20:43:38Z","isEdited":false}},{"id":"6173653602","type":"user-reviews","attributes":{"review":"this app took forever to download! not only did it make my phone super slow but it also messed up how my phone worked 😡 as soon as i downloaded it everything else would crash when i tried to open it!!! this app is a SCAM. something serious is going on here it only wants you to open it 🤬😡","rating":1,"title":"never using my phone AGAIN","userName":"@littlecatchat","date":"2020-07-08T20:39:32Z","isEdited":false}},{"id":"6173627347","type":"user-reviews","attributes":{"review":"this app is terrible. The designs are disgusting they make my eyes burn. It literally just makes me want to get run over in the middle of a road. It’ll do nothing but bring you bad vibes. Negative entities WILL be attached to you if you use it with a genuine intention of supporting the orange. Also idk how but it just smells really bad like everytime i open it i smell rotting meat. I struggle to breathe whenever i open the app","rating":1,"title":"smells so bad worst app ever","userName":"Bokuto Koutarou","date":"2020-07-08T20:30:06Z","isEdited":false}},{"id":"6173623242","type":"user-reviews","attributes":{"review":"DO NOT DOWNLOAD! horrible app! The app throws you out seconds later after you open it, and after it glitches your entire phone! Even after i deleted it my phone is still glitched! Worst app ever, it ruined my phone. Also please dont support the stupid big orange cheeto🤢that we sadly have for our president, he is making our country terrible, throw him out now🥰","rating":1,"title":"HORRIBLE, throw the orange cheeto out🧚‍♀️","userName":"ThrowTrumpInTheTrash","date":"2020-07-08T20:28:42Z","isEdited":false}},{"id":"6173602810","type":"user-reviews","attributes":{"review":"THIS APP IS TERRIBLE! TOOK MONTHS TO DOWNLOAD! I NOW HAVE A GLITCH ON MY PHONE AND IT COULD BE A VIRUS!!!!!!! DO NOT DOWNLOAD THIS APP!!!! This app played a HORRIBLE sound when I opened it! Causing my hearing in one ear gone!!!!!!!! Also it caused hackers to get to my phone and hack it!!!! When I tried to delete the app it shut down my phone and I’m no longer allowed to get on the app because it kicks me off every time I get on it!! The app is now permanently on MY PHONE!!!🤬 I HATE IT NEVER DOWNLOAD IT!!! NEVERRRR!!!!","rating":1,"title":"Terrible app!","userName":"My opinion on \"Cash, Inc.\"","date":"2020-07-08T20:21:20Z","isEdited":false}},{"id":"6173600247","type":"user-reviews","attributes":{"review":"This app is not good. As I opened the app my phone immediately crashed , if I could rate this app negative stars that wouldn’t even be enough to rate it because how bad it is , this app drains your battery and tracks you even when you don’t use it , this app also leaves you vulnerable to hackers and viruses , i was on the app for no more than 30 seconds and I physically lost brian cells .","rating":1,"title":"Not good.","userName":"esto besto","date":"2020-07-08T20:20:24Z","isEdited":false}},{"id":"6173596648","type":"user-reviews","attributes":{"review":"I downloaded this app for fart noises and It didn’t have any, not only that when I downloaded it my phone battery exploded and caused one of the largest wildfires, that later was resolved but I got acne and stubbed my toe so badly I needed to get my toes removed,right after that my parents set me up for adoption and I was a adopted by a crazy woman who uses me only for child labor and I later died, so don’t download this app!!!!! ITS CURSED","rating":1,"title":"TERRIBLE APP","userName":"BootIegBoy","date":"2020-07-08T20:19:09Z","isEdited":false}}]}