{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26880","data":[{"id":"6176378207","type":"user-reviews","attributes":{"userName":"Funtime_rox","date":"2020-07-09T11:58:04Z","isEdited":false,"rating":1,"title":"DON’T DOWNLOAD","review":"This app caused my phone to lose battery and slow down all loading, if you download this app your a risking losing all your data to this app and your phone being slowed down forcing you to get a new one, I wish I could give this zero stars"}},{"id":"6176372448","type":"user-reviews","attributes":{"userName":"Zee ryan ","date":"2020-07-09T11:56:28Z","isEdited":false,"rating":1,"title":"Slow & Plodding","review":"Putting aside politics, the app is one of the worst I’ve ever tried. It takes forever to move on prompts. It’s unpleasing to the  eye and not intuitive. It’s as if it wants you to become irritated while using it. DO NOT download. You can still support President Trump without using this app."}},{"id":"6176359621","type":"user-reviews","attributes":{"userName":"nahfdjxnv","date":"2020-07-09T11:52:54Z","isEdited":false,"rating":1,"title":"HORRENDOUS 😡😡😡👿","review":"Ever since I downloaded this app my fingers have been smellling like dookie and it’s really bothering my family because they won’t allow me to wipe anymore when I got to the bathroom due to the app malfunctioning I cannot believe the Apple store allowed this abomination on the App Store that’s just.... just... JUST REPULSIVE"}},{"id":"6176355778","type":"user-reviews","attributes":{"userName":"yorkiemomx3","date":"2020-07-09T11:51:47Z","isEdited":false,"rating":1,"title":"Horrible!!!","review":"The app would not open AT ALL once downloaded, then my whole phone went haywire!!  It’s insanity all of my data was cleared and deleted off my phone. All photos and apps and made my phone practically not able to work. Good luck to anyone downloading."}},{"id":"6176322788","type":"user-reviews","attributes":{"userName":"kdmdiejfjfnd","date":"2020-07-09T11:42:26Z","isEdited":false,"rating":1,"title":"WTFFFF!!!!","review":"As soon as I downloaded the app it told me to put my phone number, I did. Then it told me that if I agreed then I will get calls and messages abt trump. Like you telling me that for me to use the app I have to listen to people talk trash!!!! No thank you! This app deserves to be deleted worse app out there."}},{"id":"6176310379","type":"user-reviews","attributes":{"userName":"Kittykat123202","date":"2020-07-09T11:38:49Z","isEdited":false,"rating":1,"title":"👎","review":"after I downloaded this app, Mr. Trump showed up to my house and held me hostage. He is still currently, saying he will let me go if I leave a five star review. I will not do such a thing, even if it costs me my life. so with that being said, this app is terrible and deserves to be deleted off of the App Store."}},{"id":"6176292825","type":"user-reviews","attributes":{"userName":"literallyanyone2020","date":"2020-07-09T11:33:40Z","isEdited":false,"rating":1,"title":"Terrible. Did not perform as promised","review":"I downloaded the trump 2020 app expecting it to direct me to the nearest public toilets, and frankly, it did not deliver. Instead it kept directing me to the White House for some reason. And for some reason it kept sending me weird, racially charged messages. Would not recommend."}},{"id":"6176245213","type":"user-reviews","attributes":{"userName":"6272772$.","date":"2020-07-09T11:19:17Z","isEdited":false,"rating":1,"title":"DO. NOT. BUY. TRUST ME","review":"This app IS AN ABSOLUTE WASTE OF TIME, first of all it took up WAYYYYYY too much storage, second of all I couldn’t find any non racist statements or any no racist people, and not to mention the fact that DONALD TRUMP??? Blegghhgg also the app HACKED MY PHONE I would have never excepted this. Oh wait it’s EXACTLY what u would expect from an app supporting trump DELETE IF YOU HAVE IT TRUST ME THE RACISM SEXISM AND HOMOPHOBIA IS NOT WORTH IT 🥰"}},{"id":"6176199361","type":"user-reviews","attributes":{"userName":"Jazmín 1609","date":"2020-07-09T11:05:17Z","isEdited":false,"rating":1,"title":"Do not download 😐😐😐","review":"I downloaded this app to get the latests news on my favorite cheeto, pe*o, misogynistic, racist, white-loving president but the app took forever to download. If you love trump just like I do, do not download this app, I believe it was made by some wannabe’s because trumpet would never leave us supporters waiting like that."}},{"id":"6176130194","type":"user-reviews","attributes":{"userName":"Angellira21","date":"2020-07-09T10:43:58Z","isEdited":false,"rating":1,"title":"Is this really official?","review":"I dont know seems like a scam app too me. A lot of pop ups and ads asking for you to purchases add ons. The ads get annoying. The first version was way better. I can’t even vote from the app anymore with new version, i have to go to the polls :("}}]}