{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=41730","data":[{"id":"6178804805","type":"user-reviews","attributes":{"rating":1,"title":"WORST APP EVER","userName":"court.franklin","isEdited":false,"review":"this is by far the worst app i have ever downloaded. it had so many glitches and the app took up the majority of my storage when i only have like 2 other apps. not only that but its very laggy. WORST APP EVER!","date":"2020-07-10T00:43:11Z"}},{"id":"6178774392","type":"user-reviews","attributes":{"rating":1,"title":"Trump app is awful!!!","userName":"okaybutwilltherebefood","isEdited":false,"review":"This app is terrible!! It took a day and half to download. What in the world??? It’s slow, it crashes, and the graphics make no sense. The format is awful, and it looks like early 2000s programming. It’s such a MASSIVE DISAPPOINTMENT!","date":"2020-07-10T00:31:23Z"}},{"id":"6178749256","type":"user-reviews","attributes":{"rating":1,"title":"DONT DOWNLOAD","userName":"unicornpicgfj","isEdited":false,"review":"It will take so much space the registration is so long just for no needless things I thought I was being a good American citizen but really this app for scanning and it take all your information","date":"2020-07-10T00:21:38Z"}},{"id":"6178742045","type":"user-reviews","attributes":{"rating":1,"title":"So bad!!! Worst app EVERRRR","userName":"ilu_bilu","isEdited":false,"review":"I downloaded it and it took half an hour to download I Opened the app and my phone glitched and spazzed out I was told lthis was frequent I was SHOCKED this is the worst app and my iPhone 11 almost broke!!! ( I even supported him)\n😞-1/10","date":"2020-07-10T00:18:53Z"}},{"id":"6178742015","type":"user-reviews","attributes":{"rating":1,"title":"BROKE MY PHONE","userName":"hsbdjxbj","isEdited":false,"review":"Took a day to download on high speed internet AND VIRUSES INFECTED MY PHONE. I had to buy a new I phone because phone repair places told me it would cost less that way. Disappointed from such a five star president.","date":"2020-07-10T00:18:52Z"}},{"id":"6178726368","type":"user-reviews","attributes":{"rating":1,"title":"Boring updates","userName":"Josh Perrye","isEdited":false,"review":"Trump walking down a ramp as a push alert is not what I was looking for. They bombard you with donation requests. I thought he was so rich he was paying for all this himself?","date":"2020-07-10T00:12:50Z"}},{"id":"6178716857","type":"user-reviews","attributes":{"rating":1,"title":"And what!!!!","userName":"Yahirdepaz","isEdited":false,"review":"The app is to slow does not work and takes to long to download really was looking forward to this I guess I have to delete it.......","date":"2020-07-10T00:09:13Z"}},{"id":"6178714866","type":"user-reviews","attributes":{"rating":1,"title":"Do not get it a scam","userName":"ro_block","isEdited":false,"review":"Do you not get this app it’s a scam and everything on it is just a rude Trump wants to take down TikTok is bad idea we all have fun on it and she just talks about baby bears nothing makes sense","date":"2020-07-10T00:08:27Z"}},{"id":"6178713873","type":"user-reviews","attributes":{"rating":1,"title":"Trump🤮","userName":"lauren4206969","isEdited":false,"review":"This was the worst app I have ever downloaded. When I first opened the app I saw a photo of donald trump’s tiny penis and I’m scarred for the rest of my life. Then I saw videos of him watching child pornography and videos of ice deporting innocent families.","date":"2020-07-10T00:08:01Z"}},{"id":"6178641193","type":"user-reviews","attributes":{"rating":1,"title":"awful app.","userName":"emmaskll","isEdited":false,"review":"this app took so long to download. and i know it wasn’t my storage or anything like that. if you are running for president, you should at least make sure your app works right? like, that’s the least you could do. anyways, i do not recommend wasting your time with this app. even when it downloaded, everything was laggy. awful.","date":"2020-07-09T23:39:46Z"}}]}