{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28170","data":[{"id":"6173270865","type":"user-reviews","attributes":{"isEdited":false,"title":"Disgusting","userName":"MysticalErza","rating":1,"review":"I am absolutely appalled by this app! It took a month to download and it’s taking up 14gb of storage! And when the app did finally download and I opened it, it deleted every other application on my phone and said I was ugly!! This should be taken down from the App Store!!","date":"2020-07-08T18:28:03Z"}},{"id":"6173245810","type":"user-reviews","attributes":{"isEdited":false,"title":"TERRIBLE","userName":"unicornpoop27","rating":1,"review":"This app is awful. I downloaded it to make fun of people, now all of my apps are orange🍊I think they’ve been hanging out with this app too much. It’s a very very bad influence on the others. The only app that didn’t turn orange🍊Was ✨Tiktok✨ i’m not one for choosing favorites but… The Chito man has left me no choice🤷‍♀️✌️","date":"2020-07-08T18:19:48Z"}},{"id":"6173225494","type":"user-reviews","attributes":{"isEdited":false,"title":"Froze my phone","userName":"Sy.paris","rating":1,"review":"This app made my phone freeze for an entire day. After I finally got my phon to work the app wasn’t even downloaded. Same thong happened when I tried again. Very disappointed and will not be trying any longer.","date":"2020-07-08T18:13:05Z"}},{"id":"6173198601","type":"user-reviews","attributes":{"isEdited":false,"title":"So horrible it ruined me","userName":"jackobobacko","rating":1,"review":"I was planning on getting the app but then as i was getting it my mom looked at my phone and then slapped it out of my hand and sold me to the cast of river dale ☹️ i feel like my ears are on fire everytime they talk and now they are talking about sacrificing me to the pigs because i’m a piggy too","date":"2020-07-08T18:04:08Z"}},{"id":"6173198431","type":"user-reviews","attributes":{"isEdited":false,"title":"WORST APP EVER.","userName":"Selena Marin❤️","rating":1,"review":"This app made my phone glitch and lag so bad that i had to get a completely new one! I am so frustrated. Before downloading this app my phone was fine! I want this app deleted. This is not ok. I also read that this was happening to other people. Fix the app or delete it.","date":"2020-07-08T18:04:05Z"}},{"id":"6173193795","type":"user-reviews","attributes":{"isEdited":false,"title":"Donald Trump has worms for brains","userName":"K_G_T","rating":1,"review":"I downloaded this dumb app just to give it a bad rating and get it taken off the App Store. My intentions was to stop his racist, homophobic, transphobic, sexist, xenophobic, and Islamaphobic ideals from being further shared through this app. In which it encourages voters to choose him to continue to lead this country horribly😊","date":"2020-07-08T18:02:36Z"}},{"id":"6173189946","type":"user-reviews","attributes":{"isEdited":false,"title":"Made MY PHONE CRASH","userName":"redheadedgamer22.43","rating":1,"review":"This literally made my phone crash, I have the 11 and that shouldn’t of happened but it DID. This is app needs to be taken down due to the amount of glitches in this app it’s ruining people’s phones!!!!!!\n\nThis app should have been developed better and developed by BETTER PEOPLE!","date":"2020-07-08T18:01:21Z"}},{"id":"6173184234","type":"user-reviews","attributes":{"isEdited":false,"title":"HORRIBLE APP","userName":"sig5363","rating":1,"review":"this app gets less than one star because it represents the president that runs this country. it is a symbol of hate, and anyone that still supports him is ignorant. he is a racist, misogynist, & overall bad person who doesn’t bring any class or decency to the white house or the united states government.","date":"2020-07-08T17:59:32Z"}},{"id":"6173161358","type":"user-reviews","attributes":{"isEdited":false,"title":"calling","userName":"fycy un","rating":1,"review":"when you download the app you have to enter your phone number and after i signed up a random number kept calling me and sending me random messages about raping me and that they’re going to find me honestly if this is YALL president what a shame.","date":"2020-07-08T17:52:12Z"}},{"id":"6173109611","type":"user-reviews","attributes":{"isEdited":false,"title":"The app doesn’t work","userName":"thicc xoxoxoxoxoxo","rating":1,"review":"I honestly can’t get on the app for some reason I don’t know why it just just doesn’t let me and this app took so long for it to download like very long almost 35 minutes can u believe that this app is the worst I can’t take this any more","date":"2020-07-08T17:35:51Z"}}]}