{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27300","data":[{"id":"6177744597","type":"user-reviews","attributes":{"title":"I FEEL VIOLATED","date":"2020-07-09T18:24:04Z","isEdited":false,"rating":1,"review":"so i downloaded the app to see what trumps plans were for the year of 2020 i kid you not two weeks later the secret service showed up and made me get a spray tan the color orange and forced me to cut and dye my hair and when i asked why they completely ignored me these acts were completely outrageous DONT DOWNLOAD PLEASE","userName":"sad trump look alike 😔"}},{"id":"6177719114","type":"user-reviews","attributes":{"title":"Not worth it","date":"2020-07-09T18:16:26Z","isEdited":false,"rating":1,"review":"It has you make an account right as you go in. Why? We are only looking at documents and characters just to see what trump is doing. Okay, now for the real news. I love the new movie and we need more apps so why can’t trump make that happen?","userName":"TheRidgeChannel_YT"}},{"id":"6177704207","type":"user-reviews","attributes":{"title":"App Issules","date":"2020-07-09T18:11:57Z","isEdited":false,"rating":1,"review":"They use use basic words in the app🙄 Now why would they do that when majority of the white colonizers can’t read! Ughh. Who is the manager of this app?  I demand that they make CHANGES! Also the graphics are HORRID!!😠 WHY IS THERE A HALF DED FAKE TAN MAN ON THE PAGE WE FIRST SEE! THE AGE REQUIREMENT FOR THIS APP SHOULD'VE BEEN 50+! Disgusting! I will NEVER EVER use this app AGAIN. And neither should ANYONE!","userName":"Archive is confusing AF"}},{"id":"6177695381","type":"user-reviews","attributes":{"title":"Absolutely horrible","date":"2020-07-09T18:09:18Z","isEdited":false,"rating":1,"review":"This man supports the Confederate Flag and backs up racists and is threatening taking away schools fundings if they don’t re open soon which can kill MANY people in our nation just so that big businesses can make money again. Plus this app is 17+ and thats kind of scary","userName":"Jahootey_"}},{"id":"6177683973","type":"user-reviews","attributes":{"title":"Super buggy","date":"2020-07-09T18:05:47Z","isEdited":false,"rating":1,"review":"The UI is trash and the information is so horribly displayed that you can’t learn anything from it. For being the top “news” app on the App Store you would expect it to be better, right. Apple shouldn’t let this be on their platform","userName":"Mttexas"}},{"id":"6177626658","type":"user-reviews","attributes":{"title":"no💕","date":"2020-07-09T17:47:21Z","isEdited":false,"rating":1,"review":"As soon as I opened this app I was completely startled by the creepy orange deranged face the greeted me. It knocked me off my feet so by bad that I broke my elbow. So if you support him, that nasty orange creature, you support broken elbows. I even wrote him a letter, demanding the cost for my hospital bills. Then he had the AUDACITY to tell ME quote on quote “I DON’T CARE THAT YOU BROKE YOUR ELBOW”.    how rude.","userName":"✨baby big booty judy✨"}},{"id":"6177621404","type":"user-reviews","attributes":{"title":"what a waste of time","date":"2020-07-09T17:45:39Z","isEdited":false,"rating":1,"review":"i genuinely wanted to recieve updates and news from our wonderful president trump but upon getting the app it took three hours to download and made my phone crash five times! i had to restart my phone in order for it to work again because this app overloaded it so badly. if you’re reading this (even if you’re a trump supporter) please don’t get this app it will waste your time ruin your phone and leave you tremendously disappointed. sorry mr orange trump!! i really tried 😔","userName":"spamalingdong"}},{"id":"6177617219","type":"user-reviews","attributes":{"title":"Just don't download it","date":"2020-07-09T17:44:20Z","isEdited":false,"rating":1,"review":"This wiped out all of my phones data and I saw a man sitting on the toilet looking for toilet paper it was just gross just don't download it it's a troll don't just please don't it makes you go crazy and I saw people robbing a bank please don't download it just please don't","userName":"im a mindreader"}},{"id":"6177612553","type":"user-reviews","attributes":{"title":"it killed my grandma","date":"2020-07-09T17:42:50Z","isEdited":false,"rating":1,"review":"so i downloaded this app and the first thing it did when i opened it was shut down my phone, a few short seconds later it explodes in my hands. i originally gave the app 2 stars because of this but the next day i went to visit my grandma and she was dead on the floor ! i checked the security tapes and it turns out trump came to my grandmas apartment and killed her because i gave the app a low rating, how crazy. anyway 1 star because the app was kinda slow too.","userName":"shhaksksmsk"}},{"id":"6177585507","type":"user-reviews","attributes":{"title":"No❤️","date":"2020-07-09T17:34:10Z","isEdited":false,"rating":1,"review":"I downloaded this app with a will to live now it’s just gone bro. This app stole everything from me, my family won’t even talk to me anymore 😭 \nAfter I got this app my girlfriend called and broke up with me and my friends told me to go commit die. THIS APP HAS TAKEN EVERYTHING FROM ME AND I WONT REST UNTIL I HAVE MY REVENGE. Thx for coming to my ted talk😌","userName":"Artemis Jackson"}}]}