{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26110","data":[{"id":"6173626926","type":"user-reviews","attributes":{"review":"This app is extremely confusing to use and some of it’s functions seem unnecessary? It glitches constantly and causes my phone screen to turn white without reason!  Very poorly executed design as well, also unappealing to the eyes.","userName":"Wolfyluver","date":"2020-07-08T20:29:57Z","isEdited":false,"title":"This app is unnecessary and confusing","rating":1}},{"id":"6173626255","type":"user-reviews","attributes":{"review":"This is just a terrible app. It made my phone crash several times to the point where I almost needed an new phone. I cannot believe they idiocy in creating this app. Even flappy bird did better than this. I would never ever recommend this app to anyone.","userName":"samibuell","date":"2020-07-08T20:29:44Z","isEdited":false,"title":"Awful app","rating":1}},{"id":"6173622202","type":"user-reviews","attributes":{"review":"This app is AWFUL. My storage is basically free and it took TWO HOURS to download. I cannot support an app that takes forever to download. It was not worth it 0/10 would never use again. #SettleforBiden. Generation Z is NOT going down without a fight. You mess with our app, we’ll mess with yours. 🍊","userName":"KENTRA BOO BERRY","date":"2020-07-08T20:28:19Z","isEdited":false,"title":"Terrible.","rating":1}},{"id":"6173603919","type":"user-reviews","attributes":{"review":"Without even having to be said, the app is irritatingly glitchy. Consistent adds are being displayed pertaining to donations for Donald Trump which ultimately makes the app unusable. Will uninstall. Trump himself is also a vicious fraud, and a rapist to women of which he has paid off large sums to. Utterly disgusting nonetheless.","userName":"decreeson","date":"2020-07-08T20:21:45Z","isEdited":false,"title":"The Worst App I’ve Downloaded On AppStore","rating":1}},{"id":"6173579893","type":"user-reviews","attributes":{"review":"Liar liar pants on fire. What a terrible app. Seems to have a repetitive bug where the news is inconsistent with actual data and current events. Seems more like propaganda than news. Try again.","userName":"SoccerDog98","date":"2020-07-08T20:13:19Z","isEdited":false,"title":"News App? None of the “news” is useful or fact based","rating":1}},{"id":"6173576006","type":"user-reviews","attributes":{"review":"this app has so many problems it’s ridiculous, it shouldn’t even be up anymore. it never works, took forever to download, and there isn’t much to do. this app ruined my phone when i downloaded it. it made it crash and glitch. do not download.","userName":"Me angry me!","date":"2020-07-08T20:11:59Z","isEdited":false,"title":"TERRIBLE","rating":1}},{"id":"6173563557","type":"user-reviews","attributes":{"review":"everytime i open this app it crashes. making me then have to restart my whole entire phone. this app has also given me multiple viruses on my phone. you might have to fix that and all i can say is, this app is terrible DO NOT DOWNLOAD!","userName":"shequea","date":"2020-07-08T20:07:44Z","isEdited":false,"title":"this app is terrible","rating":1}},{"id":"6173549417","type":"user-reviews","attributes":{"review":"this is the worst app ever created. it is completely pointless and a wast of my time. it took HOURS to download and filled up all of my storage. once i downloaded it i received a virus on my phone and i cant remove it. it scammed me of my money and overall just an awful app. i’m so frustrated and angry right now. DO NOT DOWNLOAD THIS APP!!!","userName":"gxjsjskka","date":"2020-07-08T20:02:57Z","isEdited":false,"title":"WORST APP EVER","rating":1}},{"id":"6173536482","type":"user-reviews","attributes":{"review":"If I could give this app a 0 star rating I would it is not worth your time or effort for this stupid app takes like weeks to finish downloading and what all this for an 🍊 and there is sooo much negativity on the app it’s almost like Donald trump id a white supremacists. Oh wait that’s cause he is. Worst app of all time","userName":"knoot_knoot","date":"2020-07-08T19:58:35Z","isEdited":false,"title":"Worst app ever","rating":1}},{"id":"6173536082","type":"user-reviews","attributes":{"review":"This app is the worst app it made my phone glitch and it would not let me out of the app until I had to tern of the phone completely and it started making this music that made a baby  cry so bad until I had to throw my phone off of a building","userName":"issam00774","date":"2020-07-08T19:58:27Z","isEdited":false,"title":"The worst app ever","rating":1}}]}