{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=136530","data":[{"id":"6180203591","type":"user-reviews","attributes":{"userName":"joe9181","date":"2020-07-10T09:07:22Z","isEdited":false,"rating":1,"title":"hateful","review":"I’m disturbed."}},{"id":"6180203521","type":"user-reviews","attributes":{"userName":"Ahdhydbd","date":"2020-07-10T09:07:21Z","isEdited":false,"rating":1,"title":"MAKES PHONE GO CRAZY","review":"Just HORRIBLE"}},{"id":"6180203426","type":"user-reviews","attributes":{"userName":"Nick Keichel","date":"2020-07-10T09:07:19Z","isEdited":false,"rating":1,"title":"1 Star reason","review":"The app keeps crashing and kicking me out of it every time I open it and it’s getting annoying"}},{"id":"6180203095","type":"user-reviews","attributes":{"userName":"Corrupted Pandas","date":"2020-07-10T09:07:12Z","isEdited":false,"rating":1,"title":"Please delete this","review":"ITS HORRIBLE I HATE THIS App- It ruined My Phone\nPlease delete this App"}},{"id":"6180202087","type":"user-reviews","attributes":{"userName":"#cute cat","date":"2020-07-10T09:06:52Z","isEdited":false,"rating":1,"title":"Don’t get!!!!!","review":"I got this app to see my wonderful president but it made my phone crash and I had to get a new phone then it keeps making a noise and drove my pet fish crazy and I thought “oh it’s probably nothing” but no it was our president trying to brain wash us to vote for him and long story short I moved states."}},{"id":"6180201023","type":"user-reviews","attributes":{"userName":"hhhhhghghhhh","date":"2020-07-10T09:06:28Z","isEdited":false,"rating":1,"title":"Ahem","review":"Need I say more"}},{"id":"6180200696","type":"user-reviews","attributes":{"userName":"gdhnddnfn","date":"2020-07-10T09:06:21Z","isEdited":false,"rating":1,"title":"why","review":"i can’t Believe this I keep opening the app and it just crashes immediately"}},{"id":"6180200346","type":"user-reviews","attributes":{"userName":"alogator94bcn","date":"2020-07-10T09:06:14Z","isEdited":false,"rating":1,"title":"this app broke my microwave🤬🤬🤬🤬","review":"i downloaded this app 28 days ago and it finally loaded. i was very excited to finally be able to use the app, but unfortunately it wasn’t the experience i expected. i opened the app and the first thing i see is an oversized oompa loompa staring at me, asking me to vote for him. i was too frightened to make any moves, but longer i hesitated, the more furious this man got. his eyes started glowing red, and the glow soon travelled to every corner of my screen. i was frozen in fear. then, the app abruptly switched to a pitch black screen with a loading sign. my initial reaction was, “great, even MORE waiting,” but then the screen changed again, and something peculiar popped up. the app told me to put a roll of tin foil in my microwave and leave it in there for 4 minutes. so i inserted the tin foil, turned on the microwave, and went to go check on my pet wombat while it was microwaving. after 20 seconds, i hear a big boom from my kitchen, and to my surprise, my microwave had blown up, and it was all thanks to this app. my phone, my cabinets, my counters, my stove, my oven, and my sink was obliterated. the only thing that survived was my Samsung RS27T5561SR Side-by-Side with built-in 21.5\" media center Refrigerator - 35.9\" - 26.7 cu ft - Stainless Steel, which is what i’m posting this review from, because as i said before, my phone was a victim of the microwave explosion. and for anyone who is reading this, yes, me and my wombat are fine. anyways, in short, this app is terrible and you should not download it, unless you want it to break your microwave and destroy your kitchen."}},{"id":"6180198849","type":"user-reviews","attributes":{"userName":"bsuahshj","date":"2020-07-10T09:05:41Z","isEdited":false,"rating":1,"title":"Wish I could give 0 stars","review":"I downloaded to see what his plans were and I was let down greatly I wasn’t even able to see anything as no matter what each time I opened the app my phone would crash, and the battery would start to die much faster than usual. With the app open my battery would go from 80% to around 15% within minutes. My phone has never done this before. All I have to say is no matter what you expect to gain from downloading this app, you won’t get it. You won’t be able to stay on the app long enough to see what you need. This app is worthless, if I could give less than 1 star I would."}},{"id":"6180198527","type":"user-reviews","attributes":{"userName":"Aboss0228","date":"2020-07-10T09:05:33Z","isEdited":false,"rating":1,"title":"how abt...no?","review":"literally the worst app ever. It’s worse than google classroom. I hop on here for news and all I saw were disgusting pics of fake news outlets and I just don’t like the layout and the fact that my favorite app is going to be banned is NOT helping me with this"}}]}