{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=89550","data":[{"id":"6176917538","type":"user-reviews","attributes":{"userName":"bfificndbcjdjsdjdj","rating":1,"isEdited":false,"title":"no no no","date":"2020-07-09T14:22:43Z","review":"horrible app kept crashing and extremely bias"}},{"id":"6176883516","type":"user-reviews","attributes":{"userName":"Booster11","rating":1,"isEdited":false,"title":"Terrible","date":"2020-07-09T14:13:46Z","review":"Terrible, just terrible."}},{"id":"6176864701","type":"user-reviews","attributes":{"userName":"Sally Krueger","rating":1,"isEdited":false,"title":"Absolutely Horrible App","date":"2020-07-09T14:08:53Z","review":"Do not download app"}},{"id":"6176853081","type":"user-reviews","attributes":{"userName":"papi.yoshi","rating":1,"isEdited":false,"title":"Hiiiii SIKEEEEE bye","date":"2020-07-09T14:05:48Z","review":"I was told that an orange Cheeto would appear and it did but I’m rating one star cuz he wants to open schools LIKE NOOOO BOOMER"}},{"id":"6176847119","type":"user-reviews","attributes":{"userName":"❤️💂🏽","rating":1,"isEdited":false,"title":"Horrible app","date":"2020-07-09T14:04:14Z","review":"Aw bunker boy is mad because the little teenagers are embarrassing him? That’s ✨sad✨😜😖😭"}},{"id":"6176828344","type":"user-reviews","attributes":{"userName":"geovdievzkfbeiab","rating":1,"isEdited":false,"title":"this app is bad","date":"2020-07-09T13:59:21Z","review":"it keeps crashing and making my phone a mess"}},{"id":"6176804541","type":"user-reviews","attributes":{"userName":"AshleyStephens111","rating":1,"isEdited":false,"title":"horrible nasty","date":"2020-07-09T13:53:00Z","review":"did not like it, the setup is confusing and horrible, much like the environment in america right now"}},{"id":"6176775855","type":"user-reviews","attributes":{"userName":"Queenly390","rating":1,"isEdited":false,"title":"I am homeless because of this app","date":"2020-07-09T13:45:26Z","review":"I’ve supported President Trump since day 1, and when I heard that our amazing president had come out with his own app, I was thrilled!! I immediately downloaded it, and at first, things seemed to be going well. I was enjoying the fun in-app games such as “wallblock”, where the goal is to build a wall fast enough to stop the Mexicans from getting into the USA, and “target practice”, where you are a white cop aiming at as many unarmed black civilians as possible. The games are amazing, but unfortunately this doesn’t hold true for the rest of the app. Apparently the software tracks all activity on your phone!! For instance, I ACCIDENTALLY clicked on a CNN article in the Apple news app. I quickly backtracked because I don’t listen to fake liberal news, but the damage was done. I heard a shrill screech from outside, followed by a loud thud. Confused, I opened my front door and a rabid fox leaped in.\n“FOX NEWS IS THE ONLY NEWS” it snarled, and proceeded to rip my phone from my hand and chew it to shreds. It moved around my house, chewing and scratching until my priceless 18th century home was reduced to a pile of rubble. And as if that wasn’t enough, it sat down in the rubble and pooped out all the furniture, clothes, and electronics it had eaten. Insurance refused to go near my house because it smelled SO BAD. My town had to evacuate and I am now homeless. TLDR: a fox sent by Fox News destroyed my house and ruined my life. DO NOT DOWNLOAD THIS APP - BIDEN 2020"}},{"id":"6176762341","type":"user-reviews","attributes":{"userName":"MAE TRIBE","rating":1,"isEdited":false,"title":"HORRIBLE HORRIBLE APP","date":"2020-07-09T13:41:50Z","review":"Super frustrating and took days to download"}},{"id":"6176760426","type":"user-reviews","attributes":{"userName":"Lilly Miresse","rating":1,"isEdited":false,"title":"the worst app","date":"2020-07-09T13:41:21Z","review":"when i downloaded this app my phone broke and i had to get a new one"}}]}