{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=143070","data":[{"id":"6179247068","type":"user-reviews","attributes":{"rating":1,"title":"🍄💕It’s shit🧚🏻‍♂️✨","userName":"the fuckkkk","review":"🧚🏻‍♂️✨Don’t download it’s a peaches of shit✨🍄","date":"2020-07-10T03:25:44Z","isEdited":false}},{"id":"6179247088","type":"user-reviews","attributes":{"rating":1,"title":"Terrible","userName":"One Lonely Person","review":"Don’t vote trump he bad","date":"2020-07-10T03:25:44Z","isEdited":false}},{"id":"6179246934","type":"user-reviews","attributes":{"rating":1,"title":"Idk why I am here TikTok","userName":"teeltok","review":"TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok TikTok","date":"2020-07-10T03:25:41Z","isEdited":false}},{"id":"6179246820","type":"user-reviews","attributes":{"rating":1,"title":"I’m scared luv","userName":"thisistragic","review":"I was casually strolling down the street, when out popped a man that resembled a pasty white tapeworm. He asked me to take him to my place of work. I hesitated, but reluctantly agreed. As we arrived, I asked him which treatment he would like to receive. He said he would like the most expensive option. I pulled out the darkest shade and began to apply the tanning lotion to this man. After I was finished, he no longer resembled a tapeworm, but rather, a dusty stale Cheeto that had been stepped on and then sweeped into cat throw up.","date":"2020-07-10T03:25:38Z","isEdited":false}},{"id":"6179246775","type":"user-reviews","attributes":{"rating":1,"title":"zero","userName":"Maddi ro","review":"there needs to be an option for zero stars... this app was just slow and honestly not worth the space on the phone","date":"2020-07-10T03:25:37Z","isEdited":false}},{"id":"6179246560","type":"user-reviews","attributes":{"rating":1,"title":"AWFUL HACKED MY PHONE","userName":"wolfganggirl","review":"✨🧚This abomination of an app not only hacked my phone but also is spyware!! All going to president trump disgusting!!🧚✨","date":"2020-07-10T03:25:34Z","isEdited":false}},{"id":"6179246514","type":"user-reviews","attributes":{"rating":1,"title":"Horrible","userName":"Madeleine 1234567890","review":"It turned my whole screen orange!!","date":"2020-07-10T03:25:33Z","isEdited":false}},{"id":"6179246521","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE APP","userName":"BLM! BLM!","review":"Trump 2020 💞🧚🏼✨ but on a tombstone 💫🌸🙈","date":"2020-07-10T03:25:33Z","isEdited":false}},{"id":"6179246322","type":"user-reviews","attributes":{"rating":1,"title":"trump app","userName":"クラフリン","review":"terrible app for a terrible president","date":"2020-07-10T03:25:28Z","isEdited":false}},{"id":"6179246297","type":"user-reviews","attributes":{"rating":1,"title":"THIS APP IS TERRIBLE","userName":"abcdefghijklmno0197","review":"It should not be an app and should be taken off the app store. It caused me a lot of problems","date":"2020-07-10T03:25:27Z","isEdited":false}}]}