{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=13300","data":[{"id":"6178885291","type":"user-reviews","attributes":{"userName":"tenwavess","date":"2020-07-10T01:13:18Z","review":"For the record if I could\nleave a rating of less than 1 I would. When I decided to download the app it took 4 days. After it finally downloaded I was notified that I had gotten a virus on my phone??? What is this?? This is unacceptable! Right after I started to receive weird phone calls and texts. Not to mention when I tried to use the app it would crash every time. All in all VOTE THIS CHEETO HEAD OUT IN NOVEMBER!!!!!!","title":"TERRIBLE APP!","isEdited":false,"rating":1}},{"id":"6178860752","type":"user-reviews","attributes":{"userName":"sam quinonez","date":"2020-07-10T01:04:26Z","review":"I wanted to support our lovely orange president but it took 42 hours to download. Once I opened the app it set off a VIRUS in my phone 😾. I had to take my phone to the apple store and yell at the manager for hours so that they could fix my phone. Not only that but when i went back to the app they kept sending me photos of Donald trump fighting Joe Biden in a bikini, horrible. After it sent a Spirit after me and now I am haunted. I DONT RECOMMEND AT ALL, ITS A HORRIBLE APP!!!!","title":"DO NOT DOWNLOAD THIS APP","isEdited":false,"rating":1}},{"id":"6178822915","type":"user-reviews","attributes":{"userName":"Art+BookDork","date":"2020-07-10T00:50:06Z","review":"absolutely DISGUSTING \nit took 78 hours to download. then i opened it and starting singing baby shark. then all of a sudden trump came on and said ‘build the wall’ like excuse me? then it froze my phone for 89 years. \n\nI told them i needed to walk my fish but they told me that it was illegal? like since when? kids these days 🙄 also i tried to call my aunt’s grandma’s cousin’s dog on there but apparently they couldn’t find it like the AUDACITY. would not recommend.","title":"NOT OKAY","isEdited":false,"rating":1}},{"id":"6178799993","type":"user-reviews","attributes":{"userName":"DontBother Reveiws","date":"2020-07-10T00:41:15Z","review":"I tried to get the app Monday but it would only download if I was right by my WiFi box. It took me forever to figure that out. Then I try to open the app and it’s all black you saw literally nothing I kept trying to get in but I couldn’t. When I finally got into it I was super disappointed so I just deleted it. This app is trash and I would not recommend getting it, it is a waste of time. 🗑🤮😪","title":"Trash 🙄","isEdited":false,"rating":1}},{"id":"6178749965","type":"user-reviews","attributes":{"userName":"hehwfdnhr","date":"2020-07-10T00:21:54Z","review":"This app is super glitchy and basically shut down my entire phone as well as all of my apps! Some guy got my phone number from this and asked me if I could buy him flop flip! He told me crazy facts that were inappropriate in all ways! This app is filled with racist quotes and terrifying content! Finally on the app it said to drink bleach and my son did and it ended in pour resolutes!","title":"Take this app down along with our idiot of a president!","isEdited":false,"rating":1}},{"id":"6178580351","type":"user-reviews","attributes":{"userName":"jednna","date":"2020-07-09T23:15:51Z","review":"i was so excited to download this app and show support to our president but when i did i regretted it immediately. as soon as i downloaded this app the home button on my phone stopped working. i’ve seen other reviews saying this app gave them a virus, i wish i had believed them. now i have to buy a new phone. don’t waste ur time downloading this unless ur willing to risk spending money on a new phone!","title":"DO NOT DOWNLOAD","isEdited":false,"rating":1}},{"id":"6178571065","type":"user-reviews","attributes":{"userName":"aavannaaaasssa","date":"2020-07-09T23:12:18Z","review":"This app took 2 days to download! I was so excited to support my trump daddy but as soon as it FINALLY downloaded, my whole phone crashed! Battery instantly drained, even after charging my phone for 4 hours it was still at 20%! Every app I try to use now crashes and why was once a great phone is now virtually useless (just like trump) will never download again and will be voting blue In November!","title":"Worst app ever!","isEdited":false,"rating":1}},{"id":"6178562465","type":"user-reviews","attributes":{"userName":"not.jasmine","date":"2020-07-09T23:09:05Z","review":"Terrible app it finally downloaded after 365 days only to start play SHAWTY LIKE A MELODY IN MY HEAD air soon attracted all the roaches in my house I kill fed them all cuz duh but then my cat ate a toaster because I like water and there was a bus outside my water bottle then I am ate I a musical rat called 69 he started screaming then I jumped into a wall then I died then I came back to life at the end of the 4 I didn’t eat for 6 days because I did eat for 6 days so then yeah","title":"Terrible app","isEdited":false,"rating":1}},{"id":"6178548670","type":"user-reviews","attributes":{"userName":"Silicth","date":"2020-07-09T23:03:30Z","review":"I love my president but they never decided to fix the huge bug to where the app takes OVER A DAY to download. This is honestly a disgrace to Apple to have this app on its shelves and make it the #1 on News. This app deserves a #1 on the longest download on an Apple application ever. This is disgusting and needs to be taken down immediately. It’s better off sticking to a website then going on the Apple Store...","title":"The Worst App To Ever Hit The Apple Store","isEdited":false,"rating":1}},{"id":"6178495922","type":"user-reviews","attributes":{"userName":"Great game😄😄😄😄👌","date":"2020-07-09T22:42:27Z","review":"Even though I strive to support our president everyday, I cannot use this trash app. Though I am sure that Donald Trump has nothing to do with this dumbster fire of a download it is making me question my undying allegiance to the Trump campaign. I did not get notifications for new rallies in my area or anything. This app simply does not work. Hopefully they will try to fix the bugs present in this app and restore my faith to America’s savior Donald J. Trump.","title":"What a failure","isEdited":false,"rating":1}}]}