{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31840","data":[{"id":"6173019868","type":"user-reviews","attributes":{"date":"2020-07-08T17:07:17Z","title":"Don’t download","rating":1,"isEdited":false,"userName":"th4tB0iSosa","review":"This app made my phone work very terrible I couldn’t even properly use it I was looking for a reason why I should vote for trump but all I got was reasons not to vote for him so do not download this app it will make your phone work terrible"}},{"id":"6173009443","type":"user-reviews","attributes":{"date":"2020-07-08T17:04:07Z","title":"doesn’t work","rating":1,"isEdited":false,"userName":"imarealperson1","review":"This app does not work. It took 10 hours to download and when it did, it would not stop glitching. I couldn’t even use it and my phone stopped working a while after I opened the app."}},{"id":"6172983462","type":"user-reviews","attributes":{"date":"2020-07-08T16:56:14Z","title":"Never Download This App","rating":1,"isEdited":false,"userName":"BootyKilla476","review":"I downloaded this app to see the good things our president has been doing and the app kept freezing ‼️ also the rewards option doesn’t work! This app needs to be deleted ASAP Gen Z don’t let us down also i hate trump ❤️ k bye"}},{"id":"6172983243","type":"user-reviews","attributes":{"date":"2020-07-08T16:56:10Z","title":"Bad app bad president","rating":1,"isEdited":false,"userName":"leah07tlc","review":"This app is so bad I did not find anything relatable to why I should vote this man president but I can’t he’s taking away things that we love and he download this app just to get it out there to his“Trump supporters“ he’s not a great fit for America or in our case any place."}},{"id":"6172973494","type":"user-reviews","attributes":{"date":"2020-07-08T16:53:09Z","title":"I CANT BELIEVE THIS","rating":1,"isEdited":false,"userName":"Oh Man, It's A Rat","review":"Right after i downloaded this app, my cat was hacked. It stabbed my Roomba, and proceeded to jump in the water, electrocuting my pet dog who was taking a bath. All I wanted to do was support our wonderful President, and this is how I’m repaid?? With an app that electrocutes my DOG?? If I could rate it less, I most definitely would."}},{"id":"6172907670","type":"user-reviews","attributes":{"date":"2020-07-08T16:32:38Z","title":"Reallly Bad","rating":1,"isEdited":false,"userName":"Janitza Beltran","review":"Not helpful, I opened it and a badger came in through the window and smashed into my face. I thought it was a coinky dunk but I opened the app again and an ocelot flew in from my skylight and scratched me up really bad. This app is nightmare. DO NOT GET IT. it’s a threat to many lives. Thank god I managed to fight them off."}},{"id":"6172905146","type":"user-reviews","attributes":{"date":"2020-07-08T16:31:50Z","title":"Fascists.","rating":1,"isEdited":false,"userName":"Down with donald","review":"This app caused many deaths and threatens life as we know it. Please do not get this app, it is very laggy and glitchy. Everytime id open the app up in would make my phone have a virus. I also have never hated a human being more than I hate trump. ✨✨✨👑🤡🧚🏻‍♀️so point is no❤️"}},{"id":"6172876372","type":"user-reviews","attributes":{"date":"2020-07-08T16:23:04Z","title":"Trump is a terrible president and I’m happy we will voting for the next president soon","rating":1,"isEdited":false,"userName":"Trump is a terrible president","review":"This is a absolutely terrible app it took the hole day download and honestly it says we will keep America great whenever all he has done is make America a terrible and even more polluted place"}},{"id":"6172864799","type":"user-reviews","attributes":{"date":"2020-07-08T16:19:31Z","title":"Worst app ever","rating":1,"isEdited":false,"userName":"trash😒","review":"This app is complete trash. I had so many problems with it. There were lies posted everywhere. It also supports racist which is horrible as well. I would not recommend this app unless you don’t have any self dignity left."}},{"id":"6172849264","type":"user-reviews","attributes":{"date":"2020-07-08T16:14:51Z","title":"This app is trash","rating":1,"isEdited":false,"userName":"lydi...1817","review":"When I first got it it asked for my location which is not needed, it took my personal data and I had to delete the ap as quickly as possible but i am now scared that they’ll break I to my house"}}]}