{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26160","data":[{"id":"6173174591","type":"user-reviews","attributes":{"userName":"analia_789","date":"2020-07-08T17:56:24Z","review":"When I first opened the app I saw a Cheeto staring back at me and I closed the app immediately before it blinded me and I just wanted to come on here and say y’all boomers can stop ruining our futures we don’t want an orange with a bad history of things to be in office again thank you 🙈✨.","rating":1,"isEdited":false,"title":"Horrible just horrible 🥴"}},{"id":"6173153654","type":"user-reviews","attributes":{"userName":"indu on tiktok","date":"2020-07-08T17:49:47Z","review":"I downloaded this app and thought i could finally see what all these boomers and conservatives were talking about- now i am traumatized and keep getting nightmares of white and orange people uniting to make america horrible. i am now suing bc i cant afford therapy bills on my own reeeeeeeeeeee\n\nsincerely, someone from genz","rating":1,"isEdited":false,"title":"the orange in office is no more :,o"}},{"id":"6173152749","type":"user-reviews","attributes":{"userName":"imDisapointedInYouTrump","date":"2020-07-08T17:49:29Z","review":"I am so enraged because the app kept glitching so much that when my dad was using the app and HIS PHONE BLEW UP IN HIS HANDS BECAUSE OF THIS!!! He’s now in the hospital and I need an explanation. He’s suffering from electric shock wounds. This is absolutely insane. trump I’m so  severely disappointed in you. This app caused severe injuries I’m so worried about my ol man. Send prayers and don’t use this app!😡","rating":1,"isEdited":false,"title":"😡"}},{"id":"6173151228","type":"user-reviews","attributes":{"userName":"Fief she","date":"2020-07-08T17:49:01Z","review":"Trump is an idiot if he can’t even run a show what makes you think he would be a good president. He can’t handle being insulted and can’t handle answering simple questions truthfully, in fact I don’t think he has done anything truthfully. Like when he says he loves someone. (Complete idiot)","rating":1,"isEdited":false,"title":"Stupid"}},{"id":"6173140490","type":"user-reviews","attributes":{"userName":"cuckdydjcifyeufifyshf","date":"2020-07-08T17:45:36Z","review":"The app made my phone glitch and malfunction. The music it had attracted cockroaches and a bunch of other insect. This app is the worst ever app I have ever downloaded. Not to mention if you use your phone number it will save it in the system and they will track you and you don't want that!!!!!","rating":1,"isEdited":false,"title":"DON'T DOWNLOAD"}},{"id":"6173137245","type":"user-reviews","attributes":{"userName":"Games Reviewz","date":"2020-07-08T17:44:37Z","review":"The app is too glitchy and also I brought this app in attempt to find somethings that would make people  want to vote for trump but I couldn’t find anything nothing will change that fact that he a terrible president and a terrible person.","rating":1,"isEdited":false,"title":"Glitchy"}},{"id":"6173117533","type":"user-reviews","attributes":{"userName":"bry_banana21","date":"2020-07-08T17:38:24Z","review":"I downloaded his app to see reasons on how I could see how good of a president he was. This clearly didn’t help. It just is the worst app ever. And he is planning on banning tiktok from the us so that makes it 100x worse. So if you plan on downloading this app don’t it’s just a waist of time. \n\n                      Your welcome","rating":1,"isEdited":false,"title":"Ruined my life"}},{"id":"6173113707","type":"user-reviews","attributes":{"userName":"f he sergfjkiutffswwqa","date":"2020-07-08T17:37:09Z","review":"This guy makes my stomach hurt, Cinnamon Hitler has gone too far and gen z will not stand for it. With ICE concentration camps, the censorship of TikTok (if it gets banned of course) , raping young children and lying about it, and so many more issues; i can’t see why anyone would wanna stare at his face for 4 more years. Would rate 0-5 if possible.","rating":1,"isEdited":false,"title":"vote blue"}},{"id":"6173088823","type":"user-reviews","attributes":{"userName":"POed citazen","date":"2020-07-08T17:29:11Z","review":"i had high hopes for this app you know you would think for a billionaire you would’ve put in more money into this app, it took hours to upload it glitched me out having to log in every time worst app ever definitely do not recomend not voting for you you piece of trash can","rating":1,"isEdited":false,"title":"WORST app ever"}},{"id":"6173045269","type":"user-reviews","attributes":{"userName":"gaygirljoe","date":"2020-07-08T17:15:12Z","review":"I just wanted to support our president but the app took 1000 hours to download! As soon as I opened the app it started playin  really loud death metal that made my 2 year old brother die! That’s not even the worst part! After my little brother died from trumps very horrible death metal, my thumb fell off! It was vv painful and I now HATE trump","rating":1,"isEdited":false,"title":"DO NOT DOWNLOAD!!"}}]}