{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31540","data":[{"id":"6176450484","type":"user-reviews","attributes":{"isEdited":false,"title":"HORRIBLE","rating":1,"date":"2020-07-09T12:18:00Z","userName":"hann714","review":"If I could give this app no stars I would. After downloading this app all of the technology in my house glitched and I was not able to use it for three days. The app asked for my phone number which I found inappropriate and misleading. DO NOT DOWNLOAD."}},{"id":"6176440986","type":"user-reviews","attributes":{"isEdited":false,"title":"Took very long","rating":1,"date":"2020-07-09T12:15:23Z","userName":"momo8826378","review":"This app has many misleading information and took days to download, and my phone tends to shut off every time i open if, and when it does works(very rarely) my phone becomes very hot, hotter than stanan’s house cat"}},{"id":"6176439802","type":"user-reviews","attributes":{"isEdited":false,"title":"BUNKER BOY CANNOT BE TRUSTED","rating":1,"date":"2020-07-09T12:15:03Z","userName":"caitlin45799063","review":"I downloaded this app to access our faithful and beautiful president’s events and merchandise, only to discover that he is actually a racist, homophobic, egotistical liar! I could not believe it! I felt so betrayed that I just had to leave a review. Our precious president cannot be trusted. Do not download this app!!"}},{"id":"6176435576","type":"user-reviews","attributes":{"isEdited":false,"title":"disgusted 🤢","rating":1,"date":"2020-07-09T12:13:55Z","userName":"alexandric","review":"this app is one of the worst apps i've ever seen. the color scheme is completely off, and as soon as i saw that creature i threw up!!! can you believe that? will never download again and will tell all my friends NOT to even try"}},{"id":"6176432474","type":"user-reviews","attributes":{"isEdited":false,"title":"Don’t recommend","rating":1,"date":"2020-07-09T12:13:04Z","userName":"dominationk05","review":"It’s a terrible app. It says it works on my phone but nothing came up when I downloaded it. Nothing work and too many ads were showed. If I could give it a 0/5 stars I would."}},{"id":"6176422994","type":"user-reviews","attributes":{"isEdited":false,"title":"Not recommended","rating":1,"date":"2020-07-09T12:10:28Z","userName":"s haghv","review":"The app would not load and it took several hours to download I would never recommend it to a friend to use there is probably a better app out there to use."}},{"id":"6176417731","type":"user-reviews","attributes":{"isEdited":false,"title":"DONT DONWLOAD","rating":1,"date":"2020-07-09T12:09:01Z","userName":"Uanni96","review":"I thought I would download this up to support my president but as soon as I did it he asked FOR MY AGE SIR THIS IS NOT A DATING APP but with my morbid curiosity I typed in my age and he instantly tried to get me to send nasty pictures and disgusting text I said sir I’m a 8 month fetus this is unlawful so yeah don’t donwload this app my fellow infants"}},{"id":"6176345486","type":"user-reviews","attributes":{"isEdited":false,"title":"SO MANY VIRUSES","rating":1,"date":"2020-07-09T11:48:53Z","userName":"Dump Trumperson","review":"I got this app to support out progressive, petite handed, non racist president... However after downloading the app I received so many viruses throughout my phone AND body.. My skin is turning orange and my hair is starting to fall out! I’m also starting the early signs of dementia. Please learn from me and DO NOT GET THE APP!"}},{"id":"6176304246","type":"user-reviews","attributes":{"isEdited":false,"title":"Hi Mr. Trump","rating":1,"date":"2020-07-09T11:37:00Z","userName":"sjjsajajsn","review":"I would write a long roast about how your presidency is a disgrace to the American people, but your lack of intelligence wouldn’t allow you to understand any of my words. Please go on weight watchers and buy a new hair color, because you currently look like that musty hot cheetoh under my couch."}},{"id":"6176231442","type":"user-reviews","attributes":{"isEdited":false,"title":"Absolutely just awful","rating":1,"date":"2020-07-09T11:15:03Z","userName":"Michael pencil 💛","review":"One of the worst apps I have ever downloaded. I got it and then it charged my card without telling me and kept charging it!!!! On a DAILY BASIS! Totally whipped my bank account, and I didn’t even get a stimulus check :/"}}]}