{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42720","data":[{"id":"6174954524","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:53:12Z","review":"this app is cursed after downloading it my entire phone exploded killing me and turning me into a zombie so that i was able to write this review. do not download unless u r willing to become one of the undead.","userName":"i.did.not.write.this.","title":"WISH I COULD GIVE ZERO STARS"}},{"id":"6174949896","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:51:47Z","review":"This is one of the worst apps I have ever made does not have any use to it. It also waists your time just even signing up to the app. In conclusion this is the worst app of all","userName":"Dan0983925279","title":"Horrible"}},{"id":"6174948277","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:51:18Z","review":"i tried this app to get updates and be more involved with the political part of our country but it functioned horribly!! i’m very disappointed and now will not be educated on important topics like this :(","userName":"sofia the first✨","title":"DO NOT DOWNLOAD"}},{"id":"6174933861","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:46:49Z","review":"this app is crap i downloaded it and instead of giving me information and topics about the president it just kept showing me pictures of of Donald Trump in a speedo what has this world come to smh","userName":"🖤🥶💗🏁","title":"Donald Trump in a speedo"}},{"id":"6174923115","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:43:31Z","review":"Got this app and it erased my phone. Everything in it and the phone itself. GONE. It started slowly erasing things in my house. My bed went missing and my dog too!","userName":"ailedn","title":"Worst experience ever"}},{"id":"6174922300","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:43:16Z","review":"I downloaded this app and two days later my pet rock died... coincidence, I think not!!!!! How am I supposed to recover from that??? He was my best friend and because of this app I no longer have my best friend 🙄🙄","userName":"dancelover_75","title":"Worst app ever!!!!!!!"}},{"id":"6174915126","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:41:08Z","review":"I got the app so I could see how ripe our orange boi was this time of year but then it had the AUDACITY to ask for my phone number. Like NO SIR that is very violating of you. I felt VERY uncomfortable and do not recommend this app or the orange boi who runs it","userName":"djrkrkfnfnf","title":"Orange Boi"}},{"id":"6174914385","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:40:54Z","review":"I downloaded it and it hacked my phone so I had to get a new one because it kept glitching and it had to be destroyed in order to stop the glitch","userName":"FDJTDABAPOTUS","title":"Horrible app"}},{"id":"6174899465","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:36:27Z","review":"When I downloaded it, there was a loud voice coming from my house saying “ IT DOESN’T  MATTER WHAT YOU THINK, WE ARE GOING TO BUILD A WALL” I deleted it and then I saw Trump in my dreams terrorizing my town. I recommend if you want to get haunted. Stay safe kids.","userName":"kvyinv bh","title":"THIS APP IS HAUNTED"}},{"id":"6174897811","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-09T03:35:59Z","review":"This app is horrible. Right after I downloaded it my phone stopped working and had to buy a new one","userName":"xGr0uchyx","title":"Horrible and glitchy"}}]}