{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37870","data":[{"id":"6174419574","type":"user-reviews","attributes":{"rating":1,"title":"Terrible","userName":"KJ62805","isEdited":false,"date":"2020-07-09T01:16:02Z","review":"Went on to the app, to see a whole bunch of fake news. Not just about Biden, but also very very racist articles about how blacks and Asian-Americans should not be allowed to run for president, or any government position. Fix yourself."}},{"id":"6174412126","type":"user-reviews","attributes":{"rating":1,"title":"Spooky 🙈","userName":"idontfeellikeputtingonw","isEdited":false,"date":"2020-07-09T01:13:45Z","review":"This app gave me nothing but spooky vibes. When you first open it it tries to sexually harass you by showing you a picture of a racist orange man that was so #vom 🤮 If I could I would rate this app zero stars. Anyway fam don’t get this it’s nasty. #charliforprez2024"}},{"id":"6174410948","type":"user-reviews","attributes":{"rating":1,"title":"Why should we be tracked","userName":"oliver patrick tedros","isEdited":false,"date":"2020-07-09T01:13:24Z","review":"i think it’s pretty weird that an app is made to organize rallies and inform others on a platform that barely any of its demographic knows how to navigate safely while understanding what they are agreeing to"}},{"id":"6174399536","type":"user-reviews","attributes":{"rating":1,"title":"Offensive","userName":"ZH4943","isEdited":false,"date":"2020-07-09T01:10:00Z","review":"This app’s messaging and UI are horrible. I can’t believe Apple would allow such an app on the App Store. Just a horrible app to use, it is really slow and really hard to use! It made my phone explode!"}},{"id":"6174393145","type":"user-reviews","attributes":{"rating":1,"title":"TERRIBLE CHEETAH ATTACK","userName":"Kaitlynnsicjsmskskzkx","isEdited":false,"date":"2020-07-09T01:08:08Z","review":"this app summoned some dumb pig into my house and then i opened to find a man who looks like a Cheetos which ruined cheetos for me and apparently he wants to delete an app that has saved many of lives including my own so do it and nobody will vote for u."}},{"id":"6174384121","type":"user-reviews","attributes":{"rating":1,"title":"Horrible","userName":"cran123ju","isEdited":false,"date":"2020-07-09T01:05:19Z","review":"This app is just disgusting I got it and look through it and all that stuff and it was like saying trump 2020 and all that stuff and like I mean it’s no it made me feel uncomfortable and dizzy and I ended up passing out"}},{"id":"6174381833","type":"user-reviews","attributes":{"rating":1,"title":"Bad","userName":"biglilboi","isEdited":false,"date":"2020-07-09T01:04:38Z","review":"Bad bad bad what more is there to say what a terrible app it crashed constantly and almost broke my phone with how much data it took with I’m no tech person but I KNOW that shouldn’t happen so DELETE THIS APP or just don’t download!!!!"}},{"id":"6174375609","type":"user-reviews","attributes":{"rating":1,"title":"Titty milk","userName":"cooljid234","isEdited":false,"date":"2020-07-09T01:02:46Z","review":"I would like to personal say that this app ruined my life, first my husband leaves me then my wife then my son then my grandma then my slave owner then my dog then my parents then my dinosaur, I have no one else accept my Netflix and then my Netflix trial expired"}},{"id":"6174374496","type":"user-reviews","attributes":{"rating":1,"title":"So bad😖🤢🤮","userName":"gbbfbb","isEdited":false,"date":"2020-07-09T01:02:25Z","review":"I am Kim's dildo and i aM 21 years old. I wanted to learn more about politics. I opened the app and it sent me to a link were big Cheeto man was naked and got 69 viruses. My phone glitched and big cheeto man naked was on my lock screen while i was showing a presentation 🤢."}},{"id":"6174369661","type":"user-reviews","attributes":{"rating":1,"title":"Horrible","userName":"notmyidentity","isEdited":false,"date":"2020-07-09T01:00:53Z","review":"Horrible quality the search bar is messed up I can only go on the home page I would not recommend this app at all"}}]}