{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27440","data":[{"id":"6174841923","type":"user-reviews","attributes":{"userName":"Hey people!!$$$$$","title":"DO NOT DOWNLOAD IF YOU LOVE YOUR PHONE","isEdited":false,"rating":1,"review":"Where to begin. \n\nThis app is HORRIBLE. Downloaded fine on my iPhone, but once I opened the app, it made my phone barf🤮 Yes, my phone THREW UP. It started showing me orange people with terrible haircuts and SPREADING LIES about how climate change isn’t real😦 i couldn’t believe my eyes, I immediately deleted it and now I have to buy a new phone. \n\nIf you love your iPhone PLEASE do not get this app. It will RUIN your iPhone, and I’m pretty sure it signed me up for a subscription that I did not want. \n\nSo do yourself the favor and do not get this app.","date":"2020-07-09T03:19:37Z"}},{"id":"6174839992","type":"user-reviews","attributes":{"userName":"SamanthasaurusRex","title":"No no no nooo","isEdited":false,"rating":1,"review":"This app crashed multiple times while trying to open. Do NOT download this app. It is a scam. There is no benefit in having this on your phone. It will take up large amounts of space, track your information, and crash.","date":"2020-07-09T03:19:03Z"}},{"id":"6174830182","type":"user-reviews","attributes":{"userName":"HamsterKK202","title":"HORRIBLE DONT BUY","isEdited":false,"rating":1,"review":"this app looks like it was created by a child! makes sense because don is a child molester! made my phone crash multiple times and my phone got a mind of its own and started scrolling and switching through apps (perhaps it was taken over by an fbi agent :o) DONT DOWNLOAD!!","date":"2020-07-09T03:16:10Z"}},{"id":"6174836584","type":"user-reviews","attributes":{"userName":"billy4206969","title":"Totally horrible!!","isEdited":false,"rating":5,"review":"It was so bad the app is so incredibly slow hate it!","date":"2020-07-09T03:18:03Z"}},{"id":"6174825706","type":"user-reviews","attributes":{"userName":"Arreguin dude","title":"Spread of horrible messages and encouragement of violence","isEdited":false,"rating":1,"review":"This app has been infested with so many instances of lies and hate speech that it is simply unusable and a saddening sight for the people of America. I believe this app should be taken down IMMEDIATELY, and removed from anywhere that it can be downloaded. I am VERY angry 😡🤬.","date":"2020-07-09T03:14:53Z"}},{"id":"6174825267","type":"user-reviews","attributes":{"userName":"Hehou","title":"Terrible","isEdited":false,"rating":1,"review":"Like others are saying in the reviews: I downloaded this app to get updates about the presidential campaign but it has COMPLETELY RUINED MY NEW IPHONE 11. My battery is drained. Every time I open the app it glitches and my whole phone crashes. Absolutely terrible.","date":"2020-07-09T03:14:45Z"}},{"id":"6174824067","type":"user-reviews","attributes":{"userName":"Kool3st1","title":"Whoever made this app made a HUGE mistake","isEdited":false,"rating":1,"review":"first of all, do we not know what pain this man has caused to us ? And yet people are still going to “support” him til the end. You people are pathetic and weirdos. so much for make america great again but a soldier passed and yall president wasnt moved by it. just think about that 🤷🏼‍♀️meanies.","date":"2020-07-09T03:14:24Z"}},{"id":"6174805934","type":"user-reviews","attributes":{"userName":"saimya","title":"Don’t download this","isEdited":false,"rating":1,"review":"I downloaded this and then my phone start buzzing trump 2020 trump 2020 all night long it got extremely unpleasing and i hate it there no need to be annoying the only reason i download this app is so i can roast boomers if you download this your gonna regret it -sincerely this girl","date":"2020-07-09T03:09:04Z"}},{"id":"6174803365","type":"user-reviews","attributes":{"userName":"nickinickzz","title":"Horrible","isEdited":false,"rating":1,"review":"Words cannot describe how awful this app is. Trump used my information to stalk my address and showed up at my house and drop kicked my grandma in the face. And he stole all the food in our fridge! Just because we’re black! How rude! I wish I could give this app zero starts.","date":"2020-07-09T03:08:21Z"}},{"id":"6174798248","type":"user-reviews","attributes":{"userName":"nikinkinkijam","title":"Mad mad","isEdited":false,"rating":1,"review":"I was very disappointed in what I saw in this app. I’ve never wanted to throw my phone against the wall and throw up ever in my life. This app stole my food my bed and my pet rat, bat and dolphin. And when I say that I’ve never left SUCH A BAD review on a app I would not be lying. That’s all I have to say today. Sincerely disappointment","date":"2020-07-09T03:06:49Z"}}]}