{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=4060","data":[{"id":"6177480371","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"The Birds are watching","review":"It has been brought to my attention that this app is actually what the Great Trumpkin and his administration have been using to control the birds that work for the bourgeoisie. It looks and functions like what it is advertised on the App Store (though very poorly) but upon further investigation, these rumors appear to be true. Anyone who has this app is being monitored by their own personal spy pigeon (along with their FBI agent of course). This is clearly an invasion of privacy and therefore, needs to be removed from this App Store. For goodness sake, CHILDREN can download this app. If it is not taken down soon, I will have to formally request to speak to your manger.","userName":"maggie.24601","date":"2020-07-09T17:01:18Z"}},{"id":"6177370211","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"I almost died","review":"OK so I don’t understand and when I opened it up I saw that Jesus Christ was laying on the floor with a shoe over his or her thank you and then after I showed my husband he was like oh my god what the heck and he stab me with his iPhone 87,343 times then I threw a water bottle at him implying that he no longer wanted to confirm the baby that I gave him after he after he canceled that she then proceeded to stop myself with a deer head and shave and go on your thing over and she can after that I was in the laundry and a curtain fell over my head on the floor in my in my hou se ended up going down then the only thing that I could retrieve my couch inside of my couch was Jesus","userName":"bshcusbxjfhdjx","date":"2020-07-09T16:28:39Z"}},{"id":"6177237289","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This app is HORRIBLE 💀😤","review":"Downloaded the app and got a weird virus on my phone. When I opened any kind of music app it played fireflies by owl city over and over and over again. After abt two days the song that would play switched to California girls by Katy Perry and it really ruined the song for me not gonna lie. I then deleted the app to see if it would stop and to my surprise it didn’t stop. I tried everything and did research but there was no solution. I have a to buy a whole new phone now which I didn’t have the money for in the first place. This app costed me a lot of money and I’ve never been more unhappy w an app in my entire life.","userName":"mariaaa05","date":"2020-07-09T15:50:37Z"}},{"id":"6177041151","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"my rating for orange🍊","review":"i downloaded this app to support our racist, transphobic, homophobic, womanizer, rapist orange of a president but was met with too many problems. what a shame ! when i opened the app, i kept on getting locked out of it which turned to many attempts on getting into the app itself. how outrageous! and when i finally got in, the data from all my devices connected to my id WERE ERASED! what type of monstrosity is this? due to these many problems, i am deeply sorry to say that i will be taking off and BURNING the invisible maga hat as well as leaving the trump supporting community because i am also not a real woman. thank you for your patience","userName":"Word Google","date":"2020-07-09T14:55:46Z"}},{"id":"6177034362","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"😪 never again","review":"Okay so first off this app took a whole day to download. Which is not good 🤬 secondly the second I opened it the thing wanted me to buy so much stuff. Trump hats which is 🤮 like who wears those. Secondly the thing crashed my phone completely I had to go back in and restart my phone. Then when I finally got it working the app just lagged really bad and all the information was from some clown looking guy. Listen I didn’t download the McDonald’s app I downloaded the Trump app gosh 🙄 apple should just take this app down already it’s honestly the worst I’m so glad I watched the tik tok on this app and how bad it is. Never downloading this again.","userName":"Mr.SlankyMan","date":"2020-07-09T14:53:57Z"}},{"id":"6176970755","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This is the slowest and worst app","review":"It took a WEEK to download this app a WHOLE WEEK which is unbelievable and while it was downloading it slowed down all of my other apps and made it impossible to connect to the internet! Once it finally downloaded it immediately asked for all of my personal information including my social security number! Once I filled out what was non-invasive it deleted everything on my phone and took all my personal information anyway!! If I could give this app 0 stars I would, I am absolutely outraged by the fact that this app is still up and running and I demand that it should be taken down!!!","userName":"E K-M","date":"2020-07-09T14:36:43Z"}},{"id":"6176965737","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"America is not built on censorship","review":"The image that the president portrays to the public is one of sexual harrasment and hate and racist beliefs towards minorities, such as Mexican immigrants. This country is not built on the idea that you or anyone can control the idea of how the people speak, suppressing our rights is truly what will make you more and more unimpressive as a whole. If it were possible to leave a negative number of stars I would make sure to as censorship and sexual assault is not what anyone deserves in a president. This app also acts as a propaganda chain from the White House to his small loyal followers with false information about what he will actually carry out if re-elected","userName":"Sandy17265","date":"2020-07-09T14:35:24Z"}},{"id":"6176959687","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Not worth your time❌🤬🤮","review":"When I first saw the app I’m just like “oh yeah make America great again!”...little did I know there was an ugly looking orange thing on my screen. I showed my mo and she threw up. After that the words on the screen were to small and you have to constantly zoom in. As I was looking around the app it app kicking me out and kept showing up his nudes. I was immediately blinded and had to bleach my eyes. Off topic (why is it so small) anyway I got put the app and my phone immediately was shut down for two hours. When I got back on it was rearranged and I finally decided to delete it before anything could happen.","userName":"cheerios and milk","date":"2020-07-09T14:33:47Z"}},{"id":"6176827284","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"An awful experience!","review":"I downloaded this app expecting to learn more about trump’s campaign for the year 2020 but that’s not what I got! Instead I was asked to give them all my personal information to make an account. When I provided them with my information, I got a black screen and no content from the app. But that’s not it. The same week I downloaded the app, a ton of roaches ran into my room. I mean, a TON. And they all came in through the window. Wearing MAGA hats! I felt so attacked and so afraid, and I know this app is the cause of it! Don’t download or you’ll be subjected to roaches being sent to your house, and the other this depicted in other reviews!","userName":"makmahoney","date":"2020-07-09T13:59:04Z"}},{"id":"6176701274","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"WORST APP IN THE WORLD 🤢🤢🤢","review":"When i first tried to download the app it took 4 YEARS. Once i opened it i got a threat saying that if i didnt buy his rally tickets he would take away my dog so i obviously bought them! but the rally was the same day i had to go walk my pet rock so i couldnt go. All of my photos are now photos of trump and when i try to delete them an alien singing that “foreigner” audio from tiktok comes and blows up my phone. Im on my 100th iphone within the last week. My phones also keep calling that chuck e cheese where the 5 kids went missing and when they pick up all i here is that fnaf song i listened to in 4th grade. 0/10 do N O T reccommend.","userName":"Life360 ends today","date":"2020-07-09T13:25:48Z"}}]}