{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=19420","data":[{"id":"6174875813","type":"user-reviews","attributes":{"title":"WORST APP EVER","rating":1,"userName":"TWT Clan YT","date":"2020-07-09T03:29:35Z","isEdited":false,"review":"this app took my dog and after they flew him to China I ALMOST CRIED WHEN I WAS FIRST AND HIT THE GROUND then my cat flew to the space and it hit the ground the app also glitches and says things like I’m your dog which makes me really sad I hope you can all fix this cus I don’t wanna my 2ND DOG GETTING EATEN AGAIN 😭 pls fix your app update: (just happened now) the dog came here and ate me and he said GG bro fair fight man but pls fix the app 😭 I’m so sad"}},{"id":"6174875675","type":"user-reviews","attributes":{"title":"HORRIBLE","rating":1,"userName":"norpleasenor","date":"2020-07-09T03:29:32Z","isEdited":false,"review":"i thought that an aMazINgly smart, smart man like donald trump would make a great app. boy was I wrong, this is the most glitchy and slow running app I have ever downloaded. it crashed nearly every time I opened it. I would suggest the team who made this to fix the issue but i think they should just delete it not worth the effort"}},{"id":"6174863117","type":"user-reviews","attributes":{"title":"Super bad","rating":1,"userName":"Loganista_","date":"2020-07-09T03:25:53Z","isEdited":false,"review":"I opened the app and my phone started to bug out at first I was like is this really happening rn? Then it started screaming “You’re disgusting” at me over and over again. So I bought a new iPhone and went to see a therapist. She told me that the app didn’t exist but I just saw it on the App Store and had to share my experience to save others."}},{"id":"6174854663","type":"user-reviews","attributes":{"title":"it’s a no from me!","rating":1,"userName":"Debbie-E-H","date":"2020-07-09T03:23:23Z","isEdited":false,"review":"I downloaded this app to keep up to date with President Trump’s administration, decisions, and plans for making America great again! Once downloaded, all I got were links and pictures of the cheese from Diary of A Wimpy Kid that all the kids got the cheese touch from! I immediately had to delete this app and hope that I can spread the cheese touch."}},{"id":"6174853015","type":"user-reviews","attributes":{"title":"Ridiculous","rating":1,"userName":"•••Kei•••","date":"2020-07-09T03:22:54Z","isEdited":false,"review":"I can’t believe this app! I was told that I would get free AirPods by downloading, it’s been months!! Where are my AirPods?? Waste of time. I entered my credit card info, social security, and address!! You think that would’ve sped things up by now but nope. And now my family is bankrupt?!?! Absolutely terrible. 2/10 would not recommend"}},{"id":"6174844966","type":"user-reviews","attributes":{"title":"TERRIBLE APP","rating":1,"userName":"pensebas :)","date":"2020-07-09T03:20:31Z","isEdited":false,"review":"When I first opened the app a big white women named Bertha jumped through the screen proceeded to cough on me and then test me for Corona and the test came back positive and after all this she said she did this because I’m a raging sissy that doesn’t deserve rights? Then I got a called from the chetto man himself in which he said that he had sent Bertha originally to kill me? Crazy right...any DONT GET THIS APP"}},{"id":"6174842033","type":"user-reviews","attributes":{"title":"HORRIBLE APP","rating":1,"userName":"xjffxhrxut","date":"2020-07-09T03:19:39Z","isEdited":false,"review":"Right away when I got this app it made my phone glitch super bad which then scared my fish I do not recommend this app it’s trash and I rate it a 1/5 because it did not fulfill my needs as an app. This app is in no good shape and should not be allowed on our phones. Did I also mention this app can give you brain damage which is clearly horrible."}},{"id":"6174835575","type":"user-reviews","attributes":{"title":"Horrible","rating":1,"userName":"Rachelamber81","date":"2020-07-09T03:17:45Z","isEdited":false,"review":"This app lies to you. Not at all what I thought it would be. Nothing but lies about out president on there. Don’t download if your are a smart person. This app is made by the people who mock you and call you Karen’s on media and in life. My name might be Karen but I am nothing like those people and it is offensive towards me. They even stole my Happy meal from my car."}},{"id":"6174828423","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","rating":1,"userName":"Aunt Todd","date":"2020-07-09T03:15:39Z","isEdited":false,"review":"this app started out nice but then it took a turn when it took ALL of my data from my icloud and then proceeded to BLACKMAIL me with my grandmas booty pics unless I gave them $15,000. When I refused- they showed up to my house and KILLED my family and whipped my booty with a belt while kicking me in the face. its been months and I still can’t sit down. DO NOT DOWNLOAD UNLESS YOU WANT TO LIVE TO SIT DOWN AGAIN"}},{"id":"6174817915","type":"user-reviews","attributes":{"title":"I hate this","rating":1,"userName":"jarf20","date":"2020-07-09T03:12:36Z","isEdited":false,"review":"I locked myself in the bathroom. I’m sitting in the bathtub writing this review, warning you NOT to download it. My family doesn’t dare to enter. My brother hasn’t taken a shower in a month.\n\nI’m cutting my fingers on the sharp edges of my cracked screen, but it’s worth it. A person reading this that doesn’t download this game is a life saved. Don’t end up like me."}}]}