{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22890","data":[{"id":"6174462006","type":"user-reviews","attributes":{"rating":1,"review":"If I could give zero stars believe me I would. The moment I downloaded this app the scariest thing happened! This man popped up on my phone screen and he looked like a Cheeto that got dropped and left on the floor for 50 years. It was TERRIBLE. I don’t think I’ll be able to sleep tonight. I’m going to my therapist tomorrow to discuss this horrid incident.","date":"2020-07-09T01:28:54Z","userName":"aviciiconleche","title":"DISGUSTING.","isEdited":false}},{"id":"6174461144","type":"user-reviews","attributes":{"rating":1,"review":"when downloading this app i had the intentions to stay informed with our country and president, sadly that didn’t happen. what i saw was propaganda and belligerent talk on topics that our president doesn’t agree with. A CLEAR LACK OF THOUGHT WAS PUT INTO THE MAKING OF THIS APP!! a disgrace to the apple store and they should reconsider if this app should be kept on because it’s very hurtful.","date":"2020-07-09T01:28:39Z","userName":"mr.patrick star","title":"A MAJOR YIKES TO THE PATRIARCHY","isEdited":false}},{"id":"6174458293","type":"user-reviews","attributes":{"rating":1,"review":"Nah I opened this app so I could get some info, when I opened it a bunch of bugs started crawling out and went to my head I went to my mommy and she said it was lice. Not to mention I saw a ton of pictures of a wrinkly old Cheeto my eyes are STILL BURNING if I could give this app a rating in the negatives I would it’s garbage. Anyway if anyone is reading this STREAM ITZYS WANNABE AND DO NOT DOWNLOAD THIS APP","date":"2020-07-09T01:27:49Z","userName":"cindy lizbet","title":"APP GAVE ME LICE🤮","isEdited":false}},{"id":"6174439087","type":"user-reviews","attributes":{"rating":1,"review":"I wish I could give this app 0 stars. No, NEGATIVE stars. I have to say it may be the worst app in the history of apps, maybe ever. It honestly disturbs and disgusts me to see that it’s still on the App Store. I want to throw my phone into oncoming traffic because of this app. Apple, please take this off your store! 👎","date":"2020-07-09T01:21:54Z","userName":"jjpaul2 NCSU","title":"Apple, delete this awful app!","isEdited":false}},{"id":"6174438442","type":"user-reviews","attributes":{"rating":1,"review":"Probably the worst app I’ve ever downloaded. I opened it and immediately a misogynistic, pompous, racist appeared on my screen. I will definitely never use this app again in the fuerte and hope to see it deleted off of the App Store. Hopefully Apple can stand with the horrid reviews left by unsatisfied customer and delete this monstrosity. ❤️🤍","date":"2020-07-09T01:21:45Z","userName":"maalocon","title":"🤢","isEdited":false}},{"id":"6174437358","type":"user-reviews","attributes":{"rating":1,"review":"This app is just disgusting just delete it nobody wants it except for the racist people . So delete this app because it’s nasty disgusting and nobody likes. Trumps ugly racist orange face so please delete this app I don’t know why is he been on here delete it and he’s trying to delete Ti\nTikTok which is going to make his votes even worse so please delete this","date":"2020-07-09T01:21:25Z","userName":"@lovejessica28","title":"DELETE THIS APP","isEdited":false}},{"id":"6174433746","type":"user-reviews","attributes":{"rating":1,"review":"Horrible is the nicest word I can think of to describe this app it gave my phone 128 different viruses which then spread to my computer and when I rushed out of my house to get them fixed I ran over my neighbor.... so basically this app cost me 3000 in computer repair and a lawsuit for paralyzing Jerry DO NOT DOWNLOAD","date":"2020-07-09T01:20:18Z","userName":"Sarah.Garrett","title":"This app is the reason my neighbor is paralyzed","isEdited":false}},{"id":"6174405563","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app expecting a lovely slideshow of cute pictures of my favorite prezzy-wezzy, but all I got was a VIRUS on my phone. This app definitely caused it and the user interface kept telling me to drop out of school and do drugs. Don’t know what that’s about but anyways do NOT download this app unless you want a VIRUS. Bad app. Very bad. The worst app.","date":"2020-07-09T01:11:47Z","userName":"Young Astronomer","title":"This app DOES NOT WORK","isEdited":false}},{"id":"6174398525","type":"user-reviews","attributes":{"rating":1,"review":"I saw a taco on the page I wanted to eat it but then I saw trump and I fainted which cause to have diarrhea over and over again because I saw trump face which is a orange and something else y’all why are u making fun of an orange by calling it Donald Duck I mean Donald dumb excuse my bad manners for all the ducks in the world sorry for using your name for Donald trump😂😂😂😂😂","date":"2020-07-09T01:09:42Z","userName":"idk1233572)","title":"Horrible tacos","isEdited":false}},{"id":"6174389077","type":"user-reviews","attributes":{"rating":1,"review":"I got this app to help me get more reliable news about trump but once I opened the app....... I started to notice things in my room got moved first my drink just disappeared right in front of my eyes then my game system started making a crying noise then my hamster just rolled over dead and my dog just jump out the window.🙈","date":"2020-07-09T01:06:52Z","userName":"doneman99236","title":"DONT DOWN LOAD","isEdited":false}}]}