{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37340","data":[{"id":"6173680307","type":"user-reviews","attributes":{"rating":1,"review":"i have been a supporter since day 1, but this is making me question my loyalty. gave me 35 viruses and on top of that, took days to download. I cannot explain my frustration with this app.","userName":"ivy gates","date":"2020-07-08T20:49:03Z","title":"horrible app😤 very disappointed","isEdited":false}},{"id":"6173665677","type":"user-reviews","attributes":{"rating":1,"review":"This app took hours to download and when I tried to open the app it kept glitching and taking me back to the home screen. So overall I’m very disappointed in this app","userName":"aureny manzanilla","date":"2020-07-08T20:43:46Z","title":"Horrible app","isEdited":false}},{"id":"6173661335","type":"user-reviews","attributes":{"rating":1,"review":"This app took so long to download I even have good WiFi where I am at and it still took 5 hours. When it finally downloaded it showed me this weird orange looking thing which was really scary so I don’t recommend this app AT ALL","userName":"babygirl808123","date":"2020-07-08T20:42:16Z","title":"OMG THIS APP IS TERRIBLE","isEdited":false}},{"id":"6173657737","type":"user-reviews","attributes":{"rating":1,"review":"This app is terrible and does not work the way it should! It has so many pests (I mean bugs) that haven’t been dealt with no matter how many times we bring this issue to light","userName":"Ch3yP13","date":"2020-07-08T20:40:57Z","title":"Horribly Configured","isEdited":false}},{"id":"6173655098","type":"user-reviews","attributes":{"rating":1,"review":"Ever since I got this app weird things have been happening!! I can’t open the app without it crashing and anytime I get the chance to be on the app it freezes! Very unsatisfied, do better. ❤️","userName":"Annaadorn","date":"2020-07-08T20:40:05Z","title":"What the hell!??","isEdited":false}},{"id":"6173646348","type":"user-reviews","attributes":{"rating":1,"review":"the app took forever to download and THEN it wouldn’t work when I tried to use it. I would give it a zero out of five stars but unfortunately that is t an option. I DEFINITELY DO NOT recommend getting this app. TERRIBLE.","userName":"Horselover1459","date":"2020-07-08T20:36:56Z","title":"HORRIBLE👹","isEdited":false}},{"id":"6173634027","type":"user-reviews","attributes":{"rating":1,"review":"my grandma went to go get an orange, then a car ran her over 🤕 she then got up and chased after it. not only did the cat jump on her, but the giraffe did too. this app caused it all. i hate this app its the worst app. i lost a loved one because of it.","userName":"harryinchworm","date":"2020-07-08T20:32:29Z","title":"WORST APP EVER","isEdited":false}},{"id":"6173626614","type":"user-reviews","attributes":{"rating":1,"review":"Absolutely the worst app there is. It started glitching and it took forever to download with good internet connection. When I opened the app all I saw were lies and an orange Cheeto. I don’t know why but what I do know is that this is by far the worst app","userName":"hejrjfj","date":"2020-07-08T20:29:51Z","title":"So bad","isEdited":false}},{"id":"6173605360","type":"user-reviews","attributes":{"rating":1,"review":"I wouldn’t even give this app a 1 star but you can’t get any Lower. So how about we start with the huge amount of time it took to download. 10 hours. Yes that’s right. Them it took up over half my storage.","userName":"jwnwba","date":"2020-07-08T20:22:15Z","title":"Ew.","isEdited":false}},{"id":"6173600221","type":"user-reviews","attributes":{"rating":1,"review":"this app took 3 days to download and when I opened it it started playing loud music that attracted birds onto my front lawn😠 it kept glitching to an orange, I don’t even like oranges. overall I would give this a 0 stars.","userName":"china anmclain","date":"2020-07-08T20:20:24Z","title":"horrible app 🧚‍♂️✨","isEdited":false}}]}