{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24530","data":[{"id":"6175326814","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:01:52Z","review":"When I downloaded the app it started glitching and after a minute of being in it it gave me 5 ads! Then I got off the app and music started playing! There shouldn’t be that many glitches on a political app, such a shame, never downloading this app ever again.","title":"Had to delate app","userName":"Angeline2020"}},{"id":"6175299508","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T05:50:58Z","review":"I was going to leave a good review to our wonderful president but the he built the wall and he is ugly and doesn’t like Mexicans last time he tweeted “I don’t know what is this game called fortnite but all I know is that you can build walls so I love it” I was shocked when he said that until then I don’t like I HATE HIM (tiktok)😂","title":"Worst present ever","userName":"lizbet1113"}},{"id":"6175227370","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T05:23:06Z","review":"i am NOT a karen, but let me tell you this app is one of the worst i have ever downloaded. once i put my phone number in i got tons of random calls and text also i tried to delete it twice and my whole phone glitched and powered off. okay now remember black lives matter and dont vote trump 2020","title":"HORIBBLE HORRIBLE HORRIBLE!!!","userName":"acab|1312|blm"}},{"id":"6175204823","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T05:14:57Z","review":"That you never use his name again. You and every enabiling republican (Lindsay graham and Mitch the idiot McConnell) assured that this conservative will never vote for your pathetic excuse for a hijacked immoral party again.  None of you who enabled this pathetic excuse for a human have a right to speak on issues of governance, religion , morals or American values again.","title":"Lincoln just called and demanded","userName":"Owendahl9999"}},{"id":"6175164235","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T05:00:34Z","review":"This app is the worst possible app in the App Store image a cow that just walked up 10 flights of stairs that is now terrified to come down yes this app is worse then that situation and that is saying something. This app really downgrades the quality of all other apps on the App Store sorry apple but you messed up with this one.","title":"HORRIFIC APP","userName":"lissathe app reviewer"}},{"id":"6175136232","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T04:51:05Z","review":"This app is so bad like why would the “president” need a app, is it to find all the people and look at their cameras or something. I wish I can only give half a star he is racist and don’t even appreciate the U.S. why would you tell 12 to push protesters just to take a picture 🤬🤬😡😡😡","title":"Bad","userName":"ahdhajfjakfjx"}},{"id":"6175124746","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T04:47:16Z","review":"Y’all all I wanted to do was live my life but then I saw this app and I had to check it out. When I opened this app I was completely outraged at what I had saw!!! I saw I picture of Donald Trump! I thought I was gonna see Charlie Demilio but NO! I saw him!!!! I cried myself to sleep and never again will I go on this app.","title":"This app made me mad and upset!","userName":"C.C 123"}},{"id":"6175107763","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T04:41:42Z","review":"this app caused major glitches and over heated my phone. about 5 minutes into using and downloading the app, my phone would go ham and start calling random numbers and opening up apps. it was completely glitching out. i then realized every time i opened the app, my phone would get ridiculously hot. like hot pockets hot. it would over heat to the point where i could cook some ramen noodles on that thing. do not download this app unless you want to make your phone a heating pad and glitchy!!!!!!","title":"made my phone overheat and glitch!!!!","userName":"WW3Tropfy"}},{"id":"6175089513","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T04:35:49Z","review":"So I downloaded this app and bought a fish from it and bought a tank for it all of a sudden my frogs started drowning and then to contacted me donals\nDd about my fillau o fish drowning and they said they where gonna find me but little did they know I had the boys on my said and if you want to join my fillay o fish grave it’s after juice wrlds final album","title":"DO NOT DOWNLOAD (gen z😏)","userName":"for the boys 999"}},{"id":"6175072550","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T04:30:27Z","review":"Horrible quality, spelling errors everywhere. Would not recommend!!! When I opened the app the first thing I saw was campaigns for the ‘All Lives Matter’ movement. The second was signups for Trump rallies with almost no people, I guess the rest of the country agrees with me that we need a change in leadership.","title":"Uh... no!","userName":"Lester Snodgrass"}}]}