{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29660","data":[{"id":"6173419771","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T19:18:42Z","userName":"KAMNDES","title":"Horrible","review":"At first I really did like the app, it provided great information for our glorious president. But then I remembered three things. I’m black, he’s banning an app but hasn’t made an effort to push arrest for Breonna Taylor’s murders who wear the badge, and that he doesn’t support who I am and my family at all."}},{"id":"6173412990","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T19:16:24Z","userName":"Unifox4230","title":"terrible terrible app","review":"This app is truly awful. A disgrace to society. It completely crashed my phone and wouldn’t let me sleep for a week due to the awful noise it plays non stop. I think I might have to buy a new phone. Anyways I do not recommend!!"}},{"id":"6173388097","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T19:07:33Z","userName":"calculatedx","title":"HORRIBLE 🤢🤢","review":"When u opened the app a really ugly orange Cheeto man hypnotized me and made me harass people for supporting black lives matter. Then the app made me give all my money to already rich people and then I had to throw children seeking asylum into cages. It also made me become a sex predator. IT TURNES YOU INTO DONALD TRUMP! HELP!!! thanks for making AmeriKKKa 100x worse “president” Bunker boy🍑 🖕🏻🖕🏻"}},{"id":"6173365342","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T18:59:35Z","userName":"grier everdeen","title":"False information","review":"This app just spreads lies about who is evil and who is not. He wants to ban TikTok because we’re giving information out that has never been taught in schools. Violation of first amendment rights. TikTok has been a source of happiness in these dark times. It has for a lot of people!"}},{"id":"6173360451","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T18:57:53Z","userName":"coolcatem","title":"SO AWFUL!!!","review":"I am a Trump supporter but this app is just offensive. It provides nothing to me and I want to speak to the CEO of who made this app. It’s always sending me notifications, even when I ask them nicely to stop. It’s just an awful app all together. It’s getting a bad Yelp review too."}},{"id":"6173342296","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T18:51:30Z","userName":"#blackandbrownlivesmatter","title":"BLM!  #Releaseourchildren","review":"This app is completely horrendous. While downloading my phone kept flashing orange lights. It took a full 48 hours to download. And wouldn’t let me use my phone. This is unacceptable and tragic. Like our president. And his actions towards this horrible and racist country. I don’t recommend downloading."}},{"id":"6173328768","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T18:46:47Z","userName":"and thats on ;","title":"TERRIBLE DO NOT DOWNLOAD!!","review":"I really don’t even know where to start it was just horrible i re downloaded it because i wanted to give it a chance but it glitches my phone out so bad and is very slow the app messed with my wifi and gave me a virus please do not download"}},{"id":"6173328655","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T18:46:44Z","userName":"gen z 5ever :)","title":"big NO❤️","review":"this app makes my phone lag and it gave me a lot of viruses. and this app didn’t give me a clear skin and my dream body. i think i need a new phone because my phone doesn’t wanna work anymore. i hate this app it is not worth the hype like these fellow racist say."}},{"id":"6173325475","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T18:45:39Z","userName":"behehebeiis","title":"🍊","review":"was going to give 5 stars to this amazing app created for our beautiful 🍊president but then the app started crashing and my screen started glitching. Instead I decided to get tickets to the rally but then I remembered I couldn’t go because I need to walk my dolphin🐬 that day. šâd."}},{"id":"6173325307","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"date":"2020-07-08T18:45:36Z","userName":"hmuonsnaplosers!!!","title":"barbz for bernie","review":"this app is a scam it must get taken off the app store immediately! i downloaded it and the moment i opened the app COCKROACHES WERE COMING OUT OF MY PHONE THAT HAD MAGA HATS. i am scared for my life. do NOT! get this app or this will happen to you. be warned. leave a 1 star review so this gets taken down because this is disgusting!!!!!"}}]}