{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=39720","data":[{"id":"6177830269","type":"user-reviews","attributes":{"title":"Unsatisfactory","review":"So basically this app brainwashed me to the point that I held a family captive in my basement. I don’t remember a single thing. My parents had to tie me down, hire a hypnotist, and wack me over the head to get my back to normal.","date":"2020-07-09T18:49:45Z","rating":1,"userName":"urmomhahah","isEdited":false}},{"id":"6177805971","type":"user-reviews","attributes":{"title":"this is horrible","review":"the minute i opened the cheetos app i was appalled. i did not think to see a horrible display. the man in the opening screen scared me and made my eyes start to bleed. i am now blind from both eyes because i had to wash my eyes out with bleach to clear them... which in fact was waaay better doing thaan seeing that clown as the first display. i do not recommend. save yourself while you can.","date":"2020-07-09T18:42:36Z","rating":1,"userName":"okbommer;(","isEdited":false}},{"id":"6177800916","type":"user-reviews","attributes":{"title":"awful","review":"this app was so bad if i could give it 0 stars i would after i downloaded the app i quickly received bad vibes i felt degraded and battered then a notification came in saying that i was chosen to dual donald at the white house in a fencing match this made me feel scared and heightened my anxiety then my dogs started to yell at my phone so intensely that my phone shut down and i had to purchase a new one","date":"2020-07-09T18:41:05Z","rating":1,"userName":"Holapersonwhoisreadingthis","isEdited":false}},{"id":"6177768807","type":"user-reviews","attributes":{"title":"Awful","review":"As soon as I downloaded this app I was filled with a terrible vibe and I have to say this app is to blame. I hate it and I think I’m going to have to perform an exorcism on myself just to get rid of this sick feeling 🤢","date":"2020-07-09T18:31:23Z","rating":1,"userName":"lydia roe","isEdited":false}},{"id":"6177744255","type":"user-reviews","attributes":{"title":"Horrible app","review":"I hate this app with a deadly passion as it shows little to know value in the App Store serving it’s purpose as a waste of space on my phone. I’d recommend deleting it for further evaluation at tree headquarters","date":"2020-07-09T18:23:58Z","rating":1,"userName":"princemali","isEdited":false}},{"id":"6177726629","type":"user-reviews","attributes":{"title":"no","review":"if I could give this zero stars, I would. I’m not even sure where to begin but I think people common sense can explain why I’m doing this. For multiple reasons.","date":"2020-07-09T18:18:41Z","rating":1,"userName":"dakota lover","isEdited":false}},{"id":"6177678220","type":"user-reviews","attributes":{"title":"🤢🤮","review":"Okay this is the worst app my friends told me to install it but y’all wouldn’t believe what I had to see I had to see a corn wearing a cloths with yellow hair to say less I’m traumatized I can’t believe this thing is a president 🤮🤢","date":"2020-07-09T18:03:58Z","rating":1,"userName":"sabnadhfhi","isEdited":false}},{"id":"6177676939","type":"user-reviews","attributes":{"title":"This app is terrible","review":"This app is one of the worst I’ve downloaded. It causes issues on your phone and just shouldn’t be on the App Store. I recommend everyone delete the app.","date":"2020-07-09T18:03:34Z","rating":1,"userName":"please wear a mask","isEdited":false}},{"id":"6177674539","type":"user-reviews","attributes":{"title":"Pure hellfire","review":"Made a low review and one of the reps sent me YAOI of Trump and Pence saying this was the only thing they could do to fix it. Then, when I said I was going to report them, they found my address and sent me ANTHRAX. -9/10.","date":"2020-07-09T18:02:48Z","rating":1,"userName":"Fart tone #looser","isEdited":false}},{"id":"6177672506","type":"user-reviews","attributes":{"title":"It’s horrible","review":"As soon as I opened the app it started to crash. I personally love me some Trump, but because of this app I am lead to believe that if he can not create a functioning app then he should not be president in 2020.","date":"2020-07-09T18:02:10Z","rating":1,"userName":"Kenzie725","isEdited":false}}]}