{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=12860","data":[{"id":"6165755977","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-06T22:38:10Z","review":"I got this app to check the water pressure in the meat but it could when i so didnt able to leave on it so because they won’t i wasnt to myself as a dog !!!!! WORST APP IVE EVER HAD WILL NEVER GET IT AGAIN.\nUPDATE: I downloaded the app again to see if it would let me but it’s red and no why not so it doesn’t make me mad when it doesn’t come up and it’s not a big app but it is a bit too easy to get in and it won’t let it load anything! BIG THUMBS DOWN #TRUMP2020","title":"a real review","userName":"BOOTYFUL GIRL","isEdited":false}},{"id":"6161752613","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-05T22:07:21Z","review":"I was a girl in the village doing all right and I became a princes overnight now i gotta figure out how to do it right so much to learn and see up in the castle with my new family in a school that’s just for royalty a whole enchanted world is waiting for me im so excited to be sofia the first i’m finding out what being loyal a all about sophia the first making my way it’s an adventure every day sophia it’s gonna be my time to show em all that i’m sophia the fiiiiiiirst","title":"SOpHia ThE FiRst","userName":"jichimsjams","isEdited":false}},{"id":"6159780241","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-05T09:54:31Z","review":"When I downloaded it it made my smart phone not so smart anymore for whatever reason😱🤷‍♂️, Siri started to say stupid and ignorant things like “Keep America great again” and “Trump 2020”(disgusting phrases I know🤢🤮. I was surprised at the language choices that Siri used, I can’t believe they allowed her to say the t word. I also believe it’s to blame for the virus🦠 on my phone, it seems like it doesn’t take the right precautions when it comes to viruses. \n\nVOTE TRUMP OUT","title":"I REGRET DOWNLOADING THIS APP","userName":"CJW350","isEdited":false}},{"id":"6147024792","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-02T05:32:23Z","review":"I dont like trump nor do I support his actions bug i got curious about his app due to (horrible) reviews and let me TELL YOU!!!! They were all true. One review said that ever since they got the app they have been having paranormal activities and I thought it was bogus but oh how i was wrong!! My family will never be the same I wish I can go back in time and listen to the reviews. Now please listen and don’t install!!!","title":"Wish this was never made","userName":"Victoria_lopezz","isEdited":false}},{"id":"6145926282","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-01T22:28:37Z","review":"I downloaded this app to support our bunker baby president as any good american would. It asks for your phone number and now i am being harassed. My phone has already started to not work! They asked for so much personal information like my credit card and address 😡 I was also bombarded with the american flag 🇺🇸 and a picture of our cheeto president. I hate to break it to him but ALL FLAGS MATTER 🧚‍♂️❤️🧚‍♂️ This is the worst app i’ve ever downloaded!!!!","title":"no 🧚‍♂️❤️🧚‍♂️✨","userName":"MaddieBooks22","isEdited":false}},{"id":"6145585349","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-01T20:11:52Z","review":"So I downloaded this app to support our wonderful and kind president. I was doing the usual stuff you know opening the app and about to sign in. Then all of the sudden out of freaking nowhere this image of a giant, grotesque, wrinkly, orange alien wearing a toupee and a suit popped up. Well I was in such a state of shock that I completely blacked out and when I woke up the app mysteriously disappeared but no matter what that image will still be forever ingrained in my mind till the end of time.","title":"OMG!","userName":"Brianna Lewis","isEdited":false}},{"id":"6145314331","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-01T18:36:34Z","review":"Upon downloading this app, my phone started glitching and crashing. I’m sure this app gave my phone a virus. Then as I was on the app my phone started making weird noises. It sounded like demonic words coming out of my speaker. As the chants kept going, things in my house started the shake. Everything turned red and my dog turned into SATAN. This is completely unacceptable and I am outraged. This occurrence made me completely hate trump and now I will  #settleforbiden .","title":"Devil App","userName":"Care N.","isEdited":false}},{"id":"6140379987","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-30T15:16:00Z","review":"while downloading this app, my phone got EXTREMELY hot. then when i opened it my phone exploded into thousands of pieces. not to mention, i haven’t even USED the app first. then when i opened it there was a big picture of a rat standing by an american flag. it was so hideous i had to throw up multiple times in a row. i was forced to go to the emergency room. i would not recommend getting this app. definitely a one star.","title":"this app has ruined my life","userName":"dhdndkdksos","isEdited":false}},{"id":"6140324140","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-30T15:01:01Z","review":"When i downloaded it i was receiving notifications and multiple other things that upsets me. For example, repeatedly using homophobic and racial slurs. I cannot and WILL not participate in a president that does that and will never support trump. I downloaded the app in order to see more news updates due to my new built into my phone not working. SO PLEASE DO NOT DOWNLOAD THIS APP IT IS A WASTE OF SPACE!\nThere were also comments about women that were horrendous and sexist.","title":"HORRIBLE APP DONT USE IT👺","userName":"dont use this app periodt","isEdited":false}},{"id":"6137760791","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-30T00:14:38Z","review":"Horrible...horrible...horrible... I got the app and I thought to myself it’s a okay app!!! I decided to feed my birds by putting bird food in the bird feeder!!! I went out to do so and the birds came diving down at me... I looked at them and they had tRUMP faces... I ran as fast as I could trying to call for help but I was being spammed by Donald trump adds!!! I fell to the floor about to die from the ugly birds.. Someone found me on the street and took me to the hospital. This app is extremely bad luck DO NOT GET IT","title":"no","userName":"i like root beer","isEdited":false}}]}