{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=126890","data":[{"id":"6178059614","type":"user-reviews","attributes":{"title":"Worst app ever. Periodt.","rating":1,"isEdited":false,"date":"2020-07-09T20:03:35Z","review":"Downloaded after seeing it online, thinking “hey might as well see what our presidents up to?”. Fake news. All of it. Worse app ever, and I know a lot of horrible apps, trust me, I do. I know apps better than anyone. When I tell you how racist and homophobic it is, I say that with an overtone of- this app is covered in pedophilia. Apple should take this down. Lots of.... unusual things going on in this app. \n\nI’d rather play something more daring, something more... exciting. I’d rather lose at Russian Roulette then ever use this app again.\n\nHorrible, just horrible.","userName":"Itsls"}},{"id":"6178059225","type":"user-reviews","attributes":{"title":"Dixie Cups","rating":1,"isEdited":false,"date":"2020-07-09T20:03:27Z","review":"ᗷᕼᑌᗴᔕᒍYᗴᔕ 🤷sometimes✨i🙁don't😢wanna😱be😼happy🧚don't✋hold😇it🤪against😈me🙆","userName":"connieyenn"}},{"id":"6178059152","type":"user-reviews","attributes":{"title":"THIS APP IS TRASH!!😡","rating":1,"isEdited":false,"date":"2020-07-09T20:03:25Z","review":"hey, im here from ✨tik tok✨ and im writing this for algorithm. so while you are here, you should follow my tik tok @annawilsonlee also i think this rating thing my work, cuz ya know, we cool like dat😌💅. so ya, have fun making trump mad😎","userName":"nfksjfis"}},{"id":"6178058940","type":"user-reviews","attributes":{"title":"bad app","rating":1,"isEdited":false,"date":"2020-07-09T20:03:21Z","review":"this app is the worst. It mad my phone buzz all the time.and it showed me what a orange looking man said about rude things and how this orange was being so rude to women and being racist sorry I don’t want this on my phone","userName":"mayo looking head"}},{"id":"6178058906","type":"user-reviews","attributes":{"title":"✨🧚🏾‍♀️🌸","rating":1,"isEdited":false,"date":"2020-07-09T20:03:20Z","review":"This app made my bed fo into a heart attack😭 we had to take it to the hospital and they said that she was under too much stress from the stupidity and ignorance from this app. Literally said we should do research on the person who this app is about and get them arrested for sexual assault !! They also said to call 844-298-2731 and get BREONNA TAYLOR’s murders arrested ❗️❗️","userName":"shuplk"}},{"id":"6178058367","type":"user-reviews","attributes":{"title":"Horrible","rating":1,"isEdited":false,"date":"2020-07-09T20:03:09Z","review":"Horrible","userName":"Escobar Guzman"}},{"id":"6178056206","type":"user-reviews","attributes":{"title":"6-5-14  26  :)","rating":1,"isEdited":false,"date":"2020-07-09T20:02:24Z","review":"The app took a long time to download. Also the app should have let you continue as a guest without having to sign up bc ya know Donald’s all about privacy of information (until it becomes a disadvantage for him — ahem: title). Like I just wanted to see what the app was all about but I don’t want to give up my constitutional right to protect my privacy","userName":"20-9-3 20-15-11"}},{"id":"6178055954","type":"user-reviews","attributes":{"title":"All cops are bad","rating":1,"isEdited":false,"date":"2020-07-09T20:02:20Z","review":"ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB ACAB","userName":"smexypotatoface"}},{"id":"6178054932","type":"user-reviews","attributes":{"title":"THE WORST","rating":1,"isEdited":false,"date":"2020-07-09T20:02:00Z","review":"No even gonna lie this app gave me severe baldness and my dog won’t talk to me ever sense I got the app my grandma blocked me as well as the rest of my family except my racist cousins that try to flirt with me now I can’t go to college and I lost my job too I might have to move to a different planet and start a new life, smd trump","userName":"bihhhnugget"}},{"id":"6178054908","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","rating":1,"isEdited":false,"date":"2020-07-09T20:02:00Z","review":"i downloaded this app and not even 5 min in it started glitching,i gave up and went on instagram and it got HACKED i checked all my social media and my spotify,snapchat and email got hacked.i don’t recommend.who would vote for that cheeto anyways?","userName":"tik tok🥰🥰"}}]}