{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=94840","data":[{"id":"6068803058","type":"user-reviews","attributes":{"date":"2020-06-13T01:09:59Z","isEdited":false,"userName":"Dangerous Person: Mzzz Magpie","review":"Is for monsters.","rating":1,"title":"This app"}},{"id":"6064824587","type":"user-reviews","attributes":{"date":"2020-06-11T23:50:54Z","isEdited":false,"userName":"Candy monster crazed","review":"was lookin to get plugged into the war against snowflakes before realizing the real snowflakes were conservatives like me.","rating":1,"title":"disappointed but not surprised..."}},{"id":"6063783632","type":"user-reviews","attributes":{"date":"2020-06-11T17:02:52Z","isEdited":false,"userName":"Phlogen","review":"I will now tell the story on how this app ruined my life. It was a perfect day and I was just admiring the picture of DJT (Donald J Trump) that hangs above my fireplace, watching over all my Christian family and friends. Then an idea stronger in my mind, only if there was an app that could help supreme ruler overlord Trump get re-elected. Of course I want Trump re-elected, I am an upper middle class, white, straight, cis gendered, Christian, male, the most superior race (of course). I went into apples App Store and found this app. I was over joyed by seeing it. Only if I knew back then that this app would be the end of me. So I downloaded it and everything was off to a great start. After a few days of obeying the all knowing and merciful Trump administration I began to notice that my phone was acting weird. I seemed to have a mind of its own. But I ignored it and went on in blissful ignorance because I can. I then woke up one night to a strange sound in my room. I woke up and turned the light on. Turns out that my WIFE HAD BEEN MURDERED AND MY THREE CHILDREN WERE HANGING FROM THE CEILING. On the wall the message “come to the abandoned mine” was written in their blood. Weirdly my phone had disappeared, but I didn’t think anything about it. So as I was pulling out of my drive way MY HOUSE EXPLODED INTO A FIREY PLUME OF SMOKE AND ASH. My daughters head then landed on my hood and her lifeless eyes stared back at me. After arriving at the mine I went deep into the dark tunnels. I then heard a rumble and the tunnels collapsed behind me. An eerie electronic glow was coming from the end of the tunnel. IT WAS MY PHONE. As I looked at I the Trump app was open with the message ALL HAIL SUPREME LEADER TRUMP on it. I am know writing this review from the tunnels were I get only one bar of service. I will spend the rest of my days here until I starve to death. I leave with this message to the world, don’t vote for Donald Trump.","rating":1,"title":"This app has ruined my life!"}},{"id":"6058624041","type":"user-reviews","attributes":{"date":"2020-06-10T11:57:03Z","isEdited":false,"userName":"daakuukid.","review":"Terrible app do not download","rating":1,"title":"Horrible & Dreadful"}},{"id":"6054410889","type":"user-reviews","attributes":{"date":"2020-06-09T11:24:13Z","isEdited":false,"userName":"Wazwazwazizup","review":"Got my dick stuck in a garbage can","rating":1,"title":"Uhhhh"}},{"id":"6053182262","type":"user-reviews","attributes":{"date":"2020-06-09T03:40:16Z","isEdited":false,"userName":"HSBC.","review":"Imagine actually supporting this tangerine lol","rating":1,"title":"Awful"}},{"id":"6048231160","type":"user-reviews","attributes":{"date":"2020-06-07T20:50:54Z","isEdited":false,"userName":"😬🤢😖🙃😖💔","review":"This app is HORRIBLE. The second I downloaded it I lost ALL my brain cells.","rating":1,"title":"F trump"}},{"id":"6015082796","type":"user-reviews","attributes":{"date":"2020-05-30T21:28:13Z","isEdited":false,"userName":"Gdybuft","review":"Terrible app.. worst in this store","rating":1,"title":"Terrible app"}},{"id":"5944608432","type":"user-reviews","attributes":{"date":"2020-05-14T15:10:52Z","isEdited":false,"userName":"yaboidieks","review":"The app is super glitchy","rating":1,"title":"I love the president but not this app"}},{"id":"5642805765","type":"user-reviews","attributes":{"date":"2020-03-10T19:54:09Z","isEdited":false,"userName":"kristakulp","review":"The worst of the worst apps. Terrible.","rating":1,"title":"Terrible"}}]}