{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31240","data":[{"id":"6173443596","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This is a horrible app as soon as I downloaded it it crashed my phone!! When I got it back I got a ton of ads from business all linked to Trump. I don’t want government tied to business!! I think Trump is DEFINITLEY helping the NSA track us and invade our privacy. I demand my rights!!","title":"Terrible!!","userName":"Shannon7474","date":"2020-07-08T19:26:41Z"}},{"id":"6173439846","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"Please do not get this app! It is like a virus to your phone! After I got this app my phone stopped working!! My screen just turned orange!! It was so scary!! This app caused my phone to only receive trump associated texts and emails!! So please please do not ever get this app!!!😡","title":"Never downloaded","userName":"GGoswal","date":"2020-07-08T19:25:25Z"}},{"id":"6173428345","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This app is very poorly designed and won’t stop glitching. I can barely have it open for a few seconds before if closes itself. Very frustrating and I’m quite disappointed.","title":"All around poor app","userName":"liv sove","date":"2020-07-08T19:21:38Z"}},{"id":"6173429886","type":"user-reviews","attributes":{"rating":2,"isEdited":false,"review":"I couldn’t get to open this app because it took all of the storage and it’s just a horrible app in general. How do I know the info is real! I would never recommend this to a friend or even an enemy. This app needs to be deleted ASAP","title":"Absolutely trash","userName":"one star rating app","date":"2020-07-08T19:22:09Z"}},{"id":"6173427036","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I am personally offended by this app because it was horribly made. This app is racist and goes against everything thing I believe in. I believe that black lives matter and trump is not doing anything to help the black community. He is a disgrace to humanity and will not win the 2020 election.","title":"Worst App Ever🤢","userName":"AnnaHunte","date":"2020-07-08T19:21:11Z"}},{"id":"6173424168","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This app made my device have the biggest glitch ever it made it so when I go to other apps it kicks me out and I have to power my device all the way off for the apps to work then that start messing up again if I go into the Trump app.😡😡","title":"WORST APP OF ALL TIME","userName":"Ads are bad they have to go","date":"2020-07-08T19:20:13Z"}},{"id":"6173408124","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"it took DAYS to download and when i did it never let me do anything and keep popping up with virus warnings and saying the whole app had a virus. if my phone is messed up because of this i will be angry. take this app down it’s not safe!","title":"just HORRIBLE","userName":"MADISYNS REVIEW","date":"2020-07-08T19:14:44Z"}},{"id":"6173392032","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"DO NOT DOWNLOAD THIS APP! This app took nearly the whole time Trump was president to download and while it was downloading I couldn’t load anything else. This app infiltrates my phone and started showing Cheetos on my screen?!?!?! I hate it so much and it should be taken off the appstore for its hateful malware! #seTtLefOrbIdEn","title":"THIS APP IS TERRORIZING AND TERRIBLE","userName":"huh cUlt lIfE","date":"2020-07-08T19:09:01Z"}},{"id":"6173377699","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"this app is absolutely horrible. it took 5 hours to completely download and let me into the app. then when i got into it it was super racist and judged me on the color of my skin. then it told me to inject bleach into my veins so i won’t get sick. which would kill me by the way. they then it tried to delete one of my favorite apps. the app is also believes in white supremacy which is absolutely disgusting. lastly it cheated in the election to get on to the recommended page in the app store.","title":"horrible!!","userName":"ricecake12345678910","date":"2020-07-08T19:03:51Z"}},{"id":"6173363375","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I can’t believe that you would want me to leave a good review on this app when all apps should have good reviews not just this one I am disgusted 😞And also all presidents matter so why do our Cheeto president just have one I can’t... don’t get this app it’s TRASH!!!!!😡","title":"All Apps Matter 😡","userName":"dottyknight","date":"2020-07-08T18:58:54Z"}}]}