{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=90270","data":[{"id":"6174833036","type":"user-reviews","attributes":{"date":"2020-07-09T03:17:00Z","rating":1,"isEdited":false,"review":"its so stupid and hard to use and is contributing to a cheeto racist rapist that is a child molester","userName":"barron trump #monkeypoo","title":"TERRIBLE APP"}},{"id":"6174823791","type":"user-reviews","attributes":{"date":"2020-07-09T03:14:19Z","rating":1,"isEdited":false,"review":"i downloaded this and was diagnosed with the clap, to me those two things are directly related","userName":"2fast2furiouslyitchy","title":"don’t risk sexual impurity for this app"}},{"id":"6174821698","type":"user-reviews","attributes":{"date":"2020-07-09T03:13:43Z","rating":1,"isEdited":false,"review":"Horrible app!!!","userName":"jaytak11111","title":"Awful"}},{"id":"6174817780","type":"user-reviews","attributes":{"date":"2020-07-09T03:12:34Z","rating":1,"isEdited":false,"review":"It bad it almost dealer my pics","userName":"41pisgood","title":"Lips"}},{"id":"6174810357","type":"user-reviews","attributes":{"date":"2020-07-09T03:10:22Z","rating":1,"isEdited":false,"review":"This app is SO bad you should even get it. There’s no point.","userName":"Charie-Rose","title":"BAD BAD BAD"}},{"id":"6174804988","type":"user-reviews","attributes":{"date":"2020-07-09T03:08:49Z","rating":1,"isEdited":false,"review":"title says it all","userName":"i think the think not","title":"I think not"}},{"id":"6174800213","type":"user-reviews","attributes":{"date":"2020-07-09T03:07:25Z","rating":1,"isEdited":false,"review":"There are gajillions of stories...  of mischief and fun,  but to keep things simple,  let's start with just one...  about a mom and two kids...  and a house and a hat...  that, oddly enough,  was worn by a cat.  But soon enough  we will get to all that.  In the valley that stretches  from this hill to that hill,  a city is nestled...  that city is Anville.  - Hurry up!  We'll miss the movie!  - Any more tutti-frutti?  I'll check.  Thanks!  It's a town that's not huge,  but quite big enough...  for buyers and sellers  to sell and buy stuff,  from shoes and shirts...  and elongated ladders...  to sailboats and gibble-grated  berry-juice bladders.  So our story begins  at the corner  of Main and Montroob...  in the spotless  real estate office...  run by Hank Humberfloob.  Humberfloob Real Estate. How can  we make your dreams come true?  What do you mean,  you're leaving?  You're a babysitter.  Babysitters don't leave. They sit.  Baby-leavers leave.  I'm sorry. I really  gotta go, Miss Walden.  Well, I need to come home  right away.  All right.  Thank you, Amy.  Sorry.  Attention, everyone!  It's 9: 02.  Staff meeting!  Staff meeting!  Look alive, everyone!  First I'd like to  welcome aboard...  our newest member  of the Humberfloob family,  Jim McFlinnagan!  - Mr. Humberfloob,  I wanted to thank you...  Fired.  I beg your pardon?  Fired.  B-But l...  Fired!  One, two, three,  four, five, six, seven,  eight, nine, 10!  As you know, tonight is  our bimonthly meet and greet\" party.  Tonight's host is...  Joan Walden.  This is where people can  meet our real estate agents...  in an informal,  yet hygienic setting.  Mr. Humberfloob,  I have to get home to my kids.  Ah, yes.  Your children.  Joan, let me make this  perfectly clear.  If your house  is as messy as last time,  you're fired!  That's pretty clear,  Mr. Humberfloob.  Don't worry. I promise.  My kids'll be  on their best behavior.  Great.  Humberfloob Real Estate.  How can we make  your dreams come true?  Please hold.  If you leave Humberfloob's  and turn left onto Main,  three miles down  you'll find Lipplapper Lane,  a pleasant-enough street  in a pleasant-enough way...  where a neighbor greeted neighbor  with a neighborly \"Hey!\"  Hey!  Hey!  Here the hedges were hedged,  the weeds were all weeded,  and lawns were mowed daily,  twice daily if needed.  And at the end  of this street,  in a house like any other,  something magical  would happen...  to a sister and her brother.  Shh! Nevins!  Stealth mode.  Today's to-do list.  Number one:  Make to-do list.  Number two:  Practice coloring.  Number three:  Research graduate schools.  Number four:  Be spontaneous.  Number five:  Create lasting  childhood memories.  And number six:  Amend will.  What is he doing?  Number 10:  Make tomorrow's to-do list.  Ladies and gentlemen!  Nevins,  your attention, please.  You are about to witness  the third most spectacular stunt...  ever performed  under this roof!  Do you know how hard it's getting  to tell people that we're related?  Relax.  I'll put everything back.  And now,  for the indoor stair luge!  Indoor stair luge?  I'll have to add this one  to my list.  Go have no fun  somewhere else.  It... is... showtime!  Whoa!  - Aah!  - Yeah!  - Oh, my word!  Nevins!  Nevins, come back!  Hey, Mom. What's up?  You are so lucky  you didn't ruin this dress.  Mom, I know  you're angry,  but there's something  you need to know.  This was all Sally's fault.  Oh, really?  And how, exactly,  was it Sally's fault?  Give me a minute.  I'm workin' on it.  Save it, Conrad.  Why today? Why did you  have to pick today to destroy the house?  You know  what's happening today.  I tried to tell him, Mom.  \"Mom's throwing  a very important party,\" I said.  \"All other important  clients will be here.\"  But he went right ahead  and wrecked the house  and let Nevins get away.  Now, again, I hope  you're going to ground him.  Yes, Sally, for a week, but  that's none of your business.  A week?  Come on. Two days.  I asked you to do  one thing today, Conrad...  keep the house  clean.  Do you know how frustrating it is  that you're always doing  the exact opposite of what I say?  Knock, knock, knock.  Someone lose a dog?  I found him next door...  in my yard... again.  You are a saint.  And here I thought  you were only dating me  for my good looks.  Lucky us.  Larry Quinn is here.  Hey-a, sport.  Call me Lawrence.  Okay?  You rescued Nevins!  Thanks, Lawrence!  It was my pleasure, Sally.  Anything for my little princess.  Oh, I don't wanna be a princess.  In a constitutional monarchy  parliament has all the real power.  I see.  Okay, that's great.  Uh, look, pal, be a sport.  Why don't you go  tidy up the living room.  Okay...dude?  I don't have to listen to you, Larry.  Conrad,  do what Lawrence says.  Have you given some thought  about the Wilhelm Academy?  You mean the Colonel Wilhelm  Military Academy for Troubled Youth?  That's the one, Joan.  I'm not sure  it's right for Conrad.  Oh, Joan, Joan.  Joan, Joan, Joan.  I have so much respect  for you, Joan.  Single mother, career woman,  raising two children on your own,  and still finding time  to be the best darned  real estate agent in town.  I know how hard it is, Joan.  It is hard.  Oh... I know.  And I know  how hard you're trying.  This is a once-in-a-lifetime  proposition,  and you must act now.  The Colonel Wilhelm  Military Academy for the trouble youth... is what we call in the sales game  a win-win scenario.  A top-flight military school, and it’s only... eight hours away. Oh the phone.  I heard what you said last.  I’m not going to military school, Larry. Look, buddy, I know I’m not your dad... and this is probably really strange for you... your neighbor’s  dating your mom. But here’s the thing, son.  Come here. I don’t like you either.  But I’m gonna  marry your mom.  And if it was up to me, you’d be at military school today.  I’m not going to. military school. I can’t type any more. Ik sad. Have a good day!","userName":"Roblox_Fan11","title":"The Cat in the Hat Movie Script :D"}},{"id":"6174777564","type":"user-reviews","attributes":{"date":"2020-07-09T03:00:31Z","rating":1,"isEdited":false,"review":"This app made me constipated.","userName":"youtuhgy","title":"1 Star is too much"}},{"id":"6174766795","type":"user-reviews","attributes":{"date":"2020-07-09T02:57:13Z","rating":1,"isEdited":false,"review":"Donald Jenius Trump has failed me with this app😾😾😾 since he’s sOOOooOo AMAZING i thought his app would be cool aswell😿😿😿 It made me so didsapointed 😠😠😠 OooOOoH GON~~~","userName":"tripadviso","title":"WORST APP"}},{"id":"6174753658","type":"user-reviews","attributes":{"date":"2020-07-09T02:53:13Z","rating":1,"isEdited":false,"review":"this app is a SCAM! don’t trust it and don’t download it!!!","userName":"gggwwtwuqy1524","title":"horrible app!!!"}}]}