{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=44910","data":[{"id":"6175340226","type":"user-reviews","attributes":{"title":"Would NOT RECOMMEND","review":"This app took 69 hours to load and when I finally had it opened ask me for my personal information which was stolen.","date":"2020-07-09T06:06:12Z","rating":1,"isEdited":false,"userName":"roses5339"}},{"id":"6175208128","type":"user-reviews","attributes":{"title":"Fab da dbadbrn","review":"This app will make your dad disappear, I woke up and my dad said he was going to the store to get milk and he hasn’t come back yet and it’s been 4 days I’m getting worried, and the app stole all my Dino nuggets and my smiley fires 😡","date":"2020-07-09T05:16:11Z","rating":1,"isEdited":false,"userName":"soccer123!!!!!"}},{"id":"6175192052","type":"user-reviews","attributes":{"title":"Destructive.","review":"It’s ruining everything. Glitch on glitch on glitch. Doesn’t work. Slow as hell. Doesn’t make sense. Not user friendly. Not informative. Absolute trash.","date":"2020-07-09T05:10:25Z","rating":1,"isEdited":false,"userName":"mssuziehadasteamboat"}},{"id":"6175189159","type":"user-reviews","attributes":{"title":"He has no lips how will he get a kiss kiss","review":"I was unfortunately told that this was an app to rank babies animals on how snuggly they are and how much you wanna kiss them on their forehead, but it will only show my photos of a burnt pile of pork.","date":"2020-07-09T05:09:21Z","rating":1,"isEdited":false,"userName":"disapointed animal lover"}},{"id":"6175156353","type":"user-reviews","attributes":{"title":"Tik took","review":"This app is horrible because it is owned by Donald Trump and he is trying to take down TickTock which is everyone’s favorite app so if he takes it TickTock down we are taking his       AppDown with it","date":"2020-07-09T04:57:52Z","rating":1,"isEdited":false,"userName":"raevonta"}},{"id":"6175146918","type":"user-reviews","attributes":{"title":"This app killed my pet roach","review":"My pet roach Mr. Snuggly Bear was choked to death by how horrendous this app was. He choked on his own antennas with how bad Cheeto Puff looked. I was just so horrified at the lumpy looking man on the app. I thought his name was Dumpy not Trump. But I guess that’s what I get for wearing broken glasses.","date":"2020-07-09T04:54:41Z","rating":1,"isEdited":false,"userName":"TheQueenofMakeup"}},{"id":"6175137471","type":"user-reviews","attributes":{"title":"BEWARE!!! scary orange lizards!!!!","review":"i downloaded this app and the SECOND i opened it a SCARY ORANGE LIZARD popped out. i was so scared. the scary orange lizard was also a white supremacist it was rly spooky. i would not recommend anyone get this app unless the want a scary orange racist homophobic lizard telling them the news 👍🏽","date":"2020-07-09T04:51:30Z","rating":1,"isEdited":false,"userName":"ANNA bbOrTiOn"}},{"id":"6175133953","type":"user-reviews","attributes":{"title":"Worse thing ever!","review":"Worse thing I’ve ever experienced it crashed and slowed down my phone as soon as I opened it! I would give it a fat 0 if I could","date":"2020-07-09T04:50:21Z","rating":1,"isEdited":false,"userName":"dile pickle"}},{"id":"6175120293","type":"user-reviews","attributes":{"title":"Would give 0 stars if I could.","review":"This is the worst app I have ever used. The programmers and graphic designers for this app are mediocre at best. How was this ever allowed to be on the App Store? It looks like a Russian bot turned into a programmer. A disgrace.","date":"2020-07-09T04:45:50Z","rating":1,"isEdited":false,"userName":"dontforgetaboutthis"}},{"id":"6175112477","type":"user-reviews","attributes":{"title":"Worst App I’ve Ever Downloaded","review":"I thought perhaps The Don had something to offer this political season. this app ruined my expectations tremendously. my phone is totally ruined now thanks to Donald J Trump. i might as well vote for Kanye","date":"2020-07-09T04:43:16Z","rating":1,"isEdited":false,"userName":"joeydonutz"}}]}