{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30000","data":[{"id":"6174897947","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:36:01Z","isEdited":false,"title":"disgusting","review":"I opened the app and it immediately started glitching. It then crashed entirely and broke my phone and stole my dog. The government then showed up at my house and stole my wallet so they could take my money in person instead of through taxes. Don't recommend.","userName":"Anyonebut Trump2020"}},{"id":"6174894242","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:34:55Z","isEdited":false,"title":"I hate this app","review":"I don’t have any money for that stuff I don’t want to see you guys go check out my car 🚙 I was like I wanna was a good day one day I wanna was a good day I love you too bruh bruh is the time of time to get your boobs done with your hair looks like a new outfit for your birthday 🎂.","userName":"mkilro"}},{"id":"6174892377","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:34:22Z","isEdited":false,"title":"CRIMINALLY DISGUSTED BY THIS APP","review":"this app is the WORST APP on the apple store hands down. i am extremely disgusted by the things this app has done to my life, it made ALL of my vegetation die, DO YOU KNOW HOW LONG IT TOOK FOR ME TO GROW MY TOMATOES  this app has offended me on many levels and it causes me emotional anxiety and it is hard for me to sleep at night APPLE FOR THE LOVE OF GOD GET RID OF THIS APP BEFORE IT RUINS MORE LIVES LIKE IT DID MINE","userName":"Francisco martin"}},{"id":"6174889254","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:33:28Z","isEdited":false,"title":"Worst APP EVER","review":"I had installed it and my phone started glitching and this didn’t happen till I downloaded it and literally all it does is ruin your phone and I had to buy a new one I they should just delete the app it hacks your phone and gives it a virus DONT DOWNLOAD IT!","userName":"ikc54321"}},{"id":"6174885583","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:32:23Z","isEdited":false,"title":"TEREIBLE APP","review":"DO NOT DOWNLOAD!!! This app stole my mamas toaster, milk and APPLE PIE!! Like are you joking??!!! Anyhow now my dads going to get some more milk but he’s been gone for a day now so that’s why I’m spreading the word so you don’t have to go through what me and my mama have been through! TERRIBLE APP!!! Do not recommend if you want to have nice things!!⚠️","userName":"DO NOT GET APP!!!"}},{"id":"6174876000","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:29:39Z","isEdited":false,"title":"Worst App Out There","review":"This app was a piece of garbage. It’s a bunker baby hang out for those that project the title snowflake on to others when they are the true snowflakes. This app takes away your rights and is all fake news. Honestly wouldn’t be surprised if it stole your morality cause it sure is twisted.","userName":"Regin69"}},{"id":"6174869880","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:27:51Z","isEdited":false,"title":"Ruined my life","review":"I downloaded this app so I could keep up to date on news. Within hours all my information was sold to the Chinese government. My friend Lin just informed me she got an alert I was wanted in China. Now I have to start my life over thanks to this app.","userName":"ddydog"}},{"id":"6174867671","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:27:13Z","isEdited":false,"title":"worst app ever","review":"i love me, my president and i wanted to support him. i downloaded the app and it showed me inappropriate images of politicians. now that is now way to win! when i went to uninstall the app my phone caught on fire burning down my house and my two kids... this was an unfair tragedy that can be avoided.. don’t download this app. by the way my two kids are doing better but they told me while in the hospital trump came by and touched them! but you know, he always manages to get it covered up.","userName":"nickinball"}},{"id":"6174863350","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:25:57Z","isEdited":false,"title":"HORRIBLE","review":"The minute I got the app my phone crashed. I turned it back on to see why and it said, “No matter if you’re a Republican, Democrat, Independent, etc, you shouldn’t support Cheetos!” And I believe this app put this RIDICULOUS VIRUS on my phone, and no expects me to believe this ludicrous crap that we have a CHEETO FOR a PRESIDENT. . Like, what!?","userName":"CheetoForPrez"}},{"id":"6174848127","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:21:27Z","isEdited":false,"title":"this app is not it","review":"when i open the app i see a shriveled up oranges thing which is absolutely disturbing and my 3 year sister started screaming her head off. this is only the first terrifying thing. i also saw the shriveled up orange taking a bath in clear water!! ew ew ew. that was the first time i threw up. there was also a lot of racism and people might be canceling the app store. then i saw about five more even more gross things and threw up three more times. i feel sick and ik deleting this app right now.🤮","userName":"awfulhorribleapp"}}]}