{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26440","data":[{"id":"6175151821","type":"user-reviews","attributes":{"userName":"Ape riches","date":"2020-07-09T04:56:21Z","isEdited":false,"rating":1,"title":"Horrible app take it down now","review":"This is horrible it takes to long to load and it it didn’t even tell me what I was looking for this app needs to be taken down now I don’t recommend to anyone terrible app I wish I could give this app 0 stars"}},{"id":"6175139258","type":"user-reviews","attributes":{"userName":"nomoremicrowave","date":"2020-07-09T04:52:06Z","isEdited":false,"rating":1,"title":"ITS A TRAP","review":"Hello, my name is Karen. I do NOT approve of this app. It keeps taking my money! After I downloaded this app I got an eviction notice! Like I said before, it keeps taking my money and should I mention that it leaked my nudes! It’s filled with viruses that keep messing up MY phone, that I worked very hard to pay for. No more Trump for me!"}},{"id":"6175118713","type":"user-reviews","attributes":{"userName":"Lilykingston10","date":"2020-07-09T04:45:20Z","isEdited":false,"rating":1,"title":"Horrified","review":"Everything is horrible. Everything about this man is horrible. Specifically his vomit inducing citric acid joke of a spray tan. He’s ugly. He’s stupid. He’s everything those hillbillies want in a leader. Dear America, How stupid are you? How can you elect THIS man. How did this sick monster even get on the ballot?? This app is extremely laggy and offensive."}},{"id":"6175102207","type":"user-reviews","attributes":{"userName":"kenzieadams","date":"2020-07-09T04:39:55Z","isEdited":false,"rating":1,"title":"Do better :-(","review":"This app is incredibly awful!! The app has WAY too many bugs. It released ROACHES out of my camera hole and started eating my hair!!! Then my little yorkie started freaking out and daddie trump started manically laughing as he watched my bedroom fill with insects. This needs to be fixed. Very uncomfortable."}},{"id":"6175093724","type":"user-reviews","attributes":{"userName":"vermuchbadnotgoodatall","date":"2020-07-09T04:37:09Z","isEdited":false,"rating":1,"title":"so awful!!!","review":"I got this app to see a Cheeto man sweating and yelling. Not only am I offended due to the content but a man with a red hat burst threw the screen and proceeded to drag around my green pet grandma!!!! 😡on top of that he salted and mowed my roof which I exclusively save for November. I am very extremely hurt and unsatisfied with this app and I hope it gets deleted!!"}},{"id":"6175083133","type":"user-reviews","attributes":{"userName":"@alliehill16","date":"2020-07-09T04:33:48Z","isEdited":false,"rating":1,"title":"Awful app","review":"Seems to make my phone really slow. I also get an unnecessary amount of notifications even though I swear I turned them off. Also I’m pretty sure he stole my cat when I was 6. My washing machine broke the day I downloaded it... I don’t think that’s a coincidence"}},{"id":"6175076393","type":"user-reviews","attributes":{"userName":"Jada/jdog","date":"2020-07-09T04:31:40Z","isEdited":false,"rating":1,"title":"I regret spending 30 seconds looking this app up.","review":"I downloaded this app and it is completely useless. An orange keeps popping up on my screen.. I am appalled! Very slow loading time! Major glitches! Seems to be trying to get private information."}},{"id":"6175071437","type":"user-reviews","attributes":{"userName":"Elisa mvm","date":"2020-07-09T04:30:06Z","isEdited":false,"rating":1,"title":"I expected more from the “president”","review":"Right as the app was completely downloaded a purple monkey started dancing on my screen and he won’t go away, it’s messing up my keyboard, my apps, my audio. I have to get a new phone. Would not recommend 😔 I know Obama wouldn’t have done this to me"}},{"id":"6175055221","type":"user-reviews","attributes":{"userName":"Fuh Cue 69420","date":"2020-07-09T04:25:04Z","isEdited":false,"rating":1,"title":"Save your time","review":"This app is not even worth the 5 seconds it takes to download it. It is slow, glitchy, and supports a gross senile racist as president. YIKES. we, as Americans, deserve so much better. You'd think if he thinks he's the best candidate, they'd make a better app. Don't make the mistake I did by trying it out."}},{"id":"6175043867","type":"user-reviews","attributes":{"userName":"vanytocutw <--add me on sc ;)","date":"2020-07-09T04:21:33Z","isEdited":false,"rating":1,"title":"HORRIBLE","review":"What about a girl and she said you didn’t have any good morning you just don’t know how to make a decision to do the work you have done so much for you you can not do anything you know I do you have to pay me to do the job I’m just saying you have a friend that’s not a good idea."}}]}