{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31530","data":[{"id":"6176626900","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:06:13Z","review":"This app took several hours to download, and over 30 minutes to open when I clicked on it. Once it was open, it immediately crashed, my phone was unusable for several DAYS. DO NOT DOWNLOAD","title":"Awful App","userName":"...breenan","rating":1}},{"id":"6176621720","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:04:48Z","review":"when i opened this app not only did I see a crusty orange cheeto man (that made the kids I was with cry) but also it crashed my phone.  This app is horrible source of news, will DESTROY your phone and overall just got worth the download","title":"horrible 🤮","userName":"🦋🧚‍♀️✨🧚","rating":1}},{"id":"6176590941","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:56:26Z","review":"I am a white male but i wanted to try and make a difference and donate to the BLM cause. So i thought the best way would be to donate through the presidents app because you know hes the president. But when i donated i got a message saying that my donation went towards trumps new weave!???????!?!?!!!?","title":"DO NOT BUY","userName":"Tristyboiii","rating":1}},{"id":"6176556132","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:47:00Z","review":"This app took four days to down load and I wanted to support my president on this app but it took to danm long to down load and when it got don downloading my phone started glitching rlly bad and it would power off buy it self","title":"App","userName":"will morrex","rating":1}},{"id":"6176550700","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:45:31Z","review":"This app took forever to download and when it finally did it wiped all the information from my phone all the apps were gone and all my photos gone, this app is made to harm, i have to get a new phone tomorrow","title":"Zero Stars","userName":"fromthetiktok","rating":1}},{"id":"6176537289","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:41:48Z","review":"This app is terrible it took all of the data from my phone and it doesn’t have anything on it the app is annoying to work through and it is in general terrible","title":"This app is terrible","userName":"Dannyyy boi","rating":1}},{"id":"6176518233","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:36:37Z","review":"as soon as i downloaded this app (which took several days to download) my dog exploded. literally just exploded his guts are all over the wall and my brother is traumatized. the app was whispering sweet nothings into the ears of my loved ones, telling us all that were never getting obama back and that the orange creamsicle is here as a dictator for eternity. i cried. my mom cried. my dad cried and he’s a rupublican. my dog would have cried if the app didn’t kill him. if i could give it zero stars i would ❤️","title":"my dog died ✨🦋🧚🏻‍♂️💞","userName":"orange is NOT the new black","rating":1}},{"id":"6176507564","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:33:41Z","review":"The app took 2 days to download and was buggy when I opened it. It was so bad I had to uninstall and reinstall the app 4 times for it too work a little, but I couldn’t acces anything to the app to me is worse than a homemade app.","title":"Worst app","userName":"charmar115","rating":1}},{"id":"6176490558","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:29:00Z","review":"Tried multiple times to open the app but it always glitches out. I thought it would have been better made but it looks rushed with no thought put into it. 1/5","title":"Horrendous","userName":"dhgshjoophgfdr","rating":1}},{"id":"6176480247","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T12:26:12Z","review":"First let me talk about the good things about this app: It didn’t take long to delete.\nAs for why this app gets 2 stars instead of 1 well it’s easy to use but I don’t trust what it does with my data. \n\nUpdate: I gave it one star.","title":"Two star app","userName":"pubman1974","rating":1}}]}