{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=41360","data":[{"id":"6174658846","type":"user-reviews","attributes":{"isEdited":false,"title":"DONT DOWNLOAD!!!","review":"This is a horrible app and it even tracks your location without you even knowing!!  If you support trump idc if you don’t idc, don’t download and if you don’t like trump leave it a bad review and 1 star rating!!","date":"2020-07-09T02:24:52Z","rating":1,"userName":"Nancy🥰"}},{"id":"6174647723","type":"user-reviews","attributes":{"isEdited":false,"title":"AWFUL","review":"It LITERALLY connected to my other apps and sent fret pics to my grandparents. And that’s not all it hacked into my phone and it will randomly have my Siri tell me to KILL MYSELF. I wish I could rate it 0 but don’t download!","date":"2020-07-09T02:21:43Z","rating":1,"userName":"Coochiebaby"}},{"id":"6174643079","type":"user-reviews","attributes":{"isEdited":false,"title":"The worst","review":"I hate it. I will never look at this again. I hate it. This app should not exist. It told me to roll down the stairs and I had a concussion. Then it told me to hug my cat and I hate my cat. I don’t know what to write I came here for Tiktok","date":"2020-07-09T02:20:20Z","rating":1,"userName":"Ellentu123"}},{"id":"6174642826","type":"user-reviews","attributes":{"isEdited":false,"title":"Absolutely awful.","review":"This app drains your battery extremely quickly. Needless to say my pet chicken was not happy about it and threatened to divorce me over it. If i could rate this app 0 stars I would. 0/10","date":"2020-07-09T02:20:16Z","rating":1,"userName":"not a fake righter😂😉"}},{"id":"6174642871","type":"user-reviews","attributes":{"isEdited":false,"title":"this app is horrible","review":"this is quite possibly the WORST app i have ever used. horrible to navigate and you can’t do anything. when i wanted to delete it they threatened to steal my dog and put my pet ants in a microwave!!","date":"2020-07-09T02:20:16Z","rating":1,"userName":"BiasListIsWreaked"}},{"id":"6174636293","type":"user-reviews","attributes":{"isEdited":false,"title":"Horrible","review":"I got the app but it made my phone glitch😒 I wanted regular updated but it doesn’t work as soon as I deleted it my phone got back to normal. I HATE IT!!! Never downloading it again😡","date":"2020-07-09T02:18:25Z","rating":1,"userName":"blahhh🤢🤮🤢🤮🤢"}},{"id":"6174628987","type":"user-reviews","attributes":{"isEdited":false,"title":"this is the worst app anyone on the planet has ever created","review":"once i downloaded it, my phone got a virus and completed shut down. i tried to get it to turn back on but it wouldn’t work. so we went to the apple store to get it fixed but it died. the workers said this is happening to a bunch of people who downloaded the app. i’m now on a new phone and we’re in the process of suing donald trump.","date":"2020-07-09T02:16:21Z","rating":1,"userName":"mc chicken head"}},{"id":"6174621691","type":"user-reviews","attributes":{"isEdited":false,"title":"TERRIBLE app. Really NOT GOOD.","review":"WOW. This app. Let me tell you about this app. When I first downloaded this app I was excited. I thought it was something new. Something fun. Something for the summer. I was WRONG. As soon as I downloaded this app, I knew it was BAD. Not good!","date":"2020-07-09T02:14:17Z","rating":1,"userName":"tonald gunp"}},{"id":"6174612903","type":"user-reviews","attributes":{"isEdited":false,"title":"DO NOT GET IT","review":"This app has literally destroyed me and my family’s lives 😔 We were obligated to say racial slurs in order to log in the app and Donny sent a private message saying we all had to leave the country! DO NOT RECOMMEND","date":"2020-07-09T02:11:48Z","rating":1,"userName":"nickvideosloveslance"}},{"id":"6174604933","type":"user-reviews","attributes":{"isEdited":false,"title":"This app made me lose my money!","review":"I looked at this app and I thought It was gonna be useful but every 1 month, it takes 1 dollar out of my bank account!","date":"2020-07-09T02:09:33Z","rating":1,"userName":"wubbzy301"}}]}