{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=84730","data":[{"id":"6177958128","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T19:30:22Z","review":"this app is ✨terrible✨ would not recommend","title":"DONT DOWNLOAD","userName":"scf44","rating":1}},{"id":"6177933188","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T19:22:18Z","review":"A horrible choice for that photo you put up donnie 🙃 your turkey neck couldn’t even breathe in the suit ☹️","title":"THE IMAGE THAT FIRST APPEARED SCARED ME","userName":"Shakiralol","rating":1}},{"id":"6177913631","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T19:15:51Z","review":"I downloaded this and I was expecting to support the MOST SMARTEST ORANGEST PRESIDENT EVER, but then I realized he was a complete failure and that i want obama back. TRUMP SUCKSSSS","title":"Horrible app","userName":"jfkdkdkdkd","rating":1}},{"id":"6177878875","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T19:04:29Z","review":"Now, I was a pretty big Don fan when I downloaded, I loved all the great things Donald J. President was doing for the country, like giving out free murals of his face for people to put up in their garages, but since getting this app, awful things have been happening! The owls in my neighborhood have completely turned against me for one. When I would go outside to do my nighttime mischief, they used to always land on my shoulders and carry me away with their bare hands so I couldn’t do anything dangerous, but now they won’t even look at me. What’s worse is they’re collecting garbage from nearby and flying over my head to throw it on me and they say it’s an accident, but I know they’re mad because I downloaded Donald’s store into my phone. I wasn’t even going to say anything before about this, but yesterday was the last straw. Yesterday morning, the Trump mural in my garage started to look sick, and I was going to see what was wrong, when suddenly the ghost of George Bush came bursting out through his mouth hole. I didn’t know what to say, I couldn’t believe my eyes! George Bush stood there lashing his razor sharp fangs at me and warned me that if I didn’t delete this app, I’d be doomed to show up for work late forever. Then he stuffed himself into my Nike sneakers where he told me he’d be waiting if I ever needed some advice. I thanked him of course, but now the ghost of George Bush is living in my Nikes and I don’t want my house to be raided by Jeb and George who will inevitably come looking for him. Will never use this app again! Thanks a lot Donnie.","title":"Owls are throwing garbage at me and I think the ghost of George Bush is stalking me","userName":"KatieB_$","rating":1}},{"id":"6177871739","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T19:02:16Z","review":"this is a horrible app! i would not download at all! i didn’t want to download it but i wanted to rate it! so yeah. i would not download this app if i were you!","title":"tiktok","userName":"ahvebejd","rating":1}},{"id":"6177869776","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T19:01:39Z","review":"I got the app and my pp shrunk to .0002 inches","title":"Don’t get it I’m warning you","userName":"Cocoloco44","rating":1}},{"id":"6177827311","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:48:49Z","review":"This app completely destroyed my phone and my life. When I tried to download it, first of all, it took SEVEN HOURS (!). When I finally got it to open, during the login process I opted not to use my mobile number (I used my email).This clearly angered the app moderators, and after I finished the login, I got 4 scathing emails stating things such as “sweet, sweet revenge will be rained upon you”. I didn’t think much of it, until a couple days later, as I was studying Trump propaganda in my room, I heard a whirring noise coming from above my house, getting louder as the seconds went on. I went outside on my balcony and just in time for me to witness, a helicopter emblazoned with “TRUMP 2020 LIBTARD POLICE” landed on my roof, causing my life’s work of completed puzzles, which were being stored upstairs at the time, to be completely destroyed. This would  later send me and all three of my dogs spiraling into a deep depression. I think about what I could have done to deserve this, and while I am pondering, I notice that Donald Trump himself has emerged from the helicopter. We lock eyes, and he lumbers his way across the roof onto my balcony while I am frozen in fear. Then, as soon as he breaks eye contact, he leaps down from the roof, rips two bricks out of my house with his bare hands, and brutally beats me with them for hours, shouting,  “LIBTARD! LIBTARD! MAGA!””KAG!”. ya When I take my final dying breath, knowing that I will soon be released form this misery, the last words I hear are “This is what happens when you don’t put your phone number in, punk!”The moral of this story is to NEVER under any circumstances download this app, and if you choose to ignore this warning, always put your phone number in unless you want to suffer the same fate as I did.","title":"Terrible! Do not download!!","userName":"--xxxxxxcafjdbdjdjdbhokxxxxx","rating":1}},{"id":"6177818868","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:46:23Z","review":"Worst app ever. Would not recommend.","title":"Worst app","userName":"azheleh","rating":1}},{"id":"6177817853","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:46:04Z","review":"This app is very racist because they did let me do","title":"Whomp whomp whomp","userName":"andnwxkyr","rating":1}},{"id":"6177796594","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:39:47Z","review":"Everytime I open this app. I see a dancing burnt Cheeto","title":"1 star","userName":"fkshapeknrfichandhftojfbabdhc","rating":1}}]}