{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=41070","data":[{"id":"6178430818","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T22:16:59Z","userName":"ajhu1435","rating":1,"title":"terrible","review":"it took way to long to download and keeps freezing. when it came down to the password i put Biden2020"}},{"id":"6178401292","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T22:05:32Z","userName":"gameofemma","rating":1,"title":"this is the worst app possible","review":"i downloaded this app to get more educated on the ✨cheeto✨ in charge, but was horribly disappointed. after taking 3 months to download, the app didn't even work. all it had was pictures of orangutans. as soon as i opened this app, the air conditioning broke in my house in 90 degree weather. i can only assume that it was because i opened the app. do not download."}},{"id":"6178381490","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:57:56Z","userName":"hdjxnsnx","rating":1,"title":"Worst app I have ever downloaded!!","review":"I downloaded this app to help see the man’s beliefs, but it wanted me to put in my phone number!?!? That is just as unconstitutional as the government making me wear a mask!!! I will NOT be voting for him in this election #biden2020"}},{"id":"6178375247","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:55:31Z","userName":"thebestrevoewer93","rating":1,"title":"App Malfunctioning","review":"So, I downloaded the app, and I support trump etc. However, when I downloaded it, it kept showing supports for Biden 2020. This is horrendous, not sure how the donald trump app is supporting Biden. Though, if the app supports biden then I do too. Biden 2020"}},{"id":"6178372779","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:54:35Z","userName":"Ghostfire10648","rating":1,"title":"Had high hopes!😭","review":"I had some pretty high expectations for this app but I was pretty disappointed right off the bat. It took 69 hours to download?! Apple you shouldn’t allow that to happen!🤬"}},{"id":"6178369092","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:53:07Z","userName":"ncksktnnsnama","rating":1,"title":"no ❤️","review":"i had a dream about trump raping my sister and it scared me to death. i literally woke up crying. i was raped not too long ago and i really don’t think a RAPIST should be in office. all trump supporters can come at me, dilligaf? NO. then they wanna take our therapy away (tiktok) NOOOO."}},{"id":"6178367612","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:52:35Z","userName":"wassghbrmdidjehs","rating":1,"title":"THIS APP IS NOT SAFE","review":"As soon as got done downloading I went on it and my phone started turning on and off it messed up my phone so now I got to get another one don’t get it. You can mess up your phone"}},{"id":"6178350713","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:46:03Z","userName":"BLM.Rena","rating":1,"title":"Whomp whomp","review":"So I got this app becuz I am a trump supporter but this app failed me I was trying to see his plans but it just made my phone do weird things so this is why I am writing this and what I said in the beginning was a lie BLM."}},{"id":"6178338874","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:41:32Z","userName":"Vianca💯","rating":1,"title":"Im here from TikTok","review":"This is so bad bc he is rasist and is really mean to Mexicans and he only municipalities his supporters and just uses them!!! I hate him btw!! And just got to be president from luck!!! And overall he is a bad and HORRIBLE person!!!!!! Ok thanks for reading :)"}},{"id":"6178338699","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:41:28Z","userName":"cthnwbvagudbrbjal","rating":1,"title":"Review","review":"DONT DOWNLOAD!! this app made my phone crash after just 5 minutes and now it’s not working correctly. No wonder it only has 1.2 stars. If I could I would have rated it 0. No trump 2020!"}}]}