{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=32410","data":[{"id":"6172894363","type":"user-reviews","attributes":{"userName":"bobmanny","isEdited":false,"title":"NOT A GOOD APP","review":"absolute worst app ever. took so much storage and lags your phone. not to mention when you first open the app, there’s a jump scare. i almost had a heart attack. i am 59 years old. i tried to show my support for my king Trump, but it’s not worth it. do not download guys.","date":"2020-07-08T16:28:29Z","rating":1}},{"id":"6172875978","type":"user-reviews","attributes":{"userName":"whyamireviewingthis120120","isEdited":false,"title":"This app-","review":"This app is- I threw a green burger and mini Oompa Loompas dressed like donald trump came up to my house chowing down on it- now this is just the beginning. charli garlics live was going ok... but Donald decided to hack miss garlics account saying you poopy fart I hate you 😾 but this time he looked like an Oompa Loompa with green wig and orange skin buh bye that’s the end","date":"2020-07-08T16:22:57Z","rating":1}},{"id":"6172865976","type":"user-reviews","attributes":{"userName":"partygirl91736501","isEdited":false,"title":"HORRIBLE APP DO NOT DOWNLOAD","review":"this app literally shut my entire phone down. i had to go to the apple store to have them get into my apple id and delete this app. then my phone finally turned on. this has happened to a lot of people i know. i STRONGLY advise you do not download this app.","date":"2020-07-08T16:19:53Z","rating":1}},{"id":"6172841016","type":"user-reviews","attributes":{"userName":"Omar_castanon","isEdited":false,"title":"Terrible app","review":"This app was horrible. Took forever to download. Once it downloaded it was very slow and would not work. I do not recommend getting this app at all. There is also more bad reviews than positive ones.","date":"2020-07-08T16:12:24Z","rating":1}},{"id":"6172831293","type":"user-reviews","attributes":{"userName":"martin7281638","isEdited":false,"title":"Absolutely horrible","review":"The app crashes and freezes. It makes my phone lag. Every time I try to open the app it closes up again and again. President 🍊✨🍊should do something about this.","date":"2020-07-08T16:09:33Z","rating":1}},{"id":"6172825319","type":"user-reviews","attributes":{"userName":"MadisonCora","isEdited":false,"title":"Why","review":"The app is very misleading. It makes our president seem like not a racist jerk. I think there is a clone of him and we should all fear for our lives! There’s clearly an imposta🍝! This app is an attempt to brainwash innocent old people into voting for a FAKE CHEETO!!! 0/10 recommendation. The app is also very ugly in general.","date":"2020-07-08T16:07:50Z","rating":1}},{"id":"6172821543","type":"user-reviews","attributes":{"userName":"txbxuniverse","isEdited":false,"title":"Terrible app","review":"I thought this app would give me reason to give our current president a second term. Turns out this app just gave me more reason to dislike the president. He’s done nothing good for us and maybe his presidency was a terrible idea.","date":"2020-07-08T16:06:45Z","rating":1}},{"id":"6172820173","type":"user-reviews","attributes":{"userName":"dhdbwhwo","isEdited":false,"title":"Horrible👎🏻","review":"This app is disorganized and has terrible quality. He is using this only to make money and not to benefit his supporters. The point system is not effective and the app is not what the preview says it is. The worst app of all time. It makes me uncomfortable.","date":"2020-07-08T16:06:21Z","rating":1}},{"id":"6172808007","type":"user-reviews","attributes":{"userName":"TiggerTrouble3","isEdited":false,"title":"🤢🤢","review":"This man really thinks tiktok causes more harm than Facebook?? The only reason he’s upset is because we trolled him. Sorry that your feelings are hurt but c’mon… you’ve done worse. Ever heard of separating children and their parents only to put them in detention centers? Get it together Don.","date":"2020-07-08T16:02:55Z","rating":1}},{"id":"6172798202","type":"user-reviews","attributes":{"userName":"free america 2020","isEdited":false,"title":"Literally made me hate trump more than i already do","review":"going through the app made me realize how hard he is trying to make it seem like he’s not one of the most racist presidents we’ve had.  just go ahead and delete the app for me.","date":"2020-07-08T16:00:05Z","rating":1}}]}