{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38470","data":[{"id":"6175094257","type":"user-reviews","attributes":{"title":"gave my phone a virus 🤮 horrible app","date":"2020-07-09T04:37:20Z","isEdited":false,"rating":1,"review":"This app gave my phone a virus worse then covid!!! This disgusting app made my phone crash and i could barely write this review oml djjfjenfjen sorry it’s messing up my keyboard sndhjdbejerjd oops did it again... 🤢🤮🥴","userName":"AbigayleLK"}},{"id":"6175066269","type":"user-reviews","attributes":{"title":"DONT GET THIS APP!!!","date":"2020-07-09T04:28:29Z","isEdited":false,"rating":1,"review":"This app couldn’t have been worse. It glitched, crashed, malfunctioned and more. I couldn’t get any of the VERY important information i needed. It also LIED TO ME!!! It gave me false information and i hope Trumps team is on it! Fake News!!!!!","userName":"whiteracistuglytrumpsupporter"}},{"id":"6175062617","type":"user-reviews","attributes":{"title":"Good lord this app is garbage.","date":"2020-07-09T04:27:23Z","isEdited":false,"rating":1,"review":"I downloaded this application on my cellular device to learn of any updates that our president will give us. I received several viruses from this application and have to get my cellular device repaired.","userName":"@wowdrew's helper"}},{"id":"6175041795","type":"user-reviews","attributes":{"title":"My pet fish died seeing this app","date":"2020-07-09T04:20:55Z","isEdited":false,"rating":1,"review":"As soon as I opened this app my phone started to buzz consistently and then I decided to show my pet fish while I was taking it out for a walk and it died bye far worst app I’ve ever used !!","userName":"fishlover246"}},{"id":"6175035340","type":"user-reviews","attributes":{"title":"disappointed","date":"2020-07-09T04:18:53Z","isEdited":false,"rating":1,"review":"i went in with high hopes and and honestly was just all around upset with what i received. while the app itself had been put together okay (not great but at least tolerable) the content shown wasn’t at all worth the download, really just stuff i can easily see with 1 google search. it’s completely pointless. will be deleting, don’t waste your time downloading :/","userName":"hdidjifjdhdisbdihsneufixbshef"}},{"id":"6175031944","type":"user-reviews","attributes":{"title":"0 STARS!!! MY GOOGLE ACCOUNT WAS HACKED AFTER DOWNLOADING","date":"2020-07-09T04:17:47Z","isEdited":false,"rating":1,"review":"I am furious!! After downloading this app my google account that is also attached to my bank account got hacked!!! My profile picture on google was also turned to a confederate flag!!! Horrible app do not download!!","userName":"Anna222222222222222222222"}},{"id":"6175024882","type":"user-reviews","attributes":{"title":"Never","date":"2020-07-09T04:15:33Z","isEdited":false,"rating":1,"review":"This app made my dogs, Aunties refrigerator jump into the street and flip 8 car while jump roping over the bay bridge. Also the refrigerator drop all the coronas on the street and licked it up plus it was foggy and it got lost💀","userName":"lol ihvdfv"}},{"id":"6174968192","type":"user-reviews","attributes":{"title":"I expected more 😐","date":"2020-07-09T03:57:30Z","isEdited":false,"rating":1,"review":"I downloaded the app to see my favorite Cheeto puff but as soon as I opened the app my phone started steaming and glitching so it was destroyed and I had to get a new one. I really expected more, please do not get this app!!!!","userName":"melt ice."}},{"id":"6174962793","type":"user-reviews","attributes":{"title":"Horrible App","date":"2020-07-09T03:55:47Z","isEdited":false,"rating":1,"review":"I have never seen an app that runs this bad. It took an hour to start up and then asked to see my birth certificate. Excuse me! I am an American. I eat apple pie and watch baseball and I’m morbidly obese. Something me and Mr. Trump have in common. You just lost my vote Mr. Orange. #notmypresident","userName":"mad voter"}},{"id":"6174951258","type":"user-reviews","attributes":{"title":"Hbk1","date":"2020-07-09T03:52:14Z","isEdited":false,"rating":1,"review":"When I opened the app. My phone stopped working and I had to get another one .This is the by far the worse app I have ever had in my life. Because I had to pay for a new phone cuz the orange president.","userName":"638262827K"}}]}