{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23510","data":[{"id":"6178683610","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T23:56:23Z","userName":"Molly Fellenz","isEdited":false,"review":"this app has the worst layout i have ever seen. hours after downloading my phone began to slow down, and then completely shut off. i couldn’t turn it back on so i took it to the apple store. they couldn’t do anything and i had to get a completely new phone. DONT DOWNLOAD.","title":"MALWARE"}},{"id":"6178656075","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T23:45:38Z","userName":"Catlover23354","isEdited":false,"review":"This app took so long to download!!!! It took all of my storage on my phone and filled my camera roll with pictures of another country (you can probably guess what country). All I was trying to do was get more information on our jolly ol’ orange man’s 2020 campaign. So outraged and disappointed.","title":"Belongs to the streets"}},{"id":"6178652908","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T23:44:21Z","userName":"bannana anal","isEdited":false,"review":"Omg it took over a MONTH!!!! to download like wtfffff I opened it and a bloody screen popped up saying I’ll kill you like omg whatttttt I was so scared I passed out!!!! When I woke up I tried to delete the app but I couldn’t!!! I started to think and I went onto tiktok and saw a few zaddys!!! Then they told me what to do so I’m okay now but this app could HURT you BEWARE!!!!","title":"Omg"}},{"id":"6178641905","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T23:40:02Z","userName":"Esmee Paulsen","isEdited":false,"review":"Bruh, I was gonna our the entire bee movie script but APPARENTLY it’s too long, so here my tangent on why this app is disgusting. Why would an app that supports the campaign of a ra[p or c(your choice)] exist? This app is revolting just like its name and I felt actaully sick downloading this app. So I hope you all have fun rating it 1 star and leaving quality reviews❤️","title":"Trump is ✨g r o s s✨"}},{"id":"6178599217","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T23:23:20Z","userName":"Jennifer Ziegler","isEdited":false,"review":"This app is VERY broken. Crashes every single time! Extremely laggy and poorly designed. I would not recommend this to anyone! Save your time and energy to download a different news app. Not worth the stress. Would give this ZERO stars if I could.","title":"keeps crashing!!!"}},{"id":"6178594279","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T23:21:21Z","userName":"no longerr a trump supporter","isEdited":false,"review":"This app had a two day download time and the actual app was horrible not only were the features bad but it never worked and was just bad so I deleted it and I’m done I am never downloading this garbage again","title":"This app is horrible I never want to see it again"}},{"id":"6178565869","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T23:10:26Z","userName":"Kristinahugs","isEdited":false,"review":"THIS APP took me 12 years to download like what!!! Then it started screaming and flying in the air. Then it went and crashed on the floor making my phone break. But 2 years later it revived itself and the app is gone. If my phone decided the world was better off without him and his “leadership”","title":"EWWWWEEE🤢🤢"}},{"id":"6178548086","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T23:03:17Z","userName":"ItIskathey","isEdited":false,"review":"I downloaded this app in hopes of getting the real news from my president. But instead I was bombarded with glitches. Not only was the app glitching but it also took 17 hours to download. I demand that this app be removed until it is ACTUALLY ready for users!","title":"Very disappointed"}},{"id":"6178539529","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T22:59:53Z","userName":"jess steel","isEdited":false,"review":"It took a whole week to download! I had downloaded it to see what information it had about COVID-19 and it had nothing all it had was stay safe, that’s disgusting I had high hopes for trump and that he would have better tips to stay safe but he clearly doesn’t care!","title":"Worst app"}},{"id":"6178499051","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T22:43:45Z","userName":"unibrowcorn_","isEdited":false,"review":"I downloaded the app and it took two days to download when it finally downloaded I went on the app and it crashed so I had to restart my phone and it didn’t work it crashed again and gave me a virus this app is so bad don’t download it unless you want a virus","title":"This app is so bad 🤢🤮🤮"}}]}