{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38270","data":[{"id":"6177961165","type":"user-reviews","attributes":{"review":"Honestly its just didnt work out for me its not like i wanted to work i unstan this omg it was a huge mistake downloading this but it was worth it to write the review and give it a one star don’t recommend downloading unless u want to write a review","title":"Yikess","userName":"jxkskskwie","isEdited":false,"date":"2020-07-09T19:31:22Z","rating":1}},{"id":"6177943248","type":"user-reviews","attributes":{"review":"I was told that after downloading this app, COVID-19 would disappear. Instead of that, we’re up over 3,000,000 cases nationwide with no end in sight. I would move to a different country, but no other country wants Americans.","title":"Worst App Ever","userName":"ceecee12344","isEdited":false,"date":"2020-07-09T19:25:35Z","rating":1}},{"id":"6177911915","type":"user-reviews","attributes":{"review":"This app sucked so it hacked my phone and now pictures of bunker boy pop up every two seconds I’ve never been so afraid 😦 not to mention any time I play a video the oranges voice comes out of nowhere. Someone help me .","title":"PLEASE FOR THE LOVE OF GOD DONT DOWNLOAD","userName":"bit life suggestion","isEdited":false,"date":"2020-07-09T19:15:16Z","rating":1}},{"id":"6177886798","type":"user-reviews","attributes":{"review":"This app is terrible takes to long to load the person it’s is terrible and and racist and ignorant and this app takes to long to load and it’s not very high quality!🤮🤢","title":"Dump trump !!!","userName":"DUNPN","isEdited":false,"date":"2020-07-09T19:07:04Z","rating":1}},{"id":"6177882550","type":"user-reviews","attributes":{"review":"I downloaded this app because i was excited to see just what such a racist, sexist, homophobic, transphobic, spineless leader could come up with- but it turned out to jut be one big ad! I want my money back!!","title":"Disappointed","userName":"Jabailey222","isEdited":false,"date":"2020-07-09T19:05:39Z","rating":1}},{"id":"6177873905","type":"user-reviews","attributes":{"review":"Bad so bad it was so confusing in did not let me do what i wanted to do and it takes you into a spiral of deep thought that you can never get out of also my husband thinks it’s control by hitler ew","title":"🤮🤮🤮","userName":"hdchdjgdgmxmhxhk","isEdited":false,"date":"2020-07-09T19:02:56Z","rating":1}},{"id":"6177854201","type":"user-reviews","attributes":{"review":"When I downloaded the app it was very glitchy and very hard to download for one it took about an hour to download and his plans seemed very scattered and not organized.","title":"Very Poor","userName":"sanee1233464849","isEdited":false,"date":"2020-07-09T18:56:50Z","rating":1}},{"id":"6177851586","type":"user-reviews","attributes":{"review":"This app is EXTREMELY slow and laggy. Not worth it at all. Download another app because it takes to long to show anything. All I wanted to see was a ✨bald orange ✨But no I can’t see anything 😫","title":"Terrible App 😤","userName":"War and good","isEdited":false,"date":"2020-07-09T18:56:04Z","rating":1}},{"id":"6177836492","type":"user-reviews","attributes":{"review":"I am very disappointed in you for taking tik tok down you take away all the fun in the world self tanning orange you don’t wanna get on my bad side mr if you take away my tik tok I’ll take away your self tanning machine and then your gonna go expired","title":"TikTok","userName":"hbuguugbugerxexcnow","isEdited":false,"date":"2020-07-09T18:51:34Z","rating":1}},{"id":"6177821574","type":"user-reviews","attributes":{"review":"I kept trying to open the app and it would show me horrible things and it would kick me out of the app. I would not recommend this.","title":"App is horrible","userName":"none of all your concerns","isEdited":false,"date":"2020-07-09T18:47:10Z","rating":1}}]}