{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=129390","data":[{"id":"6175443252","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:46:19Z","review":"Please do not download this app whatsoever. When I first download this app the app want to pay $136.49 like are you serious,I don’t have enough money to afford this in general but I paid the money anyways. This app after I paid the money sent meI repeat 47,000 spam emails for some reason like I don’t even know why they had my email. So after I deleted all of the spam emails from my inbox a life size 6 foot Danny Devito cut out arrived at my front door saying Trump 2020 or else your cats getting taken away. First of all do not threaten my beautiful cat second of all is this really a campaign strategy. So I continue my day as any other normal person would until an FBI agent showed up at my door trying to steal my cat first of all you told me if I didn’t vote for Trump my cat was getting taken away second of all where did you find my dress and third of all I it’s not even November. Then after I finally got this man to leave President TrumpPersonally took time out of his day to message me on Twitter first of all since you’ll be dealing with the coronavirus and second of all how did you find my Twitter. I am mediately blocked his Twitter account even though I did not read his messages. I feel personally threatened by Trump and his campaign strategy and his campaign strategies this election and I do not wanna feel this way anymore so I personally do not recommend downloading this app for any means because one a 6 foot Danny DeVito cut out will show up at your door and FBI man will and you will get harassed by the president.","userName":"appas luv","title":"Horrible"}},{"id":"6175436793","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:43:52Z","review":"follow me on instagram @dont_call_me_matt","userName":"DR4GON H4CK3R","title":"absolutely garbongo"}},{"id":"6175434960","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:43:07Z","review":"This app stinks took almost a year to download then I had to see his face when I opened the app totallyyyyyyy not worth it PICKLE RICK 2020","userName":"kerri😎","title":"It sucks🤬"}},{"id":"6175434181","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:42:49Z","review":"Horrible I tell you- it hacked the rest of my apps! My cat got pregnant within a week of my downloading this app- and she’s a virgin 🤬😖 Yep that’s right Trump impregnated my cat😭😤 and time make matters worse my car broke down after download this app full of bs!!! At least now the cops have stopped choking me and see me a straight white b!tch again- yay I got my privilege card back!!!! Honestly I thought this app was gonna be full of Cheeto coupons or a site that can put me in contact with Epstein to vist his pervert island- It wasn’t-very disappointed😭💔","userName":"DisBitcch","title":"He lost my vote 🤬🤬🤬"}},{"id":"6175432468","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:42:06Z","review":"First of all, was this app created by the most incompetent person on the planet? Seriously, the creator of this app must have the IQ of a cardboard box. Basically, when I tried to delete the app, my IPhone spontaneously combusted after the loud screams of Trump yelling from my microphone. It’s like the hoverboards. I instantly thought it was the issue with the IPhone. So naturally, I bought an android. Downloaded and deleted the app and IT COMBUSTED AGAIN. Maybe it wasn’t that app because dont those phones explode? Or were those the samsung galaxies? Not sure. But it HAD to be the apps fault. I am now writing this review, very hungry, on my smart fridge. Hopefully it doesn’t explode because of this app. Anyways, i am so unhappy with this app. I hope it gets deleted and never comes back😿","userName":"liveallday","title":"THE WORST APP EVER😕😕"}},{"id":"6175431334","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:41:42Z","review":"I have never had any problems with any other app! This is the worst app ever! It would not send me a verification code even though i typed in my number right and everything! This app is ran by a bunch of morons so the app is a moron to. I will not be using this app ever again and will be immediately removed off my phone and hopefully of the app store.","userName":"TotherRelic3","title":"worst app ever"}},{"id":"6175431368","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:41:42Z","review":"I am beyond DISGUSTED. This app promotes fascist ideas and constantly shows pictures of an orange Cheeto. Like I really REALLY wouldn’t even wipe my a** with it; I would seriously be afraid to get orange paint down there. But it’s not all bad news for you, here’s what i suggest can be done. For starters the orange mascot has to go 100% just gone. Second of all maybe keep the false news and the fascist authoritarian dictator vibes out of the app you know just so that it can at least be somewhat tolerable. Then once that’s done simply take the app away.... hear me out. All of these scare tactic are just toxic. As a matter fact get rid of the orange Cheeto in real life I think that’s the best solution.","userName":"FuckthatCheeto","title":"This is Gross"}},{"id":"6175429577","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:40:59Z","review":"I would never vote for this sexist rude butt hole who bleached his hair and gets fake spray tans to look like something out of veggie tales or especially the annoying orange himself. The fact that he would come out with an app is even worst.","userName":"Ariana Rodi","title":"Tik Tok isn’t going down without a fight"}},{"id":"6175429462","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:40:57Z","review":"Is it looks like poop and if it smells like poop it’s poop. That’s what this app is","userName":"Gjs623","title":"POOP"}},{"id":"6175429221","type":"user-reviews","attributes":{"rating":5,"isEdited":false,"date":"2020-07-09T06:40:51Z","review":"This is the beat app to ever be made I 4 more years trump 2020 keep up the good work and everybody else who is writing the fake bad comments go buy some work boots and get a job","userName":"jack🤠🤡","title":"Maga trum 2020 4 more years"}}]}