{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=127870","data":[{"id":"6177363050","type":"user-reviews","attributes":{"review":"Ummmmmmm\n\nEat my ass","userName":"¿donde esta la leche?","date":"2020-07-09T16:26:33Z","isEdited":false,"title":"Ya boi thick dick daddy trying to save TikTok","rating":1}},{"id":"6177362660","type":"user-reviews","attributes":{"review":"So I got this app because I wanted to help our 🧡 wonderful Cheeto of a president 🧡 with his campaign in any way I could. However, I was GREATLY UNSATISFIED with both the quality and overall experience I had with this app. For starters, it made me wait literal days for it to download. I just sat there with my phone through the night while it’s battery slowly drained, waiting for the app to download. Because of the sleep deprivation I was hospitalized for a week. And once it finally downloaded, a horrifying image of this big 🍊 orange 🍊 man with white circles around his eyes popped up. This was terrifying for me, and has been haunting me ever since I saw it. I finally realized that this image was of our president, which caused me to have an existential crisis. By this time, pop up adds for Trump 2020 started showing up all over my phone and my computer. The app must have hacked my phone and all my other digital devices, and now I can’t access anything on my phone except the App Store to write this review and so I can’t call anyone or get help so I’m basically deserted in a hospital bed and I can’t do anything, and all that I’m being fed are cheetos, which just reminds me of that traumatizing image or our president. 🤢🤮 So yeah, I would say that I wasn’t satisfied with the Trump app. I would highly recommend that you stay as far away from this app, and from our president, as possible. They are both extremely dangerous. 🧚🏻✨ Also BTW I’m totally NOT part of the whole Gen Z “getting rid of the app” thing. 🥰🧚🏻✨","userName":"NOTGENZ","date":"2020-07-09T16:26:26Z","isEdited":false,"title":"-10,345/10, would not use again!!!","rating":1}},{"id":"6177362582","type":"user-reviews","attributes":{"review":"This app is terrible. I wanted to see what the dictator has been up to for the election. I was coming on here to get more information on the orange about his plants for the election. It was terrible! There were adds popping up saying that i have unlimited access to um let’s just say adult websites. Then my phone started shaking and vibrating really bad. I didn’t know what to do. Also it was very inappropriate right when i opened the app there was some orange on top of a neck vagina. I was really scared but i continued on. Then where i found a little link, i clicked on it and it led me to a weird website about how to cook human meat. I was really scared at this point. I went back to his app and i found a little poop emoji and when i clicked that there were these long paragraphs about why you should send your poop to the president. The whole paragraph was about how he puts it into his system (don’t really know what that means) with his bare hands and what ever is left on his hands he slurps right off. The app was really just terrible and my phone has been acting weird since. There were a lot of things that looked like my join the cult websit- uh i mean a lot of things that looked like a cult website. Anyways, overall this app is terrible. I don’t like it, don’t recommend i now have to go to therapy. I would give it 0 stars but that’s sadly not an option, just like me liking Trump is not and option. Goodbye.","userName":"emmec22","date":"2020-07-09T16:26:24Z","isEdited":false,"title":"T/I/k/T/o/k","rating":1}},{"id":"6177362481","type":"user-reviews","attributes":{"review":"period.point.blank","userName":"jfofbdlrbro","date":"2020-07-09T16:26:23Z","isEdited":false,"title":"Terrible","rating":1}},{"id":"6177358472","type":"user-reviews","attributes":{"review":"Just a disclaimer; I am not apart of this gen z thing whatever. This app was extremely disappointing. I have never downloaded an app with this much amount of bugs and glitches in years. It’s always laggy, whether I’m at home using my wifi, or out using my data. Ever since I had downloaded this app, it constantly crashes and freezes me phone no matter the circumstance. I don’t even need the app open for it to absolutely obliterate my phone and it’s daily functions. I pity others who have downloaded this app because the same exact thing has most likely happened to them, or will happen. This seriously makes me want to switch to Samsung or Android because of how sucky my iPhone has reacted to this app. Would definitely recommend taking it out of the apple store for the sake of our phones.","userName":"Yvtboy","date":"2020-07-09T16:25:11Z","isEdited":false,"title":"Disappointed","rating":1}},{"id":"6177357617","type":"user-reviews","attributes":{"review":"trump is racist and hates colored people . he also is a child predator and sends inappropriate pics to young girls . DONT VOTE TRUMP FOR 2020-2024 .","userName":"Ari stupid name","date":"2020-07-09T16:24:56Z","isEdited":false,"title":"trump 2020 🤮","rating":1}},{"id":"6177357177","type":"user-reviews","attributes":{"review":"Excuse me! I’d like to send this game back. Look, I’m pretty sure you have to do what I say, and this food was NOT satisfactory. Their was a mouse in mine. So I’d like to send this back.","userName":"Santana Lopez 🥰","date":"2020-07-09T16:24:48Z","isEdited":false,"title":"This app is terrible.","rating":1}},{"id":"6177356675","type":"user-reviews","attributes":{"review":"FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP FORTNITE TRUMP","userName":"gekyumegamer665","date":"2020-07-09T16:24:39Z","isEdited":false,"title":"Fortnite gamer 69","rating":1}},{"id":"6177356437","type":"user-reviews","attributes":{"review":"I believe we need a president that is not racist and is not going to take down tiktok! So I believe dr.holly should be president! And this app is worse then tiktok just saying!","userName":"Dr.Holly for President","date":"2020-07-09T16:24:35Z","isEdited":false,"title":"#dr.hollyforpresident","rating":1}},{"id":"6177356003","type":"user-reviews","attributes":{"review":"Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz?  Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz? Ya like jazz?","userName":"barry benson rocks","date":"2020-07-09T16:24:29Z","isEdited":false,"title":"Ya like jazz?","rating":1}}]}