{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=140260","data":[{"id":"6179525400","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:35Z","title":"Couldn’t find anything useful","rating":1,"isEdited":false,"userName":"The Phlogiston Theory","review":"I miss the old app what was it called? Ahh yes OBAMA..."}},{"id":"6179525193","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:32Z","title":"Bs","rating":1,"isEdited":false,"userName":"Alal27","review":"Complete trash. Set up bad"}},{"id":"6179525135","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:31Z","title":"Garbage","rating":1,"isEdited":false,"userName":"hwte dxb","review":"Man the app was not cool I kept getting hacked and my pictures we're leaked and I can do anything it was horrible then my oven started to play rags to riches by Rod wave after I saw my security number on my phone everywhere and I kept getting calls from foreign countries saying that my Social Security number was deleteed"}},{"id":"6179525159","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:31Z","title":"So horrible","rating":1,"isEdited":false,"userName":"lkatherinegomezl","review":"Bad"}},{"id":"6179525117","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:30Z","title":"Terrible!","rating":1,"isEdited":false,"userName":"Dndmngng","review":"This is horrible. The app never works and is always crashing. Major issues. Horrible horrible app."}},{"id":"6179525033","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:28Z","title":"The worst","rating":1,"isEdited":false,"userName":"diana.e.pineda","review":"This app made me go bald 🙈"}},{"id":"6179524941","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:26Z","title":"Worst App Ever!!!","rating":1,"isEdited":false,"userName":"Lost Boy Fam","review":"I downloaded this app 69 years ago and it literally just downloaded today😒 its now 420 Am and it’s the worst app ever it keeps crashing when I go on it and it kept trying to sell my info I always got hacked and it almost put a virus on my phone. It’s not a safe app and I don’t recommend it to anyone      . I’m pretty sure it hacked my moms car the doors keep talking to each other and the seats keep hurting each other it’s like raining two toddlers and it makes me wanna scream. It’s also making the food in my house fly around like crazy for no reason one day I’m just sitting on my phone on the app and all of a sudden a bag a chips flew at me and said trump 2020. This app is super dangerous and should not be on the App Store"}},{"id":"6179524864","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:25Z","title":"i actually died","rating":1,"isEdited":false,"userName":"lillexi1122","review":"no seriously"}},{"id":"6179524875","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:25Z","title":"the WORST app","rating":1,"isEdited":false,"userName":"__maddy__","review":"terrible terrible app...honestly full of fake news"}},{"id":"6179524708","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:22Z","title":"Not Worth It","rating":1,"isEdited":false,"userName":"Bammuel John-Smith","review":"This app took ages to finish fully downloading; 420 days, 666 hours, 69 minutes, and 13 seconds to be exact. It took 2/3 of my phone storage, which was not full let alone close to reaching its full capacity prior to downloading the Trump App. The app drained my battery life in the span of 2 minutes and it asked countless arbitrary and absurd questions regarding my sexual life; including but not limited to: Are you dominant or like to be dominated? Rough or sweet and slow? Fast paced or lengthy pleasure? Any fetishes and/or kinks? The app was constantly spamming my inbox with images of tootsies along with promotional films of Chester Cheetah dancing to the slowed and reverb version of na na by the singer trey songz. All I desired was to be able to make myself informed about the terrific Trump campaign but was instead met with the app being a complete and utter disappointment. The raid of Area 51 with no outcome gave me far more satisfaction than this sorry excuse for an app."}}]}