{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31360","data":[{"id":"6067486544","type":"user-reviews","attributes":{"date":"2020-06-12T16:28:07Z","review":"I found the tips on bunkers- specifically their lifestyle and upkeep- pretty informational; you can tell OP was speaking from experience. But overall not worth the time. Even the wall diy was a failure. Also, OP has some pretty negative views on pretty much everyone that isn’t him? #yikes #cancelled","userName":"C. A. K.","title":"Kinda sucky","isEdited":false,"rating":1}},{"id":"6067491933","type":"user-reviews","attributes":{"date":"2020-06-12T16:29:56Z","review":"Very good quality, American made like it should be, best app hands down.","userName":"BoDuke345","title":"Amazing App","isEdited":false,"rating":5}},{"id":"6057523330","type":"user-reviews","attributes":{"date":"2020-06-10T05:39:01Z","review":"This app works okay on my phone so far, but that’s the problem.  I think its inapropriate for children.  Full of hate speach. It is Corrupt and Dangerous, not to mention with human rights violations.  Overall the design is poor and it does not add anything good to my life","userName":"amanda smithers","title":"Very Poor Quality","isEdited":false,"rating":1}},{"id":"6028177164","type":"user-reviews","attributes":{"date":"2020-06-03T03:01:06Z","review":"I keep getting asked to donate, and often get fake news popping up. Something feels off about this, I don’t think this is the real app. Not sure, but maybe this is a fake Soros App to get our information?","userName":"DaMightyPope","title":"Not sure this is the real app","isEdited":false,"rating":1}},{"id":"6052342852","type":"user-reviews","attributes":{"date":"2020-06-08T22:10:47Z","review":"Only place to get true information these days!!! Good way to stay informed.","userName":"Connor Heise","title":"Donald Trump is the Goat","isEdited":false,"rating":5}},{"id":"6179180749","type":"user-reviews","attributes":{"date":"2020-07-10T03:02:00Z","review":"You see I always hated Donald Trump but after getting this app I have grown to love him. SIKE. This app was the worst app I’ve ever gotten in my life. Nothing works and everything is wrong. Imagine making an app to support a misogynist, racist, and homophobic white supremacist? Could never be me. Um anyways Biden 2020","userName":"_andrianaaa_","title":"Best app ever 🥰","isEdited":false,"rating":1}},{"id":"6179161257","type":"user-reviews","attributes":{"date":"2020-07-10T02:54:38Z","review":"So since we apparently have freedom of speech I would like to say THIS APP IS GARBAGE so is trump and since he has such an orange peach head he gets 1 star so hoping this app will get off they App Store so if I could kindly wish u a happy dump trump holiday everyday and hoping this holiday will become international 🤮🤮🤢","userName":"✨🧚🏼‍♂️anonymous✨🧚🏼‍♂️","title":"WORST APP EVER!!","isEdited":false,"rating":1}},{"id":"6179146652","type":"user-reviews","attributes":{"date":"2020-07-10T02:49:14Z","review":"it took so long to download and when i finally downloaded, the screen was blank for a solid minute. The app could not be worse itself I have no idea how to navigate it and it crashes and glitches all the time. PLEASE DO NOT DOWNLOAD THIS APP IT MIGHT HAVE A VIRUS!!!!","userName":"bunkerboy420","title":"worst app ever","isEdited":false,"rating":1}},{"id":"6179127491","type":"user-reviews","attributes":{"date":"2020-07-10T02:42:08Z","review":"This app seems very rushed and sloppy. Didn’t like it. I would say you could do better but…we all know that’s a lie. Moral of this review, I do not recommend this app. Horrific quality👎🏻","userName":"Gregory McRyan","title":"Very bad app, lags, takes forever to download, and made my phone hot.","isEdited":false,"rating":1}},{"id":"6179111267","type":"user-reviews","attributes":{"date":"2020-07-10T02:36:09Z","review":"This app is awful!! It just is a bunch of propaganda and keeps giving me information about this cheeto who calls himself president. The app made me sad and you shouldn’t download it :( \n\nI found out today this app gave me an STD it needs to be deleted!!!","userName":"isabel.lew","title":"DON’T DOWNLOAD!!!","isEdited":false,"rating":1}}]}