{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=89610","data":[{"id":"6175080806","type":"user-reviews","attributes":{"isEdited":false,"review":"Do I have to explain?","title":"Terrible app.","userName":"justanormalgirll","rating":1,"date":"2020-07-09T04:33:03Z"}},{"id":"6175079492","type":"user-reviews","attributes":{"isEdited":false,"review":"I was on the app and my dog looked at the phone and turned into stone... DONT GET THE APP!!😭","title":"Killed my dog","userName":"abby198913","rating":1,"date":"2020-07-09T04:32:38Z"}},{"id":"6175079318","type":"user-reviews","attributes":{"isEdited":false,"review":"Horrible just like the man himself.","title":"Anything but great","userName":"annon66","rating":1,"date":"2020-07-09T04:32:35Z"}},{"id":"6175031629","type":"user-reviews","attributes":{"isEdited":false,"review":"Unacceptable!! Seriously?! You want my MOBILE PHONE NUMBER?! That is mY PERSONAL INFORMATION!!!","title":"How dare you!","userName":"Kylie 😇","rating":1,"date":"2020-07-09T04:17:42Z"}},{"id":"6175022506","type":"user-reviews","attributes":{"isEdited":false,"review":"DON'T DOWNLOAD THE TRUMP 2020 APP. \n\nSo I was just trying to chill with the boys, you know the frogs by the creek, but this app ruined my week. After it possessed my hamster causing it to make itself food and do laundry (which i know sounds good at first, that was my reaction too, it got way worse), it decided that world domination via hamster was the best thing to do. I just watched in shock as my hamster started rounding up her posse, breaking other hamsters loose from my neighbors. It was an absolute nightmare. They started to join together like an organized militia, gathering toothpicks and sewing needles as weapons. The started screaming, with war cries like, \"FOR CHEESE,\" or \"KILL THE DOGS.\" Anyway I wasn't too worried at first, but as the numbers grew I wasn't really sure what to do. Whenever they saw another animal, like a squirrel, they'd scream \"FOR CHEESE,\" and swarm it like rats in the NYC subway after someone drops a slice of pizza into the tracks. Now I had climbed a tree by this point, holding my dog April in my arms. The app then started ordering them around and somehow my hamster got crowned their leader. They donned her with a bottle cap as a helmet and a gum wrapper as a cape. With cries for cheese they were all rallying around her calling for the downfall of dogs and humans. Now most my neighbors by now were all  on their roofs, elevation was the only safe place. At this point we were all a bit more worried as they found the matches and tin foil and were making match rockets. We didn't have much longer to worry as their shouts of \"VIVA LA RÉVOLUTION,\" and \"CHEESE\" were suddenly cut short with \"Where'd the wifi go?\" While everyone was up in trees and on their roofs my brilliant sister disconnected our router. My phone, an old 6s couldn't get any service so once the wifi cut, the app couldn't do anything. After about a minute of them mulling around trying to hold my phone up to get service in different places, griping about bad service, they gave up and dispersed. Now a few of them stuck around, but my boys by the creek and I got them to scatter. Hamsters don't love my frog boys by the creek so it didn't take long. \n\nSo yeah, absolutely don't recommend this app at all, unless you want revolutionary hamsters.","title":"IT STOLE MY HAMSTER","userName":"CheeseWriter","rating":1,"date":"2020-07-09T04:14:46Z"}},{"id":"6174948297","type":"user-reviews","attributes":{"isEdited":false,"review":"donald trump is a horrible president and is causing so much harm to the united states and his supporters are just making things worse","title":"this app is horrible","userName":"hehelffbh","rating":1,"date":"2020-07-09T03:51:18Z"}},{"id":"6174929287","type":"user-reviews","attributes":{"isEdited":false,"review":"I got this app just to keep in with news right when I downloaded it DELETED ALL MY MEMBERSHIPS AND DELETED ALL MY APPS OFF MY PHONE DONT GET THIS APP","title":"WORST APP EVER","userName":"Cookiecook1218","rating":1,"date":"2020-07-09T03:45:22Z"}},{"id":"6174903715","type":"user-reviews","attributes":{"isEdited":false,"review":"I wanted to see what my favorite daddy made and I’m disappointed... not my daddy.😿😷","title":"DADDY","userName":"JessTheWolf111","rating":1,"date":"2020-07-09T03:37:43Z"}},{"id":"6174898452","type":"user-reviews","attributes":{"isEdited":false,"review":"This app it keeps taking my avocado slice I’m so sick of it send\nHelp ASAP waaaaaawawawa I’m so sad","title":"Nonono","userName":"avocado help","rating":1,"date":"2020-07-09T03:36:11Z"}},{"id":"6174887996","type":"user-reviews","attributes":{"isEdited":false,"review":"This app contains an overwhelming amount of not only nationalist propaganda, but propaganda specified to entrap innocent Americans into the cult of red capped conservative fascism.","title":"This app is wacky","userName":"Cyruskennan","rating":1,"date":"2020-07-09T03:33:05Z"}}]}