{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=40410","data":[{"id":"6177916522","type":"user-reviews","attributes":{"review":"I open the app and right when i do so i get a bunch of spam messages from random numbers asking all sorts of disturbing questions. like is this some kind of joke I AM CONSTANTLY being spammed by unknown numbers.  I WOULD LIKE TO SPEAK TO THE MANAGER OF THIS APP SO THAT IT IS DELETED ASAP FOR POOR PRIVACY PRECAUTIONS!","rating":1,"title":"angry karen","date":"2020-07-09T19:16:49Z","userName":"fruatrated karen","isEdited":false}},{"id":"6177911806","type":"user-reviews","attributes":{"review":"this app took forever to download. When I opened the app all it did was glitch- things took forever to load. quality is terrible. xoxo gen z ❤️","rating":1,"title":"bad app don’t download","date":"2020-07-09T19:15:14Z","userName":"Chevron13","isEdited":false}},{"id":"6177882377","type":"user-reviews","attributes":{"review":"This is the worst app I’ve ever used. The format is terrible, there’s no real information, and you need to enter a phone number to even get in???\n\nI don’t get the point. 0/10","rating":1,"title":"Awful","date":"2020-07-09T19:05:36Z","userName":"Nemo56418","isEdited":false}},{"id":"6177842378","type":"user-reviews","attributes":{"review":"It’s just overall terrible the way it works the delivery as on top of all that it takes a long time just to load it’s terrible, just get rid of it","rating":1,"title":"Bad app","date":"2020-07-09T18:53:20Z","userName":"boom tap power","isEdited":false}},{"id":"6177841939","type":"user-reviews","attributes":{"review":"This app is really bad Bc  the first thing I saw on it was trump face and it made me throw up like what the hell is that anyways I’ve had this app for a while and it’s not that good and I’m also doing this Bc I hate trump with a passion and Bc of TikTok :)","rating":1,"title":"Spam","date":"2020-07-09T18:53:11Z","userName":"Anonymous 🤭🤭","isEdited":false}},{"id":"6177801556","type":"user-reviews","attributes":{"review":"I tried to use the app and it just wasn’t working it kept taking me out of the app and then once i got in it asked me for money like ain’t the president rich anyways don’t use the app it’s bad.","rating":1,"title":"Chile-","date":"2020-07-09T18:41:16Z","userName":"ms.gen","isEdited":false}},{"id":"6177790168","type":"user-reviews","attributes":{"review":"I am very unsatisfied with the quality of the app it is very hard to navigate and it is not very clear where I can go to get access to support my president.","rating":1,"title":"Difficulty navigating","date":"2020-07-09T18:37:51Z","userName":"joe hawk canada","isEdited":false}},{"id":"6177779097","type":"user-reviews","attributes":{"review":"it was supposed to tell me where to buy my toe cream:/ didn’t help don’t recommend!! plz don’t use deleting right away!! so terrible and should be taken off the app store such a disgrace! grrr","rating":1,"title":"AWFUL","date":"2020-07-09T18:34:29Z","userName":"wowdrew sent wm","isEdited":false}},{"id":"6177769505","type":"user-reviews","attributes":{"review":"I had such a horrible experience with this \napp it kept making my devices crash and Trumps plans for the upcoming elections are horrible. Please do not listen to this man.","rating":1,"title":"Awful","date":"2020-07-09T18:31:35Z","userName":"jdiduflejsjdojd","isEdited":false}},{"id":"6177764048","type":"user-reviews","attributes":{"review":"Our president shouldn’t have an app like this. He already has Twitter in which he complain complains and complains more. I can’t even get on this app without fearing for our countries life.","rating":1,"title":"Terrible","date":"2020-07-09T18:29:57Z","userName":"@wowdrew sent me 01","isEdited":false}}]}