{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=83130","data":[{"id":"6172353199","type":"user-reviews","attributes":{"userName":"journals hales disco","title":"This App Is Trash","isEdited":false,"rating":1,"date":"2020-07-08T13:56:25Z","review":"Made my phone glitch and lag terribly."}},{"id":"6172350511","type":"user-reviews","attributes":{"userName":"ella hubbie","title":"DONT GET THIS APP","isEdited":false,"rating":1,"date":"2020-07-08T13:55:41Z","review":"This app made my phone glitch so bad that my phone shut off for 5 minutes, DO NOT GET THIS APP!!!!"}},{"id":"6172343119","type":"user-reviews","attributes":{"userName":"pen canal seventy","title":"Do not download","isEdited":false,"rating":1,"date":"2020-07-08T13:53:39Z","review":"Do not don’t download ps trump gen z will not back down do not take away TikTok"}},{"id":"6172328681","type":"user-reviews","attributes":{"userName":"starrygirl321","title":"No.","isEdited":false,"rating":1,"date":"2020-07-08T13:49:42Z","review":"Bull crap. Everywhere was bull crap. I swear to god if trump wins again I’ll kill myself- the absolute worst."}},{"id":"6172328470","type":"user-reviews","attributes":{"userName":"RugRatzVibe","title":"Horrible","isEdited":false,"rating":1,"date":"2020-07-08T13:49:39Z","review":"This is the worst app ever. I don’t recommend it at all. It caused me depression and anxiety. :(("}},{"id":"6172320125","type":"user-reviews","attributes":{"userName":"Tatertotati051","title":"Our President","isEdited":false,"rating":1,"date":"2020-07-08T13:47:21Z","review":"He hasn’t dealt with the coronavirus well at all and is continuously homophobic, transphobic, and racist❤️"}},{"id":"6172314137","type":"user-reviews","attributes":{"userName":"ayonobev?","title":"This app shouldn’t be on the App Store it is horrible","isEdited":false,"rating":1,"date":"2020-07-08T13:45:41Z","review":"It is trash and everybody wants it banned"}},{"id":"6172287256","type":"user-reviews","attributes":{"userName":"samanthanhillbilly","title":"Remove this app!!","isEdited":false,"rating":1,"date":"2020-07-08T13:38:06Z","review":"Horrible app! Gives plenty of reasons to not vote for Trump this election!"}},{"id":"6172286266","type":"user-reviews","attributes":{"userName":"haify tik","title":"This is the worst app EVER","isEdited":false,"rating":1,"date":"2020-07-08T13:37:50Z","review":"It really made me causin upset because what it talks about it’s just so rasist"}},{"id":"6172281496","type":"user-reviews","attributes":{"userName":"b1tch muffin","title":"killed everyone i love","isEdited":false,"rating":1,"date":"2020-07-08T13:36:24Z","review":"i downloaded this app to try and learn more about the president. i assumed that it would all be fine and dandy. the first warning sight is it took 7 hours to download and used 3 full charges. then i opened the app and i could hear was polish witch chants. i didn't think much of it but then when i showed my mom this her eyes rolled to the back of her head and then she started chanted along with the app. i didn't know what to do so i called an ambulance. one they arrived the looked at her and screamed in terror and ran off. so then i asked my dad for help. i showed him the app and he just immediately started to seize. after about a minute he got up and his eyes rolled to the back of his head like they did with my mom. at this point i knew the app was out to kill much like its creator so i tried to delete it from my phone. however when ever i tried to delete it it started to scream things like your a fat chungus. Once this happened u deceded i just had to throw my phone out so i did. i smashes it and threw in a lake. i thought u was safe but later that night when i was watching my third hour of one direction videos my phone that he previously been smashed and thrown in a lake came flying towards me. it hit me square in the face. my sister picked it up and when she looked at it she faced the same fate as my parents. i was starting to i wonder why i wasn't being turned into a polish witch and then being killed by rats. i didn't have time to figure it out so i decided to lock the phone a safe. and long story short that didn't work. my brother came over thinking he could help and let's just say that he couldn't. i called my bubby and relieve that she had download the app and it turned her into a polish witch. this app has ruined my life and the lives of everyone i love. NEVER DOWNLOAD IT AND GIVE IT A BAD REVIEW!!!!! xoxoxoxo xoxoxoxo xoxoxoxo xoxoxoxo \nדונלד טראמפ הוא סופרמיציסט לבן.  עצירה מוחלטת.  אם אתה מצביע בשבילו הוא סופרמן לבן.  עצירה מוחלטת."}}]}