{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=6590","data":[{"id":"6177480007","type":"user-reviews","attributes":{"title":"Disgusting","userName":"🤍💫☀️💜","isEdited":false,"rating":1,"date":"2020-07-09T17:01:11Z","review":"This person is a disgusting human being. He doesn’t care about anyone or anything. He said climate change isn’t real. He thinks all Mexicans are rapist. And wants to deport all immigrants but little do we all know trumps wife was, in fact she’s still in immigrant. On top of that he is a sexist, homophobic, ignorant person. With no heart or compassion for the families in need. He said the Holocaust was a made story, and now he has cause half a million of people to be unemployed!!!!!! A person with no compassion and no knowledge shouldn’t be able to have an app for himself."}},{"id":"6177477479","type":"user-reviews","attributes":{"title":"Crash","userName":"Jiggfvhb","isEdited":false,"rating":1,"date":"2020-07-09T17:00:26Z","review":"Nothing positive to say. Do not recommend at all. I’ve downloaded it several times over a series of days and I have only once been able to actually open the app without it immediately closing itself again. The one time I opened the app successfully it ran so slowly that my finger swipes on my phone were happening way after I’d already clicked or swiped at a button. I had to delete the app because it slowed everything else down on my phone as well. I’d give 0 stars if I could."}},{"id":"6177458269","type":"user-reviews","attributes":{"title":"Never again","userName":"cchhlloohhhss","isEdited":false,"rating":1,"date":"2020-07-09T16:54:50Z","review":"I used to be a serious trump supporter, like I had all of his merchandise, I went to multiple rallies including ones out of my state, etc. Since January I’ve quickly come to realize that he is a complete idiot and can’t deal with tough situations like COVID-19 or the Blm movement. I got this app to try to understand his plans for the future in hopes that I might change my mind to support him again, but this app made it worse. It only shares news that he wants to share and all of his ideas are terrible. I’m VERY disappointed!🤬🤬"}},{"id":"6177421544","type":"user-reviews","attributes":{"title":"This app is TERRIBLE!!!","userName":"johnson, bob 2020","isEdited":false,"rating":1,"date":"2020-07-09T16:43:39Z","review":"See, I first downloaded this app to see what it was about and to support President Donald Trump. When the app finally downloaded, because it took forever, I opened it, the screen went white, and then it shut my phone down. When I went to go power my phone on, the battery sign came up. I literally had to go charge my phone because this app made it shut down. before I downloaded the app, my phone was on 86%. I do not recommend this out for anybody else, because I had a terrible experience."}},{"id":"6177314079","type":"user-reviews","attributes":{"title":"AWFUL!","userName":"mattieprofili","isEdited":false,"rating":1,"date":"2020-07-09T16:12:47Z","review":"this app is AWFUL! and it completely lies, first off it took 2 months to download so by the time it actually did download i forget about it. second it promised me i would get 500 dollars and justin Bieber to show up at my door once u download it and i got NONE of what i was promised. this app is a complete DISASTER. do not i repeat DO NOT waste your time getting this app. I feel lied too, cheated and scammed i will never be downloading this app again and don’t recommend anyone too!!!! i would give it a 0 if i could but that’s not a option sadly.."}},{"id":"6177177759","type":"user-reviews","attributes":{"title":"This app provides false and/or misleading info","userName":"Bonesofdoom","isEdited":false,"rating":1,"date":"2020-07-09T15:33:36Z","review":"To all of you Breitbart/OANN stans and the Fox News fake-newsers, this is the culmination of their work. They have played Americans like the average bard plays his lute. News orgs like these are in the pockets of billionaires and exist to spread misinformation about topics such as climate change and the pandemic. My suggestion to you all is to listen to the scientific/medical/academic consensus on every subject, not news orgs (including CNN and MSNBC and such) who just package what is most convenient to them.\n\nThat being said, Trump is a terrible President and the app itself creates an echo chamber."}},{"id":"6177066719","type":"user-reviews","attributes":{"title":"Ruined my life","userName":"Cade kolesar","isEdited":false,"rating":1,"date":"2020-07-09T15:02:44Z","review":"So I downloaded this app, and immediately when I opened it, the app spoke to me and said “you’re an ugly little s***”. I didn’t know what to do in response to it so obviously I told the app it was being very very mean to me, and before I knew it the app decided to call me a “poopoo stinky” :/. I was hurt. I was offended. Shortly after this fiasco I emailed the trump administration to complain, and president trump himself told me that “if I don’t stop being a liberal little c**t b**tch he was going to curb stomp me, and my children”. So please, rethink about downloading this app. It hurts peoples feelings :("}},{"id":"6176960781","type":"user-reviews","attributes":{"title":"This Is Worse Than When My Dog Gets Sick On The Carpet","userName":"A A Ron no its just Aaron","isEdited":false,"rating":1,"date":"2020-07-09T14:34:06Z","review":"There’s something wrong with the image on the home screen of the app. As soon as I opened it I was hit with an overwhelming sense of nausea and felt so unwell I almost passed out. When I closed the app I felt better but suddenly my phone felt like it was over heating from such an awful app being downloaded and it must have put a virus on my phone. I will be deleting this app swiftly as I do not wish to cause more damage to my device. Please spare yourselves for I fear this app may be the end of humanity."}},{"id":"6176946273","type":"user-reviews","attributes":{"title":"Battery","userName":"gnomename","isEdited":false,"rating":1,"date":"2020-07-09T14:30:14Z","review":"So basically after getting the app to follow up on Trump news, my phone’s battery would start draining incredibly fast and wasn’t able to keep the charge that I had. When I would open the app as well, it would slow down so much and actually never load up, and I was confused. After some digging, I guess the problem came from the fact that a lot of my memeory was being taken up, and it was slowing down my phone, while also significantly slowing down my battery."}},{"id":"6176623122","type":"user-reviews","attributes":{"title":"WORST APP I HAVE EVER DOWNLOADED","userName":"dislikescheetos","isEdited":false,"rating":1,"date":"2020-07-09T13:05:11Z","review":"I did not have the highest expectations for this app, as I had high expectations for the office of the president of the United States and Donald Trump has failed at every corner. I hoped to find some policy changes to his platform that would show he gives a d**** about our country and wants to make it a better place. Instead I was BOMBARDED with ads without my consent not unlike the women our president has inappropriately touched. And left to find under the ads the same woefully inadequate and disturbed platform. RIP Donald Trump, there’s no changing you. #notmypresident"}}]}