{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28980","data":[{"id":"6174698449","type":"user-reviews","attributes":{"review":"I hate it. It makes my phone turn all shades of color and also my dog died? So I went to get a grave but the Trump app (this app) told me to just throw it in a pond. Like who does that? This app apparently. If you care about your pet at all I do not recommend.","userName":"El Erai","date":"2020-07-09T02:36:31Z","isEdited":false,"title":"Would give 0 if I could.","rating":1}},{"id":"6174690569","type":"user-reviews","attributes":{"review":"This app is so trash just like the the guy in charge... it (referring to the app😉) told me to go back to where i came from. When I tried doing that to get out of this country I fell and landed back on this side😭. Overall trash experience... because I survived the fall. Anyways... 🧚‍♀️✌️","userName":"Al3x Candelario","date":"2020-07-09T02:34:09Z","isEdited":false,"title":"🧚‍♀️ Fairy Review","rating":1}},{"id":"6174685632","type":"user-reviews","attributes":{"review":"Worst app on the app store. My cat was barking at me once i downloaded it on my kitchen table. while i was on the app my best friend texted me “this is why you’re my girlfriend i love you so much” and i was wondering why she said that because he’s my enemy. anyways this app needs to be deleted.","userName":"ndbxbsbdbbdbd","date":"2020-07-09T02:32:40Z","isEdited":false,"title":"worst app.","rating":1}},{"id":"6174685010","type":"user-reviews","attributes":{"review":"This app locked children in cages, took away my rights to regulate my own uterus, called my black and brown sisters and brothers criminal, thugs, rapist, and job stealers. This app colluded with child rapists, corrupt foreign governments, and Russia to kill American troops. Would not recommend. BLM!!! we will not have another 4 years of this CLOWN!!!!!!!!","userName":"ES519","date":"2020-07-09T02:32:29Z","isEdited":false,"title":"Horrible, totally, absolutely horrible!","rating":1}},{"id":"6174679976","type":"user-reviews","attributes":{"review":"my phone started to glitch after downloading along with personal information was gone from my phone and when I deleted and reinstalled it got worse so this is a really bad app anyway.","userName":"mysteriousstudent","date":"2020-07-09T02:30:59Z","isEdited":false,"title":"glitches","rating":1}},{"id":"6174674402","type":"user-reviews","attributes":{"review":"When I opened the app my house immediately went swirling in the air like in the wizard of Oz. The wicked cinnamon Hitler tried to take my rights away and he killed the munchkins! I tried tapping my heels but I realized I wasn't wearing Ruby slippers because I'm not part of the one percent! Save yourselves and DO NOT download this app!","userName":"rinn.e","date":"2020-07-09T02:29:21Z","isEdited":false,"title":"The worst!","rating":1}},{"id":"6174674023","type":"user-reviews","attributes":{"review":"I had high hopes for this app and it is absolute garbage. I can’t believe the trump administration is fine with this app being in the App Store. It is completely full of glitches and almost never works. How am I supposed to empower my own bigotry and xenophobia now???","userName":"Crawdadehhhhhh57382758","date":"2020-07-09T02:29:14Z","isEdited":false,"title":"This app is so horrible","rating":1}},{"id":"6174672382","type":"user-reviews","attributes":{"review":"I am not fully convinced this app isn’t a form of Russian spyware. Trump has said beware of robots. They may take over the world some day. His fear is also my legitimate fear. So I don’t understand why he would approve of this app, ever since I have gotten it I have been getting emails I’m Russian.","userName":"whitbit1111","date":"2020-07-09T02:28:45Z","isEdited":false,"title":"This app is iffy","rating":1}},{"id":"6174671533","type":"user-reviews","attributes":{"review":"This app was very glitchy and always crashing I could not even use the app due to all the glitches At some moments it will crash and I can’t open it until a couple days later don’t get it it’s not worth your time.","userName":"Discodog53","date":"2020-07-09T02:28:31Z","isEdited":false,"title":"DONT GET IT","rating":1}},{"id":"6174669851","type":"user-reviews","attributes":{"review":"This app caused my arm to fall off and I went to the doctor and then all the doctors died bc they died from not having proper medical equipment for COVID. So I went home and my house had burned down, and my outhouse. I had to pee so I took a squat on my neighbors trump sign as I should. Then I died... do not get this app. For your own safety.","userName":"abore shun","date":"2020-07-09T02:28:04Z","isEdited":false,"title":"CURSED APP","rating":1}}]}