{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=7380","data":[{"id":"6177320610","type":"user-reviews","attributes":{"userName":"_w.i.l.l.o.w_","isEdited":false,"title":"Bad quality","review":"This app doesn’t do what it advertises. I was expecting Satan to greet me when I first opened the app but was let down when all I saw was his side kick hell spawn Donald J Trump. I found the rights propaganda to be unentertaining and frankly whinny. The lack of patriotism was astounding as well. Patriotism should be doing what’s best for everyone, not wearing a bikini with the flag printed on it. \n\nFinally, I don’t trust this app alone with my teenage daughter. In short, if I could give this a -5 star review I would. It’s dividing and destroying our country. \n\nWould not recommend.","date":"2020-07-09T16:14:34Z","rating":1}},{"id":"6177291294","type":"user-reviews","attributes":{"userName":"TIrisha KiTOK","isEdited":false,"title":"DONT GET THIS APP","review":"As a young person preparing for this years 2020 election I have decided to brush up on the candidates in order to make a well informed decision. NOT ONLY did this app provide NOTHING but it was biased, intellectually off-putting, and poorly designed. After a day of using it I noticed it was omitting a high frequency whenever I used it WHICH CAUSED MY GRANDMOTHER TO HAVE A SEIZURE!!! I cannot believe a sitting president would put his own citizens and supporters at risk in this way. Apple should immediately remove this app to prevent anymore tragedies from happening ever again.","date":"2020-07-09T16:06:18Z","rating":1}},{"id":"6177247108","type":"user-reviews","attributes":{"userName":"izzyleon","isEdited":false,"title":"WORST APP EVER!","review":"I ain’t a part of this gen z thing but I wanted to review this app. First it kept kicking me outta the app. And it kept asking for my age and my parents name. It said please put in your state and address. it’s not a safe app guys. It asked me for credit card info and other stuff like my email, Phone number, ext. \nBut even tho I put in my phone number all I got was spams from the app for random products that no one would ever use. I tried to cancel the spam but after I renters my number it didn’t stop. I rate this one star.","date":"2020-07-09T15:53:26Z","rating":1}},{"id":"6177159225","type":"user-reviews","attributes":{"userName":"behdajjdjw","isEdited":false,"title":"Lag Issues","review":"So, I was extremely excited to be able to get the app on my phone after my son told me about and to get it so I am updated on what our wonderful President is doing. However, I have been having many issues with the app. One of these includes Lag as so my son told me. So, I don’t know if I should delete the app or not. I am only rating this app 1 Star not the President. The app seems like this issue needs to be fixed. Please fix this. I have tried to reinstall  but it does not work.","date":"2020-07-09T15:28:21Z","rating":1}},{"id":"6177080628","type":"user-reviews","attributes":{"userName":"egwils","isEdited":false,"title":"I felt personally attacked","review":"I like to call myself in the middle of these to parties. and I was open to seeing how Trump will try to improve the United States. But after downloading this app I understand white America is the way it is right now. I felt personally attacked every click they wanted more money. It felt like I was just a wallet for using this app. The more I looked at it the more I realized that I don’t even align with his ideals. And those ideals are just human rights. this app is a clear indication of why the United States is failing right now.","date":"2020-07-09T15:06:34Z","rating":1}},{"id":"6177052172","type":"user-reviews","attributes":{"userName":"careehteh","isEdited":false,"title":"really bad","review":"i downloaded the app to see what trump was planning for to see if i liked it and i don’t like the cheeto looking thing plans. i downloaded and it hacked into my email account and i don’t know how to get it back. that cheeto scared me when i saw that it opened up to him as the first page. you shouldn’t scare away people like that. i think this app should be taken away because i am not comfortable with what he is trying to do from the past years and from the present years. cheeto harasses women and his own daughters. he doesn’t let his son barron have his freedom of a 14 year old. he never got to live like a free child and that makes me upset. even if it has nothing to do with trump it still upsets me how you won’t let barron have his freedom. i saw how he very much degrades women and is a racist and yes i’m done now","date":"2020-07-09T14:58:47Z","rating":1}},{"id":"6176946370","type":"user-reviews","attributes":{"userName":"Fbfjsbtcyahcjhrlfjeyfu","isEdited":false,"title":"💖🦋🧚‍♀️💫✨","review":"My whole experience on this app was a total fail. When opening this app.....I couldn’t believe my eyes. It was the man himself... the Cheeto that we call a president😭. When digging further into this app and seeing why I should possibly( not really) vote for the Cheeto  for 2020 I saw something that would scar me for life. It was mr. Donald doing the renegade. I will say, I was completely tempted to make an event to save his famous son Barron. When concluding my experience upon this devastating app, i will be sitting in the corner, crying about my awful experience.","date":"2020-07-09T14:30:15Z","rating":1}},{"id":"6176930969","type":"user-reviews","attributes":{"userName":"ANoNYmUS_SUmYNoNA","isEdited":false,"title":"Trump App","review":"So number 1 I want to say that for whoever is saying that he's NOT racist, homophobic and mysoganistic. you are incorrect, get your fricking facts right and stop being so blinded by your privilege. To the person who said were all little kids under twelve who have nothing better to do, actually im not under 12, i have so many better things i could be doing but im choosing to sit here and write this review to educate the adults who are so brainwashed that they cant see who this cheeto is. And also, my parents are very proud of me❤️","date":"2020-07-09T14:26:11Z","rating":1}},{"id":"6176916778","type":"user-reviews","attributes":{"userName":"moe-l","isEdited":false,"title":"THE APP KILLED MY BROTHER AND TOOK MY HOT CHEETO🤭","review":"This app took 2 years to download and once I downloaded it trump popped out of the screen and started to eat all the snacks in my house. It was all fine until he ate my hot Cheetos then I went crazy. I started running around at hitting him with a giant glow stick. He was so scared that he peed himself and then went into the corner and started crying. Then his evil twin poped out of the app and started  walking towards my brother. Then the twin used his mind powers to through my brother out the window. So all in all this app killed my brother.","date":"2020-07-09T14:22:32Z","rating":1}},{"id":"6176904672","type":"user-reviews","attributes":{"userName":"charityleah","isEdited":false,"title":"ugh","review":"DO NOT GET THIS APP! i first got this app to keep up with trump but i open it up to a big fat cheeto looking oompa loompa!🟠 i got scared and exited the app but my wallpaper was changed to lil huddy!!!⬛️(i don’t like him) then the bald eagle 🦅 flew through my window and took me to this weird place.🏢when i got there the place blew up💥 and all i had was a parachute 🪂 so i took that and glided to the hype house but dixie wasn’t there :( so then kouvur (or however you spell her name) slashed my head with a hammer 🔨 this is disrespectful and disgusting this app needs to be taken down!","date":"2020-07-09T14:19:22Z","rating":1}}]}