{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24370","data":[{"id":"6178941864","type":"user-reviews","attributes":{"review":"You would think the a sitting president of the USA would have the resources to launch a better app.  This was totally horrendous in every sense of the word.  Don’t waste your time downloading this garbage app.  Total failure and absolutely disappointing.   I expected better 😡😡😡","title":"Could be so much better","userName":"Big John Studdmuffin","isEdited":false,"date":"2020-07-10T01:34:12Z","rating":1}},{"id":"6178929012","type":"user-reviews","attributes":{"review":"If I can give it ZERO stars I would. TERRIBLE APP. Insane amount of glitches, typos, uses ALL my memory so I don’t have space for anything else. Took DAYS to download. The images right away are TERRIBLE quality. Share the app with your friends if you want to waste their time and they’ll rate it the same trust me.","title":"ZERO STARS","userName":"aPPAULedd","isEdited":false,"date":"2020-07-10T01:29:27Z","rating":1}},{"id":"6178891367","type":"user-reviews","attributes":{"review":"Hello. This man deserves nothing at all. If I could rate less than 1 star I would. Slow and doesn’t open correctly. App glitches and closes on me. Blah blah blah idk if I actually have to complain about the app. I’m complaining about the man. Or should I say little boy. Take this app down thank youuuu😇😇😇","title":"My left toe could do better","userName":"SophDawg29","isEdited":false,"date":"2020-07-10T01:15:31Z","rating":1}},{"id":"6178863806","type":"user-reviews","attributes":{"review":"It took 5 days for this app to completely download and I had plenty of storage and strong wifi. I finally opened it and it immediately CRASHED. Next, my phone began glitching and when I tried to delete the app it wouldn’t!!! All my photos and apps deleted or stopped downloading. THIS APP DESTROYED MY PHONE DONT GET IT!!!","title":"Terrible app","userName":"Invader Zim96","isEdited":false,"date":"2020-07-10T01:05:31Z","rating":1}},{"id":"6178858563","type":"user-reviews","attributes":{"review":"I got this app a few months ago. I recently found out that is was downloading viruses onto my phone. If you keep this app it will destroy your phone, laptop, or computer. There is no rating low enough to explain how much I hate this app.","title":"Get off this app immediately!","userName":"NEW PRESIDENT!","isEdited":false,"date":"2020-07-10T01:03:38Z","rating":1}},{"id":"6178830753","type":"user-reviews","attributes":{"review":"i opened up the app expecting the best but i only got the worst !!! how pitiful were the features !!! not chefs kiss. this dumb piece of junk made my phone shiver and timber all the way down my sidewalk. awful. old crab legs everywhere !!! days old shrimp came spilling out of my phone as soon as i downloaded. i deleted then downloaded again to see if it shall work once more but no !! it got worse !!! twerking shrek was everywhere haunting my dreams. this went on for week! i am flabbergasted. mortified even! get this man out of office please.","title":"had tiny ween peen 🤮","userName":"Kebdhshiwke","isEdited":false,"date":"2020-07-10T00:53:07Z","rating":1}},{"id":"6178823860","type":"user-reviews","attributes":{"review":"I downloaded this app to keep up with the best president in the world but it took 2 years to download and when it finish downloading it started to tell me to stop wearing a mask because I would bother me and it started my phone to glitch I think my phone felt disgusted by this app","title":"Don’t Download","userName":"ImmigrantsBuildAmerica","isEdited":false,"date":"2020-07-10T00:50:25Z","rating":1}},{"id":"6178823724","type":"user-reviews","attributes":{"review":"It took almost 27 hours to download and finally, on the 27th, I was able to get it going and it started sending me notifications saying it can see me and to start building the wall. It’s also extremely racists if I could leave a 0 star, I would","title":"Dysfunctional","userName":"minslady","isEdited":false,"date":"2020-07-10T00:50:22Z","rating":1}},{"id":"6178777584","type":"user-reviews","attributes":{"review":"This app is terrible! If I could give 0 stars, I would. It asks for personal information and the interface as a whole is just plain bad. I had such an awful experience that I will be uninstalling ASAP! Again, this is a TERRIBLE APP!!! It’s useless, and is the worst thing I have ever downloaded.","title":"AwFuL! WORST APP I’VE EVER DOWNLOADED","userName":"S.strella","isEdited":false,"date":"2020-07-10T00:32:38Z","rating":1}},{"id":"6178745228","type":"user-reviews","attributes":{"review":"I downloaded this app app while I was taking a fat poopy, and was greeted by a lying cheeto head staring back at me, with the AUDACITY to put the American flag behind him. Then the app crashed, and made my phone blow up into a firing inferno. Will NOT be downloading again. Save yourself (and your phone) from the dumpster fire that is this app.","title":"Sincerely, Disappointed.","userName":"obama4lyfe","isEdited":false,"date":"2020-07-10T00:20:09Z","rating":1}}]}