{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=129770","data":[{"id":"6174994049","type":"user-reviews","attributes":{"rating":1,"title":"So disappointed😔","review":"I was so excited to download the app until I opened it up and saw cheeto man himself asking for my phone number🤭😳. No thanks but I will not be giving out that information to an orange🙄, @skincarebyhyram you need to help him with a new skincare routine... maybe some Cerave?? Anyways, after I closed the app it restarted my phone and drained my battery. I was NOT okay, but then I listened to Dixie’s smash hit ~Be Happy~ and I felt so much better (which is the only reason I’m giving this a star!)","isEdited":false,"userName":"karen'sworstnightmare","date":"2020-07-09T04:05:41Z"}},{"id":"6174993407","type":"user-reviews","attributes":{"rating":1,"title":"VERY BAD🤮","review":"THIS MADE ME POOP MY PANTS AND THEN I PUNCHED MY GRANNY AM VERY ANGRY THIS GAME BAD NOT WORTH PLAYING WORDT GAME EVER!!!😾✨🧚🏿‍♂️✊🏽✊🏾✊🏿#blacklivesmatter #dumptrump #acab🧚🏿‍♂️✨","isEdited":false,"userName":"Jassie🤠","date":"2020-07-09T04:05:29Z"}},{"id":"6174993064","type":"user-reviews","attributes":{"rating":1,"title":"developed in a BUNKER??","review":"i have a fantastic wifi connection right now but the app is so GREAT at being glitchy it’s as if it was developed embarrassingly in a bunker under the east wing of the white house as a way to sweep multiple rape allegations and a GREAT past friendship with jeffree epstein under the rug. do bunkers even have rugs? if they did i know they’d be GREAT. i bet connection and communication especially is super NOT GREAT on all of the white house grounds too. everyone so busy keeping barron captive and plagiarizing michelle obama’s speeches there’s no time to even put on a mask! we are doing so GREAT at this pandemic thing we have THE MOST cases! oh yeah! record beating per usual. i wish this app was GREAT. whoever this app was made for should be in true donnie fashion be FIRED!!! that would be so GREAT.","isEdited":false,"userName":"Naomi793","date":"2020-07-09T04:05:23Z"}},{"id":"6174988764","type":"user-reviews","attributes":{"rating":1,"title":"Worst app EVER","review":"Thought this would help make American great but instead put a racist Cheeto in a position of power even those racists Cheetos don’t have much brains and only function on hate and praise for doing awful things. -1000/10","isEdited":false,"userName":"Jai189","date":"2020-07-09T04:04:03Z"}},{"id":"6174988760","type":"user-reviews","attributes":{"rating":1,"title":"THE WORST APP IVE EVER USED","review":"This is for rachel you big fat white nasty smellin fat b*tch why you took me off the mf schedule with your trifflin dirty white racist a** big fat b*itch oompa loompa body a** b*tch","isEdited":false,"userName":"papabernie2020","date":"2020-07-09T04:04:03Z"}},{"id":"6174987511","type":"user-reviews","attributes":{"rating":1,"title":"this app gave me clamydia","review":"i was in my room watching anime and suddenly flashback mary appeared in my room and screamed in my left ear \"HI SISTERS!\". my ears proceeded to bleed so i had to go to the hospital and get them fixed. my doctor was a trump supporter so naturally this app was on my phone. as i pushed out a giant elephant poop from my fat ass, i realized that i was itching and burning. turns out agent orange had clamydia and was spreading it via this app😭","isEdited":false,"userName":"hisoka's fat ass cheeks","date":"2020-07-09T04:03:38Z"}},{"id":"6174986913","type":"user-reviews","attributes":{"rating":1,"title":"TERRIBLE APP‼️","review":"DO NOT DOWNLOAD THIS APP!! I was enjoying my Sunday afternoon yogurt when I got a notification from my pet iguana telling me his favorite yo-yo was missing! I thought, who could have possible stolen my pet iguana’s yo-yo! Then it came to me...maybe if I wore my purple socks instead if the orange ones, my amazon package would’ve arrived sooner. Anyways, my phone blew up after opening this app so I’m writing my review from my LG 360 microwave that my gram grams gave me for christmas about 3 years ago while I went scuba diving with my best friend Larry the Lobster and then Jojo Siwa showed up to my birthday party and we ate some chocolate cake, it was pretty good actually even though I’m not a fan of cake but its ok because I’m allergic to peanuts. Thank you.😌","isEdited":false,"userName":"LovelyArlene47","date":"2020-07-09T04:03:27Z"}},{"id":"6174986671","type":"user-reviews","attributes":{"rating":1,"title":"WORST APP EVER!!! DO NOT DOWNLOAD!!","review":"Do not get this app it is absolutely GARBAGE!!!!! Took FOREVER to download even with good WiFi, and needs updates. Very glitchy and not worth it. Do.not.get.this.app.","isEdited":false,"userName":"realg_92","date":"2020-07-09T04:03:22Z"}},{"id":"6174986182","type":"user-reviews","attributes":{"rating":1,"title":"absolutely horrendous","review":"i🥵climed🧭out🥫of👋my🔒head🤯and⛸watched⏰myself👈implode💥a👅thought💭without ❌a⚠️body💤 oughta🎤be🐝the🏎 shot🔫","isEdited":false,"userName":"pakdikfodkekkdkdkdjsoslpskxjx","date":"2020-07-09T04:03:13Z"}},{"id":"6174983641","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE APP","review":"HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP HORRIBLE APP","isEdited":false,"userName":"Sade Clarke","date":"2020-07-09T04:02:24Z"}}]}