{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=43310","data":[{"id":"6177267681","type":"user-reviews","attributes":{"userName":"tylerjospehstaco","title":"bad","isEdited":false,"rating":1,"review":"when you download this app they ask you to put in personal information, and they sell it off to the chinese government!!!!!! i love president Trump, but i cant believe he’d ever do this!!!!!!","date":"2020-07-09T15:59:31Z"}},{"id":"6177264278","type":"user-reviews","attributes":{"userName":"Zachzdr","title":"ew","isEdited":false,"rating":1,"review":"this app took about four hours to download (after failing twice). i then opened it and put in info and it crashed and threw me out and my phone shut down. i don’t know if they got my info, but i assume so since i began to get a series of spam phone calls and emails all with viruses. this app is a virus and needs to be eradicated. thanks❤️ you tried! don’t do it ever again✨🧚‍♀️⚡️","date":"2020-07-09T15:58:31Z"}},{"id":"6177260576","type":"user-reviews","attributes":{"userName":"31888888888","title":"Terrible","isEdited":false,"rating":1,"review":"The functionality of this app was so bad that my goldfish killed itself. His name was Pablo and we’re having his funeral today. Never downloading this app again it’s that bad.","date":"2020-07-09T15:57:25Z"}},{"id":"6177258021","type":"user-reviews","attributes":{"userName":"LUCIFER2020666,666","title":"MAKES MY PHONE LAGGY","isEdited":false,"rating":1,"review":"i downloaded this app to support trump and the keep in with everything but IT MAKES ME PHONE LAGGGY IT MAKES MY CALLS CRASH it’s horrible please fix this or delete it I’m just scared I got a virus or something but it’s horrible","date":"2020-07-09T15:56:38Z"}},{"id":"6177253260","type":"user-reviews","attributes":{"userName":"BtsDynasty","title":"Whack","isEdited":false,"rating":1,"review":"I opened the app and literally got slapped in the knee. Like something was funny. It abused me, like I have bruises all over my elbow because it hit me upside the head with a bowling pin. Definitely wouldn’t recommend.","date":"2020-07-09T15:55:14Z"}},{"id":"6177250151","type":"user-reviews","attributes":{"userName":"mab2902","title":"This orange guy is crazy","isEdited":false,"rating":1,"review":"I downloaded this app to see what the president had to say, but instead of President Obama I kept getting information about some racist Oompa Loompa and his plans to destroy the world like some cartoon villain.","date":"2020-07-09T15:54:18Z"}},{"id":"6177236471","type":"user-reviews","attributes":{"userName":"Mjsjhfjxjc","title":"slowest and worst app out there","isEdited":false,"rating":1,"review":"this app it so slow and I couldn’t even try and open the app without my phone crashing. what a waste of time","date":"2020-07-09T15:50:23Z"}},{"id":"6177248391","type":"user-reviews","attributes":{"userName":"Kassssssssssssssssssssssssss","title":"My experience","isEdited":false,"rating":3,"review":"As soon as I opened the app I saw this old racist man all over the place.","date":"2020-07-09T15:53:48Z"}},{"id":"6177232798","type":"user-reviews","attributes":{"userName":"nowords235","title":"really bad","isEdited":false,"rating":1,"review":"bad app for the worst president, isn’t it funny how that works? seriously the app is just bad, OBJECTIVELY bad, took ages to download and has the worst operating system ever. it’s just really cheap. don’t waste your time.","date":"2020-07-09T15:49:16Z"}},{"id":"6177232692","type":"user-reviews","attributes":{"userName":"JordanZG","title":"Invades privacy","isEdited":false,"rating":1,"review":"Downloaded to learn policy info but cannot continue without providing personal info. This is unacceptable considering he wants suppress our 1st amendment by banning other apps. His life is an absolute joke.","date":"2020-07-09T15:49:14Z"}}]}