{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=82720","data":[{"id":"6176647803","type":"user-reviews","attributes":{"userName":"hiwiywiy","date":"2020-07-09T13:11:44Z","isEdited":false,"rating":1,"title":"just NOOO","review":"would give 0 stars if could."}},{"id":"6176627939","type":"user-reviews","attributes":{"userName":"braydenad","date":"2020-07-09T13:06:29Z","isEdited":false,"rating":1,"title":"This app should be banned🧚","review":"Cheeto man can buzz off and let us keep tiktok❤️"}},{"id":"6176618276","type":"user-reviews","attributes":{"userName":"nick gilbrook","date":"2020-07-09T13:03:54Z","isEdited":false,"rating":1,"title":"Aye bruh tik tok on top","review":"You ain banning tik tok this is our word to you we are getting this app down"}},{"id":"6176591043","type":"user-reviews","attributes":{"userName":"123now4eber","date":"2020-07-09T12:56:28Z","isEdited":false,"rating":1,"title":"Terrible terrible terrible!","review":"So unhelpful! No good info! I am sure this is a fake app!"}},{"id":"6176589873","type":"user-reviews","attributes":{"userName":"ttalliia","date":"2020-07-09T12:56:09Z","isEdited":false,"rating":1,"title":"Nice App","review":"Really great app but unfortunately contains some drawbacks that some people may find unacceptable. Basically when you’re signing up it asks for your phone number which then proceeds to send you some spam messages, which isn’t too bad I guess. The second thing is the app insists that you sign a statement proclaiming your unbreakable love for your president and how he is your absolutist ruler. I don’t really know what absolutist means but I’m sure its not a big deal. Anyway, I decided I didn’t really want the app anymore so I deleted it. The next day, 20 heavily armed secret service agents intruded into my bedroom while I was watching Steven Spielberg’s academy award winning masterpiece, Shrek 2. Anywho, 10 agents came directly through my door while the others smashed through my windows while dangling from ropes attached to two helicopters. Not a huge problem, but I was upset they interrupted my movie. They demanded to know why I delete this app and I told them it was taking up space on my phone that I needed to get Beat Blade. I asked them nicely if they could keep it down since my dog was sleeping and they proceeded to punch me in the face. I was dragged out of my bed and all 20 held me down, telling me I had committed a war crime. It was chill though. The one guy who punched me seemed nice. I’m writing this in some sort of dank dark room somewhere. I think the guard who brought me rice said something about Somalia? Who knows. My cellmate hasn’t moved in a few days. We made a TikTok though.I don’t think they know I smuggled my phone down here. Moral of the story is maybe don’t download this app. If you do, don’t delete it. :)"}},{"id":"6176536554","type":"user-reviews","attributes":{"userName":"iz anjos","date":"2020-07-09T12:41:35Z","isEdited":false,"rating":1,"title":"do not download!","review":"i had the worst experience using this app & even worse experience living in a country w this man for president! get him out of office now."}},{"id":"6176521580","type":"user-reviews","attributes":{"userName":"Meghan4215","date":"2020-07-09T12:37:32Z","isEdited":false,"rating":1,"title":"Terrible App","review":"Terrible president, terrible app, Let’s not make America Great Again"}},{"id":"6176488176","type":"user-reviews","attributes":{"userName":"sava151","date":"2020-07-09T12:28:20Z","isEdited":false,"rating":1,"title":"Trump","review":"This is the worst app ever, you should never get this app"}},{"id":"6176434030","type":"user-reviews","attributes":{"userName":"kaira makayla white","date":"2020-07-09T12:13:29Z","isEdited":false,"rating":1,"title":"Who cares about trump","review":"I hate trump he is the worst president in history"}},{"id":"6176422952","type":"user-reviews","attributes":{"userName":"alaynaa✨","date":"2020-07-09T12:10:28Z","isEdited":false,"rating":1,"title":"WORST APP EVER","review":"this app stole all of my information, made my phone combust, and killed my cat."}}]}