{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38100","data":[{"id":"6172806843","type":"user-reviews","attributes":{"review":"This app causes so many glitches on my phones it’s insane. I try to do anything and it never works, I finally had to delete this app because it was just so horrible","date":"2020-07-08T16:02:35Z","isEdited":false,"title":"I hate this app","rating":1,"userName":"Abagail123004"}},{"id":"6172806450","type":"user-reviews","attributes":{"review":"This app is actually TERRIBLE!. Not only did it take literal ages to download but the contents within it aren’t even good or worth the download. This was a complete waste of my phones space and my time. DONT DOWNLOAD THIS APP","date":"2020-07-08T16:02:28Z","isEdited":false,"title":"I would give it 0 stars if I could.","rating":1,"userName":"unlnown29"}},{"id":"6172802771","type":"user-reviews","attributes":{"review":"Hi his is by far the worst I mean worst app on this planet I tried to be positive but the only thing I came up with is that it’s free I can’t believe this app is a thing I wold rather have a stroke die come back in a coma wake up and be a vegetable then lay eyes on this unholy app","date":"2020-07-08T16:01:25Z","isEdited":false,"title":"How cold you","rating":1,"userName":"penis man 69 420"}},{"id":"6172792460","type":"user-reviews","attributes":{"review":"This app took forever to install and when it finally did it kept crashing !!! It made my phone over heat and burned my fingers ! This app is so toxic that even my phone is sending me signs not to open it. DO NOT DOWNLOAD !!","date":"2020-07-08T15:58:25Z","isEdited":false,"title":"So bad !","rating":1,"userName":"Severely confused player"}},{"id":"6172784378","type":"user-reviews","attributes":{"review":"i was ok with app, i really was until i opened it! when i opened the app it started saying some poem. after it said the poem 10 times a million bugs came to my house, i hate bugs! it also kidnapped my daughter, so i am using her phone to type this! i am digested! i was a republican but now i am a democrat! i will be telling jennifer and susan everything! and when i got my daughter back they lit fireworks in my house!~karen","date":"2020-07-08T15:56:06Z","isEdited":false,"title":"terrible!","rating":1,"userName":"KateMeadows08"}},{"id":"6172743387","type":"user-reviews","attributes":{"review":"When I downloaded the app it took almost three weeks and 17 tries to load it. I prayed to the orange god himself to let me see his amazing app. Sadly after this terrible experience I will not be using it","date":"2020-07-08T15:44:23Z","isEdited":false,"title":"Weird glitches","rating":1,"userName":"gen Z ✨🧚"}},{"id":"6172738098","type":"user-reviews","attributes":{"review":"This app is one of the worst run apps i have ever come across. I went on and almost simultaneously my grandma had a stroke. A day later i went on again and my dog jumped off a cliff. This app is cursed along with the entire Trump administration. BAN THIS APP FROM AMERICA!","date":"2020-07-08T15:42:53Z","isEdited":false,"title":"Absolutely disgusting","rating":1,"userName":"big______papi"}},{"id":"6172736167","type":"user-reviews","attributes":{"review":"this app not only made me like trump less, but it wasn’t well put tougher(not like I went past the 3rd screen). this app was not good overall and 10/10 don’t recommend!","date":"2020-07-08T15:42:19Z","isEdited":false,"title":"trump, this is not it","rating":1,"userName":"Juleshenry101"}},{"id":"6172723215","type":"user-reviews","attributes":{"review":"The app took several hours to download and when it did it hacked my phone yook my identity social security credit cards passwords and Texts please don’t download this app or it WILL destroy your phone!!!!","date":"2020-07-08T15:38:38Z","isEdited":false,"title":"Almost killed my phone!!!!!","rating":1,"userName":"BBBBelen"}},{"id":"6172701667","type":"user-reviews","attributes":{"review":"This app took like 40 hours to download and usually it takes my apps about 30 seconds to download this app also shows pornography it’s just disgusting to see.","date":"2020-07-08T15:32:30Z","isEdited":false,"title":"This is the worst app ever!","rating":1,"userName":"That one two in one guy"}}]}