{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=136150","data":[{"id":"6180441567","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:30:52Z","review":"Whenever I sign up for notifications they don’t stop and I can’t focus on my tik tok dances so either tell the president he’s f*ing up or delete this app ... we will cause destruction ✊🏻✊🏼✊🏾✊🏽✊🏿","userName":"awe.xd","title":"Keeps Spamming me"}},{"id":"6180439946","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:30:23Z","review":"this is the worst app","userName":"jaiahrbjsjs17","title":"horrible app"}},{"id":"6180436764","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:29:27Z","review":"Bee Movie Script\n  \nAccording to all known laws\nof aviation,\n\nthere is no way a bee\nshould be able to fly.\n\nIts wings are too small to get\nits fat little body off the ground.\n  \nThe bee, of course, flies anyway\n  \nbecause bees don't care\nwhat humans think is impossible.\n  \nYellow, black. Yellow, black.\nYellow, black. Yellow, black.\n\nOoh, black and yellow!\nLet's shake it up a little.\n\nBarry! Breakfast is ready!\n\nOoming!\n  \nHang on a second.\n\nHello?\n  \n- Barry?\n- Adam?\n\n- Oan you believe this is happening?\n- I can't. I'll pick you up.\n\nLooking sharp.\n  \nUse the stairs. Your father\npaid good money for those.\n  \nSorry. I'm excited.\n  \nHere's the graduate.\nWe're very proud of you, son.\n  \nA perfect report card, all B's.\n\nVery proud.\n  \nMa! I got a thing going here.\n\n- You got lint on your fuzz.\n- Ow! That's me!\n\n- Wave to us! We'll be in row 118,000.\n- Bye!\n\nBarry, I told you,\nstop flying in the house!\n\n- Hey, Adam.\n- Hey, Barry.\n\n- Is that fuzz gel?\n- A little. Special day, graduation.\n\nNever thought I'd make it.\n  \nThree days grade school,\nthree days high school.\n  \nThose were awkward.\n\nThree days college. I'm glad I took\na day and hitchhiked around the hive.\n  \nYou did come back different.\n  \n- Hi, Barry.\n- Artie, growing a mustache? Looks good.\n\n- Hear about Frankie?\n- Yeah.\n- You going to the funeral?\n- No, I'm not going.\n\nEverybody knows,\nsting someone, you die.","userName":"Arasjeuh","title":"Trump fy"}},{"id":"6180436418","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:29:19Z","review":"App literally is a waste clearly doesn’t work and deserves to be under 1star (true rating 0stars)","userName":"deathbringer125678","title":"Trash"}},{"id":"6180435996","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:29:10Z","review":"it’s bad. unfortunately i can’t go any lower than 1 star.","userName":"id0nTliKetH!s@pp","title":"bad"}},{"id":"6180435882","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:29:09Z","review":"I got this app to support our wonderful great leader. After taking almost 45 minutes to download I had to use my personal information to be able to see what was going one with the annoying orange in the White House. It’s almost like they are taking our information to spy on us but whatever, I completed the sign up (which included a request for my ssn which was optional and a citizenship test which was not) and the process took so long. I’ve sat here for 6 hours recanting my love for the trumps and mike pence and I’ve finally made it into the app. Or so I thought. The app crashed on me! And don’t save any of my progress!! When I reopened it displayed a message saying that the error was caused by me not giving correct information and that officials were headed to my location to ask me some questions. I was like, how do the officials know my location? Turns out that the app uses location services to track you, even when you’re not using the app!! That’s why I had to plug my phone in to charge during the first 15 minutes of my citizenship test. It drains so much battery so quickly, and didn’t even ask if I wanted to use location services. So, now in addition to all the questions that I had to answer in my first attempt to open the app, it now knows my exact location at all times. Well, I think I’ve had just about enough of it. Who are these officials questioning my citizenship status??? When are they coming??? Do I have time to cook up some of my world famous medium rare chicken tendies for them??? We want answers, Mr. Trump. I will be deleting this app and hopefully I was not hacked or my information harvested for some tracking purpose. \nAlso, I keep getting emails and text asking for donations for the Trump campaign. I thought he was a business man, why can he not fund his re-election himself if he’s so rich? Hasn’t he had enough tax breaks or something? Why does he need more money from Americans if he has so much? Isn’t he rich? Let’s see them tax returns Donnie. I wanna see em. Give em to me. And stop spamming my email and phone. You seem desperate. And it’s actually spam, gmail has it listed as spam, it’s in my junk folder where it belongs and I can’t get rid of it. It’s like Mike Pence is slithering his little snake tongue into my ear to ask for $42. What is so special about $42? Why is $42 the automatic amount they ask for? I do not understand; I do not comprehend. You’re not the 42nd president. Why do you need $42 of my money? You’re so rich. Right? Right??\nAnyway, I’m off to go pitch my support for the other racist I guess see y’all later xoxo gossip girl","userName":"Sen. Lindsey Graham","title":"I think my info was stolen?"}},{"id":"6180432935","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:28:12Z","review":"Delete TikTok, you know what’s gonna happen, get rid of our so we get rid of yours","userName":"martinricelambott","title":"Delete this app"}},{"id":"6180432456","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:28:05Z","review":"far scs","userName":"Pierce_122","title":"a a ava day"}},{"id":"6180431893","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:27:54Z","review":"1) This app is really annoying and frustrating to work with, ever since I got the app it makes my phone glitch and brings me back to home page when I try to enter the app, also when I use my other apps the same thing happens. My phone has been getting really hot lately because of the app and I know this because I went to the “phone store” and got it checked, turns out this app itself brings viruses 🦠 and ruins everything. Good thing I got rid of the app before it could do any more damage, I suggest you do the same.","userName":"abchhljhdvh","title":"Worst App on my phone"}},{"id":"6180431722","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T10:27:50Z","review":"i want this app deleted off of here pleaseeeee he is a racist homophobic piece of trash","userName":"Ashley The Butthole","title":"delete this app"}}]}