{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=128450","data":[{"id":"6176905834","type":"user-reviews","attributes":{"review":"i’m literally so scared omg. so i opened the app and the first thing i saw was a cheeto puff with a fist. it was terrifying. for the past two days i have been crying, and my night terrors have been consistent. every night, i see an orange with bad posture walking around my room saying racist and sexist slurs... i’m so scared. -10000/5 stars. i’m so scared every day🤭😱🍊👁👄👁🍊🙀😤😫","isEdited":false,"date":"2020-07-09T14:19:41Z","userName":"teagancynthia17","title":"😭😰🍊","rating":1}},{"id":"6176905146","type":"user-reviews","attributes":{"review":"I wanted to download this app so I could keep an eye on Donald Trump news as well as things his administration was doing. But immediately upon opening the app it forced me to enter a mobile phone number, so that I would get notifications about his rally’s, polls, and things like that. I did not want to put my phone number in, but the app used a code verification number so there is no escaping it. Within the first minute I realized this app is no good, do not download.","isEdited":false,"date":"2020-07-09T14:19:30Z","userName":"1028746472","title":"This app is too pushy","rating":1}},{"id":"6176903273","type":"user-reviews","attributes":{"review":"ᗷᕼᑌᗴᔕᒍYᗴᔕ 🤷sometimes✨i🙁don't😢wanna😱be😼happy🧚don't✋hold😇it🤪against😈me🙆","isEdited":false,"date":"2020-07-09T14:19:00Z","userName":"bdhdkendbfj","title":"no ❤️","rating":1}},{"id":"6176900692","type":"user-reviews","attributes":{"review":"poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop  poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop poop","isEdited":false,"date":"2020-07-09T14:18:18Z","userName":"Onbdghvv","title":"poop","rating":1}},{"id":"6176900251","type":"user-reviews","attributes":{"review":"-10/10. this app took 525,600 weeks to download, and when it did, it crashed my phone, computer, ipad, android, nintendo ds and wii mario kart. when i finally got it open, all i saw was a cheeto man being racist, homophobic and sexist. i exited immediately to play subway surfers.","isEdited":false,"date":"2020-07-09T14:18:11Z","userName":"Gab?!!'m36881!","title":"🌸💫🧚‍♀️","rating":1}},{"id":"6176899701","type":"user-reviews","attributes":{"review":"Downloaded this in hopes to learn more about the trump admin and what he wants to do for america, all I found was a cheeto all over the app. It also turned my iphone into the quality of an android with how much it crashes and closes. I hope this gets patched in the new update. 😡😡😡 #notcool","isEdited":false,"date":"2020-07-09T14:18:03Z","userName":"Phuc Depoleece","title":"False Advertisement","rating":1}},{"id":"6176899134","type":"user-reviews","attributes":{"review":"This app is the equivalent of eating dog poop","isEdited":false,"date":"2020-07-09T14:17:54Z","userName":"173748z","title":"🤢","rating":1}},{"id":"6176897743","type":"user-reviews","attributes":{"review":"Hello, I was so happy to get this app so i can get more educated on how to make america “great again” and how to stand with my great and wonderful 🍊orange 🍊 president ☺️ but it took several weeks to download and i was starting to get mad and it finally downloaded,, so i go into the app and it says to put in my phone number which.. is no problem BUT when i put in my phone number it told me to put in the verification code BUT I NEVER GOT THE CODE!1!!1!1 🤬🤬🤬 i am so mad and frustrated by our presidents coding system the fact that i cant get ✨educated ✨ is making me furious!!!!!!!! And it was so hard to navigate to see whats on my screen but there so much text!!!! I do not and will never recommend this app,, i used to support the trump2020 (on a grave) but now i dont know how to feel about it its gotten me mad i have no idea what to do so if our president would fix the app that would be great bur i do not think he will because he does not care about his citizens satisfaction because i WAS NOT SATISFIED AT ALL!!!!!! . I hope this orange thing gets thrown 6 feet under. I love my president tho 🌚🌝 anyway WORST APP EVER DO NOT DOWNLOAD!!!!!","isEdited":false,"date":"2020-07-09T14:17:33Z","userName":"Hxppy Costumer","title":"Worst app ever!!! 🤬😡","rating":1}},{"id":"6176897581","type":"user-reviews","attributes":{"review":"Don’t delete tik tok stoopid","isEdited":false,"date":"2020-07-09T14:17:31Z","userName":"Cooperniner","title":"Donald Trump is a stinky butt","rating":1}},{"id":"6176896896","type":"user-reviews","attributes":{"review":"This app is more stinky than my poop without a doubt💩","isEdited":false,"date":"2020-07-09T14:17:20Z","userName":"SeaMonkee","title":"No point!!!","rating":1}}]}