{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=14750","data":[{"id":"6178574271","type":"user-reviews","attributes":{"review":"This app had terrible effects on my phone. I really had high expectations considering it was made by the “president of the United States” but all the news updates and notifications I received were racist, homophobic, and misogynistic. Not quite sure why they haven’t fixed or addressed this virus/defect on the app yet. Would not recommend.","isEdited":false,"rating":1,"userName":"summertimegirlygirl","date":"2020-07-09T23:13:28Z","title":"Unfortunately zero stars isn’t an option"}},{"id":"6178535440","type":"user-reviews","attributes":{"review":"This took sooo long to download and it wasn’t even worth it! There was very little information regarding trumps campaign. Texting the phone number didn’t even work. Frankly I think this app is fake and isn’t official. Who makes an app that takes over two days to download?? Absolutely recked my phone and storage space and sent me spam emails. So many spam emails. Just no.❤️","isEdited":false,"rating":1,"userName":"______•______","date":"2020-07-09T22:58:20Z","title":"No.❤️"}},{"id":"6178460357","type":"user-reviews","attributes":{"review":"i downloaded this app to see trumps election plans and what he has in store, hoping to see anything good but there was nothing. the app took ab 32 hours to download. when it finally completely downloaded, it crashed. i tried to reset it and it was blank. after a couple days i didnt see anything i liked on the app. DO NOT waste your time on this app🤦‍♀️","isEdited":false,"rating":1,"userName":"alexisperiodhope","date":"2020-07-09T22:28:29Z","title":"i do not recommend this app."}},{"id":"6178459425","type":"user-reviews","attributes":{"review":"This app caused me phone to crash down and now my phone is growing legs and arms and talking back to me. What is up with this attitude? Also, this app asked for my number. FIRST OF ALL I HAVE A HUSBAND. I am so in shock on how bad this app is that I don’t even know what to say. Ever since I have downloaded the app my brain has shrunk to the size of Donald trump supporter. Deescostin. Now my dogs are singing the for💞in💞her💞 and I am truly disappointed.","isEdited":false,"rating":1,"userName":"Mr.CheesyCheese","date":"2020-07-09T22:28:06Z","title":"I am disturbed."}},{"id":"6178459392","type":"user-reviews","attributes":{"review":"So like I was trying to download this app but it took 5 weeks so my cat had a new phone and it was just so good. When I looked to see if my mom called me back I was in the bathroom so I didn’t answer. My neck snapped so she took me to the vet and they did an eye exam and I had 2020 vision. Then we got iced coffee but she cut my hair then ate it. I was so confused cause I just got it done but I guess she was thirsty. I don’t recommend this app to anyone🪔","isEdited":false,"rating":1,"userName":"alyaoqhab gatlwbweer","date":"2020-07-09T22:28:05Z","title":"DONT VOTE FOR TRUMP!"}},{"id":"6178443377","type":"user-reviews","attributes":{"review":"I am very disappointed in Mr. annoying orange’s app. It took over a week to download. It slowed my phone down and I couldn’t even use my phone properly! I wish there was a one star option because i would give it that! It also hacked my Alexa! She wouldn’t stop playing Foreigner by pop smoke, even though i thought the orange didn’t like foreigners!","isEdited":false,"rating":1,"userName":"thatperson999","date":"2020-07-09T22:21:49Z","title":"One of the WORST apps I have ever came across. 😠"}},{"id":"6178399022","type":"user-reviews","attributes":{"review":"this app was not helpful what so ever in informing me about trumps 2020 campaign and it was very poorly designed. this app is so unhelpful that personally i think it should be removed from the app store. this app also put a virus on my phone and it kept on crashing over and over and it glitched my whole phone. it took forever to download too. everything about this app is DANGEROUS and HARMFUL to your phone.","isEdited":false,"rating":1,"userName":"amaya cruz","date":"2020-07-09T22:04:37Z","title":"not helpful AND DANGEROUS"}},{"id":"6178388690","type":"user-reviews","attributes":{"review":"So I just wanted to preface and say how much of a horrible time I’ve had with this app in the past 1 hour I’ve had it downloaded. There are SO MANY issues and bugs that make it so terrible it shouldn’t even be considered an app but a poorly designed application. I highly recommend to NOT download this app as it took a whole 2 DAYS as well to even download on my phone.","isEdited":false,"rating":1,"userName":"Anonymous173849294","date":"2020-07-09T22:00:40Z","title":"Horrible App"}},{"id":"6178375806","type":"user-reviews","attributes":{"review":"This is the worst app I have ever had downloaded onto my phone. It took over two weeks to download and all I am trying to do is support my country. This app after it has finally been downloaded has literally caused me to go mentally insane. I went to the doctors for it and they blamed the app. I do not recommend this horrible app and it must be removed.","isEdited":false,"rating":1,"userName":"fonorama","date":"2020-07-09T21:55:43Z","title":"Horrible, terrible, disgusting 😡🤮🤢😈"}},{"id":"6178354181","type":"user-reviews","attributes":{"review":"Please read all before judging. Being a supporter to download this app of course... I had downloaded this app to support the money hungry goblin dictator we all know and love. I thought I would be able to volunteer at one of his projected 1 million attendees rally! But sadly the app did not let me sign up because I am too pigmented. I thankfully did reserve my tickets to his next rally, but I might have to water my fish.","isEdited":false,"rating":1,"userName":"Nog13596","date":"2020-07-09T21:47:23Z","title":"I Support Trump!"}}]}