{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=47350","data":[{"id":"6174295513","type":"user-reviews","attributes":{"title":"0 stars.","isEdited":false,"rating":1,"review":"i H A T E this app. \n\nI downloaded because my friend Olives Mattur recommended it to me. \n\nher aunt wyte preval ijghe told her about it and said this app was top notch.\n\n I trusted her, and downloaded it only to be extremely dissatisfied and disappointed. I opened it to find a known racist, misogynistic, homophobic, rapist, just sitting there on my screen. \n\nI think he goes by bunker boy? \nIt is disgusting, and not a good rep. Anyways, stream “be happy” by dixie damelio.","userName":"Proe Lyfe","date":"2020-07-09T00:36:09Z"}},{"id":"6174294961","type":"user-reviews","attributes":{"title":"would leave a no star review if I could","isEdited":false,"rating":1,"review":"Apple needs to delete this app asap. spreads false information and promotes violence, xenophobia, misogyny, racism, and homophobia among many other things.","userName":"lanamarie3457","date":"2020-07-09T00:35:56Z"}},{"id":"6174283119","type":"user-reviews","attributes":{"title":"Worst app ever","isEdited":false,"rating":1,"review":"Upon opening the app I was greeted by a sweaty Cheeto. I don’t know how this Cheeto was not removed by factory quality control. This makes me seriously question whoever is in charge of removing defective products.","userName":"I could not pick one.","date":"2020-07-09T00:32:03Z"}},{"id":"6174282615","type":"user-reviews","attributes":{"title":"WORSE APP TO EXIST","isEdited":false,"rating":1,"review":"I downloaded the app for news on trump 💙and as soon as I opened it, It completely made my eyes hurt and felt as if I was losing brain cells. I don’t know who the orange guy is but he is definitely not it.","userName":"TRUMP AND EPSTEIN","date":"2020-07-09T00:31:53Z"}},{"id":"6174279772","type":"user-reviews","attributes":{"title":"🤮","isEdited":false,"rating":1,"review":"As soon as you open the app you really just wanna gouge out your eyeballs. He’s disgusting and so is this app. If you’re for trump then you’re for everything wrong in this world. Wake tf up.","userName":"Trumps a rapist","date":"2020-07-09T00:30:54Z"}},{"id":"6174273851","type":"user-reviews","attributes":{"title":"AWFUL","isEdited":false,"rating":1,"review":"first of all the app doesn't work. the technical component of it is awful. secondly, the app is extremely biased and does not provide accurate information. ABSOLUTELY AWFUL.","userName":"fuzzling","date":"2020-07-09T00:28:48Z"}},{"id":"6174270987","type":"user-reviews","attributes":{"title":"Very bad!","isEdited":false,"rating":1,"review":"I downloaded this app and it was very terrible it steals credit card information and all gives your phone viruses","userName":"tany222","date":"2020-07-09T00:27:49Z"}},{"id":"6174270918","type":"user-reviews","attributes":{"title":"Horrible","isEdited":false,"rating":1,"review":"Please spare your time don’t get. It never worked for me and it was so slow even though my WiFi was fine.","userName":"anonymous2.030000","date":"2020-07-09T00:27:47Z"}},{"id":"6174261787","type":"user-reviews","attributes":{"title":"Hospital checkkkk","isEdited":false,"rating":1,"review":"When I first opened the app I cried and I needed to bleach my eyes and now I’m sitting in my hospital bed 😌 and I opens the app one more time when my brother was here and he cried to he’s in the hospital bed next to me","userName":"i love love balls","date":"2020-07-09T00:24:31Z"}},{"id":"6174253262","type":"user-reviews","attributes":{"title":"horrific","isEdited":false,"rating":1,"review":"this app is all too terrible... I saw a cheeto dressed in a suit and tie with a very awful toupee. not to mention the fact that this app is very disturbing and not something for anyone to see no matter the age.","userName":"muke67","date":"2020-07-09T00:21:35Z"}}]}