{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29470","data":[{"id":"6174980771","type":"user-reviews","attributes":{"title":"THIS APP MADE ME GO TO THE ER","rating":1,"userName":"squidneysquidson","date":"2020-07-09T04:01:31Z","isEdited":false,"review":"I was minding my own business when suddenly this app appeared on my cellular device. IT SHOCKED ME TO MY CORE!!! This app surprised me because I could not believe that such an ignorant and hateful man could have such a large platform. The shock that I felt made me have a heart attack and I had to go to the ER. I almost died!!! DO NOT RECOMMEND!!!!!!!"}},{"id":"6174940272","type":"user-reviews","attributes":{"title":"Don’t download","rating":1,"userName":"ahahahhdnrb","date":"2020-07-09T03:48:47Z","isEdited":false,"review":"This is the worst app it made my phone glitch so much.  I still continued it being in my phone not think that the app is causing my phone such mess. My phone won’t turn on so I had to go to the apple store and they said the app caused a virus"}},{"id":"6174931802","type":"user-reviews","attributes":{"title":"🤷🏻‍♀️","rating":1,"userName":"Mall.m","date":"2020-07-09T03:46:11Z","isEdited":false,"review":"Look, man... I really wanted to love this app, but with the glitches and bugs, I just couldn’t. Not to mention that this app took way too much space on my phone. Space that I needed for better apps like Tik Tok, Plants VS Zombies, the Weather App, and literally anything else. Sorry🥺✌🏼"}},{"id":"6174926486","type":"user-reviews","attributes":{"title":"This is terrible don’t get it","rating":1,"userName":"niyah😘","date":"2020-07-09T03:44:32Z","isEdited":false,"review":"As soon as I got this app it started glitching my whole on my device and I started seeing more racist things and getting calls from\nRacist people and getting spams from trumps texting thing then I realized trump was a orange racist rapist and deleted the app"}},{"id":"6174920611","type":"user-reviews","attributes":{"title":"Boring and useless","rating":1,"userName":"Calijaytone","date":"2020-07-09T03:42:46Z","isEdited":false,"review":"I’m all for trump but this app is the worst app I’ve ever used. Like, BIGLY bad! Huuuuge mistake downloading it! The UX design feels, old. Almost colonial. I feel like I don’t like color as much when it’s open. And I took an IQ test and scored unusually low. I’m deleting it at once! Thanks for nothing. Again!"}},{"id":"6174920288","type":"user-reviews","attributes":{"title":"Ew","rating":1,"userName":"taco fettucini","date":"2020-07-09T03:42:40Z","isEdited":false,"review":"I thought this app was going to set the bar so high , but i was utterly disappointed. I wish i could give zero stars to something because one star is a STRETCH. this app is tacky and useless and deserves to be removed. Not only that, Trump is a horrible person and should not be allowed to have an app. H.A.G.S"}},{"id":"6174919716","type":"user-reviews","attributes":{"title":"What even is this.","rating":1,"userName":"Noelle1254","date":"2020-07-09T03:42:31Z","isEdited":false,"review":"Seriously this app has to be the absolute worst. They say they update it regularly but it stays the same and doesn’t even work. Resources aren’t helpful and sound like gibberish. My 7 month old can speak better."}},{"id":"6174918478","type":"user-reviews","attributes":{"title":"I can’t believe this app","rating":1,"userName":"Crunchy PB&J sandwich","date":"2020-07-09T03:42:09Z","isEdited":false,"review":"I was so exited to get the app representing the best tweeter ever but then I got the app and every time I open it it calls me names and then turns everything on my phone blue. The glitches are ridiculous which is so sad because I aspire to tweet like trump himself smh my head"}},{"id":"6174905466","type":"user-reviews","attributes":{"title":"Terrible for iphones","rating":1,"userName":"itkennn","date":"2020-07-09T03:38:15Z","isEdited":false,"review":"This app has been glitching for a lot of my friends? I downloaded and immediately had issues with my phone shutting off and was disappointed that I won’t get to navigate the Trump app): don’t download this one guys! It’s no good"}},{"id":"6174901118","type":"user-reviews","attributes":{"title":"WORST APP IVE EVER DOWNLOADED","rating":1,"userName":"TrumpAppRuinedMyGrandmasPhone","date":"2020-07-09T03:36:57Z","isEdited":false,"review":"I cannot believe that apple would disrespect its consumers by allowing such a terrible app on their platform. The news is inaccurate and offensive. And it made my phone crash twice. My grandma got it and it crashed every electronic she had! I wish I could rate lower then 1 Star. I am appalled."}}]}