{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22060","data":[{"id":"6175165685","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This is the worst app ever!!!!!!!!! super vile!!!","review":"I was scrolling through this app looking at what my lovely president has to say and then suddenly I started getting spammed with pictures of WRINKLY ORANGE FEET. that was absolutely disgusting! it even downloaded some onto my phone!! I immediately deleted but I can never delete those images from my memory. PLEASE DON'T DOWNLOAD!!","userName":"glitterbug2078","date":"2020-07-09T05:01:07Z"}},{"id":"6175154234","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Delete this App - THE WORST","review":"WORST app!!! Why would Apple allow such a terrible app to be represented in their platform????\nAfter weeks of it taking to download and then it constantly crashing while I was trying to make a profile I had enough.  This app is as effective as the Administration, a lot of lies, glitches and meltdowns.","userName":"Ev8621","date":"2020-07-09T04:57:11Z"}},{"id":"6175135257","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Completely terrible app. Just terrible. Greatly wrong.","review":"I downloaded this app to see updates from our President. But once I downloaded it my phone shut off completely and never turned back on. A terrible bug must’ve been put into my phone, like fascism. I expected more from this. DEFINITELY NOT MAKING TECHNOLOGY GREAT AGAIN WITH THIS CRAP APP.","userName":"fascismwhoxxx","date":"2020-07-09T04:50:47Z"}},{"id":"6175117338","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Button to work?","review":"I’m sorry I didn’t wanna was the day I was going to go to get through this morning and I have to go to get through this week and I have to go to get through this early morning I have a lot to say to my dad I don’t want you guys going on a day like you want me and you don’t have any good friends.","userName":"Fricken Buttons","date":"2020-07-09T04:44:51Z"}},{"id":"6175116397","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Please Stay Away","review":"I downloaded this to keep track of our president because i understand that our media may not always give the people the truth. But this app was not the answer. Instead i was met with bugs and malware that damaged my phone. For that reason I will no longer be supporting the campaign. DO NOT DOWNLOAD THIS APP!!!","userName":"michaell10009","date":"2020-07-09T04:44:34Z"}},{"id":"6175078681","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"do not recommend","review":"i thought i was the only one having troubles with the glitching and the lag but i’m not, it not only does that but when you finally get to the first page you find yourself looking at a cheeto puff and on top of that it goes ahead and asks for you number which personally makes me uncomfortable as i do not want my number given to a pervert, it also gives false information about our so called “president”, i don’t and will never recommend this app to anyone as it is just a waste of space on your phone.","userName":"screwcheetopuff","date":"2020-07-09T04:32:23Z"}},{"id":"6175067618","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"GAVE ME A VIRUS","review":"Worst app I’ve ever had. I downloaded to see what the fuss was about and my entire phone started to get a bunch of Obama pop up ads. It was insane. I was watching Hamilton and my phone started to buzz like a fly and I threw it out of the window because it started to make Obama pop ups on my computer and tv. Don’t download it trumpie poo😚🥰","userName":"Trumpies bby mama","date":"2020-07-09T04:28:56Z"}},{"id":"6175021152","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Worst app ever","review":"When I opened the app it kept showing lil huddy making nessa day the n word instead of kissing him but the the Oompa Loopas ran in the White House and took back there king but then Trump said “go back slaves” then my bf disappeared out of my room and when I looked out my window he was being whipped for not eating watermelon. That what kinda of app does this","userName":"genZ for presidents;)","date":"2020-07-09T04:14:22Z"}},{"id":"6174982690","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"WORST APP","review":"So this app takes your house and McDonald away I was waking home from the store with my mask of course and then my house was gone there was the orange left and then I got McDonald and a new jirrafe but it was gone my McDonald was getting cold and I didn’t get to get home or eat my food bye tik tok lifes mattter \n\n Heart ❤️been broke 💔so many times⏱ I don’t 🤷🏽‍♀️know what believe","userName":"wanna c mycoochies","date":"2020-07-09T04:02:08Z"}},{"id":"6174954532","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"i cant believe i wasted space.","review":"this app completely trashed my phone i went to go let my windows out for a walk to dry in the sun and come back from my moon walk and my phone was completely broke. I had to buy a whole new iphone just to write this review. I am so angry and so are my windows! Don’t get this app AT ALL.","userName":"Miapankake21","date":"2020-07-09T03:53:12Z"}}]}