{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=15380","data":[{"id":"6177163802","type":"user-reviews","attributes":{"review":"this app is the worst app ever.😡 it took two weeks to download onto my phone. right when I opened up the app I saw the scary looking orange man that looks like he had Cheeto dust all on him🍊. then after a few days I looked in the mirror and I started to become 🍊 orange🍊. just like the big ugly Cheeto man. this app hacked all of my data. It also broke my phone. Do not get this app. It is the worst thing ever.\n Much love from GEN Z❤️","date":"2020-07-09T15:29:37Z","userName":"FNAF Iover over here","rating":1,"isEdited":false,"title":"✨HORRIBLE APP✨"}},{"id":"6177138450","type":"user-reviews","attributes":{"review":"When I tried to download this app it took forever and a day to fully download have that when I downloaded it it glitched and my thing got a bug and so I had to go get bug spray from the story and spray my tablet with it so my bug would go away on my tablet but that didn’t work so now I have a huge bug and my tablet and I can barely see what I am typing on my tablet. In all I HATE THIS APP!!!!","date":"2020-07-09T15:22:34Z","userName":"Ashlnyl","rating":1,"isEdited":false,"title":"I HATE THIS APP"}},{"id":"6177038097","type":"user-reviews","attributes":{"review":"Trump is one of the most unconstitutional people I think I’ve ever seen.\nHe’s sending police forces to hurt the citizens of America so he can feel safe. The only reason we have the police is so they can protect the citizens from harm.\nAs there job, they are supposed to protect the citizens before they protect the president.\nSomeone so unconstitutional shouldn’t have an app that helps him lie about stuff and get more stupid followers.","date":"2020-07-09T14:54:56Z","userName":"Whsper","rating":1,"isEdited":false,"title":"Unconstitutional"}},{"id":"6177008318","type":"user-reviews","attributes":{"review":"I downloaded the app with high hopes of seeing what the President was up to but once I launched the app it kept crashing. In some instances it even made my phone laggy and I suspect there’s something wrong with the software of the app itself. If you’re looking for a news outlet The New York Times and the Washington Post provide much better information without destroying my phone.","date":"2020-07-09T14:46:54Z","userName":"annonymous742","rating":1,"isEdited":false,"title":"Not Worth It"}},{"id":"6176881925","type":"user-reviews","attributes":{"review":"Jeez this app is one of the most unstable things I’ve ever downloaded. You think that with the President making so much money and being such a successful business man that he’d be able to release something with a much higher standard of quality. This thing would crash 9/10 times I opened it and it’s honestly really disheartening to see such a mess.","date":"2020-07-09T14:13:22Z","userName":"Automobe","rating":1,"isEdited":false,"title":"Buggy as all hell"}},{"id":"6176674790","type":"user-reviews","attributes":{"review":"Literally can’t even begin to explain how horrible this app is. From the minute i downloaded it my entire phone froze. i couldn’t open anything, had to completely reboot my phone and manually delete it by connecting to a computer. i think this app is a bug!!! definitely designed to hack people, please delete it off the app store immediately!!! this is dangerous!!!!","date":"2020-07-09T13:18:49Z","userName":"very sad :((((","rating":1,"isEdited":false,"title":"WORST APP EVER"}},{"id":"6176646642","type":"user-reviews","attributes":{"review":"DO NOT DOWNLOAD THIS APP! first of all, it took 69 hours to download, which was the first red flag😡. second, as soon as I opened it up it glitched and my house blew up!!! the trump administration owes me a new house!! i also sustained major injuries, and thank goodness i have healthcare🤩, or i would have been buried in hundreds of thousands of dollars of debt. of course I will do anything to support my mysogonisic, homophobic, racist president, but this app can go shrivel in a hole✨🧚💕😌.","date":"2020-07-09T13:11:24Z","userName":"trumpie lumpy 123 🦋🦋🦋","rating":1,"isEdited":false,"title":"no❤️"}},{"id":"6176557777","type":"user-reviews","attributes":{"review":"This took a very long time to download. Three and a half days, specifically. I then started to get a lot of bugs on my phone and it kept randomly shutting off. I may need a new phone unless this one can get fixed. 0/10, very disappointed from a trump supporting view. Thank you for taking the time to read this message.","date":"2020-07-09T12:47:28Z","userName":"PokèmonLoverSarah","rating":1,"isEdited":false,"title":"0/10 do not recommend"}},{"id":"6176485461","type":"user-reviews","attributes":{"review":"This app took an incredibly long time to download and caused my phone to overheat to the point where I could barely hold it. After waiting several days to download I opened the app and it cared my battery to drain completely. It also accessed all of my personal information (credit cards, contacts, photos, etc) WITHOUT MY PERMISSION. THIS NEEDS TO BE REMOVED BEFORE IT CAUSES PHONES TO BE DESTROYED AND PERSONAL INFORMATION TO BE SPREAD!","date":"2020-07-09T12:27:35Z","userName":"Fatponylover11","rating":1,"isEdited":false,"title":"Nearly set my phone on fire 🔥🔥🔥"}},{"id":"6176316035","type":"user-reviews","attributes":{"review":"The app is spamming me with so many notifications, I was distracted and my son almost got hit by a car! Also, some orange monster thing is plastered all over the pages. As if the situation couldn’t get any worse, it took forever to download, and is taking up all of my data! Also, I know they have spies listening in on all my conversations. Not okay. Is this really making America great?","date":"2020-07-09T11:40:29Z","userName":"Doo doo da doo","rating":1,"isEdited":false,"title":"DO NOT DOWNLOAD"}}]}