{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38150","data":[{"id":"6147298199","type":"user-reviews","attributes":{"title":"IT TURNED ME ORANGE!!!","userName":"RooFaceWorld","rating":1,"date":"2020-07-02T07:16:50Z","isEdited":false,"review":"Omg as soon as i clicked on the app my skin instantly turned orange like the photo that appeared on my screen of the orange man. it also asked me for my PHONE NUMBER!!! EXCUSE ME?!!! is this how he gets the kids??? unbelievable, worst app i’ve ever downloaded 10/10 would NOT recommend."}},{"id":"6146510486","type":"user-reviews","attributes":{"title":"Disappointing","userName":"Jaznjill","rating":1,"date":"2020-07-02T02:20:41Z","isEdited":false,"review":"I downloaded this app because i wanted to show support for our dictator. But i was very disappointed to find out i had to be of a certain age to worship the orange dictator. Would not recommend. Worship Obama instead"}},{"id":"6145715244","type":"user-reviews","attributes":{"title":"This app was a waste of time!!","userName":"im_racist","rating":1,"date":"2020-07-01T21:02:05Z","isEdited":false,"review":"I would never recommend this app to fellow trump supporters! Trump needs to step his game up and just delete this app. Unbelievable and just so disappointing 🤢 if I could give it 0 stars I would!! Jesus Christ have mercy"}},{"id":"6141361706","type":"user-reviews","attributes":{"title":"DONT DOWNLOAD!!","userName":"my cat is possessed","rating":1,"date":"2020-06-30T20:39:08Z","isEdited":false,"review":"As soon as i opened the app trumps face popped up, locked eyes with my cat and possessed him. Then MY CAT STARTED TALKING. He told me he was spreading the message for trump and started yelling racial slurs and nonsense about white power. I would never recommend this app for the safety of your beloved pets and family."}},{"id":"6138070572","type":"user-reviews","attributes":{"title":"If I could rate it .5 I would","userName":"Leedre","rating":1,"date":"2020-06-30T02:10:03Z","isEdited":false,"review":"It has way too many glitches and as soon as I downloaded my phone starting overheating from all of the notifications. Do not download this app!!"}},{"id":"6138028571","type":"user-reviews","attributes":{"title":"dont trust him!!","userName":"kaidencex","rating":1,"date":"2020-06-30T01:53:44Z","isEdited":false,"review":"I downloaded this app to support our beautiful and amazing president but when I got it all of a sudden I was downloading this thing and I got a computer virus. THEN MY PANTS SLIPPED OFF!! My mom tried to come in but i told her i deleted the virus!! This is crazy I cant support trump!! DONT DOWNLOAD THIS APP!!"}},{"id":"6137906333","type":"user-reviews","attributes":{"title":"don’t download.","userName":"donnyissohot","rating":1,"date":"2020-06-30T01:08:11Z","isEdited":false,"review":"i thought this app would be a way to get to know good ol man donny better but i was wrong. as soon as i downloaded it i began getting spam calls from an unknown number and weird knocks at my door. i immediately assumed it was donny and waited eagerly for his marriage proposal except it never happened!!!!!! instead i got hacked through this app and now i can only cry about the lost love of my life. donny if ur reading this ily take my hand in marriage"}},{"id":"6136995121","type":"user-reviews","attributes":{"title":"worst app ever 🤮","userName":"hgafhmnnb","rating":1,"date":"2020-06-29T18:57:50Z","isEdited":false,"review":"you see before I got the app I saw all of the bad reviews but I figured it was just those gen z kids pulling a dumb prank but my as soon as I opened the app my husband went into labor!!! Thanks Trump now i have 30 children🙄"}},{"id":"6136468093","type":"user-reviews","attributes":{"title":"SO BAD","userName":"jess68265_ee","rating":1,"date":"2020-06-29T16:00:24Z","isEdited":false,"review":"I downloaded this app because  🧚🏻I totally support trump🧚‍♂️✨. This app has fake news and gave my phone a virus. It is very glitchy and I can’t believe our dear president would encourage us to download this horrible app. I was very disappointed."}},{"id":"6136012076","type":"user-reviews","attributes":{"title":"TRUMP","userName":"Kh0004","rating":1,"date":"2020-06-29T13:45:42Z","isEdited":false,"review":"Donald Trump has never been an elected official. He has never held elected office of any kind. He’s never had to broker political compromise, give political speeches or pour over political briefing notes. So why on earth, with no experience in politics, would people think he’d make a good president?"}}]}