{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=5740","data":[{"id":"6177484889","type":"user-reviews","attributes":{"review":"My friend told me to get this app to support my beautiful president 🥰😍😍😍 but when I downloaded I realized how TRASH this app is. It keeps shutting down and crashing and soon after it does that the app starts whispering death threats in my ear(Ex: “I’m gonna impale you with my big toe”). After 4 consecutive days of this happening I decided I would delete the app because I was starting to lose my mind and hallucinate the president stabbing me with his big toe 😨. Anyways I mean if you want to get this app you can but know that you will never be the same mentally and might need therapy.","rating":1,"date":"2020-07-09T17:02:40Z","title":"Not what I thought","userName":"iwannakmsahahababahah","isEdited":false}},{"id":"6177479779","type":"user-reviews","attributes":{"review":"I downloaded this app hoping to see if Barron Trump would show any more clues of needing saving😌✨ but was very VERY disappointed when I opened the app and was met with a Cheeto ✨✨✨😤 not only was he ugly and had cheese for hair but he also I guess was doing some weird Cheeto magic✨😥✨ because I started having the most freighting dreams about him in my room feeding me Cheetos sensually😥🧚 then when I woke up my whole room looked orange. Now when I eat Cheetos I see his disgusting flakey, orange, fish face. I am traumatized. Please get rid of this horrible, HORRIBLE, horrible app🥰🥰🥰✨💕💕😘💖✨💕🧚🧚 thank you for your time.","rating":1,"date":"2020-07-09T17:01:07Z","title":"✨🧚terrible🧚✨","userName":"😚gen z overpowers all😚","isEdited":false}},{"id":"6177466241","type":"user-reviews","attributes":{"review":"So I downloaded this app to see what Trump was planning for his next election. Such as, what policies will he put in place to protect the American people, especially LGBTQ+, POC, and people with disabilities. BUT!! I couldn’t even get that far!! :((( It took like two days to download, and once it did, I couldn’t even get past the home screen without the whole app crashing and completely crashing my phone as well!! I’d have to wait like 5 -15 seconds to even be able to turn my phone back on!?!?! Absolutely HORRIBLE!! please GET RID OF THIS APP >:(((","rating":1,"date":"2020-07-09T16:57:11Z","title":"Horrible App, Crashes Every Single Time","userName":"Karen Smith :)","isEdited":false}},{"id":"6177457586","type":"user-reviews","attributes":{"review":"I was strolling through the app store and this app looked kinda weird to me so i decided to give it a download. BIGGEST MISTAKE OF MY LIFE! Right when it downloaded my iPhone completely freaked out. The screen kept going black, there was a high pitched noise but i couldn’t turn the sound down, I tried to leave and delete the app but my phone got so hot I couldn’t use it anymore. This app must’ve been maybe by the devil himself. This all being said, the only good thing about this app is that I am writing this review off of my new iPhone 11.","rating":1,"date":"2020-07-09T16:54:37Z","title":"Horrible Quality—Not here from Tik Tok🙂","userName":"DEZI1605060000","isEdited":false}},{"id":"6177447673","type":"user-reviews","attributes":{"review":"download this app to support my Oompa Loompa king. But when I downloaded it I was ambushed with pictures of his little turtle *wink wink*. I felt very uncomfortable and very unsafe and feared for my mental health and well being. Then things got worse my skin started changing colors and my hair started to look like a worm on my head. I started turning into him. Very scary. But the worse part was when little trump babies started crawling around my house screaming TRUMP 2020. It was very very terrifying. I have to go to counseling twice a week for my ptsd. Trump has scared me for life. And I don’t think I’ll ever fully recover","rating":1,"date":"2020-07-09T16:51:35Z","title":"🤬🤬🤬","userName":"karrington hogan","isEdited":false}},{"id":"6177293999","type":"user-reviews","attributes":{"review":"please do not get this app ! after i learned about how the trump administration is not homophobic, racist, etc. I wanted to support my orange president in everything that he’s ever done. when i opened the app, i was shocked that they would ask such personal information like my phone number and i immediately had to shut it down !! then, DONALD TRUMP the ACTUAL PRESIDENT OF THE UNITED STATES began hitting me up on my phone number and asking me for explicit pictures !! although i was contemplating making a little bank on the side, i realized that this is actually unacceptable. then i deleted the app.","rating":1,"date":"2020-07-09T16:07:04Z","title":"DO NOT GET AT ALL 💖🧚‍♀️✨","userName":"tiktok-saviorr","isEdited":false}},{"id":"6177176852","type":"user-reviews","attributes":{"review":"the app starting SPEACKING racist, sexiest, and just mean comments. i was all\nabout supporting our rapist- i mean ✨o r a n g e  president✨ sorry stupid autocorrect. then it made a loud noise, so loud i fell off my roof and broke my ribs. the medical bill was super expensive. our orange we call president should pay for it. he can stop buying his wife Gucci purses and pay my medical bill. maybe he can get me a car as a gift. i can’t even drive lol. then the stupid app wouldn’t delete. like what type of sorcery is this. y’all need to fix this app pronto! \n\nxoxo, not a orange supporter 💖🥰🦋✨🍊","rating":1,"date":"2020-07-09T15:33:20Z","title":"i will never download this app every again.","userName":"Jeoejrbfkeomwndnfkeoe","isEdited":false}},{"id":"6177044858","type":"user-reviews","attributes":{"review":"so i downloaded the app because i was curious about how it worked and what trump was going to do to save our country and as soon as i scanned my face id the app downloaded and said i wasn't welcome, as i am not a straight white male. it said that if i didn't get everyone i know to vote for trump he would give us all coronavirus. i closed the app and went outside to do yard work and these ninjas all dressed in white with pointy hats said that they would burn me? if i didn't do everything in my power to help trump win the election:/ i am now hanging upside down from the tree writing this review on fire because i refused to help trump win. it's pretty hot here and i'm getting very lightheaded and it's getting very dark. anyway y'all should take this app off the app store because i don't like ninjas and they also store your location even when the app is not on.","rating":1,"date":"2020-07-09T14:56:47Z","title":"scary ninjas dressed in white with pointy hats:(","userName":"behshejwj","isEdited":false}},{"id":"6176644116","type":"user-reviews","attributes":{"review":"T : tremble in the wake of knowing that Gen Z is coming for you and there is no stopping them until they reach total world domination\n\nR : repulsive, honestly that’s what you are. We have been stuck at the mercy of your Cheeto-tan regime for long enough. You clearly don’t seem to care about anyone but yourself and your image. Also, where’s Melania? Is she okay? I feel like we haven’t heard from her.... does she need to be rescued? \n\nU : unqualified, you are IMMENSELY unqualified for the job you applied for. Did you lie on your resume? That must be it because how the hell did you get arguably the most important job in the United States with little to no qualifications??? \n\nM : is for the blatant misogyny that you, your policies, your campaign, and your followers spew on a daily (is it really daily? It’s more like a minute-by-minute status at this point) basis\n\nP : Puh-Lease get a new haircut, the ‘combover’ isn’t fooling anyone","rating":1,"date":"2020-07-09T13:10:45Z","title":"An Ode to Trump","userName":"Rockey Nasty","isEdited":false}},{"id":"6176506691","type":"user-reviews","attributes":{"review":"i just got the app not only did it take HOURS to download and not let me access any other apps while doing so it also gave my cellular device a virus i do believe!!!! i can’t open any other application when i try to it brings me right back to this app it also asked me to put in my credit card number and when i did to put it in the support the best president we’ve had it took all my money from my hard earned pay check i believe this app is run by the democrats to get money off of us and run thier propaganda and fake news","rating":1,"date":"2020-07-09T12:33:25Z","title":"DEMOCATS CONTROL THE AP TOOK ALL MH MONEY","userName":"igotatext","isEdited":false}}]}