{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21640","data":[{"id":"6175588690","type":"user-reviews","attributes":{"review":"When I got this app I was interested and I wanted to read about trump and his political views but now I see that you can’t go two seconds in the app without them asking you for money so he can go golf also it wiped all of my data as soon as I got the app and my phone has many viruses. In conclusion don’t get the app.","rating":1,"title":"Whyyyyyy","date":"2020-07-09T07:42:19Z","userName":"Neenn","isEdited":false}},{"id":"6175588475","type":"user-reviews","attributes":{"review":"This app hacked my phone and sold my data (maybe to the Chinese government who knows) and I am now being blackmailed. Would give it zero stars if I could. This is a security threat and should really be banned from all American phones. The manager of this app is not to be trusted, he has a history of many crimes and mistakes.","rating":1,"title":"Awful App","date":"2020-07-09T07:42:14Z","userName":"Amy*P","isEdited":false}},{"id":"6175585023","type":"user-reviews","attributes":{"review":"So I decided to get this app because I am a conservative trump loving straight cis white male, yeehaw, but when i got on the app there were a bunch of prolife and democratic subliminal messages!!!! fellow conservatives, DO NOT get this app unless you plan to be brainwashed by the liberals!!! THIS APP HACKED MY PHONE AND SUBSCRIBED MY PHONE NUMBER AND EMAIL TO BIDEN’S WEB OF PROPOGANDA. I don’t need that socialist hawdiddy on my phone and in this good christian trump loving house 🤧😤.","rating":1,"title":"Worst App Ever","date":"2020-07-09T07:40:58Z","userName":"Rachel Lahav","isEdited":false}},{"id":"6175579736","type":"user-reviews","attributes":{"review":"This app took 2 weeks to fully download and is glitching worse than i’ve ever seen! Once i even downloaded it i got text messages and emails from the Trump Administration, mind you i hadn’t even given my phone number OR email! This app is a scam! I would rate it 0 to even negative numbers if i could! Again DO NOT DOWN LOAD! ITS A TRAP!!","rating":1,"title":"DO NOT DOWNLOAD!!","date":"2020-07-09T07:38:59Z","userName":"PINK🦄12345678910987654331","isEdited":false}},{"id":"6175570407","type":"user-reviews","attributes":{"review":"Do not get this app! took several days to download and it took all of my private information and wiped my phone clean!!! it’s a scam! it then sent me to try to spend $300 to pay for my terrible service 😡 absolutely useless app do not waste your time and energy on it!!!","rating":1,"title":"Terrible service! don’t waste your time!","date":"2020-07-09T07:35:30Z","userName":"Me4J","isEdited":false}},{"id":"6175567136","type":"user-reviews","attributes":{"review":"I tried to download this but it took 54 years. I literally am 54 now. Yes I was 0 years old when I downloaded it. When I opened it up I immediately uninstalled it because ya know.. ya girl doesn't do trump. 100 bees (save the bees) came to my door and just STUNG ME ALL OVER. I had to go to the ER!!! It was not a pleasurable experience I do not recommend installing this app. smh.","rating":1,"title":"DO NOT DOWNLOAD!!! 🚫🚫","date":"2020-07-09T07:34:20Z","userName":"ya. girl. Anonymous.","isEdited":false}},{"id":"6175544956","type":"user-reviews","attributes":{"review":"Well this app didn’t do much to teach me that cause I already knew but some guy on an app I like told me to leave a review and i’m just a dumb snowdlake liberal who can’t think for herself, probably because ny hormones are just so crazy, so here I am leaving a review. Anyway anyone but Trump would be a better president please vote him out 💕","rating":1,"title":"This app taught me that trump is racist","date":"2020-07-09T07:26:08Z","userName":"685380","isEdited":false}},{"id":"6175540642","type":"user-reviews","attributes":{"review":"This app took 3 months to download.  All I wanted was to get an app for our totally non-homophobic, non-racist, non-transphobic, and non-xenophobic president.  To say the least, it was disappointing.  But I’m all seriousness I really hate Donald Trump and I don’t understand why he needs an app.  Like he’s the president.  Why do you need an app for your merch bruh.  Be making no sense.","rating":1,"title":"Awful!!","date":"2020-07-09T07:24:36Z","userName":"spicy._.cactuss","isEdited":false}},{"id":"6175429134","type":"user-reviews","attributes":{"review":"this app took so much space on my phone and laggeddd it so much. When I opened the app it hacked it!! This app is definitely a scam and just a way to hack into people’s stuff. Now I need to change all my passwords and some how clean my phone from the racist and problematic things this app brought. Like sheesh let me post and continue to support BLM.","rating":1,"title":"TERRIBLE","date":"2020-07-09T06:40:49Z","userName":"Irma9000","isEdited":false}},{"id":"6175363157","type":"user-reviews","attributes":{"review":"This app is completely useless. All I wanted was to follow up on the activities of the orange gorilla in the White House, but this app is nothing but glitch after glitch.  I mean, there’s no other explanation for praising such a degenerate other than this app being buggy and useless. Almost as offensive as the pathetic excuse we have for a president.","rating":1,"title":"Absolute Garbage","date":"2020-07-09T06:15:09Z","userName":"Orange One","isEdited":false}}]}