{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29220","data":[{"id":"6172542936","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"Fcgafvlgcvzcbd","title":"Don’t vote trump","date":"2020-07-08T14:48:08Z","review":"Obama put a no hunt zone in the ocean to prevent an endangered animal from becoming extinct but trump lifted that act and this animal is closer than ever to extinction he has done very little to benefit our country and is racist sexist and homophobic and he spelled genius with a j he’s very dumb that’s just 2 of the many dumb and utterly stupid things he’s done"}},{"id":"6172466075","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"nataliezepeda13","title":"The Worst","date":"2020-07-08T14:26:50Z","review":"This app has bad Quality is not so good. I am not sure that I like this app at all! And some times it glitches and it is vary weird. In my opinion this app is not really for me. To be honest!!! I just don’t like the app in general I am sorry if I am offending anyone but this is my OPINION! \n\nHave a great day!!!✨"}},{"id":"6172459331","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"banana_peel.420","title":"Worst thing I’ve ever downloaded","date":"2020-07-08T14:25:01Z","review":"This app put on horrible music as soon as it got downloaded you couldn’t do anything on your phone unless you were on that app. The music brought all my neighbors to my house and they tried to burn it down"}},{"id":"6172443866","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"💸🎞","title":"this app is horrible!!","date":"2020-07-08T14:20:52Z","review":"So basically i downloaded this app, but its really glitchy and it drained all my battery! I do not recommend getting this app. it is absolutely HORRIBLE! And don't even get me started on who this app is for! he's a off branded frosty flake from Aldy’s that expired 100,000 years ago."}},{"id":"6172437584","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"bee enthusiast","title":"Bee Movie 2007","date":"2020-07-08T14:19:08Z","review":"According to all known laws of aviation, there is no way a bee should be able to fly. It’s wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don’t care what humans think is impossible. Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let’s shake it up a little."}},{"id":"6172398546","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"Phi Mu Cutie","title":"Ew","date":"2020-07-08T14:08:32Z","review":"Super excited to be on the trump train but then I think the app knew I was a raging homo or something because even it turned against me and glitched out my phone and then I woke up and realized that the president doesn’t care about me or my phone or anything so I’m voting third party like a normal person ok byeeeeee"}},{"id":"6172377705","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"ACAB BLM ACAB BLM","title":"Deleting and uninstalling","date":"2020-07-08T14:03:05Z","review":"Worst app ever, I enter the first time I download and it crashed, next thing I see when I open it again and it’s just a Cheeto person spewing false information... then I google who this Cheeto person is and it turns out he’s a PEDOFILE AND A CRIMINAL!! Apple please stop supporting people like him! 😫"}},{"id":"6172337006","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"sophie h j","title":"so disappointing","date":"2020-07-08T13:51:58Z","review":"I was hoping to use this app to link with my fellow trump supporters, but all the app showed me was a bunch of racists 😡. And furthermore, the horrible software was glitching constantly and kept showing this picture of a bright orange Cheeto :/.\n\nTERRIBLE APP-(must be those pesky Mexican immigrants who made it so bad)\n\nAnyways, STAN DONALD GENIUS TRUMP, the most very stable genius. COVEFE!"}},{"id":"6172331686","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"Jtreeforme","title":"As bad as our president","date":"2020-07-08T13:50:32Z","review":"We have been given a president who is willing to sacrifice freedoms for his own well being. Who is willing to sacrifice the American people in order to stay in power and could care less about world issues and racism. This app just proves it all."}},{"id":"6172280252","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"kdisisn","title":"no more trump 👎🏼🤮","date":"2020-07-08T13:36:04Z","review":"theres obviously so much he has done as president and some not all white people fail to realize that TRUMP is the worst kind of people to ever exist and to be named as president. for some reason i guess they must not use their gifted brains with privilege to realize he’s not a GOD he’s a dumb and awful person."}}]}