{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=1770","data":[{"id":"6173961508","type":"user-reviews","attributes":{"title":"horrible Cheeto allergic reaction","userName":"cheeto allergy","rating":1,"review":"I got this app so I express my love for America but the first thing I see when I open it is a GIANT CHEETO which I am ALLERGIC TO. So now I’m having an allergic reaction to this GIANT CHEETO and I had to go to the HOSPITAL and my hospital bills were hundreds of dollars that mr Cheeto man refuses to pay me because it was his orange Cheeto balls that caused me to have this allergic reaction. And NOW I have to wear a minimum of THREE MASKS cause my lungs have been EXPOSED to the CHEETOS that I’m ALLERGIC TO so I’m vulnerable to CORONA now!!!!!! I rightfully blame it all on this horrible horrible app. And that’s just from opening the app once! Can I tell you, the second time I opened the app, I saw a GIANT ORANGE PIG with I’m also ALLERGIC to! So I had to go to the hospital AGAIN for the SECOND TIME due to this app! I should be refunded. I am a VEGETARIAN you should not be displaying pigs like this right on the app! If I keep having allergic reactions I WILL SUE.","isEdited":false,"date":"2020-07-08T22:33:41Z"}},{"id":"6173916330","type":"user-reviews","attributes":{"title":"no❤️","userName":"toots mcfarts","rating":1,"review":"Oof-er Gang x7\nSpent 2 robux on a new chain,\nMinecraft players stay in ya' lane!\nWhy did the guests have to go away,\nshout out to the guests who got\nthrown away! But, you know the\nbacon headers are here to stay!\nOof-er Gang x3.\n\nOof-er Gang x7\nSpent 2 robux on a new chain,\nMinecraft players stay in ya' lane!\nWhy did the guests have to go away,\nshout out to the guests who got\nthrown away! But, you know the\nbacon headers are here to stay!\nOof-er Gang x3.\n\nRobux cost more than your fit, I\nused to buy stuff with tix. (YUH)\nIn Roblox, I'm handsome and rich,\nwithout that \"R0bUx GliTcH.\"\nNone of this stuff is new to me,\nback then I used to be a newbie!\nI'm not like none of these Oders, I\nain't takin' no one to the movies!\nPlease, don't get to upset,\nOoF all day till' the sunset!\nI'm still screamin' \"BRING GUEST\nBACK,\" guest was fly like jetpacks.\nThey try to tag my message, I'll\nfind another way to type that!\n\nOof-er Gang x7\nSpent 2 robux on a new chain,\nMinecraft players stay in ya' lane!\nWhy did the guests have to go away,\nshout out to the guests who got\nthrown away! But, you know the\nbacon headers are here to stay!\nOof-er Gang x3.\n\nOof-er Gang x7\nSpent 2 robux on a new chain,\nMinecraft players stay in ya' lane!\nWhy did the guests have to go away,\nshout out to the guests who got\nthrown away! But, you know the\nbacon headers are here to stay!\nOof-er Gang x3.","isEdited":false,"date":"2020-07-08T22:16:54Z"}},{"id":"6173890393","type":"user-reviews","attributes":{"title":"Just Awful!","userName":"iiSxnflowerii","rating":1,"review":"Today I decided to download this app while I was taking my kids to soccer practice. Once I download the app because I was looking for something fun to do I opened it and I found pictures of nude cord and let me tell you I say I was mortified I was really mortified I had to exit out of the The app immediately oh boy how disappointed my kids would be if they had learned that how to install an app as appropriate as this one. I am a woman of morals and I’ll tell you just destroyed my whole family we need to get this app take it off right now. You won’t believe what happen next when I got home I was going to cook some corn for my kids and I saw there was none in the fridge so I searched and I couldn’t find any so I decided to go take a nap and I saw a naked piece of corn on my bed and that’s how I knew that I would never live same life again.","isEdited":false,"date":"2020-07-08T22:07:26Z"}},{"id":"6173791470","type":"user-reviews","attributes":{"title":"Horrible","userName":"IsolatedWeedLady","rating":1,"review":"This app is horrible! Not only did it take hours upon hours to download, it also ended up killing my phone battery. Now, I can barely go on my phone for a couple minutes before it shuts down. This app also started making my phone sprout weeds, and I’m not about to put weed killer on my phone. The weeds ended up growing so long that I needed to plant my phone in the ground, and then the weeds took over my whole garden! My squashes, tomatoes, lettuce...all of them were gone. I had a funeral for each of the plants as they died. Now, my whole house is covered in the Trump weed, and I can’t get rid of it. Gardeners refuse to touch my house and the surrounding area out of fear that the weed will end up on them and will go to their house. Now I just sit in isolation in my weed-covered house, longing for friends and a sense of belonging. Thanks (no thanks) Trump app!","isEdited":false,"date":"2020-07-08T21:29:51Z"}},{"id":"6173775257","type":"user-reviews","attributes":{"title":"Horrible app","userName":"JUSTICE FOF BREONNA","rating":1,"review":"As I installed it it started getting all my data!!! It was taking photos and pictures!!! And then it asked if it could be used as a p*rnography add!!! I was so disgusted !!! I was trying to close the app it started glitching out my phone !! Making this horrible and terrifying sound!!! It woke up my whole family and it was this ugly guy yelling trump 2020!!! I was terrified I then shut down my phone and once it turned back on all my apps got deleted with my photos!!! And my background changed to trump 2020!! I tried to delete it but it charged me !!!! I don’t even know how it charged me!!! I then closed the app but the same man kept yelling trump 2020!!! The man also started shouting that black lives don’t matter and all lives matter !!! I was terrified I then shut down my phone and payed for it to get deleted !! 1 star I do not recommend!?","isEdited":false,"date":"2020-07-08T21:23:47Z"}},{"id":"6173722273","type":"user-reviews","attributes":{"title":"Terrible app","userName":"c. cuuvuvu u","rating":1,"review":"This is the worst app on the App Store they don’t explain what is going on and the app set up is just terrible it has to many things going on in one section would not get if I was you and also this app would lead me various inappropriate sites and and it would kick me off the app and made my phone glitch very bad and as soon as I downloaded the app the next day roaches started coming into my house telling me that I was a slave and go back to picking Cotten then when we called the cops the only thing they did was threaten to kill me and my African family they then proceed to dance around my house and sing one of cardi b’s devil songs then they keep saying niki wasn’t the queen of rap they then came into my house and ate my hamster and my cat then when that were leaving they set my house on fire and called me and my family the n word","isEdited":false,"date":"2020-07-08T21:04:19Z"}},{"id":"6173616904","type":"user-reviews","attributes":{"title":"no. this should be deleted!","userName":"aaaaaaajjjdg","rating":1,"review":"the app is absolutely disappointing, disturbing, and disgusting. the first thing you see when you open the app is a picture of the president, donald duck, that is sensitive content for children. are you trying to ruin their childhoods? no, ok i didn’t think so. and all the app is about is an extreamly controversial topic. when you open the app and scroll down the words move but the picture stays the same. it hurts my eyes. i believe with all my heart that this app should be removed from the USA and the app store. other countries can see what the government is doing with this app, do it should be named and deleted, unlike tiktok which is a creative way for kids to express themselves. tiktok shouldn’t be banes because there is nothing harmful to our country on the app. trump 2020 💋☺️🤩🦕🧜‍♀️😛🐠🧚‍♂️🧚‍♀️🧚‍♀️but on a gravestone🧚‍♀️💓💅❤️💋🤩🐠😍⭐️😚","isEdited":false,"date":"2020-07-08T20:26:24Z"}},{"id":"6173560764","type":"user-reviews","attributes":{"title":"Absolutely horrible.","userName":"spunadiddle","rating":1,"review":"This app is one of the most disgusting things I’ve ever seen. I can’t believe the apple App Store would let such an ugly model pose for the pictures. My kid was looking through my phone trying to download games to play, then he though this app was a game and he installed it. After this happened he dropped my phone and ran to me screaming “mommy” at the top of his lungs. He the the ugly orange boogie man was in my phone. I went to go see and the horror in our eyes were unreal. I covered my kids eyes and said to go to daddy. When my husband came he was risking his life to touch my phone and not catch anything from such ugly monster. I have to know use my kids iPad which I will be monitoring. This app did not only cost me a new phone but new eyes for my whole family, to unsee, the unseeable. I’d rate this app a 0 start review but I can’t so. -5 stars.","isEdited":false,"date":"2020-07-08T20:06:46Z"}},{"id":"6173537751","type":"user-reviews","attributes":{"title":"wish i could rate it less","userName":"~momma~bear<","rating":1,"review":"this app was just so much garbage. he shared videos of dogs and cats eating ACTUAL garbage. why would he fill his app with this? after weeks he started to send free \"care packages\" to people. THEY WERE FULL OF SKUNKS. no matter what i did everytime i opened the app i would be greeted with so many just store clerks telling me to get out. they didn't even want my business. so many times did i walk into the app and i was told to get out. the app is very unaccepting when you walk into it. you have to keep trying though, eventually they'll start throwing tomatoes at you but at least you're into the app. many times did i come home covered in tomatoes and skunk juice. i was told to stop going to the app because of how gosh dare stinky it was. i mean there was just pure garbage everywhere for weeks. if i could i'd rate it .5 a star.","isEdited":false,"date":"2020-07-08T19:59:03Z"}},{"id":"6173264568","type":"user-reviews","attributes":{"title":"Horrible disgusting man🤢🤮","userName":"🤮🤢🤡🍊","rating":1,"review":"This man is a rude,racist,homophobic,controlling, over tanned losers who wants to be dictator he thinks he can boss people around because he’s the president he literally brainwashed people into voting for him half of the stuff he said he would do for america he didn’t do secondly him being the president what gives him the right to have an app that people can download and listen to stuff that’s probably 100 % not true he wants them to hear all good things about him rather then to hear  the truth how do you know the news on this app  is real like some of the stuff I read on the app was just horrific and all of the things he said I didn’t see on the on the actual news so how do you as people of America Know this man Isn’t just lying to you all about this stuff I suggest you do your Research because this man is a disgusting person","isEdited":false,"date":"2020-07-08T18:26:00Z"}}]}