{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=79550","data":[{"id":"6055917432","type":"user-reviews","attributes":{"userName":"Mrs. Trump (the first one)","review":"I feel all orange and crunchy, I don’t wanna feel like this!","rating":1,"date":"2020-06-09T19:06:13Z","title":"It made me feel like a Cheeto","isEdited":false}},{"id":"6055804894","type":"user-reviews","attributes":{"userName":"Finlock","review":"i couldn’t figure out how to open the app, there was something wrong with the app that made it so i couldn’t open it. how are you supposed to open the app?","rating":1,"date":"2020-06-09T18:24:58Z","title":"bad app","isEdited":false}},{"id":"6055491934","type":"user-reviews","attributes":{"userName":"jasonquack","review":"Happy Pride! Trump is a rat bastard and this app is full of glitches. Black lives matter 🖤","rating":1,"date":"2020-06-09T16:41:31Z","title":"I am not sorry to this man","isEdited":false}},{"id":"6055380396","type":"user-reviews","attributes":{"userName":"MamaMikaC","review":"When opened the app I saw a crusty annoying orange 🤮 save your eyes before its to late!!","rating":1,"date":"2020-06-09T16:06:10Z","title":"SCAM!!!!","isEdited":false}},{"id":"6179156584","type":"user-reviews","attributes":{"userName":"u/phill12321","review":"I’m in the store and I can’t find her.","rating":1,"date":"2020-07-10T02:52:55Z","title":"Where is my mommy ?","isEdited":false}},{"id":"5933537253","type":"user-reviews","attributes":{"userName":"Dah Noob","review":"This is REAL NEWS unlike CNN","rating":5,"date":"2020-05-12T00:03:05Z","title":"TRUMP 2020","isEdited":false}},{"id":"6179150446","type":"user-reviews","attributes":{"userName":"someonewhousuallylikesapps","review":"This is a very poorly built app. Do not recommend.","rating":1,"date":"2020-07-10T02:50:35Z","title":"embarrassing for Donald","isEdited":false}},{"id":"6179138990","type":"user-reviews","attributes":{"userName":"clarehawkinson","review":"i’m a HUUGE trump supporter (i support him the best you might say) so naturally i was very happy to see he had an app! i didn’t possibly think the horrendous reviews could be true, but as others have said the app took forever to download (it took 2 weeks for me). as soon as i opened the app my eyes were bombarded by trumps nudes... i tried to click off of them because my eyes hurt when i have to squint to see minuscule things, but when i tapped the picture my phone glitched. all of my photos were deleted and replaced by disturbing and explicit pictures of our president, and all of my personal information was leaked to our government as well as the chinese government (which is confusing because i thought that was what trump was AGAINST hmm). it took me months to begin to recover from this traumatic experience, but the other day i decided to log back into the app out of love for our president. i was bombarded with recordings of trump saying blatantly racist, sexist, homophobic, and pedophilic things (worse than anything he’s ever said in his speeches!) and records/pictures of him participating in jeffrey epstein’s child sex ring 😢 must be fake news because it’s not like he’s ever said anything racist or sexist or offensive ever before and it’s not like there’s any proof of him being friends w jeff lol. but i feel extremely attacked and unsafe after downloading this app. i am traumatized to say the least and have no idea how such a vile thing could be created 😾😾😾","rating":1,"date":"2020-07-10T02:46:25Z","title":"this app ruined my life 😿","isEdited":false}},{"id":"6179120012","type":"user-reviews","attributes":{"userName":"wewin2020","review":"Constantly begging for money smh","rating":1,"date":"2020-07-10T02:39:19Z","title":"App made me feel exploited","isEdited":false}},{"id":"6179111279","type":"user-reviews","attributes":{"userName":"Sophiederr","review":"as soon as i logged on it crashed! it also has so much racist and homophobic propaganda. AND IT HAS TRUMP’S PORNO!! I’M DISGUSTED","rating":1,"date":"2020-07-10T02:36:09Z","title":"this app is horrible!","isEdited":false}}]}