{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=140250","data":[{"id":"6179526448","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:57Z","rating":1,"isEdited":false,"title":"I do not like this app","userName":"an actual potato","review":"The app has installed malware into my phone! It has given my personal information to the Chinese government!! I have gotten calls every day from China!! It’s a Chinese spy app! Very illegal!! From one trump supporter to another, do not download if you love America!!"}},{"id":"6179526160","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:51Z","rating":1,"isEdited":false,"title":"Trump is gross","userName":"chodballer69","review":"This is a disgusting app ran by and for pedophiles, racists, and rapist"}},{"id":"6179526136","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:50Z","rating":1,"isEdited":false,"title":"WORST APP IN The APPSTORE","userName":"Relish14","review":"Do not waste your time. Awful. Extremely awful app."}},{"id":"6179526055","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:49Z","rating":1,"isEdited":false,"title":"Don’t download","userName":"kylr431","review":"Took forever to download"}},{"id":"6179526048","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:48Z","rating":1,"isEdited":false,"title":"The worst thing ever","userName":"txcfu123","review":"Horrible ✨"}},{"id":"6179525824","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:44Z","rating":1,"isEdited":false,"title":"gross","userName":"gggghbbbbbbb","review":"horrible i’m mad i have to give it 1 star"}},{"id":"6179525785","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:43Z","rating":1,"isEdited":false,"title":"This is disappointing! Led to many innocent hamsters demise!","userName":"Truhomeboi","review":"I was so excited to download this app because I just could not wait to show it to all my friends! I knew it would make me most popular in my friend group :) But I am very disappointed to say after showing it to my friends they told me not to talk to them anymore, and then tried to drown me in a near by lake (but don’t worry my new friend Bertha helped me out!) They also aggressively spanked me with my trump 2020 sign!  Now I only talk to the lunch lady at my school but she has a weird mole so I dont think we will stay friends which makes me very sad but what can I say... maybe this would be a better friendship if I didn't have to be ashamed that I ever downloaded this app. Also after I showed it to my sister she got very mad and decided to pull a mean prank on me by driving me all the way to the pet shop, pretending as though she was going to buy me a hamster. She asked an employee to open the cage with hamsters and then my sister reached in and grabbed fistfuls of hamsters and then began to pop them! The employee let out a scream but then my sister told her what I had done and so the employee began helping her pop the hamsters! It was very sad to watch but then it got worse, they began throwing the mushed hamsters at me while chanting about this awful app. All in all I am very displeased that my birthday ended with no friends besides a lady with a mole and of couse my brand new birthday dress covered in hamster guts! \nXoxo joe mahma\nP.S. I would like to clarify this was not real and no hamsters where harmed today( also I dont have a trump sign cuz ew)"}},{"id":"6179525461","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:36Z","rating":1,"isEdited":false,"title":"bad","userName":"Preeti bhuvan","review":"bad"}},{"id":"6179525412","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:36Z","rating":1,"isEdited":false,"title":"❤️✨Sofia the first✨❤️","userName":"_annie_rowland_sartorius","review":"Before getting this app a friend promised that once I got it I would have Sofia the first’s necklace that lets me talk to animals. And I did!! But the back of the necklace got all twisted up so now it looks like a choker and CANT COME OFF. Now 24/7 I’m listening to animals talk and talk and talk and they aren’t as nice as you’d thought they’d be. Not to mention it picks up even the smallest animal for a 5 mile radius. It’s two days and I’m going crazy. I haven’t slept, I haven’t been able to eat, and I can’t move a muscle in my body from the amount of noise that is surrounding me. The only solution I can think of is cutting off my ears so I won’t be able to hear anymore. I’m taking Van Gogh to another level."}},{"id":"6179525353","type":"user-reviews","attributes":{"date":"2020-07-10T04:59:35Z","rating":1,"isEdited":false,"title":"WORST APP EVER","userName":"Alaina0830","review":"This app destroyed my phone! Within 24 hours after downloading my phone slowed down and could hardly function anymore. My phone would lock on it’s own when I had not touched it and trying to open any app would take at least 2 minutes. I deleted the app after about 36 hours and the issues did not resolve. Finally I reset my phone back to factory settings and now it is almost back to normal. It’s hard to support trump without a working phone! DO NOT DOWNLOAD!!!"}}]}