{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31620","data":[{"id":"6174688272","type":"user-reviews","attributes":{"rating":1,"userName":"MadisonZucco","title":"HORRIBLE APP","review":"This is a worthless app that needs to be deleted right now!!! What kind of lunatic runs on a platform of racism, homophobia, xenophobia, and overall hatred and wind? To then put children in cages and ruin America’s reputation across the world? This man is a rapist and should be in jail!!! 0/10 would recommend","date":"2020-07-09T02:33:27Z","isEdited":false}},{"id":"6174685172","type":"user-reviews","attributes":{"rating":1,"userName":"Krosofire007","title":"Regret.","review":"I wish I could turn back time and tell myself to never download this horrid app. What a waste of 30 seconds. I could’ve watered my tulips in that time. I hope this review helps anyone from having this kind of regret.","date":"2020-07-09T02:32:32Z","isEdited":false}},{"id":"6174681987","type":"user-reviews","attributes":{"rating":1,"userName":"takeawaysecondamendment","title":"Terrible app","review":"I request that this is taken off the App Store immediately. It seems like many others have had the same problems so an update to Trumps running status may be required.","date":"2020-07-09T02:31:36Z","isEdited":false}},{"id":"6174670877","type":"user-reviews","attributes":{"rating":1,"userName":"myisntjeff","title":"This app killed my whole blood line","review":"I downloaded this app and as soon as I opened it my screen went black then dozens of robots labeled “trump 2020” came in my house and killed my family in front of me and made we watch. 1 Star wouldn’t recommend","date":"2020-07-09T02:28:20Z","isEdited":false}},{"id":"6174665847","type":"user-reviews","attributes":{"rating":1,"userName":"Karen Whitmore the 7th","title":"ABSOLUTELY DISGUSTING USE OF MY PHONE STORAGE","review":"Who in their right mind thought this would be a good app, I have children and when they saw what was on this app they were traumatized!!!! I cannot believe that our president would endorse this misuse of technology! I for one am never using this app again!!!!😡😡","date":"2020-07-09T02:26:54Z","isEdited":false}},{"id":"6174662285","type":"user-reviews","attributes":{"rating":1,"userName":"✨traumatized✨","title":"✨traumatized✨","review":"I downloaded this last night because I wanted to see what our orange president was up to and now my phone is glitching every time I open it. I also got a few nightmares about oranges because of it so 0/10 😾","date":"2020-07-09T02:25:53Z","isEdited":false}},{"id":"6174659938","type":"user-reviews","attributes":{"rating":1,"userName":"Sam C :)","title":"🤮","review":"This app was awful. It made my phone start to clitch which wasn’t happening before I downloaded it. When on the app it always took forever to load and then gave me a bunch of horridly false information","date":"2020-07-09T02:25:11Z","isEdited":false}},{"id":"6174656064","type":"user-reviews","attributes":{"rating":1,"userName":"appreviewerdino46","title":"No❤️","review":"This app is horrible, they might as well delete it, as it is a waste of storage space. Unreliable and filled with glitches. Whoever designed this app needs to rethink what they are doing for a living and who they are working for. Don’t download this app.","date":"2020-07-09T02:24:03Z","isEdited":false}},{"id":"6174640119","type":"user-reviews","attributes":{"rating":1,"userName":"repooceiluj","title":"Bad bad app","review":"This app caused all the carrots into to the McDonald’s mascot like who wants a creepy clown carrot not me. Also my pet Dino he was walking on the ceiling and this app made him turn into a cave man. I miss my Dino. And finally this app stole my toe nails my feet are lonely without them. This app should be deleted at this instant. Thank you.","date":"2020-07-09T02:19:31Z","isEdited":false}},{"id":"6174638367","type":"user-reviews","attributes":{"rating":1,"userName":"soebsu10481$","title":"BAD APP","review":"this is an awful app, it glitches so much and says incorrect information. all it does it take up storage and it won’t let me delete it. this app needs to be removed from the apple store so i can get my storage back.","date":"2020-07-09T02:19:01Z","isEdited":false}}]}