{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24460","data":[{"id":"6177182250","type":"user-reviews","attributes":{"userName":"Skdnjfcn","title":"🥰✨🧚It’s a no from me😍😊✨","date":"2020-07-09T15:34:52Z","rating":1,"isEdited":false,"review":"PROLOGUE\nTwo households, both alike in dignity, \nIn fair Verona, where we lay our scene,\nFrom ancient grudge break to new mutiny, Where civil blood makes civil hands unclean. From forth the fatal loins of these two foes\nA pair of star-cross'd lovers take their life,\nWhose misadventured piteous overthrows \nDoth with their death bury their parents'strife.\nThe fearful passage of their death-mark'd love,\nAnd the continuance of their parents' rage,\nWhich, but their children's end, naught could remove, Is now the two hours' traffic of our stage.\nThe which if you with patient ears attend,\nWhat here shall miss, our toil shall strive to mend."}},{"id":"6177173787","type":"user-reviews","attributes":{"userName":"ch4ssidy133","title":"Terrible App Not Worth Getting","date":"2020-07-09T15:32:28Z","rating":1,"isEdited":false,"review":"App crashes. takes too long to download, dont respect the things and spam on this app. horrible app wasted my time and many others. this app is senseless and waste of phone storage and space. if I could rate no stars I would. worst app ever. Never again"}},{"id":"6177113359","type":"user-reviews","attributes":{"userName":"Randi Kit","title":"Absolutely Horrid!","date":"2020-07-09T15:15:41Z","rating":1,"isEdited":false,"review":"When I first opened the app, it asked for my phone number? Not only is that an invasion of privacy but I do NOT feel comfortable with the President, a married man, having access to my personal phone number. It’s disgusting and wrong. Save yourself some time and do not get this app."}},{"id":"6177147908","type":"user-reviews","attributes":{"userName":"11ama_al3x","title":"Crashing","date":"2020-07-09T15:25:12Z","rating":5,"isEdited":false,"review":"The app keeps on crashing so I can’t do anything."}},{"id":"6177105058","type":"user-reviews","attributes":{"userName":"Barron_Trump🧚😘","title":"Bad App 🤮","date":"2020-07-09T15:13:20Z","rating":1,"isEdited":false,"review":"Ok first off I downloaded the app to get updates on the Cheeto man but when I opened the app I saw the worst thing ever. I was absolutely blinded from it. I lost all my vision and now have to have a seeing eye dog to help me get around. I can’t believe that they would put such a horrid creature on the app. It is really so disgusting."}},{"id":"6177087610","type":"user-reviews","attributes":{"userName":"writerofthisreview123","title":"Crashes","date":"2020-07-09T15:08:31Z","rating":1,"isEdited":false,"review":"Okay so I downloaded this app really thinking that I wanted to check it out ya know. But it’s super glitchy. It freezes up and causes my phone to crash every time I go on it. Not to mention there’s some racist content on there that I wasn’t prepared for. Terrible user experience!"}},{"id":"6177080933","type":"user-reviews","attributes":{"userName":"sydd_jaxx","title":"Disappointed","date":"2020-07-09T15:06:39Z","rating":1,"isEdited":false,"review":"I’m not apart of the younger generation who is trying to take down the app. I was just trying to see what kind of things that our president was saying. It took four hours to download the app and it crashes more than most apps would crash."}},{"id":"6177080003","type":"user-reviews","attributes":{"userName":"a smoll person","title":"Unhelpful information","date":"2020-07-09T15:06:23Z","rating":1,"isEdited":false,"review":"Basically just the news you see if you watch the news no exclusive information or plans for his re-election that aren’t already known very disappointing, also no way to directly state your agreement or disagreements with plans."}},{"id":"6177063375","type":"user-reviews","attributes":{"userName":"effortlyssa","title":"disappointed.","date":"2020-07-09T15:01:50Z","rating":1,"isEdited":false,"review":"i downloaded this app with every intention to support my perfect and black/hispanic supporting president. yes all i got was a terrible app. it works slow, spends was too much money on the military, has a corrupted law enforcement, and only lets white users get add-ons. i was very disappointed by this. please do better.\nSincerely,\na member of Gen-Z"}},{"id":"6177049880","type":"user-reviews","attributes":{"userName":"under6863","title":"Lack of info","date":"2020-07-09T14:58:09Z","rating":1,"isEdited":false,"review":"It is clear that who ever runs this app does not keep up with the content. It takes about 48 hours for the “new” news to be place on the app. By then we have already been made aware from other news outlets. I do not recommend this app."}}]}