{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33270","data":[{"id":"6177087058","type":"user-reviews","attributes":{"title":"Review","date":"2020-07-09T15:08:22Z","isEdited":false,"rating":1,"review":"I got this to see what whats gonna happen during the campaign but every time I logged in it shut my phone of or froze to the point I would have to power off my cellular device.","userName":"daisrayne"}},{"id":"6177086228","type":"user-reviews","attributes":{"title":"Child porn","date":"2020-07-09T15:08:07Z","isEdited":false,"rating":1,"review":"I opened the app and I accidentally found a glitch that gives access to about two gigabytes of child pornography that i would rather not have ever seen! this app is for pedophiles!","userName":"MEEPINATOR OF DOOM💩💩💩"}},{"id":"6177072788","type":"user-reviews","attributes":{"title":"Unusable","date":"2020-07-09T15:04:26Z","isEdited":false,"rating":1,"review":"The interface is difficult to navigate and it freezes far to often and crashes.","userName":"Frayham 262"}},{"id":"6177044388","type":"user-reviews","attributes":{"title":"Jeez","date":"2020-07-09T14:56:39Z","isEdited":false,"rating":1,"review":"This app just makes me sad. Like really sad. I’m sad for all of the people who don’t know better. I’m sad for all of the people who don’t care about others. Please. Have some compassion. This world is too depressing to have a man like this in power.","userName":"gjsjdjwodnwoq"}},{"id":"6177042199","type":"user-reviews","attributes":{"title":"This is terrible","date":"2020-07-09T14:56:04Z","isEdited":false,"rating":1,"review":"I’m just here tryin to download this, but it took a full week to download AND once it got downloaded it kept kicking me out and sending spam messages! WTH is wrong with this app! I do not recommend this it’s the worst app ever","userName":"zim? oh no, just a been"}},{"id":"6177040884","type":"user-reviews","attributes":{"title":"Bad bad","date":"2020-07-09T14:55:42Z","isEdited":false,"rating":1,"review":"This app was one of thee most unsuccessful, unintelligent, unlikable apps I have used in my entire existences. Along with this truth I am also helping Gen Z  out, we have the right to tiktok and WILL NOT, I MEAN WILL NOT, go down without a fight. So suit up fellas you have a hell of a ride ahead of you.","userName":"elroseblondie"}},{"id":"6177037284","type":"user-reviews","attributes":{"title":"Keeps crashing","date":"2020-07-09T14:54:44Z","isEdited":false,"rating":1,"review":"I downloaded this so I could get ready for the election and it keeps crashing every time I open it you’d think the presidential campaign could hire the right people to make an app work","userName":"beth calhoun"}},{"id":"6177035284","type":"user-reviews","attributes":{"title":"HORRIBLE!!","date":"2020-07-09T14:54:11Z","isEdited":false,"rating":1,"review":"This app has made my phone crash and made it very laggy even after closing the app I could only get my phone back to normal after deleting the app I don’t recommend plus why does a glorified Cheeto need an app??","userName":"useless lesbian 69420"}},{"id":"6177013137","type":"user-reviews","attributes":{"title":"THIS IS TERIBLE","date":"2020-07-09T14:48:12Z","isEdited":false,"rating":1,"review":"Okay so it is super glitchy and it doesn’t even work. Like I’m not even joking it is horrible. Never download it. And it takes like 2 hours to download and takes up like 12 Gigibites of storage! Do not recommend it is terrible.","userName":"STARWARWASP"}},{"id":"6177012000","type":"user-reviews","attributes":{"title":"Feed back","date":"2020-07-09T14:47:55Z","isEdited":false,"rating":1,"review":"This app is glitchy and it’s racist  and homophobic and many more It said if your under the age of 15 contact Donald trump for sexually resons then it said all black people are lazy and called the COVID virus the Chinese virus and he said he wanted to kill them off . I strongly degree with this app\n!","userName":"xr.wrld"}}]}