{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36690","data":[{"id":"6173607113","type":"user-reviews","attributes":{"userName":"Marlon Bundo","date":"2020-07-08T20:22:54Z","isEdited":false,"rating":1,"title":"This app is garbage","review":"First of all. The lay out is completely unhelpful, garish, and stupid. \n\nThe rhetoric is horrible. Am I reading an App for the president of the United States or is this Germany circa 1942??? \n\nGive me a break! This app is nothing but uninformative, nationalist propaganda and will waste your time. \n\nIt made my phone crash about 4 out 5 times when trying to open it. This is the worst app I’ve ever tried to use. \n\nI was half expecting it to start spouting racist and homophobic slurs."}},{"id":"6173594857","type":"user-reviews","attributes":{"userName":"aggy .B","date":"2020-07-08T20:18:32Z","isEdited":false,"rating":1,"title":"Bugs","review":"This app is horrible it makes my phone work extremely slow I have to wait 10 minutes for one thing to even load I do t suggest this app to anyone terrible DO NIT DOWNLOAD"}},{"id":"6173594572","type":"user-reviews","attributes":{"userName":"glamglowellarose7","date":"2020-07-08T20:18:26Z","isEdited":false,"rating":1,"title":"Terrible","review":"That’s all I can say it’s terrible...shattered my phone into sharp pieces, got one in my eye, now I’m in the emergency room half blind. Glitches every second and won’t stop showing photos of a strange orange Cheeto in a suit. Would rate 0 if I could."}},{"id":"6173593093","type":"user-reviews","attributes":{"userName":"Adverting-MC","date":"2020-07-08T20:17:55Z","isEdited":false,"rating":1,"title":"Glitchy","review":"When I got this app other applications on my phone were opening on random. It messes. With the WiFi on my computer and the rest of my house if I could rate it lower I would trust me"}},{"id":"6173587370","type":"user-reviews","attributes":{"userName":"uh-oh-206","date":"2020-07-08T20:15:55Z","isEdited":false,"rating":1,"title":"Not my type","review":"The app does its job but terribly the layout is absolute trash, the colors are wack, the overall look and feel is so unusable it hurts my eyes trying my hardest to use it. Just take it down it’s a horrible app."}},{"id":"6173582061","type":"user-reviews","attributes":{"userName":"posttng","date":"2020-07-08T20:14:06Z","isEdited":false,"rating":1,"title":"0/5","review":"This app crashes every 5 minutes on my phone, and the graphics appear to not be loading correctly no matter how many times I restart the app."}},{"id":"6173577281","type":"user-reviews","attributes":{"userName":"lemon leviathan","date":"2020-07-08T20:12:25Z","isEdited":false,"rating":1,"title":"If I could give it 0 stars, I would.","review":"This app crashes my phone so many times. It played a specific ringing that my dog can hear and it killed my precious baby. RIP Bellatrix, you will be mist. The bees heard her die and are now stinging me, don’t get the dona"}},{"id":"6173576858","type":"user-reviews","attributes":{"userName":"rhiannaaa23","date":"2020-07-08T20:12:17Z","isEdited":false,"rating":1,"title":"Terrible","review":"The app kept freezing and made my whole phone freeze. All my apps force and my phone shut down. I had to delete the app so my phone wouldn’t do that again."}},{"id":"6173572356","type":"user-reviews","attributes":{"userName":"weryjvfhbmj","date":"2020-07-08T20:10:42Z","isEdited":false,"rating":1,"title":"Do not download","review":"It made my phone mess and it kept going black every time I try and download some it go black it the screen be gulch and this app delete some of my pictures and some of my app on my phone TAKE THIS APP DOWN"}},{"id":"6173561691","type":"user-reviews","attributes":{"userName":"rayrayxolove","date":"2020-07-08T20:07:05Z","isEdited":false,"rating":1,"title":"most horrible app ever","review":"this app glitches a lot, you can’t really do anything on it.. please DO NOT waste your time trying to download this app it’s honestly NOT worth it. there are way better apps than this piece of garbage.."}}]}