{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=40560","data":[{"id":"6175570477","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE","review":"overall terrible app. took a very long time to download and every time i close the app my phone turns off. im not sure if its a glitch but something if definitely wrong. HATE IT!","isEdited":false,"userName":"eliza anderson","date":"2020-07-09T07:35:31Z"}},{"id":"6175569826","type":"user-reviews","attributes":{"rating":1,"title":"Just the worst","review":"Took FOREVER to install and when it finally downloaded, every time I tried to open the app it would crash. Don’t waist your time. Made me so mad. Fake news 😤","isEdited":false,"userName":"JusticeInThisB","date":"2020-07-09T07:35:17Z"}},{"id":"6175547503","type":"user-reviews","attributes":{"rating":1,"title":"WOSRT APP EVER","review":"It took SUPER long to download and gave me a whole bunch of viruses :((( After that my phone started to get really slow from receiving so much spam that my phone BLEW UP!!! My snake ate my phone. So in conclusion I need a new phone and my snake died 👎","isEdited":false,"userName":"ripchugthesnake","date":"2020-07-09T07:27:04Z"}},{"id":"6175473046","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT DOWNLOAD","review":"it took 8 hours to finally download onto my phone!! when i opened it my front camera got turned on and then i was stalked for days, i was threatened and harassed because of this app.","isEdited":false,"userName":"Treshyio","date":"2020-07-09T06:58:09Z"}},{"id":"6175472549","type":"user-reviews","attributes":{"rating":1,"title":"Worst app in the world","review":"It took so long to load. Also all the information was not correct. It was just a waste of time. Wish I could give it-5 stars sadly I can’t","isEdited":false,"userName":"Gballs2013","date":"2020-07-09T06:57:55Z"}},{"id":"6175447628","type":"user-reviews","attributes":{"rating":1,"title":"Terrible App","review":"When I opened the app Trump reached through the phone and drop kicked me across the room. I had to delete it right away bc he wouldn’t stop. And then he kept taking breaks to go golfing.","isEdited":false,"userName":"for the tik rok","date":"2020-07-09T06:48:01Z"}},{"id":"6175433067","type":"user-reviews","attributes":{"rating":1,"title":"ASSAULT!","review":"Upon downloading this app that took 6 hours, I opened it up only for a digital hand to reach out of my phone and grab me by the p*ssy. Unbelievable. If you’re not a straight white male don’t download this app! You will be assaulted!","isEdited":false,"userName":"cokesbrands","date":"2020-07-09T06:42:21Z"}},{"id":"6175377185","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE","review":"I HIGHLY DO NOT RECOMMEND!! I downloaded this app and suddenly my 13 month old turned orange. I’ve been scrubbing for days now and he just keeps getting more and more orange every day.  Any suggestions will be helpful! 😭😭","isEdited":false,"userName":"OranGe face supporter","date":"2020-07-09T06:20:40Z"}},{"id":"6175336917","type":"user-reviews","attributes":{"rating":1,"title":"I hate this app😡😡😡","review":"Ok so when I opened the app the song foreigner came on and I saw very inappropriate things😫😭😨I felt a presence behind me and saw an Orange with a face behind me and he told me he was gonna deport me and my family😰😰😰HE WAS AN UNDERCOVER ICE PERSON!!!!! Pls don’t download this app😫😫😫","isEdited":false,"userName":"lajdsofneuf","date":"2020-07-09T06:05:00Z"}},{"id":"6175328038","type":"user-reviews","attributes":{"rating":1,"title":"DONT DOWNLOAD THIS APP","review":"I downloaded this app and immediately regretted it. I was walking home from work because it was a beautiful day and I ALMOST GO RAN OVER BY A CAR. BUT I RAN OUT OF THE WAY IN TIME THEN IT STARTED POURING AND LIGHTING ALMOST STRUCK ME BUT I JUMPED OUT OF THE WAY THEN A MAN CAME RUNNING AT ME AND NOW IM ON THE RUN! This app is trying to end me don’t make the same mistake. 😭😭😭😖😖","isEdited":false,"userName":"djfkskckdocodlslwks","date":"2020-07-09T06:02:20Z"}}]}