{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=10040","data":[{"id":"6153682404","type":"user-reviews","attributes":{"userName":"ella boals","title":"do NOT get this app","rating":1,"isEdited":false,"date":"2020-07-03T19:32:53Z","review":"i downloaded this app about three days ago and ever since then there have been strange things happening to me. i have seen doors and cabinets opening by themselves. my garage door also opened up by itself while i was home  . after a couple days i deleted it because the app was actually awful and then these strange things stopped happing. if this has happened to anyone else can you please let me know."}},{"id":"6150053605","type":"user-reviews","attributes":{"userName":"sjebegensbdv","title":"✨Anonymous 2020✨","rating":1,"isEdited":false,"date":"2020-07-02T23:05:17Z","review":"I downloaded this app to support this racist Cheeto puff :) ❤️ but my phone started glitching as soon as I downloaded it. I would not download this. This is the worst app I’ve ever seen TERRIBLE, this is unacceptable. Everyone who supports trump have the worst day of your life ✨❤️ I hope you get run over by a bus :) everyone eles have a beautiful day <3 <3 . And Cheeto puff, Im still waiting for you death ✨n e ways, back to the point this app is terrible don’t download it. Okay bye have a nice day :)"}},{"id":"6148407842","type":"user-reviews","attributes":{"userName":"weneedobamaback❤️","title":"DO NOT GET THIS APP🕺🏼","rating":1,"isEdited":false,"date":"2020-07-02T13:23:56Z","review":"This app gave me multiple viruses on my phone! I do not recommend this app to any Karens or Susans this is just disgusting. I am now getting numerous emails from the president that contain his nudes and multiple texts from this Cheeto🤢. So I WOULD DELETE THIS APP IMMEDIATELY! Anyone who would even think for a SECOND that this app is okay to use...should be very much placed in an insane asylum❤️. I can’t believe apple would create and make and app like this it’s so HORRIFYING I might switch back to a blackberry."}},{"id":"6144624060","type":"user-reviews","attributes":{"userName":"Me no like oranges","title":"HORRIBLE AND TRAUMATIZING EXPERIENCE","rating":1,"isEdited":false,"date":"2020-07-01T15:11:23Z","review":"I got this app hoping I would be able to support the racist orange whom we call president. However when I opened the app, I got teleported to a basket of oranges. All the oranges were in a circle, chanting “all hail our king”. I wandered into the front line to see trump sitting on an orange garbage pile in the center! I could barely make him out due to him looking exactly like all the trash! Then they saw I was a human and cut me up and ate me. I am now dead and wish to press charges. #justiceforanonymous"}},{"id":"6144563149","type":"user-reviews","attributes":{"userName":"iown33snakesandmyhusbandleftme","title":"DO NOT DOWNLOAD!!! VOTE TRUMP OUT!!!","rating":1,"isEdited":false,"date":"2020-07-01T14:55:15Z","review":"this app is horrendous. i downloaded it and hours later my husband came home telling me we must get a divorce. he said that he just couldn’t afford to maintain me and my thirty-three snakes. then, after he left, my bathtub fell through the ceiling and smashed my refrigerator. now i have no food and no husband. as if that’s not bad enough, i opened this app expecting to be impressed, and instead saw a racist old cheeto preaching to his posse of dumb bimbos. 0/5 would not recommend."}},{"id":"6141459090","type":"user-reviews","attributes":{"userName":"AriRosariWOW","title":"Terrible","rating":1,"isEdited":false,"date":"2020-06-30T21:17:41Z","review":"If u download this app to support Trump your sooo stupid and he is racist and a rapist homophobic and has absolutely no idea how to run the country of America this man is so bad I’d rather die than be in this country. I mean he almost started world war three. When president obama obviously was better. This is the worst person ever and he’s a disgrace doesn’t learn fact. I’m not being hateful but trump is bad and has caused the most deaths of black people. Ur terrible trump and I hope ur not president and u made AMERICA DREADFUL."}},{"id":"6140788852","type":"user-reviews","attributes":{"userName":"Nat Not Nate","title":"So very Disappointing","rating":1,"isEdited":false,"date":"2020-06-30T17:20:16Z","review":"This app is disappointing and very uncreative. I was deceived and hope this app gets taken down for how misleading it is. Who ever keeps this app up and gives it 5 stars is clearly blind and most likely would let their kids wear a plastic bag on their heads if Fox News said “trump said it was perfectly safe.” . I hope the people who give this distasteful app 5 stars get out of their harmful and close minded boxes they call a personality. Have a nice day. \n\nSincerely, W. A Miles"}},{"id":"6136868172","type":"user-reviews","attributes":{"userName":"Holo 124388838$","title":"This app was just horrible","rating":1,"isEdited":false,"date":"2020-06-29T18:11:28Z","review":"This app was not accommodated to my needs. The text needs to be much bigger. I wanted to download the app to support my president but upon opening the app I couldn’t believe what I saw. This app is a disgrace. Upon opening the app I was scared half to death by a photo of a large Cheeto puff. I do not recommend under any circumstances that you download this app. I was going to vote for Trump 2020 but after this experience I know that my vote won’t be going to him."}},{"id":"6135627284","type":"user-reviews","attributes":{"userName":"big booty judy 🦧","title":"i hate it here","rating":1,"isEdited":false,"date":"2020-06-29T11:54:21Z","review":"my uncle downloaded this app and every-time he would open this app things began to change. he grew an extra toe , then he began to to lose most of his hair and it started to turn butt-ass blonde. he started to resemble like an orangutan to me. Then his attitude and he said to yell at me “im fake news”. he would lean forward all the time almost fallling. when he would get near the stairs i would be tempted to push him because he was so mean to me. well that’s all folks🤪"}},{"id":"6123165832","type":"user-reviews","attributes":{"userName":"silverx_","title":"listen to the negative reviews.","rating":1,"isEdited":false,"date":"2020-06-26T07:35:55Z","review":"After giving the app my phone number i have started receiving multiple scam calls for the past week, this is one of the few apps i have on my phone. My bank account has also been reported to have had some \"suspicious\" activity causing all my credit cards to be temporarily suspended. Im not saying the two are linked, but this wasn't happening before. Do not trust this app."}}]}