{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29730","data":[{"id":"6172617062","type":"user-reviews","attributes":{"title":"Horrible","review":"Do not download this app, it took 2WEEKS to download and open and then crashed every time I tried opening it after that also it's information and data is incredibly incorrect and fake. Hope this helps!","date":"2020-07-08T15:08:43Z","rating":1,"isEdited":false,"userName":"Sophia G S"}},{"id":"6172615062","type":"user-reviews","attributes":{"title":"oh my goodness🤮","review":"okay let me start by saying that this app is literally awful. the quality of this app is horrendous and it takes forever to load, THEN ALL I CAN SEE IS SOME CHEETO PUFF GUY ON MY SCREEN LIKE WTH😾it is a Complete waste of space both in my phone And in the app store. please do us all the favor and delete this app😀😌❤️","date":"2020-07-08T15:08:10Z","rating":1,"isEdited":false,"userName":"gabyyy😼✨"}},{"id":"6172588382","type":"user-reviews","attributes":{"title":"This app is not worth it","review":"It takes up a tremendous amount of space and makes my phone glitch. It's very sketchy and I had a fear it would hack my phone. I will be deleting and would not recommend to anyone. I do not support this app or anyone associated with it.","date":"2020-07-08T15:00:48Z","rating":1,"isEdited":false,"userName":"Joseph Smithson"}},{"id":"6172567683","type":"user-reviews","attributes":{"title":"vomit app🤢🤮","review":"when I opened this app, I projectile vomited all over my phone. i even I had to get a new phone due to the amount of vomit in my phone! this is no way to make an app. even when I redownloaded it I threw up. 🤮 this app needs to be taken down or people will keep throwing up🤢!","date":"2020-07-08T14:55:03Z","rating":1,"isEdited":false,"userName":"Finnfinn04"}},{"id":"6172565654","type":"user-reviews","attributes":{"title":"Worst app ever","review":"This app absolutely horrible, one of the main reasons being that the first thing you see is a child rapist, racist, and a homophobic person all in one. Why would anyone want to see that :( I do not recommend this app to anyone, save your eyes from the torture.","date":"2020-07-08T14:54:30Z","rating":1,"isEdited":false,"userName":"ray cyst 😼"}},{"id":"6172551699","type":"user-reviews","attributes":{"title":"Horrible App","review":"This app crashes almost every time I open it, as a black one I am offended by the nazi symbols displayed all over the front cover every time the app would open and work. This app sings the national anthem for America but I’m German. Which now I’m not even sure is our national anthem. HORRIBLE APP","date":"2020-07-08T14:50:36Z","rating":1,"isEdited":false,"userName":"Izzyj2018"}},{"id":"6172547181","type":"user-reviews","attributes":{"title":"TERRIBLE APP","review":"When I downloaded this app it was glitching so bad that it would just take me out the app as soon as I tapped it. At the same time it would also play loud annoying music. It woke my mom up, which caused her to fall off her bed, and now she has a coma and is on life support.","date":"2020-07-08T14:49:20Z","rating":1,"isEdited":false,"userName":"laila9baby"}},{"id":"6172533926","type":"user-reviews","attributes":{"title":"Disappointed","review":"I downloaded the app in hopes of getting a better knowledge of our president. When I opened it I was bombarded by ads, asking for money and fake news. It even asked for my phone number! Right off the bat. That’s not what I wanted. Big waste of time.","date":"2020-07-08T14:45:38Z","rating":1,"isEdited":false,"userName":"kellmonster"}},{"id":"6172516890","type":"user-reviews","attributes":{"title":"What a trash aapppppppppp","review":"So slow that gta loading screen already finish  the not wall is not built your also racist stop dieing your hair the virus is still going on we have the most cases then your like we are number 1 now Ebola what are we gunna be number 1 in Ebola to like stopppppppppppp","date":"2020-07-08T14:40:48Z","rating":1,"isEdited":false,"userName":"tiktok is epic"}},{"id":"6172500860","type":"user-reviews","attributes":{"title":"WEDNESDAY","review":"I downloaded this app thinking I was going to re-think my minds about Donal Trump but unfortunately I didn’t and I will not be voting for him after I heard what he has done to young kids he’s disgusting and overall a rapist and he’s a racist I will NOT be looking forward to re-download this app EVER again","date":"2020-07-08T14:36:15Z","rating":1,"isEdited":false,"userName":"juniorburgers"}}]}