{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23330","data":[{"id":"6174007653","type":"user-reviews","attributes":{"isEdited":false,"review":"Honestly I wouldn’t even give this app a star, it takes forever to open and i might’ve got in it for a about a min after talking forever to download...very frustrating! I was just trying to see the app and what was on it, but there’s no point of even using it. \n\n-very dissapointed.","date":"2020-07-08T22:51:09Z","title":"No stars","rating":1,"userName":"Cakemaster32"}},{"id":"6174002319","type":"user-reviews","attributes":{"isEdited":false,"review":"this app is a disgusting, vile, and downright inhumane “news” app. It promotes hatred and racism while allowing young voters to be brainwashed into believing the systematic racism in America is either false, or justified. The moment i opened this app my ceiling fan fell off and started a fire in my house, i am currently outside with the fire department watching my house go up in flames, thanks trump.","date":"2020-07-08T22:49:07Z","title":"cesspool of oppression","rating":1,"userName":"Octavia Collinski"}},{"id":"6173997512","type":"user-reviews","attributes":{"isEdited":false,"review":"I don’t see the point of this app even being a thing, plus nobody even likes trump he just destroying are planet one step at a time, he is the worst president ever to exist and this app is even worse I was greeted with weird pictures and there’s no point of getting this, if I could rate this 0 stars I WOULD","date":"2020-07-08T22:47:20Z","title":"This app is garbage","rating":1,"userName":"all the other name s ar taken"}},{"id":"6173981597","type":"user-reviews","attributes":{"isEdited":false,"review":"It’s honestly a very scary app it’s been a few months now since I opened the app due to me opening the app and getting scared and then shattering my phone. No it’s not bc I dropped my phone  it shattered once I opened the app to a big fat orange ball in the app just seemed to scared my phone as much as I was scared I even broke my leg by getting scared.","date":"2020-07-08T22:41:15Z","title":"🍊","rating":1,"userName":"tasma ✨✨"}},{"id":"6173968763","type":"user-reviews","attributes":{"isEdited":false,"review":"This app is in no way shape or form helpful...AT ALL. If you were considering getting this app, well don’t. It is a waste of your useful storage. All it does is glitch. If you’re gonna make an app make sure it works correctly. But we can’t possibly be surprised considering who this app was made for. Just no❤️.","date":"2020-07-08T22:36:22Z","title":"WORST download ever.","rating":1,"userName":"Maryyyynnnnn"}},{"id":"6173967109","type":"user-reviews","attributes":{"isEdited":false,"review":"As soon as I downloaded this app, a man with a MAGA hat came and broke both of my legs. as I continued to use the app my luck just got worse. The bank took my car and my home. My spouse filed for divorce and took the kids. I have also gained crippling depression in the 24 hours of owning this app. Due to the inconvenience I will no longer be a supporter of Trump.","date":"2020-07-08T22:35:45Z","title":"WORST APP EVER🤢🤮","rating":1,"userName":"Janee Cayla"}},{"id":"6173947916","type":"user-reviews","attributes":{"isEdited":false,"review":"I literally opened this app for the first time and RATS actual RATS bombarded my house like I know the government likes to play tricks but this seems a little far, and the birds and other animals programmed in my live in my neighborhood, yeah they all seemed to disappear when this situation broke out. Oddly suspicious if you ask me. Nonetheless if you don’t want rats wouldn’t suggest.","date":"2020-07-08T22:28:31Z","title":"LITERAL RATS LIKE THE ANIMAL","rating":1,"userName":"tinytim..."}},{"id":"6173944502","type":"user-reviews","attributes":{"isEdited":false,"review":"this horrible orange with a toupee abuses grass. he forces the poor lawn to get hideous haircuts *almost as bad as his* and makes them dye their hair without consent! he also hates lamps, that’s right you hear me lamps. WHAT DID THE POOR LAMPS DO TO YOU!!???? is it because they have some form of common sense unlike you??? aww poor carrot got his feelings hurt😢!!! does someone need to change your diaper!!!","date":"2020-07-08T22:27:16Z","title":"disgrace","rating":1,"userName":"Rohan Humperdink"}},{"id":"6173922072","type":"user-reviews","attributes":{"isEdited":false,"review":"I downloaded the app to try and get all my information in line to vote this year but as soon as I opened it and saw the president with his fist in the air I automatically threw up and had to delete the app. With COVID spreading as much as it is right now the last thing I want to do is compromise my immune system. NO GOOD!!","date":"2020-07-08T22:18:58Z","title":"This app will make you sick","rating":1,"userName":"mes45dump"}},{"id":"6173918826","type":"user-reviews","attributes":{"isEdited":false,"review":"when i first opened the app, there was a picture of  cheeto cuddling with an UNDERAGE female kitten. as a daughter, if my a man ever did that to me i’d call the police. the fact that this picture was on an APP is just unbelievable and sickening. i then scrolled and saw a NAKED CHEETO. i don’t think presidents should post nude photos on reelection apps. this app is HORRIBLE. and i do NOT recommend it at ALL.","date":"2020-07-08T22:17:49Z","title":"this is HORRIBLE.","rating":1,"userName":"hdjdjjdkdkfng"}}]}