{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=4290","data":[{"id":"6175763799","type":"user-reviews","attributes":{"title":"Absolutely the worst.","review":"First of all, the wait for this download was ABSURD. Are you kidding me?? A whole month?? For this app?? No. But that was just the beginning. I thought I was going to be warmly welcomed by a fun and bright community of white supremacy, instead, I got bugs and glitches and endless technological problems. As a woman, i don’t really understand what’s happening or how to fix it, and I unfortunately do not have a big strong man husband to help me! >:(. This app is not operational for not only me, but I don’t think anyone could use it! It stinks worse than the locker rooms where our faithful president himself chats with his friends about his ugly sexual conquests. ❤️","userName":"The Origional Karen","date":"2020-07-09T08:43:31Z","rating":1,"isEdited":false}},{"id":"6175728844","type":"user-reviews","attributes":{"title":"TERRIBLE! DONT DOWNLOAD","review":"I tried to download this app and it took forever!!! I was amazed how slow and INEFFECTIVE this app was at doing its job. It never even tried to do what it promised. It was so weird because i dont even remember downloading it. I had a strange feeling that an outside source put this app in my way. No one ever thought that this app would even be in the app store, nevertheless downloaded onto their phones. Now, everyone I know has to face the consequences of this app being allowed in the store. I believe that it should not have even been to be made into an app, but thats just my opinion. Anyway be warned that this app DOESNT WORK and SHOULD NOT BE DOWNLOADED!!!!!!","userName":"genejidendnck","date":"2020-07-09T08:31:38Z","rating":1,"isEdited":false}},{"id":"6175694714","type":"user-reviews","attributes":{"title":"FAKE NEWS","review":"This app took all day to download, thank heavens fox news had 24/7 coverage on the television to keep me occupied by telling me who to be angry at that day. After I got done kissing my dad on the lips I opened this app and it immediately asked for my phone number and my name. It was OBVIOUSLY the Russians trying to steal my information so they can sell it to the liberal sheep, ya know the ones who believe in modern medicine and dinosaurs. Anyways I can't figure out how to delete this app but I feel like you should apologize to me for my pain and suffering from this terrifying experience because the world owes me for any minor inconvenience and I take zero accountability.","userName":"karen732569","date":"2020-07-09T08:20:00Z","rating":1,"isEdited":false}},{"id":"6175587098","type":"user-reviews","attributes":{"title":"KILLED MY FAMILY😡","review":"I downloaded this app in support of chester the cheeto our loving president🕺❤️ But it took 3 hours to download. I understand its alot if date si I waited. But after i opened the app I was greeted with a glitched screen. I clicked on it and it revealed top secret alien data that has been hidden by the government! After a week all was good no issues, but I hear a knock at my door. I opened the door and it was THE MEN IN BLACK! They came barging in and told me to forgot then promptly shot my family and my dogs. They then hung my dogs on strings like puppets and played with them for hours making a puppet show with the CORPSES OF MY DEAD DOGS! all because I downloaded this app... Im done😡blocked✨","userName":"Spotellis","date":"2020-07-09T07:41:46Z","rating":1,"isEdited":false}},{"id":"6175541553","type":"user-reviews","attributes":{"title":"Absolutely terrible, a disgrace of a app","review":"This app is completely terrible, once opening the app everything seems normal. But soon after photos and and other data will start to disappear of off your device. This app steals data and uses it against you in order for you to vote for trump. The app also throws around racial slurs like its nothing. Even asking you to leave the country if you are from Mexico, and telling you to die if you are black. Lgtbq+ people receive a notification telling you to be straight or you will be given the death penalty. This app should not be on the app store what so ever! Please do not download app.","userName":"Alidicious","date":"2020-07-09T07:24:54Z","rating":1,"isEdited":false}},{"id":"6175445693","type":"user-reviews","attributes":{"title":"DO NOT I REPEAT DO NOT DOWNLOAD","review":"this app is terrible. not only did it ruin my phone battery. but it also wiped my phone. as soon as i opened the app my phone started glitching and the screen turned black multiple times. it then shows the apple turning on screen. once it turns back on everything is gone. all my files, photos, apps. everything. i try to back up my phone from cloud and it tells me my phone isn’t capable . it screwed with the whole software. i called apple there’s nothing they can do. and this app caused all of this. absolutely terrible. this app needs to be removed if its happening more then once","userName":"enchilada23457522","date":"2020-07-09T06:47:14Z","rating":1,"isEdited":false}},{"id":"6175152345","type":"user-reviews","attributes":{"title":"💕☀️Save your storage☺️✨","review":"... I downloaded this app to stay updated on Trumps election campaign. As soon as I downloaded it my phone shut down and it won’t turn back on. I’m currently writing this review from my laptop that now is also experiencing glitches that I have never seen before. Sims is taking twice as long to load than it did before, and it took a long time before, so you can imagine the amount of stress I am under. All of this is from downloading this app. I can not believe that the president would do such a thing!!!! Very very upset with this. Where is the tech team? Now I have to get a new phone🥴🐍","userName":"Bernie Sanders imy","date":"2020-07-09T04:56:31Z","rating":1,"isEdited":false}},{"id":"6174854276","type":"user-reviews","attributes":{"title":"HORRIBLE APP😡😡😡","review":"when i got it i was really excited but as soon as i tried to make an account THE WHOLE APP CRASHED!!!!!!! NO MATTER WHAT I DID IT WOULDN'T WORK. I tried to delete the app and re-download it but when i did that MY IPHONE STARTED TO ACT UP!!!!!! eventually i got the app to work after 4 hours of trying to get it to work. But as soon as i got access, the layout of the app was VERY CONFUSING and just plain  atrocious, get this app if you want to sit there and try to make an account for 4 hours, having the app crash randomly, make your phone act up, and if you want to look at a ugly disgusting layout!!!!! IF I COULD GIVE THIS 0 STARS I WOULD!!!! DONT GET THIS SAVE YOUR PHONE FROM ACTING UP!!!!!!!!!!!","userName":"bill nye lover","date":"2020-07-09T03:23:16Z","rating":1,"isEdited":false}},{"id":"6174853207","type":"user-reviews","attributes":{"title":"HORRIBLE","review":"this app made me fall down the stairs to where i saw a skunk. the skunk sprayed everywhere so i ended up going blind and collapsing onto the freezer to which my hands when completely numb so as i tried driving to the doctor my fingers couldn’t move so i crashed into a stoplight, causing it to go on fire. the people got very mad and start fighting so it started a tornado cuz the universe was mad so not only did this app start a fire, but it created a massive tornado which made everyone fly into the air and then the dinosaurs rose from the dead. they stomped on everyone. they died. so ya i wouldn’t recommend getting this app if you want the human population to go extinct.","userName":"xXMinecraft_LoverXx","date":"2020-07-09T03:22:57Z","rating":1,"isEdited":false}},{"id":"6174818847","type":"user-reviews","attributes":{"title":"BAD APP FAULTY AND RACI-","review":"this app deleted and moved all my other apps to another country it had never been to before. i was shocked and horrified. it glitches and were allowing apps that should’ve been deleted FOUR YEARS AGO to stay for another term. LIKE WHAT? this app glitches so much and gives out so much bad information. like it manipulated my phone to believe the less i check the time, time will never move. or like if i keep downloading apps and the “no more available storage” pops up i can just click out of it and my storage will never be full again. crazy. bad app. it needs to be impeached—i mean defeated in november—i mean deleted.","userName":"Lundy 5","date":"2020-07-09T03:12:52Z","rating":1,"isEdited":false}}]}