{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=132160","data":[{"id":"6174040295","type":"user-reviews","attributes":{"userName":"Purportedswine","rating":1,"isEdited":false,"title":"Nope","date":"2020-07-08T23:03:21Z","review":"Sorry y’all I know the only language you speak are confederate flags and racial slurs. But let me put this plainly. Eat ass and try to care about someone other then yourself. Have a nice day🤗"}},{"id":"6174038587","type":"user-reviews","attributes":{"userName":"cochieslayer","rating":1,"isEdited":false,"title":"BLINDING TO THE EYES NO TRIGGER WARNINGS 🤮🤮🤮🤮🤮🤮🤮","date":"2020-07-08T23:02:42Z","review":"So when I opened the app the first thing was a naked chettttoooo mannnnn likeee eewwwweee.whooweeee I was so damm disgusted gurl bye 🤢🤢🤢and my mom was behind me and she looked at the screen her eyes LETTERLY FELLL OUT HER EYES , her just couldn’t take it. Why DO WEEEEE INOCENT HUMANZZZZZ SUFFER THIS WHAYYYY.EWWWWWWEEWWWEEEEEEE. My mom got stransplants thankfully 😅 but don’t recommend this app I wish there was an option to give it no stars."}},{"id":"6174038218","type":"user-reviews","attributes":{"userName":"shane 🌝 dawson","rating":1,"isEdited":false,"title":"ew 🤢","date":"2020-07-08T23:02:33Z","review":"-r-r-roll💿up⬆️to2️⃣the🤩party🥳with🧶my🧚crazy🤪pink💝wig💇🏼‍♀️"}},{"id":"6174037445","type":"user-reviews","attributes":{"userName":"tatumxcrook","rating":1,"isEdited":false,"title":"no ❤️","date":"2020-07-08T23:02:15Z","review":"this app is horrendous and reeks of racism and pedophilia"}},{"id":"6174037318","type":"user-reviews","attributes":{"userName":"lilythewatcher","rating":1,"isEdited":false,"title":"F**k DONAL TRUMP","date":"2020-07-08T23:02:12Z","review":"Right when I open the app my face started breaking out with all these pimples and I tried getting help from hyram but he said there was no cure. It was skin eating disease. Now I am dieing in my grave bed plz grant my one wish. Don’t let trump take all our faces away."}},{"id":"6174037037","type":"user-reviews","attributes":{"userName":"MdmamkJAJANNKSLDOIXIJDNDJD","rating":1,"isEdited":false,"title":"green eggs and ham by dr.seuss","date":"2020-07-08T23:02:08Z","review":"\"GREEN EGGS AND HAM\" (by Doctor Seuss) \n\nI AM SAM. I AM SAM. SAM I AM.\n\nTHAT SAM-I-AM! THAT SAM-I-AM! I DO NOT LIKE THAT SAM-I-AM!\n\nDO WOULD YOU LIKE GREEN EGGS AND HAM?\n\nI DO NOT LIKE THEM,SAM-I-AM.\nI DO NOT LIKE GREEN EGGS AND HAM.\n\nWOULD YOU LIKE THEM HERE OR THERE?\n\nI WOULD NOT LIKE THEM HERE OR THERE.\nI WOULD NOT LIKE THEM ANYWHERE.\nI DO NOT LIKE GREEN EGGS AND HAM.\nI DO NOT LIKE THEM, SAM-I-AM.\n\nWOULD YOU LIKE THEM IN A HOUSE?\nWOULD YOU LIKE THEN WITH A MOUSE?\n\nI DO NOT LIKE THEM IN A HOUSE.\nI DO NOT LIKE THEM WITH A MOUSE.\nI DO NOT LIKE THEM HERE OR THERE.\nI DO NOT LIKE THEM ANYWHERE.\nI DO NOT LIKE GREEN EGGS AND HAM.\nI DO NOT LIKE THEM, SAM-I-AM.\n\nWOULD YOU EAT THEM IN A BOX?\nWOULD YOU EAT THEM WITH A FOX?\n\nNOT IN A BOX. NOT WITH A FOX.\nNOT IN A HOUSE. NOT WITH A MOUSE.\nI WOULD NOT EAT THEM HERE OR THERE.\nI WOULD NOT EAT THEM ANYWHERE.\nI WOULD NOT EAT GREEN EGGS AND HAM.\nI DO NOT LIKE THEM, SAM-I-AM.\n\nWOULD YOU? COULD YOU? IN A CAR?\nEAT THEM! EAT THEM! HERE THEY ARE.\n\nI WOULD NOT, COULD NOT, IN A CAR.\n\nYOU MAY LIKE THEM. YOU WILL SEE.\nYOU MAY LIKE THEM IN A TREE!\n\nI WOULD NOT, COULD NOT IN A TREE.\nNOT IN A CAR! YOU LET ME BE.\nI DO NOT LIKE THEM IN A BOX.\nI DO NOT LIKE THEM WITH A FOX.\nI DO NOT LIKE THEM IN A HOUSE.\nI DO NOT LIKE THEM WITH A MOUSE.\nI DO NOT LIKE THEM HERE OR THERE.\nI DO NOT LIKE THEM ANYWHERE.\nI DO NOT LIKE GREEN EGGS AND HAM.\nI DO NOT LIKE THEM, SAM-I-AM.\n\nA TRAIN! A TRAIN! A TRAIN! A TRAIN!\nCOULD YOU, WOULD YOU ON A TRAIN?\n\nNOT ON TRAIN! NOT IN A TREE!\nNOT IN A CAR! SAM! LET ME BE!\nI WOULD NOT, COULD NOT, IN A BOX.\nI WOULD NOT, COULD NOT, WITH A FOX.\nI WILL NOT EAT THEM IN A HOUSE.\nI WILL NOT EAT THEM HERE OR THERE.\nI WILL NOT EAT THEM ANYWHERE.\nI DO NOT EAT GREEM EGGS AND HAM.\nI DO NOT LIKE THEM, SAM-I-AM.\n\nSAY! IN THE DARK? HERE IN THE DARK!\nWOULD YOU, COULD YOU, IN THE DARK?\n\nI WOULD NOT, COULD NOT, IN THE DARK.\n\nWOULD YOU COULD YOU IN THE RAIN?\n\nI WOULD NOT, COULD NOT IN THE RAIN.\nNOT IN THE DARK. NOT ON A TRAIN.\nNOT IN A CAR. NOT IN A TREE.\nI DO NOT LIKE THEM, SAM, YOU SEE.\nNOT IN A HOUSE. NOT IN A BOX.\nNOT WITH A MOUSE. NOT WITH A FOX.\nI WILL NOT EAT THEM HERE OR THERE.\nI DO NOT LIKE THEM ANYWHERE!\n\nYOU DO NOT LIKE GREEN EGGS AND HAM?\n\nI DO NOT LIKE THEM, SAM-I-AM.\n\nCOULD YOU, WOULD YOU, WITH A GOAT?\n\nI WOULD NOT, COULD NOT WITH A GOAT!\n\nWOULD YOU, COULD YOU, ON A BOAT?\n\nI COULD NOT, WOULD NOT, ON A BOAT.\nI WILL NOT, WILL NOT, WITH A GOAT.\nI WILL NOT EAT THEM IN THE RAIN.\nNOT IN THE DARK! NOT IN A TREE!\nNOT IN A CAR! YOU LET ME BE!\nI DO NOT LIKE THEM IN A BOX.\nI DO NOT LIKE THEM WITH A FOX.\nI WILL NOT EAT THEM IN A HOUSE.\nI DO NOT LIKE THEM WITH A MOUSE.\nI DO NOT LIKE THEM HERE OR THERE.\nI DO NOT LIKE THEM ANYWHERE!\nI DO NOT LIKE GREEN EGGS AND HAM!\nI DO NOT LIKE THEM, SAM-I-AM.\n\nYOU DO NOT LIKE THEM. SO YOU SAY.\nTRY THEM! TRY THEM! AND YOU MAY.\nTRY THEM AND YOU MAY, I SAY.\n\nsAM! IF YOU LET ME BE,\nI WILL TRY THEM. YOU WILL SEE.\n\n(... and he tries them ...)\n\nSAY! I LIKE GREEN EGGS AND HAM!\nI DO! I LIKE THEM, SAM-I-AM!\nAND I WOULD EAT THEM IN A BOAT.\nAND I WOULD EAT THEM WITH A GOAT...\nAND I WILL EAT THEM, IN THE RAIN.\nAND IN THE DARK. AND ON A TRAIN.\nAND IN A CAR. AND IN A TREE.\nTHEY ARE SO GOOD, SO GOOD, YOU SEE!\nSO I WILL EAT THEM IN A BOX.\nAND I WILL EAT THEM WITH A FOX.\nAND I WILL EAT THEM IN A HOUSE.\nAND I WILL EAT THEM WITH A MOUSE.\nAND I WILL EAT THEM HERE AND THERE.SAY! I WILL EAT THEM ANYWHERE!I DO SO LIKE GREEN EGGS AND HAM!THANK YOU! THANK YOU, SAM I AM."}},{"id":"6174036500","type":"user-reviews","attributes":{"userName":"vevelt paws","rating":1,"isEdited":false,"title":"No✨","date":"2020-07-08T23:01:56Z","review":"I opened the app just to see a scary picture of an orange 🍊. That was just not an appropriate thing to see when you first open an app. Second of all the app MADE MY DOG COMMIT MURDER yes you heard that right as soon as I opened the app my dog jumped out of my lap ran to the kitchen grabbed a knife then killed my grandma 👵. The other issue with this app is as soon as I download it a box came in labeled as “a box of roaches-𝑓𝑟𝑜𝑚 𝑡𝑟𝑢𝑚𝑝❤︎“ so not only did this app make my dog kill someone but it also shipped roaches to my house and I find that extremely depressing.So please take this out of the App Store so this doesn’t happen to anyone one else-𝑘𝑎𝑐𝑐ℎ𝑎𝑛 𝑤𝑒 𝑤𝑒𝑟𝑒 𝑓𝑖𝑣𝑒❤︎"}},{"id":"6174036488","type":"user-reviews","attributes":{"userName":"nickname 282838829292928","rating":1,"isEdited":false,"title":"gorl what","date":"2020-07-08T23:01:55Z","review":"this app is HORRIBLE!!!!!! personally i think we should send it back to it’s country. periodt. all it had done is get in the way of good hardworking apps that were born in the appstore and steal our jobs. we will not stand for this !!!!!!!!! so this app gets a one star from me. go download a real app like subway surfers or corn hub."}},{"id":"6174035939","type":"user-reviews","attributes":{"userName":"d. f. a. s. d. j. b. nm","rating":1,"isEdited":false,"title":"OH.MY.GOSH","date":"2020-07-08T23:01:45Z","review":"this app is nasty ewww"}},{"id":"6174035948","type":"user-reviews","attributes":{"userName":"CarolinedeBoer","rating":1,"isEdited":false,"title":"A carrot as president","date":"2020-07-08T23:01:45Z","review":"Well first off I open the app to see a picture of a carrot with a white puff on the top and then I put in my phone number and it said it sent a code to me but it didn’t so I deleted the app because Trump is an ass"}}]}