{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38850","data":[{"id":"6164915812","type":"user-reviews","attributes":{"isEdited":false,"userName":"Marice ❣️","review":"Once upon a time there was a lovely princess. But she had an enchantment upon her of a fearful sort which could only be broken by love's first kiss. She was locked away in a castle guarded by a terrible fire-breathing \ndragon.\nMany brave knigts had attempted to free her from this dreadful prison, but non prevailed. She waited in the dragon's keep in the highest room of the talltower for her true love and true love's first kiss.\n\n{Laughing} \n\nLike that's ever gonna happen.\n\n{Paper Rusting, Toilet Flushes}\n\nWhat a load of -","title":"One Star 😔","rating":1,"date":"2020-07-06T17:15:07Z"}},{"id":"6167014044","type":"user-reviews","attributes":{"isEdited":false,"userName":"96792in22942","review":"It runs smoothly and is very informative. Love my president. Love his app. Make America Great Again!!!!! Trump 2020","title":"Love this app","rating":5,"date":"2020-07-07T06:30:47Z"}},{"id":"6161527121","type":"user-reviews","attributes":{"isEdited":false,"userName":"Crystalgems33","review":"When I downloaded the app it immediately stopped working. Not only that, but it also took away my eye virginity. My precious precious eyes need to be bleached right away. I am just disappointed.","title":"Disappointed","rating":1,"date":"2020-07-05T20:29:22Z"}},{"id":"6157264994","type":"user-reviews","attributes":{"isEdited":false,"userName":"Panic! at the Disco---fan","review":"There I said it. Oh how the tables have turned. This app is honestly useless. My dog was barking at the app when a pictured of Mr. Trump popped up. Don’t use this app. It’s not worth it. I find better information of Tik Tok by 20 year olds. This is a sad app. Not worth getting. #savebarron202 PS Mr. Trump is old lol","title":"FAKE NEWS","rating":1,"date":"2020-07-04T17:16:32Z"}},{"id":"6149066014","type":"user-reviews","attributes":{"isEdited":false,"userName":"Kemo8752","review":"Ever since I got this app my phone has been so glitchy. I think it hacked my phone and now It keeps randomly turning off when I’m using it. Do not get this app!!!!!!","title":"Whatever you do don’t get this app","rating":1,"date":"2020-07-02T16:35:36Z"}},{"id":"6156721834","type":"user-reviews","attributes":{"isEdited":false,"userName":"Becky46","review":"Great app from a man that loves America. And will be our president for four more years. God Bless America.","title":"Great app.","rating":5,"date":"2020-07-04T14:25:29Z"}},{"id":"6148806013","type":"user-reviews","attributes":{"isEdited":false,"userName":"Antuwn","review":"Downloaded this app to support our great President and his re-election and instead my personal information was illegally downloaded and given to LIBERALS AND DEMOCRATS. Also with leaked information and the app also downloaded a virus to spread A N T I F A propaganda!!!!","title":"Leaks personal information","rating":1,"date":"2020-07-02T15:16:31Z"}},{"id":"6147133393","type":"user-reviews","attributes":{"isEdited":false,"userName":"Sindy from statefarm","review":"I downloaded this app excited for me to see my commander in chief. Oh but I wasn’t to happy about what I saw. I got a VIRUS on my phone from this app. Just like the president should get too✨🧚(For legal reasons that’s a joke) Anyways, I HATED it. Your manager will be hearing from me.","title":"Donald dump","rating":1,"date":"2020-07-02T06:11:49Z"}},{"id":"6146221503","type":"user-reviews","attributes":{"isEdited":false,"userName":"dchtchuf","review":"I downloaded this app and after using it for 2 minutes it crashed my phone, wouldn’t let me leave the app and started showing pictures of a Cheeto on repeat, it was horrifying. DO NOT GET THIS APPPPP!!","title":"Crashed my phone","rating":1,"date":"2020-07-02T00:27:44Z"}},{"id":"6146144572","type":"user-reviews","attributes":{"isEdited":false,"userName":"barb🐉","review":"Nicki Minaj is not only the best female rapper but the best person ever. We are all trash compared to the queen herself especially tiny pp trump. Her discography of 4 albums and 3 mixtapes are filled with gold content and straight up bars. Nicki is my god and anyone is welcome to join my religion (minajism). Steam trollz.#brabs4bernie #settleforjoe 💅🏾","title":"Nicki Minaj is queen","rating":1,"date":"2020-07-01T23:56:19Z"}}]}