{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=85500","data":[{"id":"6177324664","type":"user-reviews","attributes":{"date":"2020-07-09T16:15:40Z","isEdited":false,"review":"What kind of president has an app. Take me back to the George Washington days...","title":"Horrid","rating":1,"userName":"kcut6610"}},{"id":"6177309054","type":"user-reviews","attributes":{"date":"2020-07-09T16:11:25Z","isEdited":false,"review":"That ugly peice of trash he needs to live in hell","title":"Tiktok but still i hate trump","rating":1,"userName":"🤡trump🤡"}},{"id":"6177302768","type":"user-reviews","attributes":{"date":"2020-07-09T16:09:37Z","isEdited":false,"review":"what is this app? it kind of scares me. deleting immediately!!!","title":"OH NO","rating":1,"userName":"Weed master 33"}},{"id":"6177293085","type":"user-reviews","attributes":{"date":"2020-07-09T16:06:49Z","isEdited":false,"review":"I saw this video of trump eating a massive glizzy and I thought it was kinda sus and this app is bad","title":"Glizzy gladiator","rating":1,"userName":"joemammmmaa69"}},{"id":"6177285366","type":"user-reviews","attributes":{"date":"2020-07-09T16:04:36Z","isEdited":false,"review":"It’s is a slow bad app and very inconsistent","title":"Bad","rating":1,"userName":"nah jk Haven"}},{"id":"6177285179","type":"user-reviews","attributes":{"date":"2020-07-09T16:04:33Z","isEdited":false,"review":"Worst app ever!!!","title":"If I could give zero I would","rating":1,"userName":"j8g3erut439ygrhoiegd"}},{"id":"6177262212","type":"user-reviews","attributes":{"date":"2020-07-09T15:57:54Z","isEdited":false,"review":"this might actually be the worst app to ever exist, i had high expectations, but was very very disappointed in the quality of this app.","title":"this app is the worst","rating":1,"userName":"A.R.A.b.e.l.l.a"}},{"id":"6177261935","type":"user-reviews","attributes":{"date":"2020-07-09T15:57:49Z","isEdited":false,"review":"I can’t believe this narcissistic, misogynistic white supremacists is our president","title":"Garbage","rating":1,"userName":"Savannah Libby"}},{"id":"6177260344","type":"user-reviews","attributes":{"date":"2020-07-09T15:57:21Z","isEdited":false,"review":"let me tell you a story. it began in the early dawn lighted hours of july 9th, 2020. the vision of 2020, not clear as the perfection itself, shines incessantly down upon the poor uptakers’ of the citizens of this country titled the united states. as hoping to uplift my opinions on this trechurous and horrifying year, i downloaded the trump app. this trump app downloaded as promptly as i gad decided to purchase it. and for your record, i am invigiourois in helping trumps’ mission to get what he needs. this is no joke. unfortunately, my entirety and opinion of him has changed. as soon as i glanced down gracefully upon the app on my home page, the letters Trump 2020 shone down upon me. i did not like the looks from the start. it was scary. i was scared. why am i scared in my own country, never less my own phone? as a rush of adrenaline and bravery courses through me, i opened the app. looking back into it, it is the worst decision i have ever made. there was no going back. but now, i see it as part of my personality. seeing the first screen that arose like a sail of a ship, jutting out of the cold and icy ocean waters. this app has changed me, and i’m not even past the home screen. let me describe to you the eeriness of this image that was casted into my brain. 🧠. trump. with wrinkles and orange skin upon his face, with his head looking up high. his fist in the air, like in breakfast club but scary big scary. the american flag is behind him. unfortunately, trump was crying. because of the teenagers who have overcome him. it’s okay bunker boy. but nevertheless, i immediately deleted the app after seeing this horrifying image. would not remmcomed. if i could 0/10 i would. thank you for your time. -my caretaker. because i died of a stroke when i opened this app.","title":"worst app ever created","rating":1,"userName":"Steve-O-Joe"}},{"id":"6177258656","type":"user-reviews","attributes":{"date":"2020-07-09T15:56:50Z","isEdited":false,"review":"i was super excited to get this app to support our 🍊orange maniac🍊. i realized, this orange is all over the app and decided to ✨d e l e t e i t✨. don’t get it, it isn’t worth ur precious time and effort. thank you👣","title":"❤️✨n o✨❤️","rating":1,"userName":"i dont think so❤️"}}]}