{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26740","data":[{"id":"6178636494","type":"user-reviews","attributes":{"userName":"tiodemedamkotkit","rating":1,"isEdited":false,"title":"Sadly it’s a very bad app. Huge waste of space and time!!","date":"2020-07-09T23:37:56Z","review":"This is possibly the WORST app I have ver downloaded. It kept glitching and it kept kicking me out of the app. Also after downloading the app I got creepy messages! Telling me that they knew where I lived and they could see me! This app is very dangerous! DO NOT GET THIS APP! VERY TRASHY!"}},{"id":"6178661234","type":"user-reviews","attributes":{"userName":"liam543216789","rating":5,"isEdited":false,"title":"Best app I've ever used","date":"2020-07-09T23:47:37Z","review":"Tick Tock liberals trying to spam bad comments don't listen to them it's a great app"}},{"id":"6178625860","type":"user-reviews","attributes":{"userName":"Dominguez1877","rating":1,"isEdited":false,"title":"This app gave me diarrhea😣🤢🤮","date":"2020-07-09T23:33:53Z","review":"I think this app has too much radiation because every time I open it I get explosive, violent diarrhea. Not only that, but this app literally took a week to download. I thought I was the only one, but then I saw others had the same problem."}},{"id":"6178607782","type":"user-reviews","attributes":{"userName":"Karen Stewarts","rating":1,"isEdited":false,"title":"This app is horrible","date":"2020-07-09T23:26:48Z","review":"This app is horrible no one will vote for you you created this app to make people vote for you and you are racist and you created this app to make America worse again do we all know that you are a sex afender 😡😡👿👿👿 we will troll you forever and I am exposing you"}},{"id":"6178596351","type":"user-reviews","attributes":{"userName":"hajajsbajjjN","rating":1,"isEdited":false,"title":"My Poor Cat Lucy","date":"2020-07-09T23:22:12Z","review":"I tried using this app and my cat was next to me and it blinded her. Like physically BLINDED. Everything went black and we had to rush her to the vets. We were anxiously waiting for her in the lobby when the vet came back and told us that she is allergic to Trump. Will not be installing this app again."}},{"id":"6178505344","type":"user-reviews","attributes":{"userName":"John Gary-Smith","rating":1,"isEdited":false,"title":"PLEASE BE SAFE ON THIS APP!!!","date":"2020-07-09T22:46:16Z","review":"i got this app and i noticed that it was extremely racist, homophobic, misogynistic and xenophobic! plus, this app literally made my phone orange. my iphone was the dark grey color and then once i downloaded it, my phone turned an orange color and started growing dry, extremely damaged hair? it won’t stop please help me."}},{"id":"6178479666","type":"user-reviews","attributes":{"userName":"Landon_says_keep_tiktok","rating":1,"isEdited":false,"title":"Deleting TikTok?!?!","date":"2020-07-09T22:36:04Z","review":"All of the TikTok community loves to make videos for people, and if you ban it in the u.s then thousands of creators will be broke and lose money like for one the hype house, they could lose their house and be homeless, we don’t want this, so please don’t ban this app and ruin things for thousands, review by landon"}},{"id":"6178484700","type":"user-reviews","attributes":{"userName":"notmypresidenttttttttttt","rating":5,"isEdited":false,"title":"Horrible🤢","date":"2020-07-09T22:38:01Z","review":"They tried but they can’t even get this right. Literally made me THROW UP. Nauseating"}},{"id":"6178478007","type":"user-reviews","attributes":{"userName":"save.tiktok.2020","rating":1,"isEdited":false,"title":"AWFUL🤢🤮","date":"2020-07-09T22:35:27Z","review":"I downloaded this app in an attempt to support our dearest cheeto president, but it took over 3 days to download. My phone was unusable during the download. Now it is glitching uncontrollably and I'm gettin messages from random numbers in Russian. I do not recommend downloading this unholy excuse of an app!!! 😡🤮"}},{"id":"6178473769","type":"user-reviews","attributes":{"userName":"memestar05","rating":5,"isEdited":false,"title":"Creepy","date":"2020-07-09T22:33:43Z","review":"I signed up and there were black vans outside of my house? I was truly shaking they then told me thank you for your service and it was honestly scary even tho they were nice they stalked me then poked me I think it was a tracker bc I keep hearing a beep in my head and the app does not run smooth at all!!!"}}]}