{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=15300","data":[{"id":"6136524723","type":"user-reviews","attributes":{"review":"So you know how I “love” our  dear president so much I wanted to support him so I downloaded this lovely app. When I pressed it it was just horrible ,it asked for my phone number and many more stuff. I am just so sad/Dissapointed as a supporting republican who I guess is now turning to a Democrat. I would rate it 0/10 if I could but I’m going to be considerate and give it a 1/5. you’re very welcome 🍊.    \n\noh and I forgot something .🖕🏽","userName":"valerrriieee","date":"2020-06-29T16:18:27Z","rating":1,"title":"a dissapointment 🤮🖕🏻","isEdited":false}},{"id":"6136454312","type":"user-reviews","attributes":{"review":"I tried this app because it’s the number 6 news app on the market but when i opened it the screen was black. Later i was finally able to get in and it kept glitching. eventually it started working and i relized it was a terrible app in general and hard to use. there are many other apps out there i would use before this one","userName":"janor003","date":"2020-06-29T15:55:50Z","rating":1,"title":"to many bugs","isEdited":false}},{"id":"6135736715","type":"user-reviews","attributes":{"review":"After this app had asked for my phone number I had received spam calls and texts and when I gave it my personal information I was scammed it had found my debit card number and drained all my accounts and now I’m left with no longer being able to pay my rent this month or the next if I can’t get this figured out.","userName":"hot sause 🦖🦖","date":"2020-06-29T12:27:50Z","rating":1,"title":"Please get this app taken down","isEdited":false}},{"id":"6134488428","type":"user-reviews","attributes":{"review":"When I downloaded the app I didn’t really think nothing bad would happen but then I got a notification saying that trump would like to share something with me I was disgusted and disappointed with the president behavior towards his people he send me pictures of his itty bitty penis I am scared and ashamed to call him my president I wish for this app to be deleted so other women will never experience that picture of his tiny penis","userName":"wth trump","date":"2020-06-29T04:54:52Z","rating":1,"title":"WTH TRUMP","isEdited":false}},{"id":"6134396479","type":"user-reviews","attributes":{"review":"I DO NOT RECOMMEND . I know I have to support my president trump but I had a terrible experience with this awful app. Once I entered my information i received so many spams. It wouldn’t stop so I tried deleting the app and re downloading it because I want to continue supporting this amazing president. But when I re downloaded it, it continued spamming me. I have more terrible experiences with this app that is rather not say. I just WOULD NOT RECOMMEND!!!","userName":"idania v","date":"2020-06-29T04:17:11Z","rating":1,"title":"So bad","isEdited":false}},{"id":"6133481538","type":"user-reviews","attributes":{"review":"i downloaded this app hoping to get more information about trump and he’s ways of trying to make america “great” again. when i gave the app my information they immediately started spamming me and calling me about me voting. bc they were doing so my phone started over heating and burning my hands(i now have 3rd degree burns all over my hands) and as i threw my phone bc it was too hot it blew up. the explosion was so big it blew up my entire house. me and my family are now homeless and i am doing this from my nurses sons ds. we are using the nurses son ds bc we are all in the hospital due to the explosion and my parents are barely hanging on. don’t download this app✨","userName":"✨thisappsucks✨","date":"2020-06-28T22:10:28Z","rating":1,"title":"i am in the hospital","isEdited":false}},{"id":"6114554587","type":"user-reviews","attributes":{"review":"as a trump supporter, i downloaded the app to keep up with donald. i willingly entered my phone number. That night i got many strange emails and phone calls. and the next day i went out shopping and my credit cards all got declined. i checked my account and my account was empty. i got more phone calls and some of my emails held all of my bank account information!! PLEASE DONT GET THIS APP UNLESS YOU WANT YOUR CREDIT CARD INFO STOLEN!!!!","userName":"Mikaaye","date":"2020-06-24T02:52:08Z","rating":1,"title":"IT STOLE MY CREDIT CARD INFO","isEdited":false}},{"id":"6076329428","type":"user-reviews","attributes":{"review":"Our Lord and Child Rapist Donald Chump needs to rethink this app back in the bunker. Immediately found typos in as I opened this app. “Join to help us Keep America Great” with no period at the end?! Did you fail 1st grade English and Grammar like you have been failing this country? Don’t even get me started on the reward system. The prizes are trash. Go back to wherever Cheetos come from since you like to tell others where they belong.","userName":"MissMusch","date":"2020-06-14T22:08:01Z","rating":1,"title":"AmeriKKKlan","isEdited":false}},{"id":"6179173359","type":"user-reviews","attributes":{"review":"Honestly, do I need to explain?? I was mowing my roof and then my cat started telling me how the App Stole all my money I screamed at the top of my lung and asked yoda my lord and savior why I couldn’t understand so I went to the lake and threw pebbles at it til I then heard my dog tell me that a level two corona was coming our way thanks to the orange cheto in office please don’t waste you time :(( all my pets died of depression due to the app as well","userName":"mariaaasanen","date":"2020-07-10T02:59:14Z","rating":1,"title":"Terrible","isEdited":false}},{"id":"5890650062","type":"user-reviews","attributes":{"review":"Everything Trump all in one place! One stop shop for all Trump news, notifications, events coming up and all details about it,  and you can even register to vote!! Life is good. Trump 2020🇺🇸","userName":"krazytrain555","date":"2020-05-01T23:37:09Z","rating":5,"title":"Cooler than cool😎","isEdited":false}}]}