{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=124850","data":[{"id":"6173459511","type":"user-reviews","attributes":{"review":"Tik tok lives matter","title":"Tik tok  life‘s matter","userName":"yeetyeet5","isEdited":false,"date":"2020-07-08T19:32:04Z","rating":1}},{"id":"6173459335","type":"user-reviews","attributes":{"review":"Stop ruining all our fun you Orange man 🇺🇸🇺🇸🇺🇸🇺🇸","title":"TikTok banned","userName":"Mic Oxslong","isEdited":false,"date":"2020-07-08T19:32:01Z","rating":1}},{"id":"6173459137","type":"user-reviews","attributes":{"review":"Bananæ","title":"Monkaë","userName":"ItsMeAce","isEdited":false,"date":"2020-07-08T19:31:56Z","rating":1}},{"id":"6173457408","type":"user-reviews","attributes":{"review":"BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM BLM\n    ✨Make America LOVE Again✨","title":"BLACK LIVES MATTER","userName":"clariT123","isEdited":false,"date":"2020-07-08T19:31:21Z","rating":1}},{"id":"6173454397","type":"user-reviews","attributes":{"review":"Amigo sabes acabo de conocer, una mujer que aun es una niña\nSabes tiene los 17 aun, es jovencita y ya es mi novia\nAmigo sabes acabo de conocer, una mujer que aun es una niña\nSabes tiene los 17 aun, es jovencita y ya es mi novia\nAmo su inocencia, 17 años\nAmo su errores, 17 años\nSoy su primer novio, 17 años\nSu primer amor\nAmo su inocencia, 17 años\nAmo su errores, 17 años\nSoy su primer novio, 17 años\nSu primer amor\nEs callada, tímida, inocente y tiene la mirada\nLe tomo la mano y siente algo extraño\nLa abrazo, me abraza y empieza a temblar\nA temblar de miedo diciéndome que nunca\nHabía sentido sensación así, en su vida\nAsí en su vida\n¿Qué si eso es el amor?, ¿qué si eso es el amor?\n¿Qué si eso es el amor?, ¿qué si eso es el amor?\n¿Qué si eso es el amor?, ¿qué si eso es el amor?\n¿Qué si eso es el amor?, ¿qué si eso es el amor?\nEs callada, tímida, inocente y tiene la mirada\nLe tomo la mano y siente algo extraño\nLa abrazo, me abraza y empieza a temblar\nA temblar de miedo diciéndome que nunca\nHabía sentido sensación así, en su vida\nAsí en su vida\n¿Qué si eso es el amor?, ¿qué si eso es el amor?\n¿Qué si eso es el amor?, ¿qué si eso es el amor?\n¿Qué si eso es el amor?, ¿qué si eso es el amor?\n¿Qué si eso es el amor?, ¿qué si eso es el amor?","title":"“17 años” a good song better than this app","userName":"LeNymph","isEdited":false,"date":"2020-07-08T19:30:22Z","rating":1}},{"id":"6173452656","type":"user-reviews","attributes":{"review":"No❤️\nNo❤️\nNo❤️\nNo❤️\nNo❤️\nNo❤️","title":"No 💞","userName":"Dnejdjjehdjsb","isEdited":false,"date":"2020-07-08T19:29:51Z","rating":1}},{"id":"6173448004","type":"user-reviews","attributes":{"review":"Contains racist content.","title":"Bad app.","userName":"TrippyGrandma","isEdited":false,"date":"2020-07-08T19:28:13Z","rating":1}},{"id":"6173447218","type":"user-reviews","attributes":{"review":"just awful 🤮🤮🤮🤮🤮🤮🤮","title":"disgusting","userName":"XsFreakyy🤠🤠","isEdited":false,"date":"2020-07-08T19:27:56Z","rating":1}},{"id":"6173436353","type":"user-reviews","attributes":{"review":"I did this for tiktok","title":"Tiktok","userName":"Debra Sue Mac","isEdited":false,"date":"2020-07-08T19:24:14Z","rating":1}},{"id":"6173435774","type":"user-reviews","attributes":{"review":"Disgusting app","title":"Disgusting","userName":"TRUMPISPEDOHIPPO","isEdited":false,"date":"2020-07-08T19:24:03Z","rating":1}}]}