{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=142820","data":[{"id":"6179262785","type":"user-reviews","attributes":{"isEdited":false,"userName":"zandge","date":"2020-07-10T03:31:02Z","title":"The most horrible app on the apple store","review":"I tried to download it and then after two days it made my phone glitchy horrible app!!!!!!! This was the worst experience in my life delete this app please before this happens to anyone else","rating":1}},{"id":"6179262789","type":"user-reviews","attributes":{"isEdited":false,"userName":"hehebehebejeje","date":"2020-07-10T03:31:02Z","title":"Never get this app","review":"When I downloaded this app it deleted all my picture and played Mexica music for 3 week straight and not to mention it took 6 weeks to download the and the grammar is just horrible now one puts four E’s in cat","rating":1}},{"id":"6179262751","type":"user-reviews","attributes":{"isEdited":false,"userName":"🇺🇸anonomous 2020🇺🇸","date":"2020-07-10T03:31:02Z","title":"This app is horrible!","review":"When I downloaded this app I was opened the most horrid looking Cheeto I have ever seen in my life! I was then shown a ✨disgusting✨ naked orange man. After that they told me they had all my information! (Social security number, phone number, etc.) they said if I didn’t vote trump 2020 they would leak it! I still didn’t vote because why would I after this! If I could rate 0 stars I would. 🇺🇸Anonymous 2020🇺🇸","rating":1}},{"id":"6179262792","type":"user-reviews","attributes":{"isEdited":false,"userName":"rbg2020","date":"2020-07-10T03:31:02Z","title":"The absolute worst thing I’ve ever seen","review":"If I could give it a zero I would.","rating":1}},{"id":"6179262808","type":"user-reviews","attributes":{"isEdited":false,"userName":"mdgsve","date":"2020-07-10T03:31:02Z","title":"This app is the so bad it should even be on the App Store","review":"First off it really bad to make an app about a orange but any way I don’t like how when I first open the app I saw what look like big racist person that really don’t really know how to be a president and don’t care about us so so yea this the worst app ever.","rating":1}},{"id":"6179262685","type":"user-reviews","attributes":{"isEdited":false,"userName":"Lukegraham","date":"2020-07-10T03:31:00Z","title":"Trash","review":"as soon as I downloaded this app, my phone started screaming out racial slurs. I tried to calm my phone down but it punched me in the face and told me to pull myself up from my bootstraps and stop being a snowflake. DO NOT DOWNLOAD THIS APP.","rating":1}},{"id":"6179262694","type":"user-reviews","attributes":{"isEdited":false,"userName":"Meg22 Review","date":"2020-07-10T03:31:00Z","title":"Awful","review":"0/10 do not recommend","rating":1}},{"id":"6179262648","type":"user-reviews","attributes":{"isEdited":false,"userName":"Ava Andres","date":"2020-07-10T03:30:59Z","title":"T R A S H 💕","review":"This app is trash. 💕😼 Ty for your time.","rating":1}},{"id":"6179262657","type":"user-reviews","attributes":{"isEdited":false,"userName":"sal🦋✨","date":"2020-07-10T03:30:59Z","title":"HORRIBLE APP! DON’T DOWNLOAD.","review":"I really was interested in seeing what was going on in terms of our amazing President and his rallies, but I was scarred to see such a horrendous image upon downloading the app, which by the way took a whole entire week. I have never experienced such a delay in downloading time in the app, and as soon as I the download was complete, I began to experience a great deal of glitching of my phone which I had not experienced beforehand. My phone has begun to shut off randomly and overheat rapidly even though I am indoors, and now I am scared every single night that my phone is going to overheat too much to the point where it’ll catch fire in the middle of the night, and I won’t have any idea. Not to mention the traumatizing image you would see of an orange man as soon as you clicked on the app. I had to delete the app a few nights after experiencing this because I wanted to make sure that was the case, and I was right. Never again will I download this app, and it needs to go asap!","rating":1}},{"id":"6179262558","type":"user-reviews","attributes":{"isEdited":false,"userName":"me1958262","date":"2020-07-10T03:30:57Z","title":"AHAHAHAHAHAAA","review":"We know you did it with a bowl of spaghetti 👀","rating":1}}]}