{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=39380","data":[{"id":"6173662440","type":"user-reviews","attributes":{"review":"Maybe I could gotten over how slow the app is and how it made my phone glitch. But I can not get over how it started calling me and my momma racial slurs when I tried to open it. Not MY president","rating":1,"userName":"k_lynnn","isEdited":false,"title":"Disgusting","date":"2020-07-08T20:42:36Z"}},{"id":"6173661699","type":"user-reviews","attributes":{"review":"This app opened up a new doorway for all kinds of fake news on my phone. At first I got all kinds of wonderful adds for our best orange chicken nugget president, but then these weird pictures started showing up! It said DT was supporting our lord and savior Obama?? HOW DARE THEY SPREAD THIS NEWS PLEASE EVERYONE DELETE THIS APP!!","rating":1,"userName":"ALozier","isEdited":false,"title":"THIS IS A FAKE TRUMP APP","date":"2020-07-08T20:42:21Z"}},{"id":"6173656651","type":"user-reviews","attributes":{"review":"This app is terrible, it caused my caterpillar to have a seizure after blowing up my phone and taking 1 month to download..... DO NOT GET THIS APP IT IS TERRIBLE!!!!!! I bring this review to you from my new iPod 4 and will not stand for this. Where is the manager?","rating":1,"userName":"Minty boi 69","isEdited":false,"title":"Stop this","date":"2020-07-08T20:40:35Z"}},{"id":"6173656481","type":"user-reviews","attributes":{"review":"This is the worst app ever they make you do thing and then they even make you put in your information just so they can send you emails their is the worst game ever and do not reaccomend at all","rating":1,"userName":"lunlun lol","isEdited":false,"title":"Worst app ever","date":"2020-07-08T20:40:32Z"}},{"id":"6173652821","type":"user-reviews","attributes":{"review":"Even though I wanted to support our fascist dictator daddy trump, I am unable to work with this app. It’s run horribly and I feel personally offended that it’s still aloud on the App Store. I wish I could rate lower then 1 star.","rating":1,"userName":"A fellow cat lover","isEdited":false,"title":"Absolutely appalling 🤮","date":"2020-07-08T20:39:14Z"}},{"id":"6173650940","type":"user-reviews","attributes":{"review":"This app was complicated and not functional...Kinda just like trump. I am 18 and going to vote :) but all i am getting is fake news and backlash from boomers. Do not believe everything you read AND don’t forget he’s a rapist.","rating":1,"userName":"Tabby.1937","isEdited":false,"title":"help","date":"2020-07-08T20:38:33Z"}},{"id":"6173644593","type":"user-reviews","attributes":{"review":"This app requires you to join a cult where you can earn points for being racist, misogynistic, xenophobic, hateful, stupid, and inbred. I couldn’t earn any points, so I had to rate it poorly and delete. Don’t waste your time.","rating":1,"userName":"DJ10CJ","isEdited":false,"title":"Cult App","date":"2020-07-08T20:36:17Z"}},{"id":"6173641221","type":"user-reviews","attributes":{"review":"It took a very long time to download the app and made my phone glitch. I’m still having problems with my phone and I would never get this app again.🤢🤢🤢🤡❤️","rating":1,"userName":"cheetopresident","isEdited":false,"title":"Terrible","date":"2020-07-08T20:35:04Z"}},{"id":"6173639289","type":"user-reviews","attributes":{"review":"Horrible. There were no instructions on how to download the app, and there isn’t even a guide on yahoo on how to download it. Luckily an AOL user pointed me to a helpful Facebook post, but seriously all that time and work for an app?","rating":1,"userName":"DanTheMan2378","isEdited":false,"title":"Terrible!","date":"2020-07-08T20:34:22Z"}},{"id":"6173632931","type":"user-reviews","attributes":{"review":"It’s a absolutely terrible app, I don’t know how to use it, It doesn’t give good information, and much like another review it took WEEKS to download so please just don’t download it. (Download it then give it a one star review)","rating":1,"userName":"cerial before milk guy","isEdited":false,"title":"🤮🤮🤮🤮🤮🤮","date":"2020-07-08T20:32:06Z"}}]}