{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=43580","data":[{"id":"6174387594","type":"user-reviews","attributes":{"review":"My experience using this app was awful. It is horribly flourished with disturbing images and fake news. There is an orange oaf that is pictured all throughout the app. It is raunchy and tasteless. I wish i could give negative stars .","title":"SHOULD BE TAKEN OFF THE APP STORE!!","userName":"Deshdbvdbak","rating":1,"date":"2020-07-09T01:06:26Z","isEdited":false}},{"id":"6174385055","type":"user-reviews","attributes":{"review":"This app is one of the worst set up apps I’ve ever seen, it’s formatted terribly and it’s too confusing for me to use. Beyond that, this app is directly supporting a facist. This should not be on the App Store in the form it’s in","title":"Awful","userName":"ballslover1986","rating":1,"date":"2020-07-09T01:05:36Z","isEdited":false}},{"id":"6174382898","type":"user-reviews","attributes":{"review":"I know apps. I know apps better than anyone. I have all the experience with many many apps, and I know them. This app is just horrible. Awful, horrible app.","title":"Awful","userName":"the greatest of all greatness","rating":1,"date":"2020-07-09T01:04:57Z","isEdited":false}},{"id":"6174364011","type":"user-reviews","attributes":{"review":"This app is so unprofessional and messy. Not only that the app is based off the worst person ever made...TRUMP. He is a disgusting person who deserves no right. The app is a waste of time and needs to be delete rn","title":"This app NEEDS to be deleted.","userName":"thiccdaddy.abs","rating":1,"date":"2020-07-09T00:59:04Z","isEdited":false}},{"id":"6174357605","type":"user-reviews","attributes":{"review":"i got the app hoping it would be good but as soon as i opened it all i saw was a cheeto and i wanted to bleach my eyes out. ive never been so horrified in my LIFE. no one should EVER have to see what i saw!!! 🤮🤮🤮🤮🤮","title":"terrible, distracting, etc","userName":"Puzzle KWEEEN","rating":1,"date":"2020-07-09T00:56:58Z","isEdited":false}},{"id":"6174356959","type":"user-reviews","attributes":{"review":"Obviously it’s not EVERYTHING wrong with the world, but why in the world is it available to the public? It’s absolutely disgusting and it’s a bad look for America. 🤢🤮","title":"This app is everything wrong with the world","userName":"Kadi Sacko","rating":1,"date":"2020-07-09T00:56:45Z","isEdited":false}},{"id":"6174346467","type":"user-reviews","attributes":{"review":"Don’t download I download it and my phone started glitching so I went outside and I saw a naked hot Cheetos man and then he disappeared so I went back inside and he was in my room surrounded by oranges do not download","title":"I came from tik tok","userName":"💩💩💩💩💩💩👻💩💩💩💩","rating":1,"date":"2020-07-09T00:53:17Z","isEdited":false}},{"id":"6174333458","type":"user-reviews","attributes":{"review":"This app is fake!!!! It is not the real app. Please do not use this app, it will give your phone a virus that leaks your search history on Facebook!!! If you want to keep your privacy then DO NOT download this app","title":"FAKE","userName":"abbyGabbiekdabby","rating":1,"date":"2020-07-09T00:48:54Z","isEdited":false}},{"id":"6174332255","type":"user-reviews","attributes":{"review":"Absolutely grossed out by the app. Constantly tracking you and so many annoying notifications. Sick to my stomach. Who let this man make an app when he can barely run a country. Crazy","title":"HORROR STORY","userName":"trump2020injail","rating":1,"date":"2020-07-09T00:48:30Z","isEdited":false}},{"id":"6174328932","type":"user-reviews","attributes":{"review":"I was expecting to get notification on when the next trump rally was, but instead I got a photo of Cheeto man doing CrossFit! Would not recommend getting this app! Fake news!!","title":"Uh no thank you","userName":"lickystickybicky","rating":1,"date":"2020-07-09T00:47:25Z","isEdited":false}}]}