{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33720","data":[{"id":"6133977017","type":"user-reviews","attributes":{"title":"THIS APP IS TRASH","isEdited":false,"rating":1,"userName":"Tomandjerrysplace","review":"Once I downloaded the free mobile app, my phone was hacked and Donald’s nude photos where all over it!!! It made me and my kids sick. We were in the car and I threw my phone and I’m currently writing this on my smart watch. I can’t take rich white men anywhere ✌🏾😐💔","date":"2020-06-29T01:27:00Z"}},{"id":"6133847686","type":"user-reviews","attributes":{"title":"Extremely disappointed.","isEdited":false,"rating":1,"userName":"badbitchfairyqueen🧚🏼‍♂️","review":"I have never been a tech-savvy person and all but I started using this app, I felt dumb. This is not user friendly at all. If he can’t manage a campaign app how can he manage a freaking country ?","date":"2020-06-29T00:34:59Z"}},{"id":"6121608012","type":"user-reviews","attributes":{"title":"a scam!!!","isEdited":false,"rating":1,"userName":"hii.........","review":"was very excited to download this app to support mY PrEsiDEnT but it took my phone number and credit card info and tried to scam me out of my money!!! probably sold the info to some foreign government. this app is fake news. very disappointed.","date":"2020-06-25T21:37:37Z"}},{"id":"6079983381","type":"user-reviews","attributes":{"title":"Disappointed...","isEdited":false,"rating":1,"userName":"lunacraft guy","review":"App doesn’t work, won’t let me type out my phone number to get our holy overlord’s sacred messages. I want real time updates on the kinds of structural changes Donald Trump is making to the Swamp of Washington. I support our president but I DO NOT SUPPORT THIS APP.","date":"2020-06-15T19:15:20Z"}},{"id":"6088037647","type":"user-reviews","attributes":{"title":"Awesome!","isEdited":false,"rating":5,"userName":"Billy1970*","review":"This app displays the great communication Our President has with the American People. It pointedly portrays the incredible work the President is doing.   KEEP AMERICA GREAT!","date":"2020-06-17T16:48:56Z"}},{"id":"6073172180","type":"user-reviews","attributes":{"title":"Too personal","isEdited":false,"rating":1,"userName":"Thisisjosh42","review":"I installed this app thinking it would get my closer with my dear leader, for it to only immediately ask to send me alerts and ask for personal identifying information. What is that?? The government doesn’t need to KNOW where I AN!!!!!","date":"2020-06-14T03:35:53Z"}},{"id":"6071359072","type":"user-reviews","attributes":{"title":"I thought it was free!!!","isEdited":false,"rating":1,"userName":"CarolinaSchnorr","review":"As a white American family, voting for the magnanimous king Trump I thought this was a free app that would keep me up to date with his tweets. But they just ask for money and on my bank statement it says it was withdrawn from Russia!!! Mr Trump I would like my money back.","date":"2020-06-13T15:41:58Z"}},{"id":"6066783738","type":"user-reviews","attributes":{"title":"Mayonnaise and oranges","isEdited":false,"rating":1,"userName":"mattwhiz","review":"I love mayo and oranges! I thought this was an app for appreciating both, but it ends up its for a person? Who embodies the qualities of what happens when you mix the two together? I wish I could give this zero stars. Do not recommend.","date":"2020-06-12T12:50:39Z"}},{"id":"6066273164","type":"user-reviews","attributes":{"title":"Hard 2 understand","isEdited":false,"rating":1,"userName":"Ermumyea","review":"I feel like the app is just page after page of basically the same statement, when I want real answers of what donald duck stands 4 how do i navigate to useful relevant and educated statements? Presidente no work","date":"2020-06-12T10:02:29Z"}},{"id":"6064600415","type":"user-reviews","attributes":{"title":"Terribly disappointed","isEdited":false,"rating":1,"userName":"ZenaRagh","review":"I downloaded this app hopefully it would weed out any of those naysayers and be full of people who love our lord and savior but this whole thing is fake news and liberals spreading their agendas. This app isn’t really for us who support our dear leader!","date":"2020-06-11T22:18:47Z"}}]}