{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=39950","data":[{"id":"6174654586","type":"user-reviews","attributes":{"review":"this app is sooo glitchy and displays ignorance on a very high level. it is the worst app i have ever had, i honestly don’t know why it’s still available for download. don’t waste your time with this app!","title":"terrible app, DONT DOWNLOAD!!!!!","isEdited":false,"userName":"ashlynnnn 🌊💕","date":"2020-07-09T02:23:40Z","rating":1}},{"id":"6174654059","type":"user-reviews","attributes":{"review":"I went on the app and I was sitting with my Pokémon cards(I was alone in my apartment) then they just start flying around the room. When it stop I went over to my binder and my shiny Charmander was ripped. I’m so upset and blame it on the app.","title":"I’m crying","isEdited":false,"userName":"Queen_Poke","date":"2020-07-09T02:23:31Z","rating":1}},{"id":"6174652645","type":"user-reviews","attributes":{"review":"Nasty🦋😌🎉I would give the app a zero but that’s not a option 🦄✨🌈 . here’s some inspirational words from me to you -dear trump, you dropped this 🔴 put it back on your nose🤡✨🌸 \n Anywho chile- go stan kpop, kr&b, and k-rap not this racist homophobic ignorant nasty and uneducated and selfish man who just so happens to be president  🤢","title":"🤢🤮","isEdited":false,"userName":"( ͡° ͜ʖ ͡°)_(ノ^_^)ノ","date":"2020-07-09T02:23:06Z","rating":1}},{"id":"6174645246","type":"user-reviews","attributes":{"review":"Unbelievable, as soon as I opened the app my phone became sentient and coughs in my face. I then proceeded to contract COVID-19 and spread it to my entire family, even my dog got it. Unable to afford treatment both my parents passed away and I am now orphaned with dwindling supplies. DO NOT BUY THIS APP!! IT WILL ONKY LEAD TO DEATH MISFORTUNE!","title":"TRASH!!🤢🤮","isEdited":false,"userName":"Obama knew best","date":"2020-07-09T02:20:58Z","rating":1}},{"id":"6174641669","type":"user-reviews","attributes":{"review":"I had the worst experience with this app it glitches a lot and it make all my phone really slow, I will never download this again!!🤮🤮","title":"Worst experience","isEdited":false,"userName":"natnatinatnatinat","date":"2020-07-09T02:19:56Z","rating":1}},{"id":"6174638710","type":"user-reviews","attributes":{"review":"This app has done nothing but not work! I can’t find any helpful information, and the info that is there is not even correct. It is completely horrible!!!","title":"DO NOT RECOMMEND","isEdited":false,"userName":"3686548zf","date":"2020-07-09T02:19:07Z","rating":1}},{"id":"6174628138","type":"user-reviews","attributes":{"review":"As soon as I opened this app, my entire house started shaking and everything broke. All of my stuff is destroyed and so r my eyes. My eyes r burning from looking at such a disgusting app. This Trump guy rly has the audacity to tear my house to shreds. VERY BAD APP. DO NOT GET","title":"Would not recommend","isEdited":false,"userName":"hsjabxbsjajs","date":"2020-07-09T02:16:06Z","rating":1}},{"id":"6174627814","type":"user-reviews","attributes":{"review":"When I downloaded this, an image popped up and it was a picture of Donald Trump taking a crap on the inside of my car. I was incredibly disturbed and deleted the app. Do not download this app! 1 Star!","title":"Worst app I’ve ever downloaded smh","isEdited":false,"userName":"Ava🌚","date":"2020-07-09T02:15:59Z","rating":1}},{"id":"6174620360","type":"user-reviews","attributes":{"review":"I would 100% not recommend this app. Not only is the content not relevant, it is also not helpful. The design of the app is not exactly cute either. I do not like the clashing colors.","title":"Awful Application","isEdited":false,"userName":"taylor tanniembum","date":"2020-07-09T02:13:54Z","rating":1}},{"id":"6174613877","type":"user-reviews","attributes":{"review":"I was using this app the other day, and my brother came to see what u was doing, when he looked at my phone he saw Donald Trump. It’s been 3 days and he’s still curled up crying in the corner.","title":"This app broke my brother","isEdited":false,"userName":"✨Jordan S✨","date":"2020-07-09T02:12:06Z","rating":1}}]}