{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=133810","data":[{"id":"6173280026","type":"user-reviews","attributes":{"rating":1,"title":"Horrible app","review":"Shawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nRemember the first time we met\nYou was at the mall with your friends\nI was scared to approach ya\nBut then you came closer\nHopin' you would give me a chance\nWho would have ever knew\nThat we would ever be more than friends\nWe're real worldwide, breakin all the rules\nShe like a song played again and again\nThat girl, like somethin off a poster\nThat girl, is a dime they say\nThat girl, is a gun to my holster\nShe's runnin through my mind all day, ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nSee you been all around the globe\nNot once did you leave my mind\nWe talk on the phone, from night til the morn\nGirl you really change my life\nDoin things I never do\nI'm in the kitchen cookin things she likes\nWe're real worldwide, breakin all the rules\nSomeday I wanna make you my wife\nThat girl, like somethin off a poster\nThat girl, is a dime they say\nThat girl, is the gun to my holster\nShe's runnin through my mind all day, ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nI can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, I can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, na na na na na na na\nNa na na na na na\nShawty got me singin\nNa na na na na na na\nNa na na na na na na\nNow she got me singin\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay","isEdited":false,"userName":"yuh get into it. PERIODT","date":"2020-07-08T18:31:05Z"}},{"id":"6173279701","type":"user-reviews","attributes":{"rating":1,"title":"A** app","review":"It lagged sooooo bad and when I downloaded it my photos started deleting and my contacts weren’t showing up so I’m pretty sure he’s hacking us through this app so PLEASE for your safety don’t download this app!","isEdited":false,"userName":"Jacquelyn 🥰","date":"2020-07-08T18:30:58Z"}},{"id":"6173278748","type":"user-reviews","attributes":{"rating":1,"title":"-100000000000/10","review":"this was terrible i opened it and saw a whole turkey infront of my screen this is absolutely absurd no one should have to go through the pain of this😔","isEdited":false,"userName":"in my keke","date":"2020-07-08T18:30:39Z"}},{"id":"6173278254","type":"user-reviews","attributes":{"rating":1,"title":"poopoopeepee","review":"this app is a bunch of poopoopeepee. i’m not kidding it’s poopoopeepee me as Felipe with Ninja on my shoulder i don’t accept of this ugly cheetos app :) 1.7 rating app store please get this cheetos app off the store, i know he’s the president but just please me Ninja and Felipe do not accept so yeah..this app is poopoopeepee. poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee poopoopeepee","isEdited":false,"userName":"Brirhibaker12","date":"2020-07-08T18:30:29Z"}},{"id":"6173278195","type":"user-reviews","attributes":{"rating":1,"title":"I don’t like this","review":"This is a waste of MB and GB just taking up my storage. This app is useless don’t get this app. This app has a bunch of unnecessary ads and the apps are inappropriate. One of the ads gave me nightmares and I can’t sleep. I have insomnia now because of this app. We must take down this app!!!Everybody give it a bad rating so they take down this app!!","isEdited":false,"userName":"2020🤡🤡🤡🤡🤡🤡🤡","date":"2020-07-08T18:30:28Z"}},{"id":"6173277996","type":"user-reviews","attributes":{"rating":1,"title":"The demons have taken over my house!!!","review":"OH GOD!!! Another vase just flew over my head as I type this!!! I downloaded this app to keep an update on the Trump STD that’s infecting our nation, and the second I opened this app, DEMONS FLEW OUT OF MY PHONE!!! The more I scrolled through these articles, my house became more and more active!!! They broke everything, my mirrors, my windows, even the original Picasso that was up in my living room!!! The worst part was that they ate the last Twinkie and I can’t go and buy more!!! I had a ouija board session with the demons and when I asked why they were here they spelled out F-U-C-K O-F-F!!! I deleted the app quickly and after that there were less run ins with these spirits and I was able to return to life B.A. (before app), and only have to sacrifice one of my future children to satan.","isEdited":false,"userName":"Uggggggg374","date":"2020-07-08T18:30:24Z"}},{"id":"6173277543","type":"user-reviews","attributes":{"rating":1,"title":"Terrible💞","review":"It took 2-3 hours to download.Also it made my phone almost explode 🎉","isEdited":false,"userName":"asfnsss VM gd🥶","date":"2020-07-08T18:30:15Z"}},{"id":"6173276948","type":"user-reviews","attributes":{"rating":1,"title":"Thus app is trash","review":"This app is trash it took forever to download and made my phone glitch as soon as I downloaded it. This app is just horrible in general.it also made my phone act really weird and I thinks something’s is wrong with it.","isEdited":false,"userName":"rinadal","date":"2020-07-08T18:30:05Z"}},{"id":"6173275327","type":"user-reviews","attributes":{"rating":1,"title":"Aahhhhhhhhhh trash app","review":"Rate it trash","isEdited":false,"userName":"makes days","date":"2020-07-08T18:29:33Z"}},{"id":"6173272833","type":"user-reviews","attributes":{"rating":1,"title":"this app smells bad","review":"I downloaded this app thinking it would be an enjoyable experience and i would learn a lot about my president but as soon as i clicked the download button, this awful stench surrounded me. I thought that was strange but i tried not to think much about it. I continued with my day, constantly bothered by this horrid stench. I realized my phone was excreting this horrible smell so i began investigating. After hours of thinking and going through the apps on my phone, I realized the trump app was at fault this whole time. It was a GREAT inconvenience to me and almost caused me to pass out due to the smell being so terrible. This app NEEDS to get off the app store because it could really do some serious damage to people who’re sensitive to smells.","isEdited":false,"userName":"caulymolton","date":"2020-07-08T18:28:43Z"}}]}