{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37190","data":[{"id":"6174766245","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"I hate this app >:(","review":"For some reason my phone started acting weird , nothing was wrong with it , I also wasn’t getting any updates from it. It’s a waste of space on my phone.","date":"2020-07-09T02:57:02Z","userName":"notme1904"}},{"id":"6174761747","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"awful","review":"Awful app! This app made my entire phone erase itself. I lost everything! From my pictures to contacts. Would not recommend this app to anyone.","date":"2020-07-09T02:55:40Z","userName":"⚡️✨🎉😤"}},{"id":"6174734731","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Expected Better","review":"I was greatly looking forward to using this app. It is not user friendly and always refreshing and crashing on me. Expected more.","date":"2020-07-09T02:47:25Z","userName":"brad_branson"}},{"id":"6174734024","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Bad app","review":"This is not what I was expecting. When I downloaded the app it automatically send me a warning saying that I am a Mexican. It then said that the police are going to show up to my house to deport me back even tho I’m legal.","date":"2020-07-09T02:47:14Z","userName":"BD Lathan"}},{"id":"6174723960","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"HORRIBLE APP","review":"This app should just be deleted, it ate all of my cookies and Dino nuggets and I’m just tired of it stealing my stuff and everyone else’s, don’t get this app unless you don’t want your food. I need my Dino nuggets back ASAP. As soon as possible- bbs my diamonds","date":"2020-07-09T02:44:13Z","userName":"Shutupandgivememydino"}},{"id":"6174709638","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Not so natural disaster","review":"This app totally COSUMED my friend Katie! As in... ate her. So let me explain; My friend Katie and I were getting out of the car when I opened this app. She started to float into my phone as soon as I opened the app and then never came back out.","date":"2020-07-09T02:39:52Z","userName":"Wolfie1202"}},{"id":"6174693644","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"WORST APP EVER!!!","review":"i downloaded to get updates about the bunker boy in the white house and it DESTROYED my phone!!!!!!!!!!!! my phone glitches all the time and the app is so slow it’s not even worth it!!! ✨❤️🦋this is the worst app ever and i wish i never downloaded it.","date":"2020-07-09T02:35:03Z","userName":"notmypresdient❤️"}},{"id":"6174687702","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Horrible app almost died","review":"I was trying to open the app when it say warning Mexican u will be 360 no scoped if u don’t close this app but I didn’t and was 360 no scoped but won the Gulag so unless u wanna go to the gulag then if you’re Latino or Latina stay away","date":"2020-07-09T02:33:16Z","userName":"gEt GoOd nUb"}},{"id":"6174687111","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"The WORST app!!!!","review":"DO NOT get this app. Had it downloaded for all of 15 minutes, and now my phone just keeps screaming at me to grab them by the pu*** it’s revolting!! I wish I could give this app LESS than one star cause this is ridiculous! WILL BE DELETING ASAP!!!","date":"2020-07-09T02:33:05Z","userName":"peaceanndsunshine"}},{"id":"6174686613","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"THIS APP IS HORRIBLE!!!","review":"THIS IS THE WOST APP IN HISTORY!!!! When i downloaded it it at first everything was fine but now... my dog threw up my pet hamster that has been missing for 3 days, my cat died, my son got pregnant and my husband lost all our saving at the casino. this app is bad luck!!!","date":"2020-07-09T02:32:56Z","userName":"Free Barron Trump!"}}]}