{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23490","data":[{"id":"6179187009","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T03:04:21Z","review":"According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don't care what humans think is impossible. Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let's shake it up a little. Barry! Breakfast is ready!","userName":"thisappisbootycheeks69","title":"Stream: be happy🐝🧚🏻❤️"}},{"id":"6179170379","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T02:58:08Z","review":"I thought this would be a tremendous app truly huge. But I am saddened that this app is not greatly at all. You need a free hand to hold your phone to use this app and well, you just can’t drink a glass of water with only one hand! Truly disappointly very truly honestly completely mostly greatly sadly.","userName":"Linda Elizabeth H","title":"Not good just not good"}},{"id":"6179153593","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T02:51:46Z","review":"In all honesty I just cannot stand for the ignorance, hatred and down right racism this app promotes. Imagine being a president of an entire country but only caring about the lives of a select few. We have indigenous women missing, kids in cages, Klu Klux Klan members terrorizing the black community, and a rapid surge of COVID-19 cases, and yet he still chooses to tweet such uninformed garbage","userName":"yourlocalangryblackwoman","title":"Disgusting"}},{"id":"6179107156","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T02:34:37Z","review":"My fellow trump-ets this app is horrible. It is so slow that a turtle walks faster than this app runs!! It took 5 days to download and nothing goes through officially I’m warning you this app is horrible I recommend you just leave a 1 star review and go on with your day that’s how bad it is!!.","userName":"Liz;(","title":"Horrible app"}},{"id":"6179041973","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T02:10:41Z","review":"This app glitches a lot. Time it opens all it does it glitch. It severely heats up my phone. EVERY TIME i open the app my phone shuts off. Would not recommend. When I open the app all i see are strange images. I also see extreme cases of hate speech as well as indisputable text. WOULD NOT RECOMMEND!!!","userName":"CreateNickname030117","title":"Slows down your phone DO NOT GET"}},{"id":"6179017269","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T02:01:41Z","review":"I got this app thinkng that this would be a great way to suport our great Cheeto President but when I opened the app I got a nock on my door and a god hating liberal showed up!!! She told me that she was higherd by Obama to kill anyone who downloaded this app!! I got out my gun and tried shooting her to make her leav, but she stabbed me before I culd!! THIS APP IS A DEMOCRAT TRAP!!! I AM BLEADING OUT AS I TYPE THIS. DO NOT GET THIS APP!!! VERY SAD THAT THOS SNOWFLAKES WOOLD SOIL THAT NAME OF OUR GRAET PRESEDANT!!!","userName":"Ray Cisman","title":"DO NOT DOWNLOD THIS APP!!!"}},{"id":"6178959630","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T01:40:36Z","review":"The app told me that I should hate minority’s and disown my family to join a racist cult run by Donald trump, when I said no Donald showed up to my house and proceeded to make me drink the blood of a goat. Finally after being interrogated by his body cards Donald began to go at away from my house and then shot up like a rocket into space","userName":"it dont have to be like that","title":"Traumatized"}},{"id":"6178935935","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T01:32:04Z","review":"I was really excited to download this app cause I wanted to know about daddy trump .( ima cream on your face daddy )🙈✨ It’s very bad but it’s okay because I like bad things Ouu 🤪 . Would not recommend downloading it and uhh trumpy can you let my cousin cross the border real quick haven’t seen them in sometime just for a little bit okay? .🧚‍♂️✨","userName":"trumps a rapist ✨🧚‍♂️","title":"trumpy🙈✨💘"}},{"id":"6178911317","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T01:22:55Z","review":"This app crashes your phone. Trump wants personal data. Why should we have to give out personal information just to know what is going on with Trump? If they’re complaining so much about tiktok then why not shut down this app. At least on tiktok you get to have fun.","userName":"Mad Cut","title":"Horrible"}},{"id":"6178876074","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-10T01:09:56Z","review":"First thing first it took 36 hours to download!!! Once I did download it my phone started glitching and my T-Mobile plan was cancelled!!! I got creepy death threats and people were sending me my address with threats!! My credit card was robbed and I couldn’t get any of my money back. Over all 0/10 situation.","userName":"mytite's scmle","title":"WORST APP EVER"}}]}