{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30930","data":[{"id":"6177375661","type":"user-reviews","attributes":{"rating":1,"review":"I tried restarting my phone, and redownloading the app, but nothing worked. Also, after downloading this app, my grandmother died, and my father had a heart attack. Coincidence? I. Think. Not. Overall, bad app. ONE. STAR.","userName":"OstrichesOnly","date":"2020-07-09T16:30:16Z","title":"The app keeps crashing my phone, and is super laggy.","isEdited":false}},{"id":"6177372128","type":"user-reviews","attributes":{"rating":1,"review":"This app is blood boiling. Literally. My blood is boiling. And not just because my booty is on the stove. The information is irrelevant and is immoral. DO NOT GET THIS APP. They will track your data and hack you. You finna see Oompa Loompa's all over your phone or iPad. If you purchase this app Gen z finna whoop yo booty. Get tiktok instead 😚✌️.","userName":"gen z fairy😚✌️","date":"2020-07-09T16:29:11Z","title":"Trash✨✌️😘🧚‍♂️✨","isEdited":false}},{"id":"6177356487","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app in order to follow the election path of our gloriously wonderful president but it’s an actual joke! Everything is slow, the animations and coloring is amateur, and all the information is a lie! Please remove this atrocious excuse for an app from the App Store!","userName":"Zavalarec","date":"2020-07-09T16:24:36Z","title":"This App is A Joke","isEdited":false}},{"id":"6177354076","type":"user-reviews","attributes":{"rating":1,"review":"this app took about 4 months to download and when it did the first thing it showed me was a picture of some weird orange creature so i got scared and deleted the app THIS APP IS NOT FOR THE LIGHT HEARTED i’m still suffering from nightmares after seeing that cheeto monster","userName":"bigtatertot","date":"2020-07-09T16:23:55Z","title":"this app is so bad don’t download it","isEdited":false}},{"id":"6177353613","type":"user-reviews","attributes":{"rating":1,"review":"I opened the app to remind myself just how much i hate #45. Out of nowhere, i was attacked. The orange man jumped out of my phone screen and punched me in the face. All while screaming about how hot his daughter is. Would rate 0/5 if it was possible. I’m not traumatized and in debt because of the therapy bills.","userName":"IjCiIs18","date":"2020-07-09T16:23:48Z","title":"ALMOST DIED!!!! NOT CLICKBAIT!!!!","isEdited":false}},{"id":"6177335256","type":"user-reviews","attributes":{"rating":1,"review":"I opened the app and the orange Cheeto puff started speaking causing me to have a stroke from trying to understand what he was talking about and die :( the app also has many bugs and glitches and cause my phone to crash several times","userName":"✨🧚‍♂️😍🦄","date":"2020-07-09T16:18:37Z","title":"✨TERRIBLE✨","isEdited":false}},{"id":"6177320038","type":"user-reviews","attributes":{"rating":1,"review":"This app killed innocent black men women and children. It has children in concentration camps. It took away trans rights to healthcare. It told women they were objects. It let 100,000 people die from a virus that could’ve been prevented if the app did its job and didn’t just care about money.","userName":"Yazmeen88","date":"2020-07-09T16:14:25Z","title":"THE WORST APP!!!","isEdited":false}},{"id":"6177269188","type":"user-reviews","attributes":{"rating":1,"review":"Every time I would open the app, it would crash within 10 seconds of me opening it. I was not even able to interact with the pages. Please get this sorted out.","userName":"Cmarler536","date":"2020-07-09T15:59:58Z","title":"Kept crashing","isEdited":false}},{"id":"6177257608","type":"user-reviews","attributes":{"rating":1,"review":"THIS APP HAS SERVERS IN A PLACE OUTSIDE OF THE USA AND IS NOT TRUSTWORTHY. Obviously this app is trying to steal the information off my phone to overthrow the US government. I could TOTALLY see how I, a normal, NOT a government employee, and NOT A THREAT TO ANY COUNTRY'S government system, could provide such information. Plus this app glitches every time I look at it.","userName":"Zozeyanne","date":"2020-07-09T15:56:30Z","title":"Invasion of privacy","isEdited":false}},{"id":"6177247421","type":"user-reviews","attributes":{"rating":1,"review":"When I opened the app it repeatedly was crashing and shutting off my phone. Not only is the app itself bad. But I also find it blasphemous that our President has his own app. This is ridiculous. Get this app off the App Store NOW!","userName":"Cobranono","date":"2020-07-09T15:53:32Z","title":"Glitches","isEdited":false}}]}