{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31280","data":[{"id":"6173058450","type":"user-reviews","attributes":{"title":"DONT DOWNLOAD THIS APP","rating":1,"userName":"DESHAWN2020","date":"2020-07-08T17:19:21Z","isEdited":false,"review":"I downloaded this app to see why I should vote for trump and there was nothing that would persuade me to vote for him in the upcoming 2020 election so sense this app is completely useless I deleted it because it had no good info of what trump is gonna do for this country and why u shouldn’t vote for trump.  DON’T DOWNLOAD THIS APP ITS A WASTE OF STORAGE AND TIME."}},{"id":"6173056461","type":"user-reviews","attributes":{"title":"Horrible","rating":1,"userName":"Yamz🥀","date":"2020-07-08T17:18:43Z","isEdited":false,"review":"I would start off by saying this app is horrible as the title says, I got this app and instantly says it couldn’t download not only that everytime I got in it would kick me out and the lag and glitches on this thing is disgusting"}},{"id":"6173044505","type":"user-reviews","attributes":{"title":"DO NOW DOWNLOAD","rating":1,"userName":"ladyg101","date":"2020-07-08T17:14:58Z","isEdited":false,"review":"the app completely ruined my iphone. it gives absolutely no information & instead sells your information & crashes your phone. apple, please remove this app before more people ruin their iphones & switch to droids."}},{"id":"6173042944","type":"user-reviews","attributes":{"title":"WORST APP EVER!","rating":1,"userName":"Nicholas331","date":"2020-07-08T17:14:28Z","isEdited":false,"review":"There are so many bugs with this app it barely functions. App crashes 90% of the time I open it and for some reason when it does work, it just shows me pictures of white supremacist. If I could give 0 stars I would do so in a heartbeat."}},{"id":"6173040755","type":"user-reviews","attributes":{"title":"DELETE THIS APP","rating":1,"userName":"fl0werj0y","date":"2020-07-08T17:13:46Z","isEdited":false,"review":"As an individual old enough to. Vote this app just demonstrated disgusting images I would not like to lay my eyes on it’s also glitching my phone it said it was downloaded and was never on my phone take this app down now it will break your phone"}},{"id":"6173029520","type":"user-reviews","attributes":{"title":"Would not recommend","rating":1,"userName":"fiesta salsa quinceneda","date":"2020-07-08T17:10:19Z","isEdited":false,"review":"I downloaded this app to find a reason to vote for our persistent but the apps broken every time I open it there’s a glitch where it’s just 🍊 and I would give it a -10/10 rating"}},{"id":"6173011356","type":"user-reviews","attributes":{"title":"TOTAL DISASTER","rating":1,"userName":"wkshdhdjdjdh","date":"2020-07-08T17:04:41Z","isEdited":false,"review":"This app genuinely is the worst app to ever be made. The fact that once i downloaded the app robots were sent to my door and started throwing LARGE metal balls at my window like the size of the ones from miley cyrus’ music video worst app ever i have NEVER SUPPORTED TRUMP IN MY LIFE. But i wanted to see what this orange lookin racist bastard had to say."}},{"id":"6173011323","type":"user-reviews","attributes":{"title":"Worst app ever","rating":1,"userName":"fsstyuj","date":"2020-07-08T17:04:41Z","isEdited":false,"review":"Trump is over heat thinking he’s so cool because he said all of this stufff he was gonna do but he didn’t do it. The app was also horrible to navigate and had fake news on it. Don’t recommend getting it and hope this app gets deleted!!!!!"}},{"id":"6172990195","type":"user-reviews","attributes":{"title":"r r r roll up to the party in my crazy pinky wig","rating":1,"userName":"hghitgjrgy","date":"2020-07-08T16:58:18Z","isEdited":false,"review":"R- r- r- roll up to the party with my crazy pink wig\nBut I can't get through the door because my booty’s too big\nOne percent is human, ninety-nine is plastic\nJust a sec, I gotta fix my lips\nThese ho's are jealous, 'cause their mans want me\nI can’t believe it, that girl's so sexy\nDude are you crazy, I think that's a tranny \nCheck me out, check me out\nCheck me out, check me out\nCheck me out, check me out\nCheck her out, dude you can see it poppin' out!\nCheck me out, check me out\nCheck me out, haha"}},{"id":"6172919154","type":"user-reviews","attributes":{"title":"FURIOUS WITH THIS POINTLESS APP","rating":1,"userName":"leedog4reviewin","date":"2020-07-08T16:36:13Z","isEdited":false,"review":"This app crashed my whole phone. I couldn’t click it without my phone completely turning off, to the point where when you have to hold the power button to get it back on. ON TOP OF THAT it also drained my battery tremendously!!!"}}]}