{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=75510","data":[{"id":"6172851807","type":"user-reviews","attributes":{"userName":"bernie sandars","title":"tik tok pls","rating":1,"review":"ugh this app is so bad. i downloaded this 5 years ago and has barely started to download. the sounds attracted roaches to my bedroom and a wall appears in the middle of the street with a duck that said it was an update. welll what a lousy update","isEdited":false,"date":"2020-07-08T16:15:39Z"}},{"id":"6172842107","type":"user-reviews","attributes":{"userName":"YEET! YEET! YALL!","title":"Absolutely Terrible 😤","rating":1,"review":"this app is so bad and needs to be off the app store, Trump 2020 ✨🥰🧚but make it out of office. just... no❤️","isEdited":false,"date":"2020-07-08T16:12:44Z"}},{"id":"6172839342","type":"user-reviews","attributes":{"userName":"Tj mic mix","title":"Racist","rating":1,"review":"He’s a racist, homosexual, sexist man. He doesn’t deserve my vote nor my need to care for his well being.","isEdited":false,"date":"2020-07-08T16:11:55Z"}},{"id":"6172790734","type":"user-reviews","attributes":{"userName":"hahshdbdbdvbd","title":"Horrible don’t use!!!!!!","rating":1,"review":"Contains racist sexist and goes against blm please “baby lives matter” horrible","isEdited":false,"date":"2020-07-08T15:57:56Z"}},{"id":"6172802171","type":"user-reviews","attributes":{"userName":"livedglint4065","title":"Goood app such a good one","rating":5,"review":"Good app and I support trump 2020","isEdited":false,"date":"2020-07-08T16:01:15Z"}},{"id":"6172772135","type":"user-reviews","attributes":{"userName":"mattyma34x","title":"I dont like trump","rating":1,"review":"I got this app to see what I think about trump, turns out, i dont like him.","isEdited":false,"date":"2020-07-08T15:52:39Z"}},{"id":"6172770513","type":"user-reviews","attributes":{"userName":"trump lives dont matter","title":"Wish I could give it a zero star","rating":1,"review":"He is destroying America","isEdited":false,"date":"2020-07-08T15:52:12Z"}},{"id":"6172757972","type":"user-reviews","attributes":{"userName":"eggggghhhhgh","title":"Bad app","rating":1,"review":"So I got the app and it immediately crashed my phone","isEdited":false,"date":"2020-07-08T15:48:35Z"}},{"id":"6172745269","type":"user-reviews","attributes":{"userName":"Nicfki","title":"Worst app","rating":1,"review":"This app is so awful, I couldn’t stay on the app more that 5min it’s was so laggy,","isEdited":false,"date":"2020-07-08T15:44:56Z"}},{"id":"6172744273","type":"user-reviews","attributes":{"userName":"aededed","title":"Terrible app disgusting","rating":1,"review":"This app took 2 weeks to download and when it was downloading it made my phone smell terrible but when it finally downloaded it asked for my social sicurity number and address and when I did a week later FBI agents came to my house and shot my dog and gave me a fine of 100,00$ other than that this app gave my phone a bug and every time i tried to show my family the app so they can see what’s going on with the government my daughter with epilepsy had a seizure and so we had to take her to the hospital and sadly passed away all because of this app the app also gave my phone a bug which made me have to buy a new phone and also sometimes Cheeto dust would just apear on the screen and in my house no one eats Cheetos nor do we buy them so I’m guessing it came from the president and also the next day my son was playing on my phone and wanted to go in the app and he started to watch a video of one of the presidents speeches and I was in the other room so I could hear the speech from the kitchen while he was on the couch in the family room and I heard the president cough in the speech and then my son started coughing uncontrollably I till the point where he couldn’t breath so we rushed him to the hospital and when we got there we found out this app had given my son COVID-19 and the doctors said it was to late for him and he died all because of this app you took away 2 of my 6 kids because of this app there is no way I am voting for you or supporting you anymore!","isEdited":false,"date":"2020-07-08T15:44:38Z"}}]}