{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=141080","data":[{"id":"6179458525","type":"user-reviews","attributes":{"rating":1,"userName":"M Desirae G","review":"Once I downloaded this app to get the latest news about Donald Trump . Once I downloaded this app my phone started going crazy and a lot of fake text messages were sent to my phone and My phone started shutting down randomly and it would send me fake notifications and messages about what is going on in the USA and I had to get a Whole new phone because me phone was infiltrated by This app. My email and phone number were sent fake messages and emails so in conclusion DOO NOT DOWNLOAD THIS APP","title":"Do Not Download THIS APP","isEdited":false,"date":"2020-07-10T04:37:14Z"}},{"id":"6179458454","type":"user-reviews","attributes":{"rating":1,"userName":"ml683","review":"My phone continuously froze and crashed while using this app. I think my information was stolen from this app as well I have not stopped receiving scam texts and calls since downloading this app. Even after deleting the app my phone won’t stop bugging out. DONT GET THIS APP!!!","title":"Do not get this app.","isEdited":false,"date":"2020-07-10T04:37:13Z"}},{"id":"6179458275","type":"user-reviews","attributes":{"rating":1,"userName":"Cglickauf","review":"App doesn’t work. Very glitchy. Not worth it.","title":"Not good","isEdited":false,"date":"2020-07-10T04:37:10Z"}},{"id":"6179458127","type":"user-reviews","attributes":{"rating":1,"userName":"f. d. t.","review":"Once upon a time there was a lovely princess. But she had an enchantment upon her of a fearful sort, which could only be broken by Love's first kiss. She was locked away in a castle guarded by a terrible fire breathing dragon. Many brave knights had attempted to free her from this dreadful prison, but none prevailed. She waited in the dragon's keep in the highest room of the tallest tower for her true love and true love's first kiss. Like that's ever going to happen. What a loony. Shrek Beware Stay out I think he's in here. All right. Lets get it! Hold on. Do you know what that thing can do to you? Yeah. He'll groan into your bones for his brains. Well actually that would be a giant. Now Ogres, huh, they are much worse. They'll make a soup from your freshly peeled skin. They'll chew your livers, squeeze the jelly from your eyes. Actually, it's quite good on toast. Back, back beast, back! I warned you!","title":"THIS APP KILLED MY FAMILY!!!","isEdited":false,"date":"2020-07-10T04:37:07Z"}},{"id":"6179458105","type":"user-reviews","attributes":{"rating":1,"userName":"eliah lilian","review":"Confusing app🤭","title":"No","isEdited":false,"date":"2020-07-10T04:37:06Z"}},{"id":"6179457899","type":"user-reviews","attributes":{"rating":1,"userName":"candyyy62","review":"slow ass app too many political adds.","title":"Wow. - Owen Wilson","isEdited":false,"date":"2020-07-10T04:37:02Z"}},{"id":"6179457896","type":"user-reviews","attributes":{"rating":1,"userName":"Gcie","review":"truly the worst app you can get don’t even bother","title":"worst app ever","isEdited":false,"date":"2020-07-10T04:37:02Z"}},{"id":"6179457532","type":"user-reviews","attributes":{"rating":1,"userName":"burger kings daddy 😜","review":"I had to reload this app 531,600 times until and uncrustable pb & j sandwich has not melted yet \n\nYeye😭🤠 \n\nSend help🤬😢😢😢😢","title":"😢","isEdited":false,"date":"2020-07-10T04:36:54Z"}},{"id":"6179457348","type":"user-reviews","attributes":{"rating":1,"userName":"i dont like oranges","review":"Right when I downloaded the app I saw an orange pop up and it scared me and my cat, like no seriously my cat took a fat d00ki3. AND I DONT EVEN OWN A CAT. Also it’s almost like the orange wanted to seduce me or something. Maybe it’s because I’m more than 40 years younger than him. But from what I heard he’s mostly attracted to his daughter, even more than malaria(his wife). But yeah I don’t recommend this app at ALL. Period.","title":"Worst experience","isEdited":false,"date":"2020-07-10T04:36:50Z"}},{"id":"6179457140","type":"user-reviews","attributes":{"rating":1,"userName":"Jam McKocinner","review":"Oh. He stole it and rubbed the remaining Cheetos all over his c00chie :/","title":"Where is my Cheeto bag?","isEdited":false,"date":"2020-07-10T04:36:46Z"}}]}