{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=45270","data":[{"id":"6172971492","type":"user-reviews","attributes":{"date":"2020-07-08T16:52:33Z","isEdited":false,"title":"terrible","review":"doesn’t even work and takes forever to download and when it did it wouldn’t let me in the app at all. once i did get in it kicked me out and i wasn’t able to open that app at all for days. how am i suppose to support my president and get some knowledge when the app can’t work. it’s a waste of your time and should just be deleted.","userName":"ughfhgh","rating":1}},{"id":"6172968797","type":"user-reviews","attributes":{"date":"2020-07-08T16:51:44Z","isEdited":false,"title":"This is trash","review":"I’m sorry but this is a terrible app. I don’t care how much you spent on the app but I hope you will regret banning TikTok in the US so... yeah good luck making this app last long enough to survive!","userName":"fluffypotatoboii","rating":1}},{"id":"6172963631","type":"user-reviews","attributes":{"date":"2020-07-08T16:50:09Z","isEdited":false,"title":"🖕👁👅👁🖕","review":"This app has got to be the worst price of garbage app i have ever had the misfortune of downloading. It sent my browser history to my mom and now they know how much i like looking at frog thighs, thanks a lot cheeto puff man.","userName":"eat doodoo klansmembers","rating":1}},{"id":"6172953664","type":"user-reviews","attributes":{"date":"2020-07-08T16:47:02Z","isEdited":false,"title":"THIS APP IS TERRIBLE","review":"So when I downloaded this app it instantly told me to be super racist and too tan myself until I’m an orange. Then it told me to cut off all my hair and get a crappy blonde wig from the dollar store. And then it said that I was a poopoo head.","userName":"\\>|!|€{£]","rating":1}},{"id":"6172940362","type":"user-reviews","attributes":{"date":"2020-07-08T16:42:53Z","isEdited":false,"title":"Worst app ever","review":"So this app is supposed to give me a reason to vote for Donald Trump but I could not find a reason so that’s why I would give this app one star and I would rather elect michelle Obama if she were to run for president.","userName":"Worst president","rating":1}},{"id":"6172923035","type":"user-reviews","attributes":{"date":"2020-07-08T16:37:26Z","isEdited":false,"title":"delete this app","review":"has not a single piece of information about what’s actually happening in america just a bunch of orange man asking for money so he can continue to burn america to the ground and not care about any of the minorities or people of color or lgbtq+or natives ! i did not see a single name in tribute to those who lost their lives to police brutality ~  if you support trump you are supporting a racist movement","userName":"woofenhopper","rating":1}},{"id":"6172903505","type":"user-reviews","attributes":{"date":"2020-07-08T16:31:18Z","isEdited":false,"title":"Worst president and app ever","review":"I am here just to simply say to cancel this man in any way shape or form because he is doing no good for this country. In fact, Obama did more in 1 year than trump will ever do in all his presidency.","userName":"ltjejtugjw","rating":1}},{"id":"6172887453","type":"user-reviews","attributes":{"date":"2020-07-08T16:26:23Z","isEdited":false,"title":"Horrible app","review":"The first problem was installing the app which took 3 weeks! While I was trying to open the app lice started hopping out the screen! Worst app I’ve ever seen and heard of😡🤮","userName":"ababhahagegeyi","rating":1}},{"id":"6172885449","type":"user-reviews","attributes":{"date":"2020-07-08T16:25:47Z","isEdited":false,"title":"Very Glitchy","review":"I was using this app and it was very glitchy and also trumps is just not it luv. Like fr I’m not rly in the mood for a racist pres so yeah. But if we are just talking about the app itself that crap is way to glitchy FIX IT.","userName":"juanita the fourth","rating":1}},{"id":"6172884573","type":"user-reviews","attributes":{"date":"2020-07-08T16:25:31Z","isEdited":false,"title":"The worst “app” ever","review":"I came her from the recommendation of a friend. I was disgusted by what I found. Can’t even call this trash an app. Not useful, bad images, even some ugly orange guy. Look elsewhere if you want liberty.","userName":"zellenial","rating":1}}]}