{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27270","data":[{"id":"6178229711","type":"user-reviews","attributes":{"date":"2020-07-09T21:01:27Z","title":"i’m gonna kms","userName":"drinkpoisondonald","rating":1,"isEdited":false,"review":"my phone started glitching really badly and turned off and on by itself. this happened right when i downloaded it. if my phone doesn’t want to have THIS app then what makes u think we should want cheeto man to be our president"}},{"id":"6178225378","type":"user-reviews","attributes":{"date":"2020-07-09T20:59:54Z","title":"Worse than Flappy Bird","userName":"MaydayAbbie","rating":1,"isEdited":false,"review":"I wish I could give this app lower than 1 star. The graphics on the app are so poor I could barely read the text provided. There are very few political issues covered. I would rather see flappy bird on the AppStore than this unhelpful and useless app."}},{"id":"6178217307","type":"user-reviews","attributes":{"date":"2020-07-09T20:57:05Z","title":"no❤️","userName":"Molly jean green bean","rating":1,"isEdited":false,"review":"i downloaded the app in hopes of finding info on rallies. instead, the second it finished downloading my house burst into flames and killed my little brothers. meanwhile, both my cats immediately shed all of their fur and by shed i mean it all just dropped right off their bodies. also my skin began to wrinkle and breakout, looking extremely similar to the scene in tangled where mother gothel is defeated and turned old. not to mention my phone flooded with images of a homophobic misogynistic racist rapist. in conclusion, this app ✨ s u c k s ✨thank you for your time."}},{"id":"6178209609","type":"user-reviews","attributes":{"date":"2020-07-09T20:54:19Z","title":"Disturbing and not child friendly!!!","userName":"PureBoiBeeBee","rating":1,"isEdited":false,"review":"I got this app to educate my child on trump. She is HEAVILY democratic and I thought this would teach her. However it did the opposite!!! This gave her much more information to support her fascist claims and I’m disgusted that our president let these lies on HIS OFFICIAL APP!!! Do not download, a waste of time and space."}},{"id":"6178155521","type":"user-reviews","attributes":{"date":"2020-07-09T20:35:30Z","title":"HORRIBLE","userName":"I hate this app 45683","rating":1,"isEdited":false,"review":"With this app, my phone started dying very quickly. I've never had this problem before and I even deleted many apps and photos and it was still doing it until I finally deleted the app. I do not recommend."}},{"id":"6178131671","type":"user-reviews","attributes":{"date":"2020-07-09T20:27:29Z","title":"Got this app","userName":"Peanutbutterandgiggles","rating":1,"isEdited":false,"review":"Kept crashing and made my phone incredibly slow. It also killed my phone battery and I just got a new phone so my phone is not the issue. I’m very upset, don’t bother getting this because it’s just broken dreams."}},{"id":"6178128024","type":"user-reviews","attributes":{"date":"2020-07-09T20:26:13Z","title":"TERRIBLE 🤢🤮","userName":"pence mike","rating":1,"isEdited":false,"review":"this app is terrible. as soon as i opened it, there was an ad for goggles to wear when getting a stay tan that make it as obvious as possible to see that you got a spray tan. then when i finally got off the ad, an angry cheeto was yelling at me telling me to inject myself with disinfectant. do not recommend"}},{"id":"6178127649","type":"user-reviews","attributes":{"date":"2020-07-09T20:26:05Z","title":"App keeps on crashing and asking for personal data","userName":"Chfifuvyhcy","rating":1,"isEdited":false,"review":"I don’t like it how this app is constantly crashing my phone and asking for unnecessary data 0/10. They should definitely be taken off the App Store. this is worse than China!!"}},{"id":"6178123724","type":"user-reviews","attributes":{"date":"2020-07-09T20:24:46Z","title":"Discease to our country","userName":"Unkinamous","rating":1,"isEdited":false,"review":"Trip is not a good man. He didn’t care for our people and he didn’t for his family. As for his words that he sexually thought about his daughter more than his wife. And he is racist, balance, and unable to keep this country in place."}},{"id":"6178103702","type":"user-reviews","attributes":{"date":"2020-07-09T20:18:05Z","title":"I LOVE THIS APP","userName":"igfsbfeg","rating":5,"isEdited":false,"review":"I got this app to see new and what trumps plans were and I love the lay out and the way things are organized anyways TRUMP 2020 🇺🇸🇺🇸"}}]}