{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=20350","data":[{"id":"6178767068","type":"user-reviews","attributes":{"rating":1,"title":"I care about this like Trump cares about people.","userName":"Elvis, not THAT one.","isEdited":false,"review":"This app, like POTUS, is the worst ever.  If this app stays around it will\nruin the internet just like Trump has ruined our country.    If you care about democracy, Black lives, social justice, the environment, free speech, the press, decency, compassion and civility, you should never listen to another word this President says.   There’s one way to salvage 2020–11/3–VOTE!  \n🤮🤢","date":"2020-07-10T00:28:36Z"}},{"id":"6178726386","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE APP","userName":"Asia Sain","isEdited":false,"review":"This is a horrible app if I were  you I would  not get this it is a useless  waist of space  after I downloaded it my whole dark screen turned red this is  not what I asked for.  To add to that   all my photos got an orange tint on them now and every time I opened my phone it say make america great agin do not get DO NOT waist of space and time.","date":"2020-07-10T00:12:50Z"}},{"id":"6178693862","type":"user-reviews","attributes":{"rating":1,"title":"READ THIS","userName":"Letsstopnow21","isEdited":false,"review":"This app is disgusting🤢also I’m a Genz so IF YOU COME FOR ONE OF US YOU COME FOR ALL OF US. SO WHAT’S GOOD ‼️👀 WE aint GONNA NOWHERE PERIOD‼️we gonna stay on TikTok and there’s nothing you can ABOUT IT. This ain’t just for him but for all of the people in this section talking about some the people on TikTok need to stop and commenting on this app. COME ON NOW LIKE REALLY. The ones that supporting him that’s not a President🍊y’all sick ugly mf need to stop. YALL GOT A PROBLEM.","date":"2020-07-10T00:00:21Z"}},{"id":"6178635553","type":"user-reviews","attributes":{"rating":1,"title":"Very Bad App!!","userName":"Aniyay","isEdited":false,"review":"this app took 2 days to download!!! and when it finally did it just kept closing out!! how can i possibly keep up with president trump’s campaign if the app doesn’t stay open for more than 3 minutes :( there needs to be some serious changes made before i download this app again!!","date":"2020-07-09T23:37:35Z"}},{"id":"6178617448","type":"user-reviews","attributes":{"rating":1,"title":"THE WORST APP EVER","userName":"wtfffwhatnamethen","isEdited":false,"review":"My phone crashed as soon as I opened it and then I had the hardest time looking for something on the app it’s soo unorganized like it’s unbelievable. I can’t with the app. All the gen z people were right oh my god I thought you were lying but turns out they weren’t. I’m warning some of you don’t download the app I mean like never download it","date":"2020-07-09T23:30:38Z"}},{"id":"6178470350","type":"user-reviews","attributes":{"rating":1,"title":"WORST APP EVER","userName":"celest0517","isEdited":false,"review":"i was just trying to support my president by downloading this app but it unleashed a VIRUS into my phone!!! I COULDNT USE MY PHONE FOR A WEEK! this is the worst app i’m EVER come across. when i opened the app, i started getting verbally abused! the app was cursing and saying rude things to me. i can’t even explain how long it took for the app to download!! i definitely do not recommend this app!","date":"2020-07-09T22:32:26Z"}},{"id":"6178457563","type":"user-reviews","attributes":{"rating":1,"title":"Almost died","userName":"cece8105","isEdited":false,"review":"I was told masks weren’t important by the trump administration so I refused to wear one. My dog seeing my actions followed my guide. My dog ran away yesterday and came back with the Corina virus since he wasn’t wearing a mask. He infected my parrot, my cat, and my goldfish. My goldfish is in critical condition and probably won’t make it past tonight. Do not trust these news!!!! Fake news! Law and order!","date":"2020-07-09T22:27:20Z"}},{"id":"6178454124","type":"user-reviews","attributes":{"rating":1,"title":"I think this is a scam","userName":"last name condiment","isEdited":false,"review":"If I could give this app 0 stars I would. This app took forever to download and then took up most of the space on my phone! I also think that they are stealing my information and giving it away. This is not for trump supporters this is a fake app trying to waste our time!","date":"2020-07-09T22:26:00Z"}},{"id":"6178412887","type":"user-reviews","attributes":{"rating":1,"title":"TeRiBlE 🤮🤮🤮🤮","userName":"@itz.amariya on tiktok","isEdited":false,"review":"So basically what had happen was he had think he app was good and it’s not, not to mention it kept blowing my phone up with alerts of his every move as if I care like no that’s not even okay and I really hate that it kept telling me when his fat behind ate a salad like okay and his body still looks trashy but yea that’s about it","date":"2020-07-09T22:09:58Z"}},{"id":"6178388269","type":"user-reviews","attributes":{"rating":1,"title":"traumatized","userName":"wewillendthis","isEdited":false,"review":"i think someone is watching me through my camera and i’m so scared that they’re catching me lacking bc i am NOT photogenic. anyway this app took 36 gigabits on my phone and made it all slower. very disappointing app and terrible quality. also some rando number has been calling me ever since i downloaded it. not scared bc i ain’t no p****y. hehe","date":"2020-07-09T22:00:31Z"}}]}