{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27470","data":[{"id":"6174592249","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This App..oh no","review":"This was is horrible it’s the worst I waste my time to download this in this app is horrible I would not recommend it do not get it it’s straight up horrible I did not want to see an orange Cheeto running around no ma’am I do not want to see that see it orange Cheeto ruin this country thank you","userName":"BABABAIHATETHISAPP","date":"2020-07-09T02:06:00Z"}},{"id":"6174574889","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"It’s to glitchy and plz “stop” the fake reviews","review":"Hey so I got this to keep up and see the things trump is doing then my phone started to kick me out of if.... it got worse and worse and now my phone is glitching like crazy and now if I have the app open it crashes my phone... DONT DOWNLOAD!!!","userName":"xXMelonWolfXx","date":"2020-07-09T02:01:04Z"}},{"id":"6174570754","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"I Love Kanye","review":"I miss the old Kanye, straight from the go Kanye\nChop up the soul Kanye, set on his goals Kanye\nI hate the new Kanye, the bad mood Kanye\nThe always rude Kanye, spaz in the news Kanye\nI miss the sweet Kanye, chop up the beats Kanye\nI gotta to say at that time I'd like to meet Kanye\nSee I invented Kanye, it wasn't any Kanyes\nAnd now I look and look around and there's so many Kanyes\nI used to love Kanye, I used to love Kanye\nI even had the pink polo, I thought I was Kanye\nWhat if Kanye made a song about Kanye\nCalled \"I Miss The Old Kanye, \" man that would be so Kanye\nThat's all it was Kanye, we still love Kanye\nAnd I love you like Kanye loves Kanye","userName":"bcjslvk","date":"2020-07-09T01:59:56Z"}},{"id":"6174550512","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Horrible,","review":"When I first opened the app my hamster accidentally fell from a 716 feet building and I was \nTraumatized I literally stopped eating for two and a half days straight. Loads of tears came falling down I couldn’t even close my eyes due to this depression, then I was diagnosed with anxiety, dysthymic disorder, eating disorder and more.. 😞","userName":"ᴊᴀɴᴇᴛʜ","date":"2020-07-09T01:54:02Z"}},{"id":"6174543467","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"TRIGGER WARNINGS PLEASE","review":"I am very VERY very offended. How dare you make me witness a Orange man knowing I’m allergic to oranges! \nMy allergies is VERY serious and life threatening. I thought I could trust my very handsome president. But apparently not! He tricked me and now I’m on the way to the ER. And since I live in America. I will not be able to pay my bills. So now I’m homeless and an orange man is my President rip.","userName":"edwardloverforever","date":"2020-07-09T01:51:58Z"}},{"id":"6174537846","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"I hate this app","review":"Why is this app even created everybody hates it except the people who love and honestly I still think Barack Obama is my president and whey is TikTok being banned. I feel like president trump he’s not even president to me but still I feel like he’s focusing on the wrong thing. So can this please be banned .","userName":"JordanMetcalfe12","date":"2020-07-09T01:50:22Z"}},{"id":"6174536778","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"TERRIBLE APP!","review":"This app is just so TERRIBLE, I HATE IT! It’s super slow and it’s a hate symbol. This app is disgusting and super offensive. Please remove it from the app store. it’s am embarrassment to our society. It’s a hate crime. This app needs to be removed. It’s super laggy and it’s freezes a lot. Thank you. 10/10 DO NOT recommend. This app is traumatizing... yuck","userName":"yourmeowingmom","date":"2020-07-09T01:50:03Z"}},{"id":"6174535812","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Deleting immediately","review":"One of the worst things I’ve ever put on my phone. Almost barfed even having to type trump 2020 into the App Store. Needs to be removed from the AppStore immediately I don’t want any kids to have to be put through this kind of a cult","userName":"Gracelikespopcorn","date":"2020-07-09T01:49:47Z"}},{"id":"6174534993","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Disappointed","review":"It was such a bad app it kept glitching, every time I opened the app a giant greasy Cheeto popped up on the screen, and my future un born child started weeping . It also had this really misleading slogan that stated “ Keep America great”. That’s so weird cuz America has never been great.... overall this app is really questionable.","userName":"Kirky love","date":"2020-07-09T01:49:34Z"}},{"id":"6174525100","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Therapy needed","review":"I opened this app and immediately started projectile vomiting. My poor young eyes were meet with a large orange man and his little balls. I wanted to scream. I wanted to cry. I had to start seeing a therapist. This is not safe for children. This app also caused my phone to self implode which is an odd feature.","userName":"MHXav","date":"2020-07-09T01:46:48Z"}}]}