{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=111280","data":[{"id":"6174376954","type":"user-reviews","attributes":{"date":"2020-07-09T01:03:09Z","review":"it’s a no from me luv ❤️","isEdited":false,"userName":"sairazk","rating":1,"title":"for the cheeto man"}},{"id":"6174354039","type":"user-reviews","attributes":{"date":"2020-07-09T00:55:48Z","review":"Okay RHIS IS AMERICA DONT HURT ANY OF US WE ARE POWERFUL  U HAVE DONE NOTHING TO SAVE US U PUT US IN SOMETHING AND NOW GUESS WHAT YOUR APP IS GETTING TAKEN DOWN B I TCH🥰🥰🥰😍😍😍❣️❣️❣️💓💞💞💕💕💘♥️♥️💖💖❤️❤️❤️","isEdited":false,"userName":"Lasandra dee","rating":1,"title":"DELETE THIS APP!"}},{"id":"6174353141","type":"user-reviews","attributes":{"date":"2020-07-09T00:55:29Z","review":"child molester","isEdited":false,"userName":"kth1234567","rating":1,"title":"NO❤️"}},{"id":"6174258740","type":"user-reviews","attributes":{"date":"2020-07-09T00:23:29Z","review":"all I saw was 🍊","isEdited":false,"userName":"Bri❤️✨","rating":1,"title":"No❤️"}},{"id":"6174255340","type":"user-reviews","attributes":{"date":"2020-07-09T00:22:18Z","review":"You take my app ILL TAKE YOURS","isEdited":false,"userName":"noname1203","rating":1,"title":"🖕"}},{"id":"6174252932","type":"user-reviews","attributes":{"date":"2020-07-09T00:21:28Z","review":"I saw cheetoh man bunker boi. No thanks❤️","isEdited":false,"userName":"sopmeh","rating":1,"title":"AWFUL APP! DO NOT DOWNLOAD!"}},{"id":"6174246442","type":"user-reviews","attributes":{"date":"2020-07-09T00:19:20Z","review":"This man disgusts me :)","isEdited":false,"userName":"cheetoburner","rating":1,"title":"I’m scared"}},{"id":"6174232268","type":"user-reviews","attributes":{"date":"2020-07-09T00:14:13Z","review":"i hate this app.","isEdited":false,"userName":"mackybill2004","rating":1,"title":"vomit"}},{"id":"6174200221","type":"user-reviews","attributes":{"date":"2020-07-09T00:02:16Z","review":"Talking ignorant Cheetos give me nightmares","isEdited":false,"userName":"ButterflyMilk🦋","rating":1,"title":"✊✊🏽✊🏾✊🏿"}},{"id":"6174192697","type":"user-reviews","attributes":{"date":"2020-07-08T23:59:27Z","review":"GRANDPA JOE: When a loaf of bread looks like a banquet, I've \nno right buying tobacco.\nCHARLIE: Go on, Grandpa.  Please take it.\n5. BUCKET'S HOUSE - LATER THAT NIGHT\nCHARLIE: After I finished my paper route, I was in front of \nWonka's.  There was this strange man there.  I think he was \na tinker.  He was standing right behind me, looking up at \nthe factory.  Just before he left he said, \"Nobody ever goes \nin, and nobody ever comes out.\"\nGRANDPA JOE: And right he was, Charlie.  Not since the \ntragic day that Willy Wonka locked it.\nCHARLIE: Why'd he lock it?\nGRANDPA JOE: Because all the other chocolate makers in the \nworld were sending in spies--dressed as workers!--to steal \nMr. Wonka's secret recipes.  Especially Slugworth . . . oh, \nthat Slugworth, he was the worst!  Finally Mr. Wonka \nshouted, \"I shall be ruined!  Close the factory!\"  And \nthat's just what he did.  He locked the gates and vanished \ncompletely.  And then suddenly, about three years later, the \nmost amazing thing happened.  The factory started working \nagain, full blast!  And more delicious candies were coming \nout than ever before.  But the gates stayed locked so that \nno one, not even Mr. Slugworth, could steal them.\n\nCHARLIE: But Grandpa, someone must be helping Mr. Wonka work \nthe factory.\nGRANDPA JOE: Thousands must be helping him.\nCHARLIE: But who?  Who are they?\nGRANDPA JOE: That is the biggest mystery of them all.\n6. SCHOOL\nMR. TURKENTINE: Charlie Bucket.\nCHARLIE: Yes, Mr. Turkentine?\nMR. TURKENTINE: I shall need an assistant.  Come and give me \na hand.  \n     (Charlie joins him at the front.)\nWe have here nitric acid, glycerin, and a special mixture of \nmy own.  Together it's horrible, dangerous stuff; blows you \nup.  But mixed together in the right way, as only I know \nhow, what do you think it makes?\nCHARLIE: I don't know, sir.\nMR. TURKENTINE: Of course you don't know.  You don't know \nbecause only I know.  If you knew and I didn't know, then \nyou'd be teaching me instead of me teaching you.  And for a \nstudent to teach his teacher is presumptuous and rude.  Do \nI make myself clear?\nCHARLIE: Yes, sir.\n     (The students laugh.)\nMR. TURKENTINE: Good.  Now, mixed together in the right way, \nthese three highly dangerous ingredients make the finest \nwart remover in the world.  The trick is to pour them in in \nequal amounts.  Now, Charlie, you take the nitric acid and \nthe glycerin, and I'll take my own special mixture.  You \nready?  Good lad: pour.\n     (They pour; the mixture emits a small boom and a large \n     puff of smoke.  The kids cheer.)\nCHARLIE: Did we do it wrong?\nMR. TURKENTINE: No, certainly not; this is for very big \nwarts.\n     (Commotion in the hall.)\nKID #1 (O.C.): I'm gonna get there first.  Get out of my \nway.\nMR. TURKENTINE:  Now what's going on out there?\nKID #2 (O.C.): I hope there's still some left.\n     (Mr. Turkentine opens the door.)\nMR. TURKENTINE: You, Winkelmann, come here.  What's \nhappening?\nWINKELMANN: Willy Wonka's opening his factory; he's gonna \nlet people in.\nMR. TURKENTINE: Are you sure?\nWINKELMANN: It's on the radio.  And he's giving truckloads \nof chocolate away.\nMR. TURKENTINE: Class dismissed!\nWINKELMANN: No, no, it's only for five people.\nMR. TURKENTINE: Class un-dismissed.\nWINKELMANN: He's hidden five Golden Tickets, and the people \nwho find them will win the big prize.\nMR. TURKENTINE: Where's he hidden the tickets?\nWINKELMANN: Inside five Wonka Bars!  You gotta buy Wonka \nBars to find 'em!\nMR. TURKENTINE: Class re-dismissed!\nKID #3 (O.C.): I'll meet you downstairs.\nKID #4 (O.C.): I'm gonna buy the whole store!\n     (Commotion continues; kids saying, \"I'm gonna . . .\" \n     fades into the general wash of noise.)\n7. NEWSROOM\nTV NEWSMAN: And now, details on the sudden announcement that \nhas captured the attention of entire world.  Hidden among \nthe countless billions of Wonka Bars are five gold tickets.  \nAnd to the five people who find them will come the most \nfabulous prize one could wish for: a lifetime supply of \nchocolate.\n8. BUCKETS' HOUSE\nTV NEWSMAN (on TV): (continuous) And as if this were not \nenough, each winner before he receives his prize will be \npersonally escorted through the top secret chocolate factory \n. . .\nGRANDMA JOSEPHINE: (on \"escorted\") They're all crazy!\nGRANDPA JOE: Sssshhh!  The man's a genius!  He'll sell a \nmillion bars.\nTV NEWSMAN: (continuous) . . . by the mythical Willy Wonka \nhimself.  The amount of chocolate involved in this \ncompetition has relighted*** the imagination to incite*** \ncandy eaters and all citizens around the world.\nCHARLIE: (on \"involved\") Grandpa, do you think I've got a \nchance to find one?\nGRANDPA JOE: One?  I'm counting on you to find all five\ndarn i could only fit a little","isEdited":false,"userName":"loakejs","rating":1,"title":"HORRIBLE! MADE MY UNCLES KID CRY!!!"}}]}