{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=7250","data":[{"id":"6175736454","type":"user-reviews","attributes":{"review":"So while I was testing this app out seeing what everyone was saying how great this app was! I got a virus out of no where, even spam text messages/emails of very questionable pictures/nsfw items!!! From this app being sent so I decided to quickly uninstall this app and never have this mistake happen again but it seems! I’m still having the stupid problems arise! I never wanna use this app ever again!!! This was the most horrible experience I ever have had from a “president” and his so called app. No thank you Mr. Trump.","title":"DIGUSTING!!!!","isEdited":false,"userName":"Mr. Bear Zero","date":"2020-07-09T08:34:14Z","rating":1}},{"id":"6175693042","type":"user-reviews","attributes":{"review":"This is by far the worst app I’ve ever used. If I could give it a negative star rating I would, cause that’s what it genuinely deserves! My phone has been crashing and draining it’s battery ever since I downloaded this ‘app’ if you can even call it that. It’s more like a disease which should be burned out of existence! I deleted so hopefully the damaged it’s done to my phone isn’t permanent. Anyone else who has this app should do the same. If you’re just about to download this app, take my word for it and don’t!","title":"What is this?","isEdited":false,"userName":"Aimeno97","date":"2020-07-09T08:19:27Z","rating":1}},{"id":"6175677237","type":"user-reviews","attributes":{"review":"It took 7 hours to download and once it finally did I opened it only to find a racist Cheeto starring at me. I then realized that the app hacked all of my private accounts and stole my credit card information!! And because of all that I had a panic attack and began to lose control and i then fell down the stairs and because of that I had a miscarriage and lost my child who’s baby daddy was Bernie sanders. This app is HORRIFIC and causes brain malfunctions I’m sure everyone who uses this is susceptible to all the DANGERS this app brings!!! DO NOT DOWNLOAD THIS APP FOR YOUR PERSONAL SAFETY!!!","title":"TRASH and DANGEROUS","isEdited":false,"userName":"billy bob 270","date":"2020-07-09T08:14:06Z","rating":1}},{"id":"6175671704","type":"user-reviews","attributes":{"review":"After downloading the app it was fine working as should but then a bunch of random pop ups came up and it brought to a site called pornhub I assume it was bad so I closed out of it then reopened it and it now says I had a virus then my phone stopped working for as long as until we could go get a new phone would not trust I have also gotten a lot more private proxy website ads then normal asking me to get a private proxy like the ducky website not completely sure but either way BE VERY CAUTIOUS","title":"Be cautious","isEdited":false,"userName":"pubgdiehardfan","date":"2020-07-09T08:12:10Z","rating":1}},{"id":"6175609371","type":"user-reviews","attributes":{"review":"it took 1 hour to download and drained all my battery while at it too. it asked for all my private information and no matter how many times i put down i was a white women it kept telling me to my last name was an error 😡 how dare they! when i tried showing my grandmother how to use the app, she had a stroke from all the harmful and inappropriate content that was on the app! said she had never seen anything so awful in her 89 years! i will be contacting my lawyer about this! 0 stars if i could give it!","title":"WORST APP EVER!!","isEdited":false,"userName":"Herondale101","date":"2020-07-09T07:49:54Z","rating":1}},{"id":"6175590992","type":"user-reviews","attributes":{"review":"This app told me that I can’t get an abortion even though it doesn’t have a uterus. It told me that my daughter should expect sexual assault going into the army because she is a woman. It told me that my brother doesn’t have any rights because he is trans. It told me that my sister and her fiancé can’t get married because it doesn’t like their relationship. It told me that because my best friend is Latino he can’t stay in America. It told me that my classmate’s life doesn’t matter; because “all lives matter”.","title":"Racist, homophobic, transphobic, misogynistic etc.","isEdited":false,"userName":"Me!😋","date":"2020-07-09T07:43:13Z","rating":1}},{"id":"6175584606","type":"user-reviews","attributes":{"review":"When I first down loaded this app, everything was normal. But after a few days I missed a call from my boyfriends mom who then let me know that my voicemail box was being answered in trumps voice and saying rude things and creating lies. But I’m freaking out because she’s believing them and now my boyfriend and his mom are convinced that I rub carrot juice on trumps skin so he can get his color and I can pay for school through this quarantine. I don’t know what to do! I can’t delete it! Send help!","title":"Worst experience of my entire life.","isEdited":false,"userName":"carrotrubber","date":"2020-07-09T07:40:48Z","rating":1}},{"id":"6175519957","type":"user-reviews","attributes":{"review":"I downloaded this app thinking that maybe it would be relevant to inform myself more about what Mr. Trump is doing and saying. However, the results were very disappointing. This is not a matter of politics, but it is just a horrible app. Honestly I don’t even know why someone would download it in the first place. So save yourself some storage space and do not download this. Stay away from the orange and you’ll be alright. But seriously, what a waste of time. It doesn’t work like it claims it does.","title":"Extremely disappointing.","isEdited":false,"userName":"natsonmars","date":"2020-07-09T07:16:47Z","rating":1}},{"id":"6175235009","type":"user-reviews","attributes":{"review":"This app seemed like it was all fun in games at the start, but soon I decided I HATED the app. I then was going to rate it a one star rating. However, just when I touched the small single star, a demon came out of my phone an attacked me! It left scars all across my face and I am currently in the hospital writing this review. I eventually figured out how to get the demon to not come out. You just have to leave bad reviews on multiple devices and it will get bored of you and stop coming. Trust me, it works! Don’t believe me? Try it yourself!!!","title":"BAD Devil Spawn","isEdited":false,"userName":"theonlysmartperson","date":"2020-07-09T05:25:50Z","rating":1}},{"id":"6175159379","type":"user-reviews","attributes":{"review":"I got this app in response to the overwhelming support that was present in Tulsa . Only to find the app was not only terrible at keeping me updated with the presidential campaign but also had unrealistic goals for the president to preform. For example him getting enough supporters in the first place when we now have candidates like Kanye who is set on marking the country government equivalent to a fictional African country that came for the imagination of 2 white men. Honestly I hope they fix the application as quickly as they can before November.","title":"WHAT THE ACTUAL HELL","isEdited":false,"userName":"thatbsaved","date":"2020-07-09T04:58:55Z","rating":1}}]}