{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=34740","data":[{"id":"6173936006","type":"user-reviews","attributes":{"review":"I downloaded this app to see orangutans because I like orangutans 🦧but when I got on the app it wasn’t an orangutan it was just a really orange pig in the app made me curl it was disgusting. I do not recommend this app😤 DO NOT GET THIS APP I REPEAT DO NOT GET THIS APP🚫Unless you like racist pedophiles who is bringing this country into a dark deep pit👎🏽","rating":1,"userName":"ghv ssh","title":"WORST APP EVER‼️‼️","date":"2020-07-08T22:24:06Z","isEdited":false}},{"id":"6173922694","type":"user-reviews","attributes":{"review":"Honestly I did not expect to see pictures an old guy when I opened the app. 🤢 the app should really have a warning for disturbing content. Also it takes up wayyy too much storage to be so insignificant.","rating":1,"userName":"genzlives","title":"Yikes","date":"2020-07-08T22:19:12Z","isEdited":false}},{"id":"6173918196","type":"user-reviews","attributes":{"review":"This app shows an orange cheeto trying to work as a president and dose a terrible job! There is also terrible, gross pigs using power to sexually assault people and to kill people legally! I can not believe this app is still out and is not deleted already!","rating":1,"userName":"jessierobrt","title":"This app is terrible","date":"2020-07-08T22:17:35Z","isEdited":false}},{"id":"6173916871","type":"user-reviews","attributes":{"review":"Took forever to open, wouldn’t stop asking for notifs to be turned on.\nIt’s a bad app that has a lot of bugs. Apple you need to take it down, if it stays up it’ll bug other people’s phones too.","rating":1,"userName":"Coheed is love Coheed is life","title":"Slow","date":"2020-07-08T22:17:06Z","isEdited":false}},{"id":"6173903497","type":"user-reviews","attributes":{"review":"I downloaded the app to show my support for our present. This app needs some help do to the fact it crash and information is wrong an that people want to cancel social media acct.","rating":1,"userName":"WavaBryant","title":"Make America better","date":"2020-07-08T22:12:10Z","isEdited":false}},{"id":"6173899185","type":"user-reviews","attributes":{"review":"Okay so first I thought I was getting an app for Donald trump but instead when I opened it all I saw was a Cheeto. Second the app kept glitching and IT GAVE MY ADDRESS AWAY after 30 minutes of downloading it a man in a suit came AND TOOK MY HOUSE he said it was because “trump said so” and NOW IM FRICKEN HOMELESS","rating":1,"userName":"rhsuhchsbbs","title":"DONT get this app","date":"2020-07-08T22:10:36Z","isEdited":false}},{"id":"6173886654","type":"user-reviews","attributes":{"review":"i opened this app to find a cheeto spray tanning. i am truly traumatized. i now have to go through months of therapy to get this image out of my head. i’ve cried every single night over this because i am scared. the app forced me to look at something i will never forget. also, the app said that it will steal my pet rock for no good reason. i love my pet rock. his name is dwayne. his nickname is johnson. please don’t let these scary people take him away. i love him too much.","rating":1,"userName":"iputthemuffinsinthefreezer2","title":"i am traumatized.","date":"2020-07-08T22:06:01Z","isEdited":false}},{"id":"6173880043","type":"user-reviews","attributes":{"review":"I really liked trump and was one of his TROOMPA LOOMPAS.  HAHHA FALSE. This man is a disgusting lookin Cheeto puff with a stanky fishy.  He’s a racist person and may I add, a RAPIST.  I don’t agree with his views on anything and APPLE, a brand who I stand by, should not have his orange, rapist,racist, rude lookin head on their platform.  I will no longer support Apple. This is uncalled for.","rating":1,"userName":"Himynameispriscilla","title":"disgusting— no 😍","date":"2020-07-08T22:03:38Z","isEdited":false}},{"id":"6173878079","type":"user-reviews","attributes":{"review":"This app took forever to download and when it finally did it cursed us with this weird music and my atente died a few minutes after I pressed a button that said press here.","rating":1,"userName":"fhugjcnsks","title":"Horrible","date":"2020-07-08T22:02:56Z","isEdited":false}},{"id":"6173872547","type":"user-reviews","attributes":{"review":"I got this app thinking my life would change afterwards and it didn’t. My spray tan did not stay on longer than a week and I didn’t get my fake hair in the mail. I am completely and utterly disgusted. Ugh.","rating":1,"userName":"Zaddy2000","title":"Can’t believe it","date":"2020-07-08T22:00:56Z","isEdited":false}}]}