{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29050","data":[{"id":"6174244287","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"The moment I opened this app my phone started smoking and burning!! I tried to close it and uninstall it but it wouldn't let me. Later when I tried taking pictures of my dog for instagram (@pyr_king) my phone blew up in my hand and burnt half her face off?!","userName":"goosepups117!","date":"2020-07-09T00:18:34Z","title":"They blew up my dog?!"}},{"id":"6174237966","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"it’s the worst app i’ve downloaded, after i logged in my phone number i kept getting text messages and when I told it to “STOP” it kept doing it and I had to get a new phone and phone number, this app completely ruined my phone!!!!!","userName":"animals are lit same with yt","date":"2020-07-09T00:16:17Z","title":"STAY AWAY THIS APP IS TERRIBLE!!"}},{"id":"6174225341","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"i opened the app and it stole all the data off my phone and now my pictures are all over the internet. All my social media accounts got hacked multiple times. My phone dies all the time. Once i deleted the app everything was fine. DONT DOWNLOAD IT WILL EXPLOIT YOUR DATA TO CHINA AND THE FBI.","userName":"rachaelleeluvsyou","date":"2020-07-09T00:11:38Z","title":"absolutely disgusting"}},{"id":"6174224306","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"i downloaded this app in hopes of being educated on our pReSidEnT n i’m sorry but this app is just horrible! nothing will load and theres just trumps face AS SOON AS U OPEN IT!!! who wants to see that??? there wasn’t even a trigger warning ugh! all in all this app was a severe disappointment","userName":"jill hemphensburg","date":"2020-07-09T00:11:16Z","title":"oh brother this guy STINKS"}},{"id":"6174208953","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"What appeared on my screen was devastating and will scar me for the rest of my life. This was no ordinary Cheeto. It was old, stale, moldy, and even had gross fluff at the top of it. In addition, this app was so slow, I had to reboot my phone 3 times in order for it to even open. Awful, don’t recommend.","userName":"loserville🤡🤡","date":"2020-07-09T00:05:32Z","title":"Eyesore"}},{"id":"6174192454","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"Yo my phone literally got hacked because of this and all I saw in my screen was childish opinions. What the heck is this app? Keep America great? Huhhh? America is not great at all with this fat orange lookin ahh as our president. Ps. Trump whatever they call you, have fun with hiding in a bunker while playing golf I bet and America burns. Dum-dum bubble gum lookin ahh stanky ahh boi fake hair ahh boi","userName":"kawaii anime gorl","date":"2020-07-08T23:59:22Z","title":"Cheeto puff lookin ahh"}},{"id":"6174181141","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"Long ago, the four nations lived together in harmony. Then, everything changed when the Fire Nation attacked. Only the avatar, master of all four elements, could stop them, but when the world needed him most, he vanished. A hundred years passed and my brother and I discovered the new avatar, an airbender named Aang.","userName":"Corwine4321","date":"2020-07-08T23:55:12Z","title":"Anyone but Trump"}},{"id":"6174177888","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This app has not worked properly since the entire time I’ve had it. It has caused my phone to lag and affected my usage. The help itself has not been useful in any way and was a waste of space on my phone.","userName":"Hubajub","date":"2020-07-08T23:54:01Z","title":"Disfunctional"}},{"id":"6174170175","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I use this app one time and instantly deleted it\nWhen i first clicked on it was I just I can’t even explain it was horrifying and that is just all I need to say so sorry this is a short review but I don’t even think I can say what happened on here","userName":"spakle hat","date":"2020-07-08T23:51:08Z","title":"Terrifying"}},{"id":"6174156789","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"Opened it and I don’t know what I was expecting, but it was truthfully the worst thing I’ve ever experienced as far as apps go. Horrible organization, lack of hierarchy, and thoughtless content. I thought our President could do it bigly and he HASN’T. I’m so disappointed. App is a waste. Don’t bother.","userName":"grutsb","date":"2020-07-08T23:46:28Z","title":"Horrendous"}}]}