{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=142870","data":[{"id":"6179259725","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"Gyzaira","title":"I don’t like trump","date":"2020-07-10T03:30:02Z","review":"I don’t like his orange self. Come to think of it I’m actually scared of oranges. I saw this one video of trump going into a school and he went to his classroom and like this little black girl saw him and she started screaming and then like these other kids started screaming because they didn’t like him of course no one likes him I mean even the oranges said and I quote from the oranges cuz we talked about this: “we do not except him” I asked my orange about him and he said: “no❤️”"}},{"id":"6179259605","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"Disappdoe","title":"APP GAVE ME VIRUSES","date":"2020-07-10T03:29:59Z","review":"Do not download this app! It is a FAKE created by the libtards designed to give us FAKE NEWS and keep our president out of office! Many, many VIRUSES appeared on my phone after I downloaded, including LOTS of propaganda and ads for senile joe biden. I would not recommend this app AT ALL. None of the information is accurate, and Trump would NOT APPROVE of this app. I don’t know how it got here, but the radical left is trying to use FAKE NEWS to sway our vote. We must band together to keep our president in office! FOUR MORE YEARS! Trump 2020 🇺🇸"}},{"id":"6179259590","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"Bdnckxkcklscjxkdk","title":"Horrible -293/10","date":"2020-07-10T03:29:59Z","review":"Literally as soon has I opened the app, my phone exploded."}},{"id":"6179259496","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"J caplash","title":"he has no lips how will he get a kiss kiss??!!!","date":"2020-07-10T03:29:57Z","review":"ugliest app in the store. literally terrible. the apple store is full of millions of amazing apps but this? this is an insult to apple users everywhere. when you first download it you have to see the hideous trump logo on your home screen, and when you open it there’s a nasty pic of an old orange cheeto. so gross. the app is full of fake news and false info, only download if you wanna lose brain cells! xoxo"}},{"id":"6179259450","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"Gendid","title":"Absolute Trash","date":"2020-07-10T03:29:56Z","review":"Why is this Ronald McDonald looking ass president trying to get our phone number. Is he trying to rape our children???? Isn’t he already a registered sex offender. Why does America want Donald Duck to be president again. I would take a potato to be my president over this annoying orange looking ass man. This app is stupid. The only people that are downloading it are the rednecks of America. #blm#Trumpisasexoffender"}},{"id":"6179259451","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"cheeto man 🧚🏼🧚🏼","title":"TERRIBLE","date":"2020-07-10T03:29:56Z","review":"This app made my phone start to glitch horribly after installing. It took approximately 27 years for the app to download and finally open. When I am finally able to get the app opened I see that it has horrible graphics with Cheeto dust everywhere!! I would give 0 stars if I could. Terrible app with terrible views!!"}},{"id":"6179259380","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"fhjjgfdrtggdrtggfdrt","title":"Delete this APP!!!!!","date":"2020-07-10T03:29:55Z","review":"As soon a you download it, it automatically sends all your pictures to everyone in your contacts then once you open it you get greeted by a picture of trump say the N-word. REMOVE THIS APP"}},{"id":"6179259329","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"IS_BIG_BRAIN","title":"Bad app","date":"2020-07-10T03:29:54Z","review":"It took so long to start up and the writing was in a different language"}},{"id":"6179259228","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"yeah im good","title":"No","date":"2020-07-10T03:29:52Z","review":"This isn’t a good app. No."}},{"id":"6179259223","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"userName":"blm and vannesa matters","title":"Hate this app","date":"2020-07-10T03:29:52Z","review":"It took most of my data I don’t recommend and this app was so underrated like who ever created this app need help I mean pretty people help like why would he or her think that they will get this app to see this orange man face 🍊😔"}}]}