{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=16240","data":[{"id":"6175212437","type":"user-reviews","attributes":{"review":"i got this app in hope to cure my dyslexia but NO all it did was walk my goldfish to class and bully my unborn children to much they had to drop out of school and become homeschooled!! this app is made for bullies and bullies only. i want nothing to do with it. i will be speaking with the manager soon and demanding justice (something trump seemingly wants nothing to do with). i will NOT be coming back. what a disgrace.","isEdited":false,"userName":"LizzyRalston","title":"absolutely disgusting","date":"2020-07-09T05:17:45Z","rating":1}},{"id":"6175136851","type":"user-reviews","attributes":{"review":"This app has bullied my cat. THE AUDACITY. I gave it the pleasure of being on my phone and what does it do to me, IT STARTS CALLING MY CAT NAMES! Oh dear lord, even thinking of the disturbing, perverse names that this retched app called my baby, “SoyouthinkI’mskinnnyyyy”, makes my skin crawl. Ughhhhh, my kitty, “SoyouthinkI’mskinnnyyyy”,  is still trembling under my bed from the VERBAL ABUSE she received. \nAll you get from this app is BULLYING!!! I would give it negative stars if I could.\nGood day, \nAnd DON’T DOWNLOAD THIS APP!","isEdited":false,"userName":"HelloAthena10","title":"DON’T DOWNLOAD, TRASH APP","date":"2020-07-09T04:51:17Z","rating":1}},{"id":"6175108887","type":"user-reviews","attributes":{"review":"This app is horrible app all the Karen’s and I feel that it has bad luck on it I’ve stubbed my tow too many times well having this app I tripped up the stairs and hurt my shin this app in general should be shut down for my field it takes up too much apple face I don’t know what I’m gonna download I can’t download my Mario carts anymore and in the words of Rosa you’re freaking lying let me see👁👄👁","isEdited":false,"userName":"daddys doorknob","title":"Boo boo da fool","date":"2020-07-09T04:42:04Z","rating":1}},{"id":"6175094640","type":"user-reviews","attributes":{"review":"This app tried to kill the coronavirus in me with a very powerful ultraviolet light, when that did not work it tried to clean me from within with an injection of disinfectant it was so powerful but i still tested very positively. In another sense, I tested positively toward negative, right? So no. I tested perfectly this morning, meaning I tested negative. But that's a way of saying it. Positively toward the negative.","isEdited":false,"userName":"Yolooolololololenwudndiw","title":"Tried to kill me with a powerful light","date":"2020-07-09T04:37:27Z","rating":1}},{"id":"6175070809","type":"user-reviews","attributes":{"review":"IT STOLE MY HAMSTER. My hamster was in my room and whose I downloaded it I fell asleep and the next morning I go to see if my hamster was awake and I don’t see him. So I go and look in his hides and he wasn’t there. So I look under his bedding he’s not there. And I look outside and I see someone dressed in black with the label of this app on the back of his or hers shirt. Me and my whole family have been morning the lost of my hamster Oakley.❤️🖕🏼","isEdited":false,"userName":"andylandysandy","title":"THIS APP IS A WASTE OF SPACE","date":"2020-07-09T04:29:56Z","rating":1}},{"id":"6175067171","type":"user-reviews","attributes":{"review":"So I downloaded the app and first off had to put my phone number in. But the screen kept freezing and wouldn’t let me type all of my number??? And then proceeded to tell me my number was wrong?? And on TOP of that, once it miraculously worked and I got through, the app would randomly CRASH while I was using it. I do NOT recommend for these reasons AND MORE.","isEdited":false,"userName":"Bea914","title":"Terrible App","date":"2020-07-09T04:28:47Z","rating":1}},{"id":"6175004922","type":"user-reviews","attributes":{"review":"I absolutely hate this app, you wanna know why I’ll tell you why. Was it was installed my bed disappeared now I’m sleeping on the floor, I guess when you install the app all beds disappear and go to trumps house and get sold and that’s where he is getting all of his money by using your bed, yup I said it I had to speak out about this, anyways it also takes up a lot of space on my phone","isEdited":false,"userName":"Mr. Buttington","title":"Bad app","date":"2020-07-09T04:09:14Z","rating":1}},{"id":"6175000756","type":"user-reviews","attributes":{"review":"This app is so disruptive and inappropriate is gives un accurate information and says very inappropriate things It glitched when I was trying to read something it messed up my phone horribly I came for informative things only but no this is a disappointment and from what I’ve seen it’s hasn’t gotten any better I say just delete this app","isEdited":false,"userName":"_brandyli_","title":"Horrible","date":"2020-07-09T04:07:52Z","rating":1}},{"id":"6174994155","type":"user-reviews","attributes":{"review":"I downloaded this app to keep up with President Trump’s campaign and as soon as I downloaded it, I started getting weird phone calls and text messages from automated services. My phone also started to crash very often and at first I thought it may be something else but I read the reviews on this app and turns out EVERYONE has the same problem. DO NOT RECOMMEND.","isEdited":false,"userName":"sav2319","title":"DO NOT DOWNLOAD","date":"2020-07-09T04:05:43Z","rating":1}},{"id":"6174936500","type":"user-reviews","attributes":{"review":"Really was looking forward to having something with quick access to all things Trump 2020, but only received an app that made my phone glitch. Thought it would only be while in the app but continued to happen even when I had the app closed. It’s not worth downloading considering you can’t get to the point of viewing the info.","isEdited":false,"userName":"Desi Malik","title":"WASTE OF TIME!!!","date":"2020-07-09T03:47:35Z","rating":1}}]}