{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=18710","data":[{"id":"6175512138","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T07:13:48Z","review":"This app took forever to download and once it did download it crashed every time I put in my number to support my president✨would never recommend to anyone. Can’t believe this was allowed to be published without being fact checked for accurate information, racial bias, prejudice, or discrimination!","userName":"Fabian.C","title":"Waste of time🧚"}},{"id":"6175490374","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T07:05:03Z","review":"All I wanted to do was support my wonderful president 💕🇺🇸, but when I downloaded it the app started glitching to the post where I couldn't use it! 😤😡 Not only that, but the glitches didn't stop once I closed the app, it got so bad that I ended up having to get a new phone! 🤬🤬\nIf you care about your phone you won't download this app!!","userName":"sammiam124","title":"DO NOT download this app"}},{"id":"6175487750","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T07:03:59Z","review":"It doesn’t work! Kept crashing! Believe me It was not the huge and great like they promised! They lied to us bigly and now I just feel stupid. If you download it they ask for you number! Why should I have to give my number to some app just to get updates! Doesn’t make sense, incredible. Sad\n\nApp needs serious updates!","userName":"Umbadpublicity","title":"Just Unbelievable"}},{"id":"6175481801","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T07:01:40Z","review":"This app was so ducking ridiculous and it took fore ever to download \nI couldn’t access anything and it crashed my phone and hacked my data and now I have to buy a new phone and change everything. Cuz my phone got jacked ustay away and do not purchase this app\nIt’s the worst thing u can do to yourself","userName":"ShakeyP3","title":"The Most Jacked up app on the store"}},{"id":"6175478954","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T07:00:34Z","review":"App is horrible and offends over 70% of the world population. Was designed by a team supporting a racist, rapist, bigot, homophobic, transphobic, xenophobic tangerine and it shows. DO NOT DOWNLOAD. Get this app out of the store and remove him from office. Gen z hates you and we all hope you burn in hell for everything you’ve done to this country. We don’t want you to have control of our future so leave.","userName":"Trumpshoulddie","title":"DISGUSTING DO NOT DOWNLOAD"}},{"id":"6175460346","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:52:58Z","review":"This app was extremely slow and wouldn’t open. When it did open, it would freeze my screen and make my phone impossible to operate. Don’t download this to your iPhone unless you want it to glitch, you will spend 4 years trying to fix the trouble this app causes.","userName":"Ksteppingstone","title":"Don’t recommend!!"}},{"id":"6175454570","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:50:43Z","review":"the app ruined my phone and i had to get a new one , overall would never get , the bugs in this app are insane , it hacked my phone and took my private information , not to mention the app wouldnt download and i had to redownload it about 15 times in the matter of two days . never ever get the app WOULD NOT RECOMMEND 0/10.","userName":"VannaRae..","title":"do not ever get"}},{"id":"6175432690","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:42:12Z","review":"So first when the app finally downloaded after days even though i have hood wifi my entire phone turned into a Cheeto the big Cheeto man turned my phone into a Cheeto! I am very angry at the Cheeto man and even after countless Cheetos bags keep appearing in my house now that would be good but these bags are ten years old! One star never again biden2020","userName":"ok5323344","title":"Awful"}},{"id":"6175373465","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T06:19:13Z","review":"This stupid app glitches 24 seven it doesn’t work it’s useless needs to be banded !! It’s disgusting it gives you nightmares. Once you open this app you’ll be haunted for the rest of your life by an orange man very very scary orange man. You open the app and see a very ugly orange mat and I will terrify you and you will have nightmares do not download this app you do not need this app !!","userName":"jessie20.30.99","title":"don’t download"}},{"id":"6175315014","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T05:57:08Z","review":"This app will download a virus and made my phone run extremely slow until I deleted it. After consulting with multiple other friends with the app, they experienced the same issue. My dear friend’s iPad actually caught fire while being on the app as the device overheated. The content is also abusive and hateful.","userName":"spslice","title":"Horrible terrible app"}}]}