{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38790","data":[{"id":"6172916757","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:35:25Z","review":"ok once I started downloading it, it glitches like crazyyy and when I kept pressing on it the app would send me back to my home screen. I couldn’t even use the app. Terrible app I would give it a 0/10.","title":"TERRIBLE APP","isEdited":false,"userName":"katitzas"}},{"id":"6172873263","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:22:09Z","review":"I downloaded the app in result to see more information to see if I should vote for Trump. Alas, I was not able to find the evidence that persuades me to vote for him, but instead I found more reasons of why not to vote for him.","title":"Failed attempt to vote for Trump","isEdited":false,"userName":"Jash102"}},{"id":"6172849692","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:14:59Z","review":"I download the app to see what I could learn about trump and my dog was with me and some add of trump starts playing but it was a high pitch sound my dog started whining and crying I don’t know if someone did that to the add but I think I don’t wanna learn about trump anymore :(","title":"MY DOG ALMOST DIED","isEdited":false,"userName":"Kaylapia"}},{"id":"6172840881","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:12:22Z","review":"This app is so bad it makes my phone start to glitch and I can’t even login to the app I think it should be taken down because of this terrible picture that I’ve seen of Mr. Trump makes me sick to my stomach. DONT GET THE APP IT MAKES YOUR PHONE GLITCH.","title":"Terrible App!","isEdited":false,"userName":"49ers4life#10"}},{"id":"6172832773","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:09:59Z","review":"Worst app ever I fear President Donald J Trump deletes the comments that we want to stop because my nephew he’s 28 years old he left a comment here he didn’t like the app but it’s not here anymore so I Think he’s is trying to make The app the best.","title":"Horrible service","isEdited":false,"userName":"Michelle4596"}},{"id":"6172807852","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:02:52Z","review":"I downloaded this app a month ago and my phone completely stopped working!! I had a iPhone 11 and it just stoped working right after I got the app and opened it. NEVER AGAIN. I had to buy a whole new phone!! DON’T BUY THIS APP","title":"SCAM","isEdited":false,"userName":"Anime fan 2017"}},{"id":"6172805708","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:02:16Z","review":"Terrible app it took 2 1/2 days to download and when I opened the app it started playing sweet home Alabama while calling me fat and telling me to sacrifice myself to the devil😱then that app EXPLODED my phone so now I’m writing this review on my microwave 1 star🤢","title":"Trump 2020🇺🇸on a grave😌💗💅","isEdited":false,"userName":"brooklynn robinson"}},{"id":"6172796940","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T15:59:43Z","review":"I purchased this app because I wanted to support our lovely president cheeto-I mean Trump. After I downloaded it, my phone received a virus! Now random pictures of that orange is showing up on my phone. What a scam?! Please do not download this app.","title":"DONT BUY","isEdited":false,"userName":"Lfledkemdmsm"}},{"id":"6172786812","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T15:56:48Z","review":"I downloaded the app and it gave me so much viruses to the point I had to get a new phone and the fact that this app is pointless to everyone just makes it worse I hate this app","title":"What the frick","isEdited":false,"userName":"Vineboy28"}},{"id":"6172778840","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T15:54:33Z","review":"I downloaded the app in hopes of seeing why people support him, i just saw lies and stupidity, the fact that people still support him is ridiculous, hope any trump supporters realise they’re being used","title":"Absolutely disgusting","isEdited":false,"userName":"whoneedsanicknamw"}}]}