{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=124390","data":[{"id":"6174341363","type":"user-reviews","attributes":{"review":"You’re here from tik tok I bet","userName":"youpineapple","title":"POV","rating":1,"date":"2020-07-09T00:51:31Z","isEdited":false}},{"id":"6174339841","type":"user-reviews","attributes":{"review":"NO JUST NO🤢🤮","userName":"Ah23200","title":"NO","rating":1,"date":"2020-07-09T00:51:00Z","isEdited":false}},{"id":"6174338282","type":"user-reviews","attributes":{"review":"대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n\n대취타 대취타 자 울려라 대취타\n빛이나 빛이나 내 왕관이 빛이나\n잊지마 잊지마 지난 날을 잊지마\nWe so fly, we so fly 전세기로 we so fly\n\n종놈 출신에 왕된 놈\n미쳐버린 범 광해 flow\n개천 출신에 용된 몸\n그게 내가 곧 사는 법\n미안 걱정은 말라고\n나도 잃을건 많다고\n과건 뒤주에 가두고\n내걸 챙겨 다 잡수쥬\n말이 안되지 내가 개라니\n범으로 태어났지 적어도 너처럼 약하진 않지\n좆밥들의 걍 재롱잔치\n솔까 존나게 어이없지\n싹다 죽여 난 예의 없이\n새꺄 그래 너 예외없이\nFlexing 난 없지\n필요가 없지\n\nWho's the king, who's the boss\n다 알잖아 내이름\n입만 산 새끼들\n당장 놈의 목을 쳐\n\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n\n대취타 대취타\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n\n한탕해먹고 곧바로 난 전세기로 날아\n나를 담기엔 이 나란 아직 여전히 작아\nWoo 누가 시간은 금이래\n내 시간은 더 비싼데\nTic tok 선비새끼들\n면상에다 침을 칵 뱉어\n꺾인 적이 없는 매출출출출출출출\n우리 방시혁 피디는 매일 춤춤춤춤춤춤춤\n참 감사하네 내가 천재임에\n고작 그런 이유로 약을 빨다니 애잔하기 그지없네 재능이 없는거지 뭐\n원하는 건 모두 가졌지 이제는 뭘 더 가져야만 만족이 될지\n내가 원했던 것 옷옷 다음은 돈돈 다음은 goal goal 이 다음은 도대체 뭐지\n그 다음은 그래 뭘까 심히 느껴지는 현타 위가 없는 현상\n위만 보던 난 이제 걍 아래만 보다가 이대로 착지하고파\n\nI'm a king, I'm a boss\n새겨놓아 내 이름\n입만 산 새끼들\n당장 놈의 주리를 틀어\nI'm a king, I'm a boss\n다 알잖아 내이름\n입만 산 새끼들\n당장 놈의 목을 쳐\n\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타\n\n대취타 대취타\n대취타 대취타 자 울려라 대취타\n대취타 대취타 자 울려라 대취타","userName":"cepyouth","title":"🤦‍♀️","rating":1,"date":"2020-07-09T00:50:27Z","isEdited":false}},{"id":"6174337884","type":"user-reviews","attributes":{"review":"Broken. It’s all broken","userName":"phickoff","title":"Sickening","rating":1,"date":"2020-07-09T00:50:19Z","isEdited":false}},{"id":"6174335184","type":"user-reviews","attributes":{"review":"Sad man bad man sad man bad man\nSad man bad man","userName":"Quami_","title":"Sad man bad man","rating":1,"date":"2020-07-09T00:49:29Z","isEdited":false}},{"id":"6174332198","type":"user-reviews","attributes":{"review":"You know it's been a long day\nI haven't seen you today\nYou're somewhere\nI'm sure\nOoh, yeah yeah, hey, hey\n니가 날 보는 걸 알아 누구보다도 잘 알아\n근데 있지 자꾸 알면서도 널 계속 놀리고 싶어\n아니야 내가 왜 이래 널 빨리 받아 줘야지\n밀당은 아냐 하지만 남잔\n조심 조심 조심 uh\nWoo ah 쉽진 않을걸\nWoo ah 비밀이 좀 많아\n나의 사랑 쉽게 주고 싶지는 않아\nWoo ah 난 특별하니까\nWoo ah 난 예쁜 애니까\n말해줘 보여줘 좀 더 안달이 나게\nSay hi hi hi hi 안녕하고 말할 만큼\nTake me high high high high 나를 좀 더 데려가 줘\n꿈에 love love love love 두근두근 뛰게 해줘 (it's true)\n조금 더 (someday) 힘을 내 (oh yeah)\n쉬운건 안돼 사랑이란 잔인해\n톡톡해 자주해 달콤한 얘기\n난 그럼 난 하루에 한 두 번\n세상에 없던 이기적인 나야 it's you, yeah\n사랑해 너만 보고 싶어 이런 말 듣고 싶잖아?\n아주 조금만 기다려 좀 더\n더욱 애가 타게\nWoo ah 말이 없어도\nWoo ah 묻진 말아줘\n가끔 많이 소심해져 그러는 거야\nWoo ah 걱정이 돼\nWoo ah 지치면 안돼\n사실 나 내 맘이 전부 들켜버릴까\nSay hi hi hi hi 안녕하고 말할 만큼\nTake me high high high high 나를 좀 더 데려가 줘\n꿈에 love love love love 두근두근 뛰게 해줘 (it's true)\n조금 더 (someday) 힘을 내 (oh yeah)\n수능보다 더 사랑이란 잔인해\n사실 니가 좋아 너의 모든 게 다\n다만 난 두려워\n기다린 사랑 그게 너 일까\n시간이 조금 더 필요해 난\n너를 보여줘\n달콤달콤해 새콤달콤해 매콤매콤해 매콤새콤해\n상큼상큼해 상큼매콤해\n어지러워져\nTake me high high high high 이 기분이 너무 좋아\n두근대 (so bad) 어떡해 (oh yeah)\n내 맘이 달아, 달아올라 어떡해\nHigh high high high high high high\nHigh high high high\n김밥처럼 넌 만두처럼 달콤해","userName":"oohshalay","title":"🤪💕✨🧚‍♀️😻🤧","rating":1,"date":"2020-07-09T00:48:29Z","isEdited":false}},{"id":"6174328739","type":"user-reviews","attributes":{"review":"No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No\n\nOh and did I forget to mention No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No No","userName":"Unknown_Potatoe","title":"Make America great again","rating":1,"date":"2020-07-09T00:47:21Z","isEdited":false}},{"id":"6174327174","type":"user-reviews","attributes":{"review":"Ysiismnskis","userName":"bsndhjd","title":"Ndnjdjsj","rating":1,"date":"2020-07-09T00:46:48Z","isEdited":false}},{"id":"6174326678","type":"user-reviews","attributes":{"review":"#settleforBiden2020","userName":"Fried hen","title":"HORRIFYING","rating":1,"date":"2020-07-09T00:46:37Z","isEdited":false}},{"id":"6174316268","type":"user-reviews","attributes":{"review":"Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Don’t ban tik tok. Please and thank you🥰🥰🥰","userName":"znchelgothwnslf","title":"No thank you","rating":1,"date":"2020-07-09T00:43:11Z","isEdited":false}}]}