{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=34460","data":[{"id":"6177203178","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:40:46Z","isEdited":false,"title":"The WORST app","userName":"Scoganolio_2020","review":"I wasn’t even able to open up this app for longer than 30 seconds without getting an intense feeling of nausea. I immediately felt the urge to run to my bathroom and projectile vomit everywhere. Awful app. Sad."}},{"id":"6177179201","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:34:01Z","isEdited":false,"title":"Disgustang","userName":"Bananarbear💖💖💖","review":"This app constantly bugs out and i know i'm not the only one. my friends all downloaded this app and had the same problem. i hope this app gets taken down 😒😡\n\nhaha i'm part of the Gen Z thing"}},{"id":"6177159630","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:28:27Z","isEdited":false,"title":"HORRIBLE🤬🤬","userName":"Miaa💖😘","review":"this app took 186 weeks to download and when it did it hacked me and deleted everything on my phone and replaced everything with pictures saying to vote for trump. terrible app i dont recommend it."}},{"id":"6177143788","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:24:03Z","isEdited":false,"title":"Horrible App","userName":"Swagmoney2222222222222222","review":"This app is honestly the worst app I've ever seen in my entire life. It spread propaganda, is impossible to use, really malfunctions, and is overall bad for my phone. I think this app should be deleted because it's horrible."}},{"id":"6177138843","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:22:42Z","isEdited":false,"title":"FAKE NEWS!","userName":"Charlie2015!","review":"little to none of the information on here is factual and it kept crashing my phone. don’t download. i’m almost definitely sure this app downloaded a virus onto my brand new phone."}},{"id":"6177138124","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:22:29Z","isEdited":false,"title":"Horrible","userName":"canceltrumps","review":"This application is HORRIBLE!! None of the information makes sense on here, as the worst president of the United States is solely basing things off of Fox News. Would rate lower than one star, however that is not an option!"}},{"id":"6177128751","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:19:54Z","isEdited":false,"title":"🧚✨no💕✨","userName":"trumtrumptrump","review":"This app made my dog die. I opened the app, started to use it, and my dog died cause of it. I do not think an app like this should be on the App Store. I am outraged and disappointed that someone would create this app. I would rate it even lower if I could. DO NOT BUY."}},{"id":"6177122861","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:18:17Z","isEdited":false,"title":"Disappointed","userName":"dumptrump202","review":"When I opened the app it just causes my phone to crash . 0/10 would not recommend. Had to go to get it fixed at the T-Mobile store"}},{"id":"6177120006","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:17:29Z","isEdited":false,"title":"Do NOT get this app","userName":"irepeatdonotgetthisapp","review":"This app is the worst. I opened it to a Cheeto looking back at me, so I threw up. At least I threw up on the Cheeto. Then the app crashed and gave my phone glitches. My phone just blew up. So I would not recommend getting this app. 0/10."}},{"id":"6177119515","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T15:17:22Z","isEdited":false,"title":"don’t get the app","userName":"gianna matejko","review":"ok so i got the app and the first thing that pops up is hideous and i had to get my eyes checked after that and it is a terrible app it’s horrible i really recommend not getting it because it is very scaryy and it will hack you with all your information and if you have a money app that uses the same information to get into the app your screwed all your money will be gone good luck and we are gen-z😚🦗🦟🦗🦟🦗🦟😌😘😘😘"}}]}