{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24520","data":[{"id":"6175567505","type":"user-reviews","attributes":{"review":"This app takes soo long to download and on top of that I’m pretty sure it gave my phone a virus because after it finally downloaded after a day it started acting slow I would definitely not recommend","title":"This app is absolutely terrible 🤬🎶","userName":"curlyhead A","isEdited":false,"date":"2020-07-09T07:34:28Z","rating":1}},{"id":"6175556062","type":"user-reviews","attributes":{"review":"I downloaded this app two days ago because I wanted to show love to my favorite president. as soon as I downloaded it my phone was filled with disgusting pornography images. My son Jacobe and daughter Kayleigh and Brayleigh were disgusted when they saw my phone. LIKE THEY DIDNT KNOW ME ANYMORE!! This is unacceptable, I will no longer be voting for Donald Trump. I am heart broken and","title":"DISSAPOINTED TRUMP FOLLOWER","userName":"lnternet","isEdited":false,"date":"2020-07-09T07:30:17Z","rating":1}},{"id":"6175538972","type":"user-reviews","attributes":{"review":"This game is completely broken! Too many adds and photos/videos of a rabid orange chipmunk spewing bile everywhere. Absolutely not kid friendly and possibly the worst game I’ve ever downloaded. App developers should definitely get to work on fixing it before more people download this wretched game.","title":"Game is broken","userName":"Kittenkendal","isEdited":false,"date":"2020-07-09T07:23:58Z","rating":1}},{"id":"6175538931","type":"user-reviews","attributes":{"review":"According to all known laws\nof aviation,\nthere is no way a bee\nshould be able to fly.\n\n  \nIts wings are too small to get\nits fat little body off the ground.\n\n  \nThe bee, of course, flies anyway\n\n  \nbecause bees don't care\nwhat humans think is impossible.\n\n  \nYellow, black. Yellow, black.\nYellow, black. Yellow, black.\n\n  \nOoh, black and yellow!\nLet's shake it up a little.\n\n  \nBarry! Breakfast is ready!\n\n  \nOoming!\n\n  \nHang on a second.\n\n  \nHello?\n\n  \n- Barry?\n- Adam?\n\n  \n- Oan you believe this is happening?\n- I can't. I'll pick you up.\n\n  \nLooking sharp.\n\n  \nUse the stairs. Your father\npaid good money for those.\n\n  \nSorry. I'm excited.","title":"It made me cried","userName":"#I'mlonely","isEdited":false,"date":"2020-07-09T07:23:57Z","rating":1}},{"id":"6175526643","type":"user-reviews","attributes":{"review":"So here’s the thing, not only did it take ages to download, it also was extremely glitchy. And on top of that, it made my phones storage mess up and it statutes deleting my photos and apps without me knowing. So this app is basically a phone killer so I definitely do not recommend 😬","title":"😬","userName":"kqkfkcicjskwmodpf","isEdited":false,"date":"2020-07-09T07:19:23Z","rating":1}},{"id":"6175525188","type":"user-reviews","attributes":{"review":"Don’t download it’s a horrible way to waste your memory. There are by far more wholesome apps out there in which you could spend your time on to distract you from reality. It takes forever to download and it’s just really full of fake news and propaganda.","title":"Horrible App","userName":"Lys.Art.Boutiq","isEdited":false,"date":"2020-07-09T07:18:48Z","rating":1}},{"id":"6175518096","type":"user-reviews","attributes":{"review":"this is app took so long to download and then when it did it hacked my phone and erased all my pictures. I keep getting texts from strangers i think it leaked that. as a citizen of this country i feel violated of my rights by the president and his administration. if i could give this zero stars i would.","title":"⚠️DO NOT DOWNLOAD⚠️","userName":"aspen mia","isEdited":false,"date":"2020-07-09T07:16:03Z","rating":1}},{"id":"6175502697","type":"user-reviews","attributes":{"review":"This app is very terrible to your phone. i downloaded it yesterday and it begun listing out my personal information and demanding my credit card!! Never endorse this app and what it stands for. they’re both trying to do the same thing!!","title":"If I could give it 0 stars I would","userName":"Moath Casey","isEdited":false,"date":"2020-07-09T07:09:53Z","rating":1}},{"id":"6175467710","type":"user-reviews","attributes":{"review":"This is a complete and utter embarrassment of an app. EVERY THIRTY SECONDS IT FREEZE’S and is impossible to manage, I’ve never seen a worse app in my life. This is a disgrace to the App Store and hope Apple removes it soon before it messes up more people’s day:( DO NOT GET THIS APP, I’d pay to have all the time back that it had me waist trying to manage it.","title":"I am appalled.","userName":"zey2002","isEdited":false,"date":"2020-07-09T06:55:57Z","rating":1}},{"id":"6175358151","type":"user-reviews","attributes":{"review":"I tried to download it and my WiFi crashed so I thought it was just a couinsidence but then I tried again and my router practically exploded and now it doesn’t work and has burns on the inside of it, I really don’t recommend downloading it if you want to keep your WiFi alive","title":"Unreal","userName":"Mr. Facts824","isEdited":false,"date":"2020-07-09T06:13:14Z","rating":1}}]}