{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=6280","data":[{"id":"6175580366","type":"user-reviews","attributes":{"userName":"random human 98899","title":"Configured my anatomy","isEdited":false,"rating":1,"review":"When I downloaded this app I started to projectile vomit everywhere. The bones in my arms started to disappear and I would get the flu every time. I also find it nasty that after downloading it Donald trump kept tagging me in his nudes on Twitter. Very inappropriate right? The worst part is that I don’t even own a Twitter. Which means the app downloaded and made an account or me without my consent. But now let’s get to the main reason of this. Configured my anatomy. I would randomly have outbursts where my anatomy would be configured with out my control. Sometime I would move with no control. But some of my scariest experience are listed below. \n1. My fingers got replaced with my toes\n2. My feet got stuck in my mouth.\n3. My eyes because tongues. \n\nThat was only 3 out of my at least 500 experiences. I lost track. My life it absolutely ruined because of this app","date":"2020-07-09T07:39:14Z"}},{"id":"6175246200","type":"user-reviews","attributes":{"userName":"shhainaaa","title":"HORRIBLE","isEdited":false,"rating":1,"review":"i downloaded the app and 5 minutes later my phone exploded then my entire house got a virus. then my cat lost 5 lives but brought me back some chicken mcnuggies. the nuggets had rings and backpacks with 10 packs of colorful string beans. the string beans got stuck to my ceiling then my phone and then the app started telling me very mean jokes and i cried until my neighbors dogs cousins friends turtles beetles nieces daughters cousins uncles mushrooms speakers friends daughter told me to be quiet. overall i would say i was not very satisfied with president trumps app it is dangerous for society and our lives.","date":"2020-07-09T05:30:06Z"}},{"id":"6175112974","type":"user-reviews","attributes":{"userName":"booger spit","title":"TERRIBLE APP!!!","isEdited":false,"rating":1,"review":"This app is terrible!!!! One minute I’m petting my roasted chicken! And then next thing I know the titans have broken Into wall Maria!!! Now I have to restore the keyblade of light so that my cousin, the boogeyman can ride his garden hose I to the sunset!!! The more I use this app the more my blood sucking bowl Bonquiqui wants to take away my mountain of ham and destroyed my limited edition bob Marley bong!!!! The last problem is that when using this app, the gates of hell start to open up and when I look down I can see hitler playing the kazoo, the devil grading cheese off his feet and a man in a top hat riding a giant worm!","date":"2020-07-09T04:43:26Z"}},{"id":"6174887307","type":"user-reviews","attributes":{"userName":"trists184","title":"I can’t believe I wanted storage on this","isEdited":false,"rating":1,"review":"I downloaded this app because I support our lil  orange president  and our racist lil country ✨ and I wanted to show more support by downloading this amazing app ❤️ as soon as I downloaded this app, my phone started glitching out like crazy and the lights in my house began flickering on and off! It was absolutely insane! I told my bestfriend Karen to go check out the app after she was done harassing innocent minorities, and she said the same thing happened to her! I don’t know what’s wrong with this app but do not download it guys 😹 much love from Idaho ❤️❤️ \n\nblm <3","date":"2020-07-09T03:32:53Z"}},{"id":"6174885407","type":"user-reviews","attributes":{"userName":"Aaaakdjhdjeogrg","title":"absolutely terrible","isEdited":false,"rating":1,"review":"this app is dusty musty crusty. DO NOT GET THIS APP. it is appalling, offensive, and quite frankly a threat to society. when i first went on the app i was absolutely disgusted. everything about this goes against everything i stand for. this app will sneak into your house in the middle of the night and rob you of all your possessions. this app will wear white on YOUR wedding day. this app belongs is prison for the displeasure it brought upon me. one night this app tried to kidnap my innocent puppy and sell him on the black market to criminals. downloading this app was by far the worst mistake of my life. PLEASE REMOVE THIS!!!!!!!","date":"2020-07-09T03:32:20Z"}},{"id":"6174877602","type":"user-reviews","attributes":{"userName":"lillieoriginal","title":"No❤️","isEdited":false,"rating":1,"review":"I downloaded the app and my pet dragon left me,so I went to went to walk my donkey but when I came back my talking bed didn’t let me 😴 then Martha my average 🐕 she went roof and roof and roof when she ate some alphabet soup. I went to sleep in my couch and Sophia the first came I to my house singing about how she was a girl in a village doing alright then she became a princes over night and how she had to figure out how do it right and there’s so much to learn and see she’s up in a castle with her new family in a school that’s just for roalty a whole inchanted worl d is waiting for her so,","date":"2020-07-09T03:30:05Z"}},{"id":"6174844450","type":"user-reviews","attributes":{"userName":"mangledfox2003","title":"Awful!!!","isEdited":false,"rating":1,"review":"This app I genuinely terrible! Since downloading it I have this terrible feeling that I’m being watched and my information is being taken advantage of! It asked for my location and some personal info. It said that if I didn’t give it the information it wanted it was gonna deport my dad. It gives fake news and even has some photos of this terrifying looking orange alien thing! I’m horrified of this app, the authority it tries to give to terrible people and even worse cops, and never want to see photos like that ever again! NEVER GET THIS APP!!!","date":"2020-07-09T03:20:23Z"}},{"id":"6174803272","type":"user-reviews","attributes":{"userName":"dead gorl","title":"Made me die","isEdited":false,"rating":1,"review":"As soon as I opened this app assasns literally pulled up to my house kidnapped me and took me to their warehouse to kill me. It was a traumatizing experience and if I were still alive I would need more therapy then I’m already getting to try to sooth the ptsd. Moral of the story if u get this app you are supporting murders and ptsd which is bad karma for u and your family. So please do not buy this app unless you want the following ^^^ to happen. I would say have a great day but this app ruined my chance to do so since I am now deceased. My funeral is July 69th at 4:20 am don’t be late","date":"2020-07-09T03:08:19Z"}},{"id":"6174776607","type":"user-reviews","attributes":{"userName":"Rachita Iyer","title":"WORST APP","isEdited":false,"rating":1,"review":"I can’t believe I downloaded this app thinking it would be helpful!!! The Trump 2020 app completely ruined my phone! Before downloading it my phone was completely fine, probably the best phone to ever exist, but it went absolutely downhill as soon as I hit the “Get” button on the app store. As soon as I download the app I received an error message in my phone, and my phone wouldn’t stop crashing! Now I can’t open any of my other apps. After taking it to a professional it turns out I have to get a whole new phone!! Thanks a lot Trump 😡","date":"2020-07-09T03:00:12Z"}},{"id":"6174752950","type":"user-reviews","attributes":{"userName":"kawaiitamago","title":"if I eated soap I didn’t eat it because I did 😌🧚🏼‍♀️✨","isEdited":false,"rating":1,"review":"According to all known laws of aviation 😳 there is no way 🥵 a bee 🐝 should be able to fly ✈️. But bees don’t care what humans think is impossible 🥴 so the bee flies anyway. 😌 yellow black yellow black yellow black yellow black- OOH BLACK AND YELLOW 🤪 LETS SHAKE IT UP A LITTLE 🤩🤩🤩. Barry! Breakfast is ready! Coming! Hang on a second. Hello? 🤨 Barry? Adam? Can you believe this is happening? 😱 I can’t. I’ll pick you up. Looking sharp 😎 Use the stairs your father paid good money for those 😡 Sorry I’m excited. There’s the graduate we’re very proud of you son! 😃 A perfect report card, all B’s. Very proud 😌","date":"2020-07-09T02:53:00Z"}}]}