{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=19890","data":[{"id":"6173459431","type":"user-reviews","attributes":{"title":"HORRIBLE APP DO NOT DOWNLOAD!!!","date":"2020-07-08T19:32:03Z","userName":"sksksksk oop","rating":1,"isEdited":false,"review":"It took three weeks to download and my phone got very hot in the process, I took it to the store and they said I have to wait for it to finish. When it actually downloaded it started playing music which scared my dog into dancing with my dishwasher. I would not recommend downloading this unless you want strange things to happen to you!!!"}},{"id":"6173451149","type":"user-reviews","attributes":{"title":"Promoting Nazism","date":"2020-07-08T19:29:19Z","userName":"nazi penis that hitler","rating":1,"isEdited":false,"review":"I was deeply shocked as once I opened this new app I was confronted with page after page of nazi worship in all kinds. Images of an orange man with a terrible wig standing in front of millions of nazi sympathizers. And even an auction for hitlers or “ the second coming of Jesus Christ” pinky finger for over 2 million and they stated all of this would go towards Jew lives don’t matter. Do not buy"}},{"id":"6173431778","type":"user-reviews","attributes":{"title":"This app is causing me trauma 😱😭","date":"2020-07-08T19:22:47Z","userName":"eatyourpickleskids!!","rating":1,"isEdited":false,"review":"Every time I open the app I keep seeing a scary orange face that’s the color of a Cheeto. Now I need to go to therapy every week I also wanna bring up again the lag and crashing. I also wanna say that it seems like everything on there is made by people who just wanna make us shut up but just wanna say you can’t stop gen z 🤭"}},{"id":"6173420584","type":"user-reviews","attributes":{"title":"Awful","date":"2020-07-08T19:18:58Z","userName":"I nevercared😑","rating":1,"isEdited":false,"review":"Just a absolutely awful, I downloaded to support Cheeto face, and the system failed for me. I think the Racist pedo did something wrong. And the thing is it took weeks to download, but I mean weeks. It played some music that turned my cats into weird mutants and brought in some bugs and I absolutely hate bugs. Please take this down!!!"}},{"id":"6173409816","type":"user-reviews","attributes":{"title":"This app is HORRIBLE !!","date":"2020-07-08T19:15:19Z","userName":"ELIZABETHH11184","rating":1,"isEdited":false,"review":"This app is by far the WORST possible app created and it took about 3 weeks to download. It caused tons of glitches and viruses on my device Nd it was perfectly fine before I downloaded it. If I’m supposed to support a president who doesn’t even know how to create a decent device application then I’d rather hop across that border and call myself illegal."}},{"id":"6173399905","type":"user-reviews","attributes":{"title":"Terrible","date":"2020-07-08T19:11:51Z","userName":"Haleytato","rating":1,"isEdited":false,"review":"This period tracking app didn't even track my period. I gave it the date that I recently started my period, hoping that it would tell me when my next one would start. But I got notifications from TRUMP instead?? How is that racist mf gonna tell me when my period will start??? Anyways, do not download this app!"}},{"id":"6173395573","type":"user-reviews","attributes":{"title":"ABSOLUTELY HORRIBLE","date":"2020-07-08T19:10:18Z","userName":"biggesttrumpsupporter","rating":1,"isEdited":false,"review":"i cant even put into words what a horrible app this is, it has the worst content and it steals your credit card information I was here to support our beloved president next thing i know the app steals my credit card information and on top of that the app left my phone with 47 viruses. i’m completely devestated don’t download this app."}},{"id":"6173352688","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD THIS APP!!!","date":"2020-07-08T18:55:10Z","userName":"smtarielena orres","rating":1,"isEdited":false,"review":"You should not download this app it took so long to download. Then when I opened the app it started to glitch and lag. All I wanted to do was help myself be more educated but I guess that won’t be happening. Another thing that happened when I opened the app my location turn on I always have it off even before I opened the app.\nJUST DON’T GET THIS APP! ITS TERRIBLE."}},{"id":"6173347542","type":"user-reviews","attributes":{"title":"Not ok","date":"2020-07-08T18:53:21Z","userName":"SYDSUM33333","rating":1,"isEdited":false,"review":"It is AWFUL the app took to long to download then started glitching my phone. It is tracking everyone who downloads this app !!!! Please help my phone will randomly turn off after I got the app. This also happens to other people I know.\n\nDO NOT DOWNLOAD.... your phone will brake. Even if somehow it does not break the app is not worth it. The info is unreliable"}},{"id":"6173328151","type":"user-reviews","attributes":{"title":"I HATE 🍊 WORST APP🙈😡😡🙄","date":"2020-07-08T18:46:34Z","userName":"Change this dumb game😤😤😤","rating":1,"isEdited":false,"review":"WORST APP EVER!!!! Once I downloaded it, Trump called me and said that a was a big fat stinky prune!! Then he sent a couple of roaches to kill me and burn my house!!! Mh cat Lily defended me through this tragic moment, and then they STOLE MY CAT LILY!!! Hours later my cat Lily called me from Trumps house and showed my secret information about trump, THEN TRUMP TRIED TO TAKE TIK TOK FROM ME!! I WAS STARTING TO GET FAMOUS, I HAVE 183 FOLLOWERS AND NOW THEY ARE ABOUT TO GO DOWN THE DRAIN!!! I HATE TRUMP GRRRRR follow my Tik Tok : ally_spamzx I STILL HATE THAT ORANGE"}}]}