{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=3390","data":[{"id":"6177314090","type":"user-reviews","attributes":{"review":"Well I tried to download the app and from looking at the other reviews mine isn’t the only one that took about a week. This app is nothing special, it’s all irrelevant things and shouldn’t be used. It just takes up space on my phone and glitches the whole time while during use. I just got so annoyed that I tried to break my phone while jumping off a cliff. It didn’t break my phone but it did break me. I blame  trump for making me go to A WHOLE DIFFERENT planet to get what I needed. There were no other humans and I just ended up being kidnapped by aliens and they brought me to Area 51. And here I am now, this is my cry for help. I blame trumps app for this mess.","title":"Heartbeenbrokesomanytimesiiiii","userName":"aidsoncrakcers","rating":1,"date":"2020-07-09T16:12:47Z","isEdited":false}},{"id":"6177277331","type":"user-reviews","attributes":{"review":"Welp, sorry Donald-not really- but the fact is your trying to take down a super social media app filled with gen z children and millennials that are quite literally almost afraid of nothing except human interaction at the store.  Your trying to take to take down an app that’s has completely succeeded in embarrassing you not once but multiple times and also why you would have a app for your campaign seems to be the dumbest thing you can do as you can see by the reviews. So listen here you big dumb fat overgrown Oompa Loompa looking dumb as*, if you delete TikTok, then we just gonna move to a different country or spam you with fairy comments dude.","title":"...you knew this was gonna happen","userName":"Shirindehgh","rating":1,"date":"2020-07-09T16:02:18Z","isEdited":false}},{"id":"6177219972","type":"user-reviews","attributes":{"review":"I originally downloaded the app because I saw it was ranked #1 in news, so I believed that if it is that popular it should be very accurate. I should have read the other reviews before downloading the app. When I first opened the app, I was greeted by a giant orange man who asked me to put in my phone number, and made me sign my allegiance to the campaign. I thought I was going to hear news about how a cat got saved from a tree, but instead I received texts every 20 seconds about how Donny is our savior and Joe Biden is very sleepy and old. The fact that I was forced to sell my soul and then listen to Fox News Type Beat media made me give this app 1 star. If I could give 0, I would.","title":"Extremely Biased","userName":"Hugh G. Reaction 👁👄👁","rating":1,"date":"2020-07-09T15:45:34Z","isEdited":false}},{"id":"6177205478","type":"user-reviews","attributes":{"review":"As soon as i downloaded this app my phone completely shut off! I have been respecting quarantine and am frankly a lazy person, so i just watched netflix on my broken laptop instead! Then! My dog brought me my phone! On the screen was a zoomed in picture of our highly esteemed president’s tiny pecker! My poor winston (doggy🤭😋) thought it was a tiny sausage and tried to eat my phone! Of course i tried to snatch it from him, but i put him on a diet so he was extraa hungry and sprinted off with the phone. My poor doggo nearly killed himself trying to get the tasty morsel on screen! Dont download this app! Not safe for women/children/dogs/large menly men/small men/LGBTQ aliens/illegals/aliens/hentai watchers/incels! Stay safe out there!","title":"Doggy trauma","userName":"not from TikTok😘","rating":1,"date":"2020-07-09T15:41:25Z","isEdited":false}},{"id":"6177147022","type":"user-reviews","attributes":{"review":"This app is absolutely horrible it is not easy to get around plus it has trumps face on it everywhere you look which is GROSS we dont need trump anyways hes a threat to our society hes racist and homophobic and sexist may the list go on he needs to go he has been in office for 4 years lets not make it 8 vote blue no matter who. Anyways this app is gross and repulsive the way that the trumpies are like a cult making a whole app that does not separate the church and the state the trumpies never know whats the logical thing to do because theyre so slow. This app is horrible horrendous you could say and frankly it does not show trump in a good light it makes him worse anyways delete this app its awful 🤪","title":"delete this app apple","userName":"Love girl 8735","rating":1,"date":"2020-07-09T15:24:57Z","isEdited":false}},{"id":"6177075126","type":"user-reviews","attributes":{"review":"As soon as I opened the app I hated it.... Since more people started writing reviews, I figured I’d share my story now. Donald Trump’s apps are DANGEROUS!! I started having nightmares and I actually almost seized once. I go to therapy regularly now. But, thanks to not receiving a stimulus check or unemployment, I’m now very broke. My therapy sessions are expensive and my job cut my hours due to Covid-19. Maybe if more Americans wore masks Covid-19 would die down and I’d get more hours to be able to pay for therapy....The trauma this app caused is unbelievable and I was very surprised an app could even do that. I honestly hope I have a seizure so hard it shakes the trauma out and I forget about this app AND Donald Trump for good.","title":"Traumatizing and Dangerous!!!!","userName":"kxnzie.h","rating":1,"date":"2020-07-09T15:05:05Z","isEdited":false}},{"id":"6176920336","type":"user-reviews","attributes":{"review":"This app took an incredibly long time to download and once it opened up crashed immediately. I was also hoping to be able to use it to get useful information on it as well but sadly it was not what I expected. Waste of space on my phone and time on my hands. I do not recommend using this app unless you would like to spend hours being unproductive and ultimately get very angry and frustrated. The app also gave my personal data (name, number, etc.) away and I am being hacked and texted by many random numbers that have nothing to do with the president. It’s awful. Do not recommend and I would give it 0 starts if possible.","title":"Not impressed, dissatisfied.","userName":"Mayte M. C.","rating":1,"date":"2020-07-09T14:23:26Z","isEdited":false}},{"id":"6176908490","type":"user-reviews","attributes":{"review":"For starters, it took AGES to download. Once it finally downloaded, I was expecting to be met with some fun information, some smiles and rainbows and all. The app hacked into my phone, and quite frankly I feel unsafe now knowing that bunker boy has access to my cell phone. I know for a fact that this has happened to a couple of my friends as well. None the less, I tried to navigate the app, and it was so so difficult to just get around! Everything was all over the place and the categories were misleading (just like his administration!). I can say with 100% confidence that this is the worst app I’ve ever had, I’d rather spend my time on Barbie Makeup. If there I could I’d rate it 0 stars.","title":"GARBAGE APP","userName":"corona wont stop is","rating":1,"date":"2020-07-09T14:20:21Z","isEdited":false}},{"id":"6176753122","type":"user-reviews","attributes":{"review":"I had VERY high expectations for this app, however when it finally downloaded (it took an entire week) the first thing that popped up was my search history?!!! How dare they have that on hand. but finally after i deleted that tab it asked for all of my personal information! I think it is very inappropriate for the president to have such information about me. He does have a wife you know. And after all of that mess it started glitching! it was exiting me in and out of the app as well as making screeching noises. definitely a 0/5 stars if that’s what i could give it. do NOT recommend. sorry donald but i think you need to work on yourself a little more... in prison 🥰","title":"✨🧚🏻","userName":"🧚🏻✨🦋","rating":1,"date":"2020-07-09T13:39:25Z","isEdited":false}},{"id":"6176680510","type":"user-reviews","attributes":{"review":"'Did you ever hear the Tragedy of Darth Plagueis the wise? I thought not. It's not a story the Jedi would tell you. It's a Sith legend. Darth Plagueis was a Dark Lord of the Sith, so powerful and so wise he could use the Force to influence the midichlorians to create life... He had such a knowledge of the dark side that he could even keep the ones he cared about from dying. The dark side of the Force is a pathway to many abilities some consider to be unnatural. He became so powerful... the only thing he was afraid of was losing his power, which eventually, of course, he did. Unfortunately, he taught his apprentice everything he knew, then his apprentice killed him in his sleep. It's ironic he could save others from death, but not himself.'","title":"NEVER!","userName":"Kasey_starwarz","rating":1,"date":"2020-07-09T13:20:21Z","isEdited":false}}]}