{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=129080","data":[{"id":"6175802547","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:56:55Z","userName":"pp Listic","isEdited":false,"review":"HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK HOT SHREK","title":"terrible"}},{"id":"6175801063","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:56:27Z","userName":"ACUiuuuuuuuuC","isEdited":false,"review":"According to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway. Because bees don’t care what humans think is impossible.” SEQ. 75 - “INTRO TO BARRY” INT. BENSON HOUSE - DAY ANGLE ON: Sneakers on the ground. Camera PANS UP to reveal BARRY BENSON’S BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black...oohh, black and yellow... ANGLE ON: Barry wearing the sweater he picked, looking in the mirror. BARRY (CONT’D) Yeah, let’s shake it up a little. He picks the black and yellow one. He then goes to the sink, takes the top off a CONTAINER OF HONEY, and puts some honey into his hair. He squirts some in his mouth and gargles. Then he takes the lid off the bottle, and rolls some on like deodorant. CUT TO: INT. BENSON HOUSE KITCHEN - CONTINUOUS Barry’s mother, JANET BENSON, yells up at Barry. JANET BENSON Barry, breakfast is ready! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 1. INT. BARRY’S ROOM - CONTINUOUS BARRY Coming! SFX: Phone RINGING. Barry’s antennae vibrate as they RING like a phone. Barry’s hands are wet. He looks around for a towel. BARRY (CONT’D) Hang on a second! He wipes his hands on his sweater, and pulls his antennae down to his ear and mouth. BARRY (CONT'D) Hello? His best friend, ADAM FLAYMAN, is on the other end. ADAM Barry? BARRY Adam? ADAM Can you believe this is happening? BARRY Can’t believe it. I’ll pick you up. Barry sticks his stinger in a sharpener. SFX: BUZZING AS HIS STINGER IS SHARPENED. He tests the sharpness with his finger. SFX: Bing. BARRY (CONT’D) Looking sharp. ANGLE ON: Barry hovering down the hall, sliding down the staircase bannister. Barry’s mother, JANET BENSON, is in the kitchen. JANET BENSON Barry, why don’t you use the stairs? Your father paid good money for those. \"Bee Movie\" - JS REVISIONS 8/13/07 2. BARRY Sorry, I’m excited. Barry’s father, MARTIN BENSON, ENTERS. He’s reading a NEWSPAPER with the HEADLINE, “Queen gives birth to thousandtuplets: Resting Comfortably.” MARTIN BENSON Here’s the graduate. We’re very proud of you, Son. And a perfect report card, all B’s. JANET BENSON (mushing Barry’s hair) Very proud. BARRY Ma! I’ve got a thing going here. Barry re-adjusts his hair, starts to leave. JANET BENSON You’ve got some lint on your fuzz. She picks it off. BARRY Ow, that’s me! MARTIN BENSON Wave to us. We’ll be in row 118,000. Barry zips off. BARRY Bye! JANET BENSON Barry, I told you, stop flying in the house! CUT TO: SEQ. 750 - DRIVING TO GRADUATION EXT. BEE SUBURB - MORNING A GARAGE DOOR OPENS. Barry drives out in his CAR. \"Bee Movie\" - JS REVISIONS 8/13/07 3. ANGLE ON: Barry’s friend, ADAM FLAYMAN, standing by the curb. He’s reading a NEWSPAPER with the HEADLINE: “Frisbee Hits Hive: Internet Down. Bee-stander: “I heard a sound, and next thing I knew...wham-o!.” Barry drives up, stops in front of Adam. Adam jumps in. BARRY Hey, Adam. ADAM Hey, Barry. (pointing at Barry’s hair) Is that fuzz gel? BARRY A little. It’s a special day. Finally graduating. ADAM I never thought I’d make it. BARRY Yeah, three days of grade school, three days of high school. ADAM Those were so awkward. BARRY Three days of college. I’m glad I took off one day in the middle and just hitchhiked around the hive. ADAM You did come back different. They drive by a bee who’s jogging. ARTIE Hi Barry! BARRY (to a bee pedestrian) Hey Artie, growing a mustache? Looks good. Barry and Adam drive from the suburbs into the city. ADAM Hey, did you hear about Frankie? \"Bee Movie\" - JS REVISIONS 8/13/07 4. BARRY Yeah. ADAM You going to his funeral? BARRY No, I’m not going to his funeral. Everybody knows you sting someone you die, you don’t waste it on a squirrel. He was such a hot head. ADAM Yeah, I guess he could’ve just gotten out of the way. The DRIVE through a loop de loop. BARRY AND ADAM Whoa...Whooo...wheee!! ADAM I love this incorporating the amusement park right into our regular day. BARRY I guess that’s why they say we don’t need vacations. CUT TO: SEQ. 95 - GRADUATION EXT. GRADUATION CEREMONY - CONTINUOUS Barry and Adam come to a stop. They exit the car, and fly over the crowd to their seats. * BARRY * (re: graduation ceremony) * Boy, quite a bit of pomp...under * the circumstances. * They land in their seats. BARRY (CONT’D) Well Adam, today we are men. \"Bee Movie\" - JS REVISIONS 8/13/07 5. ADAM We are. BARRY Bee-men. ADAM Amen! BARRY Hallelujah. Barry hits Adam’s forehead. Adam goes into the rapture. An announcement comes over the PA. ANNOUNCER (V.O) Students, faculty, distinguished bees...please welcome, Dean Buzzwell. ANGLE ON: DEAN BUZZWELL steps up to the podium. The podium has a sign that reads: “Welcome Graduating Class of:”, with train-station style flipping numbers after it. BUZZWELL Welcome New Hive City graduating class of... The numbers on the podium change to 9:15. BUZZWELL (CONT’D) ...9:15. (he clears his throat) And that concludes our graduation ceremonies. And begins your career at Honex Industries. BARRY","title":"Terrible"}},{"id":"6175798967","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:55:46Z","userName":"Karen the Overlord","isEdited":false,"review":"Everyone needs to know about how horrible this app is!! It tried to make me pay $36.99 to buy a Trump sticker!! Now normally I would but I got robbed when I was showing my support to our president on my road! They stole my hat and my confederate flag. This app runs slowly and kept having inappropriate ads. One ad was for a new mixer and I clicked on it and now my device is on fire!!!! This app ruined my life!","title":"Awful 🗣🗣"}},{"id":"6175797732","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:55:19Z","userName":"Moe Lester😉","isEdited":false,"review":"Roll💿up⬆️to2️⃣the🤩party🥳with🧶my🧚crazy🤪pink💝wig💇🏼‍♀️","title":"Worse than the cats movie"}},{"id":"6175794242","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:54:07Z","userName":"samantha😒","isEdited":false,"review":"if u trying to figure out if u should get this app or not my answer is NO. i don't know why this app took so long to download (99.999999 weeks). and after it finally did all of my social media accounts got HACKED.. my bank account got DRAINED.. all i was tryna do was support me lovely (but racist) president, this app is the WORST ONE YET😤😤","title":"IF I COULD GIVE THIS A ONE STAR I WOULD"}},{"id":"6175791975","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:53:19Z","userName":"Jenny Est","isEdited":false,"review":"donald trump🤢 is disgusting. when he thinks about his child he thinks about sex. he’s a racist. he is absolutely disgusting. i dont know how people can support this monster. this app shouldnt have been here in the first place. btw if u see this call me ;) 786-616-6253","title":"horrible app and person"}},{"id":"6175791201","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:53:03Z","userName":"thixc","isEdited":false,"review":"wish i could give no stars, this app is so ass lol","title":"🤢"}},{"id":"6175789474","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:52:27Z","userName":"copperate","isEdited":false,"review":"This app has to be the worst thing that has happen to me all week 😭 when I download the app my cat started pissing on my bed on my phone that it stopped downloading later on I downloaded it again but it just won’t budge I don’t recommend this app to any user for a lack of discipline","title":"Horrible 😖"}},{"id":"6175782044","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:49:53Z","userName":"itz_xutumx","isEdited":false,"review":"So I downloaded this app to support America and our amazing president but this app took FOREVER to download and when it did he asked for my number?!? I was taken back for a second but I gave it to him anyways cause like That’s the president... well anyways he kept texting me and at first I replied but than it just started getting creepy like how does he have so much time on his hands to text me this much and eventually I just deleted & blocked his number AND THAN he pops up on my TV as a YouTube advertisement telling me he is sorry and I felt bad and accepted it and told him to calm down on texting me because I ain’t no home wrecker\nEdit: ever since I left this honest review I keep seeing Cheeto ads EVERYWHERE YouTube, gaming apps, Hulu 😭 SOMEONE HELP\nIF I GET KIDNAPPED JUST KNOW IT WAS THAT CHEETO","title":"DO NOT GET THIS APP"}},{"id":"6175779977","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T08:49:09Z","userName":"🌚👁👄👁🤪","isEdited":false,"review":"I just downloaded this app to support this wonderfully horrible human being with no brain 🧠 but the structure of the app is horrible 🤢 I wish I could give it a -.000000000000000 but I can’t 😔💫✌️","title":"🥱"}}]}