{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=127400","data":[{"id":"6177711030","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:14:01Z","rating":1,"review":"When I downloaded this app my phone had all types of bugs! I couldn’t even unlock my phone so I had to buy a new one now I have an android!! This app has to go! Also for some reason there were many packages in my front door after hours of getting this app. It was all sorts of weird thing y’all don’t wanna know! They also bought cockroaches to my house and now I need to move! Thanks a lot Stanky Trump for this infestation 😭🤮","userName":"Xaxita","title":"This is the worst app created in history!"}},{"id":"6177711017","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:14:00Z","rating":1,"review":"-10/10000 would not recommend :/","userName":"Racheallllllllllllllllllll","title":"Big Yikes 👁👄👁"}},{"id":"6177708295","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:13:11Z","rating":1,"review":"Trump is probably one of the worst presidents this country has EVER seen. Not only is he the worst president, he’s also a sexist, rapist,racist,  homophobic dumb ass. He completely ignored everything about the coronavirus in January by saying ‘it’ll just go away’ ‘it’ll disappear in confident it will’ he has done NOTHING to protect our military and citizens of this country. I want this app completely removed from the App Store","userName":"lexi2246","title":"Trump is trash"}},{"id":"6177707438","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:12:55Z","rating":1,"review":"After waiting for the app to download for 2 weeks I was already impatient. I was just trying to get a spot at the rally that j would indeed ✨not✨ go to. Ayer I opened the app it took me 20 minutes to get into the part to fill in my information for the rally. After I got my ticket I deleted the app. After doing so I had already gotten 7 texts and 3 calls from random numbers. My phone usually doesn’t ever get texts or calls much less from random people. Every time it would be a different number. The next day the calls and texts were becoming more frequent. Then my phone started to crash. Now some people may say it’s because of the \ntype of phone I have but it definitely isn’t. I have the iPhone 11 Pro Max. And I just got it 2 months ago. I have had no other problems with this phone. I have never dropped the phone neither have I ever gotten it wet. It has a very protective case on it and it up to date. I’ve never had these problems in any other phone I’ve had either. The calls and texts throughout the days were progressively getting larger and longer. I ended up restarting my phone and loosing all my pictures and contacts. I would like all the other people using this app to be aware of the problems going on. Thanks for your time luv.😘\n                          -Tiktok whore💅🏼💁🏾‍♀️💘🦄","userName":"s on d ridmdjic","title":"TERRIBLE✨✨"}},{"id":"6177705429","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:12:19Z","rating":1,"review":"I purchased the application in hopes find a fun, family friendly, educational game for my nieces goldfish to play with. However, after showing the goldfish, named Mr.Buttons, how to use the app, he became oranger? I was confused at first, I was worried he was sick. As it turns out, he was VERY SICK... in the head, with awful political views induced by this garbage dump of a campaign. Hope y’all have a good day and remember to vote!","userName":"ReviewRebecca","title":"Extremely Disappointed"}},{"id":"6177704804","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:12:08Z","rating":1,"review":"mr orange man f u 👅😍 you son fine asfk doe he got insta ? 😜","userName":"anux is mee","title":"Smh"}},{"id":"6177704606","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:12:04Z","rating":1,"review":"Here it is! Thanks. Did you guys sign it? Did you sign the card?And five and four and--Hey, girls, sign! All right! Here you go! - Elle's gonna love it! - Thanks. You go, girl! Hi, girls! Here, sign! Thanks! There she is. Thank you!I love that restaurant! I heard Madonna went into labor there. Oh, gosh! I have to go shopping! \n\nI'll see you tonight. Bye.  Bruiser, what's this?\n\n            \"Good luck tonight. Elle and Warner forever.\"\n\nOh, that's so cute.Oh, my gosh! You guys are so sweet!\n\nBut I'm not positive it'll happen tonight.\n\nHello! He just had lunch with his grandmother.\n\nYou know he got the rock.\n\n    Why else would she have flown in from Newport?\n\n It's not like she'd Fed Ex a six-carat diamond.\n\n            Do you really think?\n\n            I can't believe you're getting engaged!\n\n            Oh, my gosh...\n\n            you guys have to help me pick out the perfect outfit.\n\n            Come on!\n\n            I think you should go with the red.\n\n            It's the color of confidence.\n\n            I don't understand why you're disregarding...\n\n            your signature color.\n\n            He's proposing. I can't look like I would on any other date.\n\n            This is the date-- the night I'll always remember.\n\n            I want to look special.\n\n            Bridal.\n\n            But not like I expect anything.\n\n            There's nothing I love more...\n\n            than a dumb blonde with daddy's plastic.\n\n            Did you see this one? We just got it in yesterday.\n\n            Is this low-viscosity rayon?\n\n            Yes. Of course.\n\n            With a half-loop top-stitching on the hem?\n\n            Absolutely. It's one of a kind.\n\n            It's impossible to use a half-loop top-stitching...\n\n            on low-viscosity rayon. It would snag the fabric.\n\n            And you didn't just get it in.\n\n            I saw it in the June Vogue a year ago.\n\n            So if you're trying to sell it for full price...\n\n            you picked the wrong girl.\n\n            Girls, this is it.\n\n            In a few hours...\n\n            I'll be the future Mrs. Warner Huntington III.\n\nWow. You look so beautiful.\n\n            So do you.\n\n            Let's get out of here.\n\n            Must be strange having such perfect eyes.\n\n            God, you're so wonderful. Elle, thank you.\n\n            Here's to us.\n\n            To us.\n\n            One of the reasons I wanted to come here tonight...\n\n            was to discuss our future.\n\n            And I am fully amenable to that discussion.\n\n            Good. You know how we've been having...\n\n            all kinds of fun lately?\n\n             Well, Harvard is gonna be different.\n\n              Law school is a completely different world...\n\n              and I need to be serious.\n\n              Of course.\n\n              My family expects a lot from me.\n\n              - Right. - I expect a lot from me.\n\n              I plan on running for office someday.\n\n              I fully support that. You know that.\n\n              Absolutely. But the thing is...\n\n              if I'm going to be a senator by the time I'm thirty...\n\n              I need to stop dicking around.\n\n              Warner, I completely agree.\n\n              That's why I think it's time for us...\n\n              Elle, pooh bear...\n\n              - I do. - I think we should break up.\n\n              What?\n\n              I've been thinking, and it's the right thing to do.\n\n              You're breaking up with me?\n\n              I thought you were proposing.\n\n              Proposing?\n\n              Elle, if I'm going to be a senator...\n\n              I need to marry a Jackie, not a Marilyn.\n\n              You're breaking up with me because I'm too blonde?\n\n              No. That's not entirely true.\n\n              Then what? My boobs are too big?\n\n              Elle, your boobs are fine.\n\n              So when you said that you would always love me...\n\n              you were just dicking around?\n\n              Elle, I do love you.\n\n              I just can't marry you.\n\n              You have no idea of the pressure that I am under.\n\n              My family has five generations of senators.\n\n              My brother's in the top three at Yale Law.\n\n              He just got engaged to a Vanderbilt,for Christ's sake.\n\n              Bad salad.\n\n              Sweetie...\n\n              Pooh bear?\n\n              It's not like I have a choice here, sweetheart!\n\n              You get the car, I'll get the check.\n\n              I won't be having the salad.\n\n              Let me take you home.\n\n              Elle, believe me. I never expected to do this...\n\n              but I think it's the right thing.\n\n              How can it be the right thing when we're not together?\n\n              I have to think of my future...\n\n              and what my family expects of me.\n\n              So you're breaking up with me...\n\n              because you're afraid your family won't like me?\n\n              Everybody likes me.\n\n              East Coast people are different.\n\n              Because I'm not a Vanderbilt, suddenly I'm white trash?\n\n              I grew up in Bel Air!\n\n              Across the street from Aaron Spelling!\n\n              Most people would agree that's a lot better...\n\n              than some stinky old Vanderbilt!\n\n              I told you. I need someone serious.\n\n              But I'm seriously in love with you.\n\n              Isn't that enough?\n\n              Pooh bear, just get in the car.\n\n              You'll ruin your shoes.\n\nH","userName":"Jared from that one vine","title":"Legally Blonde"}},{"id":"6177704145","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:11:56Z","rating":1,"review":"this app is sooo bad.So first I saw a giant fat Cheeto man.He turned me into a Cheeto and the I showed my penguin btw his name is Martha the app and he turned into a Cheeto.Also my taco turned into a sombrero.Then everything turned in Cheetos every tim I opens the app all the sudden the app blew up McDonald’s. And then my penguin started doing the conga witch I was fine with in till he started blowing up more and more McDonald’s. And then all of a sudden everything turns into llamas.Witch was great until creepy Cheeto man appeared and road the llamas till they stared shooting lasers out of their eyes.and now everything thing is destroyed.So if you don’t want this to happen to you then DO NOT DOWNLOAD thank you for your time❤️🥰❤️🥰","userName":"Gold duck jr","title":"My penguin is a Cheeto"}},{"id":"6177702035","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:11:18Z","rating":1,"review":"Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash Trash trash trash trash trash trash trash trash trash trash trash ORANGE","userName":"jaleyacastillo2006","title":"Trash trash trash trash trash trash trash trash trash trash trash"}},{"id":"6177701448","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T18:11:07Z","rating":1,"review":"10/10 would not recommend. All the Karen’s and Chads that help create this app can go to hell. This app is not gonna empower nobody and all the airheads who say this app is not pathetic can kiss my black ass. You don’t have any idea why ppl of this generation are doing this. Absolutely clueless and uneducated by why everyone is so upset. Ppl who have this downloaded in their phone in hopes that in November he will win are narcissistic, racist and impulsive. It takes a lot to support him. Someone who doesn’t care for kids of all races and someone who only cares for himself. That’s not a president that’s a uneducated and privileged white man. Once again we have to repeat history with the cruel intentions of a dictator. In conclusion this app is terrible and I would not recommend to anyone of any sorts. Yours truly Gen Z 🥰❤️❤️","userName":"gennie_z","title":"Built like a door"}}]}