{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36730","data":[{"id":"6173377385","type":"user-reviews","attributes":{"isEdited":false,"userName":"fojacta","rating":1,"date":"2020-07-08T19:03:44Z","review":"This app is the most racist biased most bigoted app ever. This app makes blacks look as if they are criminals and is used to support that. If this app remains on the App Store I will completely stop using apple because that means that they support this kind of stuff. That old bastard will never learn huh??","title":"THIS APP IS SO RACIST OMFGGG"}},{"id":"6173374890","type":"user-reviews","attributes":{"isEdited":false,"userName":"fae got","rating":1,"date":"2020-07-08T19:02:50Z","review":"It was a very hard app to understand, how could someone be so against people that aren’t white, straight, and rich. I though the app could have flavor but no. None. Do not download this app unless you wanna see the balony that is the United States president","title":"DO NOT DOWNLOAD"}},{"id":"6173363031","type":"user-reviews","attributes":{"isEdited":false,"userName":"ane onomous","rating":1,"date":"2020-07-08T18:58:47Z","review":"This app took forever to download. The app continually crashes whenever I open it. If it doesn’t crash it doesn’t load. -10/10 would not recommend","title":"Horrible app"}},{"id":"6173344888","type":"user-reviews","attributes":{"isEdited":false,"userName":"Ohyeathat","rating":1,"date":"2020-07-08T18:52:25Z","review":"This app never functioned properly. Just like the person it’s named after. I also found out it took up most of the memory in my phone. Worthless!! It doesn’t work! Save yourselves and avoid this app like COVID!!!!!","title":"Horribleness"}},{"id":"6173334742","type":"user-reviews","attributes":{"isEdited":false,"userName":"Uh oh stinky poopies","rating":1,"date":"2020-07-08T18:48:51Z","review":"Bruh ok first I was like ima give the app a chance its poorly made and it actually took a long time to download not only that but it took up a lot of my space and second I mean just now for y’all who underst 😌👏🏻","title":"Honestly no honey nice try"}},{"id":"6173331506","type":"user-reviews","attributes":{"isEdited":false,"userName":"Bluefacebaby7","rating":1,"date":"2020-07-08T18:47:44Z","review":"This app is horrible and ridiculous. When i downloaded this app it took 42 mins and on top of the it almost put a virus, so don’t download this app it’s no help🤮and he is not making america great again.","title":"Horrible"}},{"id":"6173330081","type":"user-reviews","attributes":{"isEdited":false,"userName":"YoBoyCare","rating":1,"date":"2020-07-08T18:47:14Z","review":"First of all when you download the app, you can’t do anything while it’s downloading. Once it’s downloaded it just glitches the whole time. Black bars appear, it’s just not a fun experience.","title":"This app is HORRIBLE"}},{"id":"6173323110","type":"user-reviews","attributes":{"isEdited":false,"userName":"MistyYoutube","rating":1,"date":"2020-07-08T18:44:53Z","review":"This ain’t it chief, every two seconds it asks me for a review so now I’m doing it, and it crashed like 29 times, this is unacceptable, this app is a waste of space, and I’m deleting it as soon as I’m done with this review, if tik tok is going down so is this app","title":"No way Jose"}},{"id":"6173313896","type":"user-reviews","attributes":{"isEdited":false,"userName":"loridoy","rating":1,"date":"2020-07-08T18:41:49Z","review":"Because if orange we have to prostest every day and all store need to stand up by deleting this app is they support black lives mater apple do you support black lives matter if you do great job of you don’t delete this app it mite be wart not a threat","title":"Orange Chetto puff"}},{"id":"6173301157","type":"user-reviews","attributes":{"isEdited":false,"userName":"SuperHoneyBee","rating":1,"date":"2020-07-08T18:37:48Z","review":"The entire time the app glitches and having the app on your phone will completely run your battery down. If I could give it a one star review I would!","title":"Don’t bother downloading"}}]}