{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36780","data":[{"id":"6172977207","type":"user-reviews","attributes":{"title":"Bad","userName":"Shimp Orange dick","review":"It took years just to load, I couldn’t even play beat blade without it lagging it’s not helping me pay my rent. I thought trump helped people who need money but it goes to show how a spoiled orange shrimp boy thinks he’s all that. Anyways Stan Bernie Sanders for clear skin","isEdited":false,"rating":1,"date":"2020-07-08T16:54:17Z"}},{"id":"6172976553","type":"user-reviews","attributes":{"title":"My life","userName":"fhgctvg","review":"This app has made me lose my whole family it’s kilt my brother my cousin and my grandmother ❗️I was so stressed out I started doing drug I was raped I kilt a man and went to jail this app has given me anxiety  depression I want apple to delete this app immediately.","isEdited":false,"rating":1,"date":"2020-07-08T16:54:06Z"}},{"id":"6172963496","type":"user-reviews","attributes":{"title":"I not working","userName":"not wo","review":"I log in them it remove me from the app it don’t work I saw some inappropriate things on there two this app is bad it be glitching your phone out please report this than you","isEdited":false,"rating":1,"date":"2020-07-08T16:50:07Z"}},{"id":"6172962552","type":"user-reviews","attributes":{"title":"Do not download!","userName":"ItsJustBrenn","review":"Ugh this is terrible!! I was so eager to be able to download this app, but it took about 2 hours to download! And when I opened the app it just kept showing orange all over my screen. One star!","isEdited":false,"rating":1,"date":"2020-07-08T16:49:49Z"}},{"id":"6172957964","type":"user-reviews","attributes":{"title":"I hate this app","userName":"charles megilan","review":"This app glitched my phone. I wanted to download the app the see if I could like trump again but obviously I can’t. AND the government hacked my phone and started deleting my apps. I am so disjointed in this country. I will NEVER get this app EVER again.","isEdited":false,"rating":1,"date":"2020-07-08T16:48:23Z"}},{"id":"6172956671","type":"user-reviews","attributes":{"title":"horriblee","userName":"Chloe Castillo","review":"When i downloaded it my phone started getting super hot. When i went into the app it made my phone glitch and wouldn’t let me exit the app. I don’t recommend this, it was a waste of time.","isEdited":false,"rating":1,"date":"2020-07-08T16:47:59Z"}},{"id":"6172922943","type":"user-reviews","attributes":{"title":"Horrible","userName":"insecurtitied","review":"This app took many many days to download and I can’t BELIVE it had the audacity to ask me for a review when it had already made my phone flush, and took tons of my iCloud storage,wouldn’t recommend","isEdited":false,"rating":1,"date":"2020-07-08T16:37:24Z"}},{"id":"6172920616","type":"user-reviews","attributes":{"title":"Horrible","userName":"brizzy_mclizzy","review":"Absolutely horrible has the worst quality I have seen in an app before. So terrible. This app is just not worth taking up my space on my phone. I wish it got taken down.","isEdited":false,"rating":1,"date":"2020-07-08T16:36:42Z"}},{"id":"6172874260","type":"user-reviews","attributes":{"title":"This is probably the worst app on my phone","userName":"Guy that goes to school","review":"Ever since I got this app there has been problems with my phone. My phone has been very slow and glitching out. The day after I got this app my dog died. The app is cursed","isEdited":false,"rating":1,"date":"2020-07-08T16:22:27Z"}},{"id":"6172850755","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD THIS APP","userName":"Soully awesome","review":"This app is just horrible. Honestly I don’t even know how it made it to the App Store. It glitches often, crashes even more. And on top of all of that the interface is counterproductive and just, disappointing. I hate it","isEdited":false,"rating":1,"date":"2020-07-08T16:15:18Z"}}]}