{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=129280","data":[{"id":"6175594750","type":"user-reviews","attributes":{"rating":1,"userName":"Mya🇩🇴🇵🇷💖💖💖","review":"This hacked my phone .I do not recommend it at all.It leak my dick as well I was shocked.😳","title":"Terrible 😤😤","isEdited":false,"date":"2020-07-09T07:44:35Z"}},{"id":"6175594479","type":"user-reviews","attributes":{"rating":1,"userName":"dadfsvb","review":"8 HOURS TO DOWNLOAD. Drained all my battery imminently and took all my storage☠️This app also steals all data and send it directly to Russia. I DIDNT WANT TO SEE A DISGUSTING CHEETO PICS. 🤮 there just so many pictures of a homophobic racist rapist. This app is like a cult it takes over and destroyed everything. This app also turns the entire construct of your phone orange and auto correct all to absolutely idiotic babbling just like trumps Speeches. If I could give this app a zero stars I would and if I could erase it from the App Store for other people’s safety I would. DISGUSTING 10/10 would NOT RECOMMEND TERRIBLE LAY OUT AND TOTAL DISREGARD FOR COMMEN SENSE JUST HIM RUNNING THS COUTRY. 🤢🤢🤢","title":"WORST APP EVER🤮","isEdited":false,"date":"2020-07-09T07:44:29Z"}},{"id":"6175593802","type":"user-reviews","attributes":{"rating":1,"userName":"Cam1234342758698","review":"app glitched my entire phone!!  made me go to bernie sanders insta and follow him!! 😡😡😡 it also made me stream one direction on spotify over and over again!! beware!!","title":"don’t get!!","isEdited":false,"date":"2020-07-09T07:44:14Z"}},{"id":"6175592667","type":"user-reviews","attributes":{"rating":1,"userName":"zero two🥴","review":"It was terrible it tracked my ip then I got booted offline for 69420 days then the app shot my dog and killed my parents🥰😊","title":"It killed my parents","isEdited":false,"date":"2020-07-09T07:43:51Z"}},{"id":"6175590827","type":"user-reviews","attributes":{"rating":1,"userName":"mikrokosmos-","review":"this is the worst app to exist. If I could give it zero stars I would but unfortunately you can’t, trash app!!!!!!!!!!! Stream More and More on Spotify!","title":"ZERO STARS TRASHY APP","isEdited":false,"date":"2020-07-09T07:43:09Z"}},{"id":"6175590135","type":"user-reviews","attributes":{"rating":1,"userName":"kennamreed","review":"This app took literally 8 days to download! Once installed, I was ready to support America's greatest president. However, upon opening the app, the first thing that popped up was a Donald Trump emoji with devil horns, screaming \"YOU'RE NEXT!\" I was horrified! Within the next few seconds every electrical device in my house exploded and would refuse to work any longer. If you think I am acting like this behaviour is normal, it's only because it gets worse. Rabid rats swarmed the outskirts of my house and few got inside through the vents. A truck labelled \"Make America Great Again\" dumbed several dead bodies into my backyard. At this point I was hiding in the corner of my bedroom attempting to dial 911, only to find someone had hacked into my internet and delayed any emergency calls.\n\nnow, if you read that review and thought it was absurd, why dont you go to trumps twitter and read the disgusting things he writes. our president is a racist, a rapist, a homophobe, and a white supremacist. If you support him, you support racism, rape, homophobia, and white supremacy. PERIODT BITCHES💅✨😌","title":"Horrible!","isEdited":false,"date":"2020-07-09T07:42:53Z"}},{"id":"6175590073","type":"user-reviews","attributes":{"rating":1,"userName":"REEEEEEEEEEEEEEE BUTT","review":"I HATE THIS BROKEN APP IT DOES NOT EVEN WORK","title":"Butt","isEdited":false,"date":"2020-07-09T07:42:51Z"}},{"id":"6175589580","type":"user-reviews","attributes":{"rating":1,"userName":"kvng_casper","review":"Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna Justice for breonna","title":"Terrible 😳😳😳","isEdited":false,"date":"2020-07-09T07:42:40Z"}},{"id":"6175587738","type":"user-reviews","attributes":{"rating":1,"userName":"starr needs sleep","review":"This app is terrible!!! It suddenly appeared on my phone and no matter what I tried to do it would not delete. Even my FBI agentcouldn’t get rid of it. To make it even worse it froze all my other apps while taking 3 days to fully download. When it finally finished it blasted the national anthem (not our holy gen z one 😔) so the whole house could hear then proceeded to call me slurs and derogatory terms. If you thought it couldn’t get any worse, it did. At that point my phone made a cursed screeching noise, sounding much like cis het whining middle aged men or Shane Dawson singing 🤢🤢🤮🤮 and grew arms and legs and spider walked right outlet of my room like something from the exorcist. It grabbed a baseball bat and beat my sister so badly that she’s now in a coma and then laughed at her. This app is CURSED!!! Do not willingly download it or the same could happen to you and your family. And it if somehow appears on your phone, please just get rid of it. I know satanic cults are taking the infected devices. Please reach out to your local cult so they can sacrifice them to our daddy satan sempai’s left ball sack so we can have more cummies. -100000/10 would not recommend!!!!!!!!!","title":"Atrocious app!!! Biggest waste of my time!!!","isEdited":false,"date":"2020-07-09T07:41:59Z"}},{"id":"6175586193","type":"user-reviews","attributes":{"rating":1,"userName":"Sofia0402","review":"I wanted to keep up with what Daddy Trump was doing but as soon as I opened the app ICE pulled up to my house, beat up my family, and deported my grandma. @Trump do better!!!","title":"Truly sickening","isEdited":false,"date":"2020-07-09T07:41:25Z"}}]}