{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=13040","data":[{"id":"6172999186","type":"user-reviews","attributes":{"title":"I lost all hope","isEdited":false,"date":"2020-07-08T17:01:02Z","rating":1,"review":"Downloaded this app in hopes of a better today and a better tomorrow. That’s what was promised. But I can longer be a part of the American liberation front. I was promised so much for this app and this presidency but both had seemingly failed me. The app is terrible it glitches and doesn’t deliver- just like the president. He poisoned our water, burned our crops and delivered a plague unto our houses. Overall. 0/10 would not recommend the app.","userName":"acupcakeeyy"}},{"id":"6172988229","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD APP","isEdited":false,"date":"2020-07-08T16:57:40Z","rating":1,"review":"I wanted to download this app to support my president🤮but it took a whole month to download and when it did download it started play terribly loud music that attracted alligators(I stay in Florida btw)and they killed my entire family. I’ve tried to delete the app to stop the music but it wouldn’t delete and it’s still playing till this day. Now the music has started to attract roaches and lizards. I’m allergic to lizards so today may be my last day.","userName":"011005011005011005"}},{"id":"6172800827","type":"user-reviews","attributes":{"title":"By far, the worst app on the App Store.","isEdited":false,"date":"2020-07-08T16:00:51Z","rating":1,"review":"This app simply has no purpose being available on the App Store. This app is extremely bias, and leaves no room for discussion of topics that trump does not agree with! In addition, this app has no real reason for being up. There is no objective of the app, or need for the app on the App Store. Furthermore, I heard that trump likes to eat his burritos sideways, too! What?! That absolutely ridiculous!! How can we have someone in office who eats their burritos sideways?!?","userName":"l_k355"}},{"id":"6172748474","type":"user-reviews","attributes":{"title":"Do not download this app!!!","isEdited":false,"date":"2020-07-08T15:45:51Z","rating":1,"review":"I was minding my own business just trying to support the president, but I’ve had the app for about a week now and some weird things have been going on. Ive been having dreams of a pair of tiny orange hands choking me every night while the thing that possesses those hands tell me to chop my family up into little bits and to put them into a gourmet dish and to serve it to the local homeless shelter. I was shocked honey, I was in tears almost.","userName":"jhehhcbhehw"}},{"id":"6172738842","type":"user-reviews","attributes":{"title":"If you are prone to diseases, do not download","isEdited":false,"date":"2020-07-08T15:43:06Z","rating":1,"review":"HORRIBLE APP. I have Chronic obstructive pulmonary disease, corrhosis, diabetes, and triglycerides, and this app almost made me die! Yeah, I said it drop dead on the floor at the sight of this monstrous app before my innocent, yet mortified, young eyes. Do not download if you have been sick in any way. If you haven’t, don’t download in the sake of you becoming sick because of this app. Thank you, and Black Lives Matter, Hispanic Lives Matter, Asian Lives Matter, and Muslim Lives Matter.","userName":"Hahwhwhzhdeb"}},{"id":"6172726454","type":"user-reviews","attributes":{"title":"Terrible!","isEdited":false,"date":"2020-07-08T15:39:32Z","rating":1,"review":"I took one month to download then when it did it deleted ALL of my apps and it deleted everything off of my camera roll but then the only thing that appeared in my camera roll was pictures of Donald Trump and not to mention when I opened up iTunes ALL of my music was gone except someone put all of 6ix9ine’s music at 100% volume and the volume wouldn’t go down this is the worst app I have ever had","userName":"big belly kelly"}},{"id":"6172672930","type":"user-reviews","attributes":{"title":"Terrible app, crashes constantly","isEdited":false,"date":"2020-07-08T15:24:26Z","rating":1,"review":"Whenever I open up this app it crashes almost immediately. According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don't care what humans think is impossible. Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let's shake it up a little. Barry! Breakfast is ready! Coming! Hang on a second. Hello?","userName":"Bryce.Hall"}},{"id":"6172591672","type":"user-reviews","attributes":{"title":"uhhhhhh let me tell you a story","isEdited":false,"date":"2020-07-08T15:01:41Z","rating":1,"review":"well I downloaded this app recently and as soon as I did my life completely went bonkers stuff was going crazy man. I fell off my skateboard and got injured really bad and my family constantly got hurt. my point is that by downloading this app it may lead to a curse upon your family. be careful. every time something bad would happen a orange would pop on screen and start saying some false stuff.","userName":"👺👺😂"}},{"id":"6172571642","type":"user-reviews","attributes":{"title":"HORIBBLE!","isEdited":false,"date":"2020-07-08T14:56:09Z","rating":1,"review":"Such a horrible app! I came her to learn about my president, first lady, ect. Should’ve never came to this app. I kept glitching our and it would shut down my phone sometimes. Even his merch is in horrible quality. I am so disappointed. This app would translate horrible, sexual things and I was shocked! I wanted to teach my little girl about our president. However, as she was reading it spit out horrible things! Very sexual, and violent! Please remove this app!","userName":"izn s"}},{"id":"6172445198","type":"user-reviews","attributes":{"title":"I turned into a cat","isEdited":false,"date":"2020-07-08T14:21:13Z","rating":1,"review":"I got this app because i thought it would help me NOT buy tickets to a trump rally, but i was so wrong. I was so bored with this app I went to bed at 7:00! But my cat came into my room while I was sleeping, took my phone deleted this app and nows where it gets weird i’m actually not a person. I am the cat. The cat that now has an owner who is a cat. I just wanted to express my hate for having a cat owner, please turn her back into a human so i can eat","userName":"asdhhdhsh"}}]}