{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=43510","data":[{"id":"6174753323","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:53:07Z","review":"This app is constantly glitching!! Information is not kept up to date and it is very poorly maintained 🤢 sad to say this is the quality app our dear President endorses! 1 star 👎","title":"Slow!","isEdited":false,"userName":"Zyglroooox"}},{"id":"6174752799","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:52:57Z","review":"Donald trump came through my phone then said black people are dumb. I dont like this app because he squeezed through my phone to be racist. To add on, my microwave broke from this and hotdog juice overcame my grandma. No trump no! Give this app 1 star","title":"NOOOoo","isEdited":false,"userName":"Step-chicken Madison"}},{"id":"6174748558","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:51:39Z","review":"This app just basically wiped out all of my memory on my phone. After downloading everything crashed!","title":"Glitches!?","isEdited":false,"userName":"Jubefitz45"}},{"id":"6174736246","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:47:53Z","review":"This app is making me crazy I started seeing the Orange man, I’m scared I don’t know what to do. Help it’s getting dark. I used to be normal now I cannot laugh I’m trapped in this cold place. I think he took me.","title":"Absolutely Horrible","isEdited":false,"userName":"sourkido"}},{"id":"6174721701","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:43:31Z","review":"I was on the app with my 8 year old son then my screen got covered with HENTAI ADS. My son had to see that and I had to explain what it was! As a good Christian and hardcore follower of the lord Jesus Christ I was beyond mortified. I cannot believe this happened!","title":"INAPPROPRIATE!!!!","isEdited":false,"userName":"lil potato 🥔"}},{"id":"6174718623","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:42:35Z","review":"Worst app ever made. It made my phone glitch and freeze.  I keep re-downloading the app but it didn’t work. My phone kept on glitching and freezing. Worse app ever!","title":"Worse app!","isEdited":false,"userName":"Lyndetgh"}},{"id":"6174715506","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:41:38Z","review":"This app will completely ruin your phone!! My phone has beeen glitching for days and a virus overcame my phone so I ended up getting a new phone. The worst app in the entire world! Do NOT get this app!! It is worth trash!!","title":"THE WORST APP","isEdited":false,"userName":"dvsjsijsvsvskaksbsvgyd"}},{"id":"6174701514","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:37:26Z","review":"bro I got this app thinking it’d be like 10/10 👌 but NOOO WAS I WRONG once I got the app I kept seeing trumps face everywhere and cmon who wants to see that and it was just GROSS and please DONT get the app for our safety of our eyes so no one has to see his face🙏🏽","title":"WORST APP EVER","isEdited":false,"userName":"im here because i want gems"}},{"id":"6174698780","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:36:38Z","review":"It’s not even worth downloading once I downloaded it, the app took my whole house and now me and my family are living on the streets, this is not the president im looking for","title":"Horrible","isEdited":false,"userName":"SpicyChillihOt"}},{"id":"6174694032","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:35:11Z","review":"I can’t see the difference between blue and gray 5 stars though since other than the fact that the fbi killed my sister I never had I ate a unpicked pikililing cu ccuumm berrrrr","title":"My college kicked me out and I’m 1117","isEdited":false,"userName":"Cashuoll dude"}}]}