{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33480","data":[{"id":"6174224114","type":"user-reviews","attributes":{"title":"I WAS HORRIFIED","rating":1,"isEdited":false,"date":"2020-07-09T00:11:12Z","review":"I downloaded this app to show my support for the best president who ever existed, only to find out that this app asked for my mobile phone number????? THAT IS A VIOLATION OF MY PRIVACY AND HUMAN RIGHTS!!! I could not have been more heartbroken and honestly scared for my life in that moment! I REFUSE TO GOVE MY MOBILE CELLULAR DEVICE NUMBER TO SOME RANDOM IT MAN THAT COULD TRACK ME AND FIND WHERE I LIVE!!!!","userName":"Teacher 857396"}},{"id":"6174217361","type":"user-reviews","attributes":{"title":"DISGUSTING","rating":1,"isEdited":false,"date":"2020-07-09T00:08:43Z","review":"i downloaded this app to see what it felt like to be racist, homophobic and every other bad thing ever. it wasn’t a good experience at all and i feel like a sinner. 💅 and to add on to that when i opened the app the first thing i saw was an add for cheetos? that should not be allowed. 👺👹","userName":"yucky twump"}},{"id":"6174216563","type":"user-reviews","attributes":{"title":"full of fake news","rating":1,"isEdited":false,"date":"2020-07-09T00:08:23Z","review":"The news in this app is unreliable and not based on facts. The information is misleading to the public and carries an ideology that could be seen as domestic terrorism or at least neofascist. app is also glitchy and unreliable.","userName":"Fortheloveofglamour"}},{"id":"6174201913","type":"user-reviews","attributes":{"title":"Home was stolen not good app","rating":1,"isEdited":false,"date":"2020-07-09T00:02:56Z","review":"I thought this app was about trump but then I see him working out like no I don’t want that stinky thing traumatizing my screen. Then my house was stolen it was moved and I can’t find it! Worst app ever!!!!! you did that... don’t do it again 🧚‍♀️💕😌","userName":"sailormoonaddict"}},{"id":"6174201488","type":"user-reviews","attributes":{"title":"WHY IS THIS APP STILL UP?!","rating":1,"isEdited":false,"date":"2020-07-09T00:02:46Z","review":"HORRIBLE APP! When I first opened it I saw an uglier and slightly taller version of an Oompa Loompa! Who could ever like this app?! My eyes nearly burned off! Whoever likes this app is a monster!!! The Oompa Loompa looked like a homophobic, racist pedo! Disgusting honestly! Why is this still on the App Store?! THIS CAN KILL SOMEONE ONE DAY!! TRULY DISAPPOINTED ITS STILL UP!!","userName":"🙄💅"}},{"id":"6174200343","type":"user-reviews","attributes":{"title":"Upset","rating":1,"isEdited":false,"date":"2020-07-09T00:02:18Z","review":"I was physically hurt when opening this app and seeing the horrors inside. I can’t even go into more detail. Please we need to have this app taken down before lives of children and families are forever ruined!","userName":"McSquarble"}},{"id":"6174190124","type":"user-reviews","attributes":{"title":"APP IS HORIBBLE","rating":1,"isEdited":false,"date":"2020-07-08T23:58:31Z","review":"first they told me  to throw my cat down the drain then they used all my storage in my phone and i have no choice to delete it. it also gave me notifications all the time 24/7. he also is a big fat cheetoh with NO CRUNCH. eww. who the hell would even vote for him.","userName":"ihatetrumpwithmywholelife"}},{"id":"6174189143","type":"user-reviews","attributes":{"title":"Not impressed","rating":1,"isEdited":false,"date":"2020-07-08T23:58:07Z","review":"Not impressed \nThere is little to no creativity \nStolen speeches, hypocrisy, and just plain awful visuals. I am offended that this app even dare show me the face of a soggy Cheeto. \nIt was EXTREMELY glitchy, and I lost literal brain cells from just downloading it. \nAwful , don’t download, it’s not worth it.","userName":"MimiUzimaki"}},{"id":"6174185833","type":"user-reviews","attributes":{"title":"U came from tik tok 😭","rating":1,"isEdited":false,"date":"2020-07-08T23:56:54Z","review":"This app doesn’t work at all. Everything is unexplainable, this app should be deleted of apple and google stores!!!. This app doesn’t have age restrictions and is bad for kids. We don’t need this  type of app on the app site.","userName":"josueis best"}},{"id":"6174185524","type":"user-reviews","attributes":{"title":"Absolutely trash","rating":1,"isEdited":false,"date":"2020-07-08T23:56:47Z","review":"Such a useless and invaluable piece of garbage. Waste of time and money. Ugh...disgusting visuals as well...who wants to see a Cheeto dressed up in a cheap looking suit that it paid thousands of dollars for instead of putting that money into organizations and communities that need it.","userName":"Tara346980788854"}}]}