{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=7310","data":[{"id":"6173593595","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Literal Garbage","review":"i downloaded this app so i can keep up with our wonderful president, but as soon as i opened the app it wouldn’t stop charging my card! Everytime i tried to press cancel on the donation it would charge me card 5$ i am now short $75 and i will not be able to afford food for the next 2 weeks and i have no family to help me with money. Not to mention it kept playing foreigner over and over again when i logged in my account. This app is disgusting and i can’t believe i saw Donald J Trumps buttocks!","date":"2020-07-08T20:18:06Z","userName":"fhsmakx"}},{"id":"6173478184","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"DEMONSSSSSS❗️❗️❗️❗️be careful","review":"I DOWNLOADED THIS APP WITH THE INTENTIONS TO SUPPORT THE RAPIST WHO SITS ON HIS FAT 🅰️SS IN THE WHITE HOUSE ONLY TO BE MET WITH DEMONS. They possessed my entire family and tried to eat me!!!! it is absurd how many people support this app... When i called the police i knew they would show up because i live in a primarily white high class neighborhood , but THEY NEVER SHOWED ONLY GROSS PIGS IN POLICE OUTFITS!!! UGH! i’m very upset this EXCUSE of a man,president,human,he has no right to take any of those titles i will forever know him as a fat cheeto❤️. \nPS:apple needs to make a person with is skin tone 🍊 <<<\nin all seriousness f that man and anyone who supports him 🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻‼️‼️‼️‼️","date":"2020-07-08T19:38:31Z","userName":"Don't be cool hhhaaalll"}},{"id":"6173448845","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Needs MAJOR improvements","review":"I wanted to support but this app is so bad. It needs major improvements. Download time is extremely slow. It constantly freezes. When  it isn’t frozen it automatically shuts down. And takes a long time to reload when I have to re-open the app. The graphics are blurry and pixelated. There is no options to turn the music down. The app shuts off when you try. The interface is very complicated and not user friendly at all. Not great.","date":"2020-07-08T19:28:31Z","userName":"GTurnerrr"}},{"id":"6173440213","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"WORST APP EVER!","review":"This app is awful, it took weeks, maybe even MONTHS TO DOWNLOAD!! It was awful quality, glitched every second, and it was sooo boring. There were ads almost every 5 seconds, and the app was overall so confusing. it put inappropriate things, and was ugly. there was inappropriate ads that i wouldnt even let 15 year olds watch. the app put false information and things that were so wrong it was hard to even LOOK AT! remove this app from the app store i dont want anyone to go through the same pain as me..","date":"2020-07-08T19:25:33Z","userName":"PastelLion"}},{"id":"6173437111","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"loss at loss","review":"i got this app in hopes of getting some extra cash and well i called and the people were super rude,orange need to get some new workers they yelled at me and said go duck yourself😞it really hurt my feeling i loved  trump but after what his workers did to me i hate him with every inch of me cuz all i wanted to say is if i can have $58,0000 and the worker yelled at me i will never be the same after this tragedy orange pls i beg u to get some new workers they were so rude all u asked was for some money 💰 i was also wondering if u would like a sugar baby????????DO NOT DOWNLOAD THIS APP ⚠️","date":"2020-07-08T19:24:30Z","userName":"sugar baby💰😌🧚🏻‍♂️💫"}},{"id":"6173417465","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"worst app EVERRR","review":"the app asked me if i would like to make a donation towards his campaign and when i put in all my information they stole all my money and when i tried to cancel it it didn’t let me and now i have no money and i can’t pay for my house or my car or anything and i’m going to be homeless because of the stupid orange oompa loompa mans app it’s HORRIBLE and when i emailed them telling me to give me my money back they told me NO and laughed for 10 minutes straight, it also took forever to get in contact with them OVER A MONTH!!!","date":"2020-07-08T19:17:54Z","userName":"natalianava_l"}},{"id":"6173384230","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Horrible","review":"This was an absolute horrible app. 😡✋ when i downloaded it, it would not even open. 😭🙏🙌👎 and then when i finally did get it open, it wouldn't let me make an account. 😢👎 and when i could finally make an account, everything on the app was blank and my whole phone froze, cause me to restart my phone. 🤧❄️🥶📱🌪 i will not 🚫🚫🚫 be downloading again🚫🚫🚫 0/10 would not recommend this horrible app😭😭🚫🚫🚫🚫🚫🚫🚫 i will be speaking to the manager about this... 🚫🤬💩💩💩🖐\n\nIn all regards \n\nAn angry Karen 🤬👩🏻‍🦳🚫🚫","date":"2020-07-08T19:06:09Z","userName":"Osama Bin Queefin"}},{"id":"6173366165","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"AWFUL","review":"i downloaded this app because i wanted to help out the cheeto in the office but it took WEEKS. to download, it gave my phone a HORRIBLE virus AND it wouldn’t let me open the app so i had to delete it and redowload it . in the end it took about 4 months to download and i believe that apple should take this app down immediately. IF i could vote below one star i would because i regret downloading this app way to much to put into words. take this app down ASAP i had to buy a new phone OUTBOF POCKET MONEY because the virus i got from this app was that bad.","date":"2020-07-08T18:59:52Z","userName":"Ayla marie ✨🧚‍♀️"}},{"id":"6173328686","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Bad app","review":"This is a terrible app I do believe that it is making my phone die constantly and making it overheat I do not want to have to buy a new phone because I am not rich like my president I got this app to try and help but this app is the worse one on the Apple store. Please do not download this app it has made my phone so terrible compared to all my other apps it takes up SO MUCH SPACE I CANNOT TAKE cute pictures of my 5 kids and I love them. So when it comes to “kids 👊🏻and voting☝🏻” so I choose my kids and am deleting this app.","date":"2020-07-08T18:46:45Z","userName":"subway sufurez10"}},{"id":"6173327152","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Please Read!","review":"As the future of america we know what’s best for the world we’re going to live and raise our children in. For all the old people who are bashing us for having personal political views at our age and that are bullying us for being under the legal voting age does not mean we do have a say in what goes. Plus you’ll be dead soon so your opinion doesn’t matter 😁.We have the resources that you didn’t have, our voices will be heard and you can believe that😌✨. Gen Z will be the greatest and most influential generation of ALL time.💓","date":"2020-07-08T18:46:14Z","userName":"Keilah Magloire"}}]}