{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=9640","data":[{"id":"6172504439","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"🍊Worst app of all time I downloaded to try to see if I should vote for Trump and all that happened was there was a bunch of oranges everywhere I was super scared and your street I was too I’m like super scared and like I keep on popping up my phone kept on glitching and now I have to go get a new phone and my phone and it turned my whole phone screen orange🍊 no I am freaking out because my phone screen is literally orange and it won’t go back to being regular🍊","title":"🍊👄🍊 🌝","date":"2020-07-08T14:37:17Z","userName":"jimbobeatspickles"}},{"id":"6172457816","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I got the app because I was bored and my poor rainbow was too. My pet rainbow ran away because of how stupid, dumb, how orange, and how fake trumps hair is. This is worst the worst app in history because you made my pet rainbow mad and he ran away. I can’t find my pet rainbow because of how stupid and dumb you are. TikTok is way better than this stupid app!!!!!!!!!! I found my pet rainbow but he was not a rainbow he lost his colors except orange😡. You killed my rainbow that is why this is the history!!!!!!!! 1 STAR","title":"How my rainbow ended","date":"2020-07-08T14:24:38Z","userName":"skansksbakbssk"}},{"id":"6172438326","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"First of all, this app took forever to download, and mind you I had perfect wifi! Second of all,  it kept glitching whenever I would open it! I legit had to power off my phone each time in order to exit the app!!! Third of all, I think it sold my information to a third party, because I have never gotten any spam calls before I downloaded this! Fourth of all, this app promotes racism, homophobia, and sexism as all Trump things do, so I am not surprised!","title":"horrible app","date":"2020-07-08T14:19:20Z","userName":"someone who cares about the us"}},{"id":"6172427123","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I downloaded this too look at his campaign to see if he was a good candidate and he’s not by the way. But my point is the app keeps lagging. When I try to use it it brings me out of the app. So o tried re-downloading but I wouldn’t work. Then I tried again and it worked but it get glitching and I couldn’t even actually use the app. So I deleted and then re-downloaded again IT STILL WOULDN’T WORK!!! I THEN THREW MY PHONE AND IT SHATTERED NOW I HAVE TO WASTE MONEY AND GET A BRAND NEW PHONE THANKS TO THIS APP!!!","title":"Glitches and takes forever to load","date":"2020-07-08T14:16:20Z","userName":"Alise Leonardo"}},{"id":"6172425242","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"First this app will overload your phone with tons of notifications.\nSecond the moment you open it your phone will literally start glitching causing you to restart it every time the app is open.\nFinally it takes up so much space after it downloads, the app will have constant annoying and unnecessary updates and while it’s updating every other app you try to use will run unimaginably slow .\nCOMPLETELY A WASTE OF TIME AND STORAGE SPACE","title":"Horrible","date":"2020-07-08T14:15:48Z","userName":"lastcall457"}},{"id":"6172379297","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"When I first downloaded this app I was expecting an amazing platform for all supporters to gather, like boomers have explained to me. However, after I put in my information the Orange dude allowed for it to get out to telemarketers. I had to place my phone on a do not call list because it got to the point where they were calling me every 20 min. Additionally, this platform was EXTREMELY negative that used harsh tactics to coerce me into voting for him. 0/10 do NOT download.","title":"Complete Waste of Time","date":"2020-07-08T14:03:30Z","userName":"Midnight233"}},{"id":"6172372200","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I have never come across an app that I hated more. I downloaded the app and it took at least an hour to download when my apps usually take about 10 seconds no more than a minute. And then when I open the app I just see Cheetos every where. Like is this a joke and ever since then my phone has been slower and I don’t appreciate it. If I could give it 0 stars I would. All I wanted to do was support our president but I can’t do that anymore.","title":"I’m done","date":"2020-07-08T14:01:35Z","userName":"Marlenezv"}},{"id":"6172361340","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"If I could give this app negative stars I most definitely would. This is the most disgusting, racist, and homophobic app on this site. I don’t even know why I gave this app a chance. I promise to do better, mom and dad. Please don’t disown me. As an Apple connoisseur I am VERY disappointed with the lack of quality it is providing for the consumer. WHO EVEN LET THIS APP BE RELEASED?!?!? If I were in power I would most certainly ban this app. The kind of content it offers it’s simply preposterous. DO NOT RECOMMEND. I REPEAT I DO NOT RECOMMEND!!!!!!","title":"Fascist","date":"2020-07-08T13:58:38Z","userName":"Coco loco moco !!!!!!!!!"}},{"id":"6172346288","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"DO NOT DOWNLOAD \n I got this app because I love our supportive president well I mean loved. After I downloaded this app I went to get some water and as soon as I touched my water glass it turned into a Cheeto!!! I was so confused but it came to me, since I had just downloaded this app and we have a Cheeto president i figured out that it this app!!! Now you are probably wondering what am I writing  this review on? I am infact writing on a Cheeto mhm so don't download this app!!! Not unless you want the Cheeto touch","title":"I saw a cheeto for days 🟠","date":"2020-07-08T13:54:33Z","userName":"ojhjojihfohvvysiy"}},{"id":"6172262836","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"The whole app was just slow on 4 bars and on perfect WiFi, it’s an extremely terrible app it seems like a middle schooler put it together, just like how our country would be in a better place if we had a middle schooler in office. Also the app blew up my phone with the nuke North Korea button and it kept saying america will never be great with trump in office. The app made my 45 hamsters have terrible diarrhea, it gave my turtles neck problems, and it made my horse do a backflip","title":"It’s terrible","date":"2020-07-08T13:31:18Z","userName":"h a vsnzhvsj"}}]}