{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=12610","data":[{"id":"6173396994","type":"user-reviews","attributes":{"date":"2020-07-08T19:10:49Z","review":"I am very disappointed. I downloaded this app to show support to my amazing pig president and when I opened it, I saw nothing but an orange. My cat was with me and when he saw the orange, he fainted as I almost did, him and I both being of color. I panicked and rushed him to the emergency room which caused more of a risk to me and my family as we are in a pandemic. But by the time I got him there, the vet said there was nothing they could do. He passed. This app killed my cat. I’m deleting it.","title":"Oh no","isEdited":false,"rating":1,"userName":"gina.420"}},{"id":"6173367000","type":"user-reviews","attributes":{"date":"2020-07-08T19:00:09Z","review":"i don’t understand it, faulty design. and i think it’s unprofessional to make an app for a campaign since most of his voters are likely elderly. may i suggest doing it over telegraph? and i would also like to complain that apple allows a racist homophobic rapist own an app on their store making money off of every download including mine when i tried to see his app. unacceptable and ignorant considering the man is trying to block tiktok from america- which is probably one of apples most used apps for the youth of america. who is soon going to be adults and you’re going to have to rely on our money to keep your business afloat. i’d rethink you’re decision of allowing this repulsive app if i were you guys just saying.","title":"i deleted it","isEdited":false,"rating":1,"userName":"nono57&&"}},{"id":"6173304275","type":"user-reviews","attributes":{"date":"2020-07-08T18:38:46Z","review":"I don’t like this app it is horrible I tried it and it sucked also I dislike trump. I think he should not be president again so if everyone can help this get to a one star review then the App Store will take it down because he is trying to Ban TIKTOK not we are not going to allow that to happen because trump does not understand if he does that we are going to fight back harder. Because TRUMP you do not know who you are messing with know","title":"Very bad","isEdited":false,"rating":1,"userName":"isabelllaaaaasnnf"}},{"id":"6173300521","type":"user-reviews","attributes":{"date":"2020-07-08T18:37:36Z","review":"when i downloaded this app everything seemed fine, until it hacked my phone!! it started playing our national anthem, anaconda by nicki minaj. although this was a beautiful way to welcome me to the app IT WOULDNT STOP. i turned my phone ALL THE WAY OFF and it KEPT PLAYING. after i deleted the app, it finally stopped, so i tried to download it again... and then it played MEGATRON??? CAN YOU BELIEVE IT?? i actually love this feature of the app but it gets 1 star for false advertisement 😔💓","title":"DO NOT DOWNLOAD","isEdited":false,"rating":1,"userName":"hoqauel"}},{"id":"6173259970","type":"user-reviews","attributes":{"date":"2020-07-08T18:24:30Z","review":"This app took about a month to download. It took so long that I forgot that I had tried to get it and when it did download, I thought I had been hacked!! The app wouldn’t open, it would simply bring up the title page and then crash. At this point I was pretty sure it was malware that was taking all my data and selling it to the government. Do not download this app! I am almost sure this is NOT the official Trump app. Be safe out there!","title":"Worst App Ever","isEdited":false,"rating":1,"userName":"Meghan Liz"}},{"id":"6173255074","type":"user-reviews","attributes":{"date":"2020-07-08T18:22:53Z","review":"this app is terrible it’s glitchy and the layout makes no sense when you open the app it doesn’t load for like 5 minutes and when it finally does load in you have to log in and then that takes another 10 minutes to load do not get this app it will slow down your whole phone and take up an unreasonable amount of your storage take this app off the App Store","title":"worst app","isEdited":false,"rating":1,"userName":"Little_Lizzy1224"}},{"id":"6173254167","type":"user-reviews","attributes":{"date":"2020-07-08T18:22:35Z","review":"Absolutely the worst app to exist!!!! When I downloaded it and opened it for the first time my whole phone shut off and wouldn’t open for a while!! And when I finally got it back on it summoned THE DEVIL!! I was forced to make a contract and now I have sold my soul, smh. If you chose to get this app after you’ve read this, then you’ve chosen to worship the devil himself. This app also left my room with red smoke all around it and I have asthma so if I die, I’m suing.","title":"Worst app ✨✨🟠","isEdited":false,"rating":1,"userName":"DOCTOR DUE LITTLE"}},{"id":"6173237395","type":"user-reviews","attributes":{"date":"2020-07-08T18:17:01Z","review":"This app in incredibly slow. Even downloading it took almost a full 24 hours. I decide to persevere and wait because of my incredible feelings towards our POTUS. But once it finally downloaded it was very slow. It took 20 minutes to load enough for me to open, and every time I clicked some new it either took a long time to load or the app would close. Overall this app is very ugly, no kisses for him.","title":"Slow","isEdited":false,"rating":1,"userName":"Hannah_Banana654"}},{"id":"6173232565","type":"user-reviews","attributes":{"date":"2020-07-08T18:15:24Z","review":"i downloaded this app in order to have a little insight on the ✨cheeto✨ that we call our president, but along with the fact that it took DAYS to download onto my phone, it was also one of the worst quality apps i’ve ever seen. the faster this app is removed will be the better the app store becomes and the sooner he who shall not be named is removed from office, the better this country will be. thank you 😌💅🏽✨🙄🧚🏼‍♀️","title":"absolutely horrible.","isEdited":false,"rating":1,"userName":"a fellow gen z member ;)"}},{"id":"6173189958","type":"user-reviews","attributes":{"date":"2020-07-08T18:01:21Z","review":"This is an awful app I could vote and look at the things on here on the news!!! Also the app structure is just awful let alone it is extremely slow and doesn’t work properly, I have amazing internet and WiFi so there shouldn’t be a lag. I would appreciate if this app was to banned for lag, unnecessary information, horrible representation, and the things we could do outside of this app.","title":"I do NOT recommend this app!","isEdited":false,"rating":1,"userName":"Saving___careers...."}}]}