{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31930","data":[{"id":"6133732608","type":"user-reviews","attributes":{"review":"After I finished making an account for the app, this guy in a pink suit and fedora came in my room, took a huge crap on my bed, and screamed vote for Trump. I am highly concerned and afraid. He proceeded to continuously scream vote for trump in a high pitched tone very loudly. I am terrified and I will never download this app again","rating":1,"userName":"JoyThePands","title":"I’m disgusted","date":"2020-06-28T23:49:21Z","isEdited":false}},{"id":"6132404903","type":"user-reviews","attributes":{"review":"This app has to be a joke(.) I MEAN everything is terrible about it(.) It’s the most useless app ever and it takes up a lot of storage (.) I DO NOT RECOMMEND (.) If you have a brain don’t download this app and if you do download it give it a 1 star rate let’s get this garbage removed(.)","rating":1,"userName":"Bu$$yA$$/666","title":"AWFUL","date":"2020-06-28T15:32:01Z","isEdited":false}},{"id":"6132261665","type":"user-reviews","attributes":{"review":"This man’s is putting his Murch out for nobody that supports him. He  hate to the black community and he had sure hate to the Mexican community yeah sure hate to the Muslim community. So why would we have to get the app if he’s going to hate on different communities of the world.","rating":1,"userName":"🥺❤️😊","title":"Disrespectful","date":"2020-06-28T14:47:14Z","isEdited":false}},{"id":"6100395102","type":"user-reviews","attributes":{"review":"This app was my worst nightmare. I thought I would be supporting an amazing president but instead I was bombarded with propaganda for a Cheeto. I was previously not aware that Cheetos or oompa loompas could be child predators, but they can. I am confused about how this horrible excuse for a human being has a campaign.","rating":1,"userName":"Dont support a child rapist","title":"Terrible app","date":"2020-06-20T13:17:59Z","isEdited":false}},{"id":"6110186019","type":"user-reviews","attributes":{"review":"What a great tool to get supporters involved in the effort to re-elect the greatest president in US history! Thrilled about these opportunities!","rating":5,"userName":"Deanne Davis","title":"#KAG2020","date":"2020-06-23T00:29:30Z","isEdited":false}},{"id":"6072416067","type":"user-reviews","attributes":{"review":"I really downloaded this app so I could pay attention to the rally schedule of our glorious and almighty leader but alas every time I try to click anything an image of a Cheeto pops up? I think it’s an ad but there’s no way to get rid of it. All I see is Cheeto Cheeto Cheeto","rating":1,"userName":"kaayyybayyy","title":"Wanted to love it","date":"2020-06-13T22:24:49Z","isEdited":false}},{"id":"6068846070","type":"user-reviews","attributes":{"review":"I am an avid Trump supporter and I was hopping this was going to be the app that satisfied all my bootlicking needs:( the app takes up WAY to much space, uses a ton of data and crashes every time I open it. VERY sad. Disappointed.","rating":1,"userName":"Amber8797","title":"Very disappointed","date":"2020-06-13T01:26:54Z","isEdited":false}},{"id":"6068176989","type":"user-reviews","attributes":{"review":"So when I opened the app they jump scared me with a orange pickle with yellow hair looking out how rude speacially if a kid randomly opened it on your moms, Karen, phone like what the heck are we now scaring people into voting for trump with a orange pickle wow the republicans really are trying their best and it shows","rating":1,"userName":".PERIODTTT.","title":"I was so scared when I saw an orange pickle","date":"2020-06-12T20:45:29Z","isEdited":false}},{"id":"6065357404","type":"user-reviews","attributes":{"review":"As soon as I opened the app I realised I’d made a mistake. The least user friendly application I have ever used. Beyond that, using this app made me just want to use the military to push through a crowd of innocent bystanders for a photo op with a bible in front of a church. This app imbued me with BDE.","rating":1,"userName":"Gupta1118899","title":"Awful","date":"2020-06-12T03:28:17Z","isEdited":false}},{"id":"6064629855","type":"user-reviews","attributes":{"review":"i downloaded this app hoping for something good. instead, donald trump himself greeted me and made my phone overheat with this laggy, unpolished interface. he advised me to give it one star, but only if i voted for him in this election. little does he know, i am a convicted felon and i lost my rights due to several accounts of tax fraud and arson. finally, the laws are in my favor. donald trump told me that he would haunt me now after his inevitable heart attack. ive been damned. 0/10 i dont want a spraytanned ghost bobbing around","rating":1,"userName":"vespxr_","title":"app","date":"2020-06-11T22:30:27Z","isEdited":false}}]}