{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=85160","data":[{"id":"6173365467","type":"user-reviews","attributes":{"date":"2020-07-08T18:59:38Z","review":"DONT GET THIS APP!! It glitches and takes forever to download.","title":"!!!!!!","rating":1,"isEdited":false,"userName":"DONT GET 🤢"}},{"id":"6173363015","type":"user-reviews","attributes":{"date":"2020-07-08T18:58:47Z","review":"makes my phone run sooooooooooo slow. it turns my screen this weird orange color too. please to do not but #savetiktok2020","title":"awful","rating":1,"isEdited":false,"userName":"Lcrid"}},{"id":"6173358693","type":"user-reviews","attributes":{"date":"2020-07-08T18:57:16Z","review":"They worst app ever doesn’t work properly","title":"The worst app ever","rating":1,"isEdited":false,"userName":"bruhhhhhh01819272"}},{"id":"6173357960","type":"user-reviews","attributes":{"date":"2020-07-08T18:57:00Z","review":"Never hated something in my life so much. This app is the worst.","title":"TRASH","rating":1,"isEdited":false,"userName":"Anonymous.Genz"}},{"id":"6173353408","type":"user-reviews","attributes":{"date":"2020-07-08T18:55:25Z","review":"It was Tuesday, I had just woken up and I thought to myself what could i do today to help make America great again, and then it hit me, I should download this app so I could keep up with what my orange god was doing. To start things off the app took a month to download even though I had perfect WiFi, and to top things off while it was downloading it kept playing all of Donald Trumps speeches on repeat till my ears bled. This sound soon attracted the evil Trump supporting rats. They infested my house and kept chanting “Trump 2020” while carrying knives. They drop kicked me to the ground and held a knife to my neck and told me if I didn’t vote for Trump they would come back and kill me. I tried calling the police but they were too busy killing innocent black people to help me. After the app was dowloaded my phone started glitching, and all of a sudden my phone was taken over by the orange man himself. I was so angry that he took over my phone and took away my access to TikTok that I told the rats I rather die than vote for him. They didn’t like this so instead they kidnapped me and my whole family and made us eat baby meat. After holding us hostage for 3 days they murdered my family in cold blood, however I was able to escape with the help from the Bernie supporting cockroaches. I barely made it out alive though when one of the rats saw me. I thought I was a goner, until my cockroach friend, pablo stepped in front of me to distract the evil rat. They dueled to the death while i made my escape. Sadly, Pablo didn’t survive the fight, but he lives on in my heart. I warn you all, if you want to keep your family safe, DO NOT download this app!","title":"worst app ever!!😾😾","rating":1,"isEdited":false,"userName":"💅🙈"}},{"id":"6173349535","type":"user-reviews","attributes":{"date":"2020-07-08T18:54:03Z","review":"The orange man with the fake spray tan who hates Iran needs to get in a van and go to Japan and get killed by a man with a frying pan. That is all","title":"I hate","rating":1,"isEdited":false,"userName":"Dogeminer250"}},{"id":"6173329794","type":"user-reviews","attributes":{"date":"2020-07-08T18:47:08Z","review":"On the app I was shamed for liking unicorns . It needs to be deleted","title":"This app is not it","rating":1,"isEdited":false,"userName":"dgygyhi244"}},{"id":"6173325556","type":"user-reviews","attributes":{"date":"2020-07-08T18:45:41Z","review":"do you really want to support this monster of a man? no. thanks for attending my ted talk. (i wish i could give less than one star)","title":"don’t download","rating":1,"isEdited":false,"userName":"laurenmcconahy"}},{"id":"6173314934","type":"user-reviews","attributes":{"date":"2020-07-08T18:42:10Z","review":"0/10 review this app is the worst","title":"Don’t download","rating":1,"isEdited":false,"userName":"crissy6899"}},{"id":"6173312455","type":"user-reviews","attributes":{"date":"2020-07-08T18:41:21Z","review":"Worst president and now the worst app to go along with it smh","title":"Awful app","rating":1,"isEdited":false,"userName":"Your niebor's dog"}}]}