{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36010","data":[{"id":"6173661081","type":"user-reviews","attributes":{"title":"Do NOT get","review":"Worst app ever. Right when I opened the app. My phone said that I had gotten a virus and there was a hacker. I had to go all the way to the store to fix my phone. But when I got there they said it was unfixable. Please do not get.","date":"2020-07-08T20:42:10Z","rating":1,"userName":"celestemal","isEdited":false}},{"id":"6173652709","type":"user-reviews","attributes":{"title":"Disappointed","review":"This app is the worst!!! It has so many bugs and crashes ALL THE TIME! It logs me out every time I open the app. DO NOT DOWNLOAD THIS APP. Trump can spend billions upon billions on the military (and for what?????) but has the worst app in the appstore lmaoo at he’s consistent at being the worst (:","date":"2020-07-08T20:39:11Z","rating":1,"userName":"Maddie Irwin","isEdited":false}},{"id":"6173648663","type":"user-reviews","attributes":{"title":"bad vibes","review":"President 🍊 I expected better from you. The vibes from your app was not it. The glitches and the 3 day download 🤦‍♀️. And not to mention there was a big orange person on my screen as soon as I opened the app I swear to you I almost pooped my pants. NEVER AGAIN WILL I GET THIS APP. UNLESS YOU WANT POOPY PANTS DO NOT  GET THIS APP !!!","date":"2020-07-08T20:37:46Z","rating":1,"userName":"hshdhdbdj","isEdited":false}},{"id":"6173646178","type":"user-reviews","attributes":{"title":"Horrible App","review":"This app showed and influenced my children horrible things! 🤢 it showed a monster and we are currently facing recovery for looking at all the horrible things this app has shown me and my family! #Allcountriesmatter","date":"2020-07-08T20:36:52Z","rating":1,"userName":"s h o n c k e e","isEdited":false}},{"id":"6173639301","type":"user-reviews","attributes":{"title":"Worst app ever!!","review":"It wouldn’t let me add my phone number. I’ve been trying for the pass ten minutes and NOTHING. This app is almost as bad as Trump’s administration. It’s SUPER slow and it made my phone freeze. This app should be removed for how bad it is!!!!","date":"2020-07-08T20:34:22Z","rating":1,"userName":"April_Waz_Here","isEdited":false}},{"id":"6173637108","type":"user-reviews","attributes":{"title":"wish i could give it 0 stars 😔","review":"Very bOring app. i wouldn’T usE it ever again. First it glitched a tOn, then it stopped woRking. also lots of Bugs that need to be fIxeD. don’t usE it if you waNt to keep you info safe.","date":"2020-07-08T20:33:36Z","rating":1,"userName":"olivia88312","isEdited":false}},{"id":"6173629703","type":"user-reviews","attributes":{"title":"Bad app","review":"This app was extremely slow and didn’t work well at all.  The information on it was false and made me gag.  It was covered in pictures of a cheeto for some reason.  I do not recommend at all.","date":"2020-07-08T20:30:58Z","rating":1,"userName":"kahshdbenwmshdbn","isEdited":false}},{"id":"6173628494","type":"user-reviews","attributes":{"title":"TERRIBLE APP🤬","review":"This app was absolutely mortifying. The moment I downloaded it my phone was bombarded with racist, sexist, xenophobic, homophobic, islamophobic, pedophilic, fascist propaganda. Other than the fact that he is a disgrace of a person and president, the app is a flop and I hope he never tries it again.","date":"2020-07-08T20:30:31Z","rating":1,"userName":"leilani talei","isEdited":false}},{"id":"6173626546","type":"user-reviews","attributes":{"title":"Broke my phone","review":"This app downloaded on my I phone 7 and my Siri automatically activated and constantly yelled racial slurs at me. I got fed up and yelled back Siri continued to say “trump 2020” and then sold herself to the antichrist. so I don’t have a phone anymore because this app.😡","date":"2020-07-08T20:29:50Z","rating":1,"userName":"Macalister11","isEdited":false}},{"id":"6173624307","type":"user-reviews","attributes":{"title":"terrible app.","review":"this app is horrible, it took a whole year to download and my phone literally shut down for 6 months in that process, then i went on the app and it showed me a picture of a cheeto in a suit? in reality i thought i was downloading subway surfers to play to shane dawson’s old songs in the background, yk the ones that straight tiktok will never find, but accidentally clicked on this and it down loaded, worst mistake of my life.","date":"2020-07-08T20:29:04Z","rating":1,"userName":"mr.shmurda","isEdited":false}}]}