{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=84930","data":[{"id":"6174857746","type":"user-reviews","attributes":{"title":"Yeah no","review":"This app stinks! Would not recommend","date":"2020-07-09T03:24:18Z","rating":1,"isEdited":false,"userName":"mike_225"}},{"id":"6174848163","type":"user-reviews","attributes":{"title":"worst app i have ever downloaded","review":"the whole thing was just terrible. 0/10 stars. do not recommend","date":"2020-07-09T03:21:27Z","rating":1,"isEdited":false,"userName":"chitpants"}},{"id":"6174834111","type":"user-reviews","attributes":{"title":"1 star!!!","review":"this app made my phone crash a whole bunch of times and it even caught fire!!😠 highly not recommended 😳","date":"2020-07-09T03:17:19Z","rating":1,"isEdited":false,"userName":"Slim Cabbage"}},{"id":"6174830998","type":"user-reviews","attributes":{"title":"WORST APP EVER","review":"this app runs so slow that it made my pet gecko die🥺 let alone is stole my bones!!! how rude :(","date":"2020-07-09T03:16:24Z","rating":1,"isEdited":false,"userName":"poopy poopy dingdong"}},{"id":"6174793193","type":"user-reviews","attributes":{"title":"Awful App","review":"Trash use of technology. Lost brain cells","date":"2020-07-09T03:05:18Z","rating":1,"isEdited":false,"userName":"Gabe Quintero"}},{"id":"6174791659","type":"user-reviews","attributes":{"title":"absolute trash","review":"this app will give you an STD. and not the good kind","date":"2020-07-09T03:04:48Z","rating":1,"isEdited":false,"userName":"jugadm"}},{"id":"6174783125","type":"user-reviews","attributes":{"title":"HELP GLITCH","review":"WORST APP EVER . There’s a really ugly orange man picture that just won’t go away PLEASE fix that glitch. Thanks","date":"2020-07-09T03:02:12Z","rating":1,"isEdited":false,"userName":"codyballard11"}},{"id":"6174780506","type":"user-reviews","attributes":{"title":"I wish I could give it a zero","review":"Bring Angry Bird back!!!!!!","date":"2020-07-09T03:01:24Z","rating":1,"isEdited":false,"userName":"Looo_23"}},{"id":"6174780432","type":"user-reviews","attributes":{"title":"Ewwwww","review":"Disappointed 😔 I hate our president cancel the orange Cheeto already","date":"2020-07-09T03:01:23Z","rating":1,"isEdited":false,"userName":"bruv just pissoff"}},{"id":"6174754377","type":"user-reviews","attributes":{"title":"This app ruined my life.","review":"What I’m about to tell you is very difficult for me to say. This app ruined my life. I was once a simple man. I went to work at my office job to provide for my wonderful family, just like any other loving father. I used to find my life boring, but now, I miss how things were. Boring and simple is good compared to how my life is now. It all started when I downloaded this app. Everything was fine for the first couple of days, but then, things began to change. My once, bubbly, loving wife, Ellie ,slowly became distant, and cold. I tried everything to win back her love, but things only got worse. After that, I notice that my eight year old son was distancing himself from me as well. I tried to respect Ellie’s boundaries, but I saw that she was always hiding the notifications on her phone. I knew it was wrong, but I decided that I had to check it. I opened her phone, and what I saw was shocking. The Trump 2020 app had contacted and seduced my one true love. After confronting Ellie, she told me that she was planning to take our son and move in with the Trump 2020 app. They were my life. They were my world. After they moved out, I became extremely focused on my job. I was doing great, too. I was in line for a huge promotion, and I knew it. The boss had his eyes on me. That is, until the Trump 2020 app got hired. The Trump 2020 app sat at my desk clump. It always hurt me to see the picture of the Trump 2020 app with my wife and my little boy. They were laughing and smiling. The Trump 2020 app quickly worked his way up the food chain. Eventually, he became the branch manager. I hated that he had power over me. I clenched my teeth whenever he gave me an order. One day, I was called into his office. He fired me. He said it was “nothing personal”. But he was wrong. It was nothing BUT personal. The Trump 2020 app stole my wife. The Trump 2020 app stole my child. The Trump 2020 app stole my job. The Trump 2020 app stole my life. MY life. Now, I have nothing. I failed to get another job, so I lost my house and my car. On top of this, Ellie got full custody of my little boy. I have nothing... I... I have nothing.","date":"2020-07-09T02:53:26Z","rating":1,"isEdited":false,"userName":"mollykite144"}}]}