{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=127240","data":[{"id":"6177844122","type":"user-reviews","attributes":{"review":"its unfair how you have to delete tiktok if people dont want to see there identity they can take it off but for you to delete out app IS RIDICULES THIS IS SO UNFAIR TRUMP GIVE US OUR APP BACK NOW.PLEASE WE ALL BEG YOU THIS APP IS HOW WE MADE FRIENDS ITS ONE OF OUR FAVORITE THINGS TO DO THIS IS UNFAIR.","title":"WHY WOULD YOU DO THIS.","userName":"weet weet with the sweet feet","date":"2020-07-09T18:53:50Z","isEdited":false,"rating":1}},{"id":"6177843422","type":"user-reviews","attributes":{"review":"f*ck this child rapist you call your president. id like to proudly celebrate my country somedaynot with him","title":"i hate it here","userName":"haley hotchner","date":"2020-07-09T18:53:38Z","isEdited":false,"rating":1}},{"id":"6177843257","type":"user-reviews","attributes":{"review":"I downloaded this app just to give it a 1 star rating","title":"ass","userName":"Dragonexus","date":"2020-07-09T18:53:35Z","isEdited":false,"rating":1}},{"id":"6177841232","type":"user-reviews","attributes":{"review":"This is an absolutely horrible app.  If I could give it less than one star I would rate it -95141626726272527252725272527517171918271617161626626625282827/5 \nalso, when you take something away from gen z, they dont like it and they will go crazy. In case you havent already learned that. Bye \n-extremely angry gen z tiktoker","title":"You take tiktok, we take away your app","userName":"gen z ","date":"2020-07-09T18:52:58Z","isEdited":false,"rating":1}},{"id":"6177840038","type":"user-reviews","attributes":{"review":"This app is nice and stuff but then my phone kept acting weird and stuff so I went to my buddy who works at a phone store and he said that nothing is wrong with it. I just went home and relax, later at night my phone went off and Siri came up and said big Cheeto man for president 2020 so I got scared and went to the app and I deleted it \n\nAlso it scared me so much I poop my pants while working","title":"Booty","userName":"dhjajwjw","date":"2020-07-09T18:52:37Z","isEdited":false,"rating":1}},{"id":"6177839448","type":"user-reviews","attributes":{"review":"Delete this shii for TikTok","title":"Revenge","userName":"we need LTMs back","date":"2020-07-09T18:52:27Z","isEdited":false,"rating":1}},{"id":"6177838032","type":"user-reviews","attributes":{"review":"He want to ban tic tok and he is rude he is a vacation face he looks like a bag of poop","title":"Burnt Popeyes","userName":"skini winie","date":"2020-07-09T18:52:02Z","isEdited":false,"rating":1}},{"id":"6177837845","type":"user-reviews","attributes":{"review":"2016:  \"And. The winner of the presidential election is. Donald Trump!\"  Everyone claps as he shakes hands with  Hilary Clinton.  \"Donald Trump will be inaugurated January 20th, 2017.\"  2020:  \"Donald J. Trump. Won the reelection!\"  2023:  Claire's POV: I pick up a piece of broccoli with my fork as I slouch in my chair not wanting to be here. Its currently 7pm and were eating dinner with the Trumps in silence.  \"So, Mike. Did you get the paper work I sent you?\" Mr. Trump asks. Melania looks at him and he continues eating.  What even are we eating?  I pick up a piece of meat and shove it in my mouth. Chewing and looking out the window.  My parents adopted me from Alaska when I was 5. I'm 16 about to turn 17 in about a week.  \"Claire honey, did you hear Melania?\" My mom asks. I look up to see everyone looking at me. Minus Barron. He decided not to join us to go to dinner at his girlfriends. God I despise her.  \"No ma'am. Pardon me Melania?\" I ask. she smiles at me and starts speaking.  \"What are we going to do for your birthday next week?\"  \"I havent really thought about it ma'am.\" I say eating some more of the dry meat.  \"I was thinking suit and tie and ball gown party. Really formal.\" My mom says as someone from the staff takes her plate.  \"Oh that'd be great! And we can have it here! Right honey?\" She says turning to Mr. Donald. He nods and they squeal like teenagers.   ***  \"We can put some flowers here.\" Melania says pointing to someone and they sent the vase down. It is now the day before my birthday and I'm sitting on the stage next to Barron where the live band will be playing. I look through the 7 page long guest list and sigh.  \"I don't even know most of these people.\" I say on page 5. \"Prince Harry? Why would he come?\" I ask turning to Barron. He shrugs not looking up from his phone. I sigh and look back down at the list.  \"Claire darling. Have you gotten your dress?\" Melania asks turning around to me.  \"Yes Ma'am.\" I say looking up from the list. She nods and goes back to decorating. I look at the time that says 10:27. I get up leaving the guest list on the stage. I hug my mom and kiss her cheek. I go over to Malenia and do the same.  I walk down the halls and knock on the office door. It opens and I walk in.  \"Dad. Im going home to rest up before the party tomorrow.\" I say walking towards them.  \"Goodnight Sweetheart.\" My dad says kissing my forehead.  \"Goodnight Claire.\" Mr. Donald says.  \"Goodnight Daddy. Goodnight Mr. Donald.\" I say hugging them both before walking out and out of the white house.  I see a slick limo as someone from the staff opens the door welcoming me in.  \"To the vice presidents house.\" I say grabbing a gummy worm from the pocket.","title":"chapter 1","userName":"AHHHHHH STUPID","date":"2020-07-09T18:51:58Z","isEdited":false,"rating":1}},{"id":"6177837318","type":"user-reviews","attributes":{"review":"Black lives matter no Trump 2020 烩尖解锯库解烩库锯尖解烩库锯尖解烩库锯尖解烩库锯尖解烩库锯尖库烩锯尖库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解库锯尖解尖烩解库尖锯解库尖锯解库库尖锯烩库尖解库尖解锯烩尖解烩锯库尖解烩锯库尖解烩锯库解解烩锯库解尖锯烩解库尖尖锯锯烩库尖解锯烩库尖解锯烩库尖解锯烩库尖解烩库解解烩解库尖锯解烩解库尖锯锯尖解解烩解库尖锯锯尖库解烩解库尖锯锯烩解库尖锯解烩解BLM烩烩锯库解烩解锯库尖烩库锯BLM烩解锯库金モ解锯库库解烩烩解拣BLM锯金モ烩筐锯锯金モ库烩解攫BLM解库攫モ尖火モ解筐锯火モ解库尖火モBLM烩拣モ解锯锯金库火BLMモ库尖解火BLM库尖烩锯解拣BLM解尖烩筐モ烩解解锯筐BLM锯锯解筐モ锯解BLM烩尖锯筐モ烩尖解库库拣BLM锯烩库库金モ拣モ解解库尖BLMモ烩锯库尖BLM库解锯火BLM烩尖解库金BLM尖锯金モ解BLMモ锯锯解BLM尖烩金モ库锯BLM尖烩金モ锯库烩金BLM烩尖金モ锯库尖火ヰBLM解尖火モ库库尖火BLM锯筐モ烩库锯拣BLM金モ库库BLM火モ尖库筐モ烩火モ解尖BLM攫モ筐モ尖解烩BLM库尖解BLM火モ库筐ヰBLM解拣モ火BLM火モ库BLMモ库烩火モBLMモ库尖库库BLMモ烩解库BLMモ烩解库BLMモ烩金モBLMモ烩解库BLMモ库解库烩金ヰBLMモ烩火モBLM解金ヰBLMモ解烩筐モBLM库解烩火モBLMモ解烩库BLMモ解烩解BLM尖库解锯BLMモ库烩拣モBLMモ库拣モBLMモ库尖锯BLMモ库尖库BLMモ库解锯BLMモ库锯库尖BLMヰモBLMモ解解攫BLMモ解解库BLMモ库拣モBLM尖锯烩金BLM锯库烩火ヰBLM尖解库库筐BLM尖库锯库库BLM锯库金ヰモ烩BLM拣モ烩解拣モ库BLM烩筐モ攫BLM锯库烩筐モ库BLM拣モ库解BLM拣モ解火ヰBLMヰモ库BLMモ解烩攫モBLM攫モ解火モBLM拣モ解烩拣モBLM攫モ解解攫BLM拣モ解攫モBLM火モ尖尖BLM烩解拣ヰヰモBLM尖尖攫モ尖烩尖BLM攫モ尖库火モBLM攫モ尖BLM锯拣モ烩解BLM攫モ烩尖锯筐モ锯尖BLM火モ锯拣ヰBLM筐金モ尖BLM金モ锯库金BLM火モ金ヰヰBLM火モ锯锯火モBLM筐モ解攫ヰモBLM筐モ烩锯解火モ烩BLM拣モ锯BLMモ烩金モBLMモ烩锯金モ解BLMモ烩锯尖解烩烩解BLMモ解火モBLM尖筐モ解烩火ヰBLM筐モ解尖解筐モ烩解BLM拣モ烩金ヰBLM攫モ火ヰBLM烩锯库烩金モ筐モ解BLM攫モ火モ攫モBLM库筐モ攫モ库BLM库金モ拣モ烩BLM攫モ解火BLM拣モ库攫モ尖烩BLM攫モ库解火モBLMモ尖烩解BLMモ攫モ库筐BLM拣モ烩火モ库BLM攫モ库BLMBLMBLMBLMBLM锯烩尖库火ヰモ烩解锯库筐ヰヰヰヰヰモ锯解烩锯解锯尖烩锯拣モ锯库解锯锯库尖锯库解锯库尖攫モ锯解锯锯BLM BLM火モ库锯烩解BLMモ锯解烩尖锯BLM拣モ金ヰヰモ尖BLM筐モ解尖筐モ解BLM火モ库尖火モBLM攫モ库尖锯BLM火モ锯Arrest The Orange Man In Office 金モ锯筐Arrest The Orange Man In Office 火モ库锯火モ库解烩Arrest The Orange Man In Office モ拣モ烩火ヰArrest The Orange Man In Office拣モ锯锯尖烩Arrest The Orange Man In Office攫モ火モ锯Arrest The Orange Man In Office金モ烩锯金モ烩金モ烩解解Arrest The Orange Man In Office拣モ烩烩拣モ烩拣モArrest The Orange Man In Officeモ尖拣BLM筐モ解烩库烩金BLM攫モ解烩BLM筐モ解锯BLM拣モ锯金ヰモ解拣モ锯攫金モBLM筐モ解BLM拣モ烩BLM筐モ解攫BLM拣モ烩锯尖BLM筐モ烩库库BLM拣モ烩金BLM拣モ筐モ尖BLM攫モ解金BLM筐モ尖BLM攫モ解库锯BLM火モ解攫モBLM筐モ尖解库BLM火モ尖解BLM攫モ库尖锯解BLM火モBLM火モ拣ヰモBLM攫モ拣ヰBLM火モ金モBLMヰモ烩BLM攫モ尖烩BLM筐モ烩BLMヰモ解BLM攫モ尖解BLM筐モ尖火モBLM筐モ拣モBLM攫モ烩BLM库解尖解筐BLM攫モ尖筐BLM火モ尖尖BLMヰモ解锯BLM筐モ锯金モBLM筐ヰ攫モ解BLM拣モ锯拣モBLM火モ锯Arrest The Karens尖筐モ锯库Arrest The Karens火モ尖锯烩尖Arrest The Karens 金モ烩拣Arrest The Karens 筐モ火モ尖锯Arrest The Karens 金モ烩金モArrest The Karens 筐モ火モ锯Arrest The Karens 筐モ锯锯库Arrest The Karens 金モ烩解BLM拣モ解拣モBLM筐モ库筐モBLM拣モ锯烩尖BLM金モ烩锯BLM筐モ烩BLM金モ锯BLM筐モ尖BLM筐モ烩解库BLM攫モ烩尖锯BLM金モ锯火BLM库攫ヰモ锯BLM解烩攫モBLM尖锯筐モBLM金モ烩解BLM拣モ解锯尖BLM筐モ烩金モBLM拣モ筐モ解烩BLM拣モ解锯BLM库锯解BLM筐モ解筐ヰヰモBLMモ库解BLM火モ库金モ库库BLM攫モ库金BLM拣モ解BLM火モ解烩解库锯BLM拣モ筐モ解烩BLM拣モ筐モ解BLM拣モ解烩火モ库解锯BLM拣モ解库库库拣モ烩BLM攫モ库金モBLM拣モ库金モBLM攫モ库筐モBLM拣モ解库尖BLM攫モ金モ尖金ヰBLM火モ库库BLM攫モ库尖金モBLM火モ解筐モBLM攫モ解尖锯解BLM火モ尖解解库攫BLM火モ库烩解攫BLM拣モ筐モBLM攫モ解锯BLM火モ解解烩Deport White supremacist 拣モ库拣モDeport White Supremascist攫モ解锯解Deport White Supremascist火モ解烩解Deport white Supremascist 拣モ金モ解Deport White Supremacist モ攫モ解攫Deport White Supremacist 拣モ解金モ解Deport White Supremacist 火モ锯烩解锯Deport White Supremacist 筐モ锯解解库Deport White Supremacist 拣モ金モ解解Deport White Supremacist 火モ解烩解解烩Deport White Supremacist 拣ヰモ拣ヰDeport White Supremacist 筐モ解库解Deport White Supremacist 攫モ锯Deport White Supremacist 拣モ金モDeport White Supre","title":"BLM库攫金70","userName":"hennesy G","date":"2020-07-09T18:51:48Z","isEdited":false,"rating":1}},{"id":"6177837181","type":"user-reviews","attributes":{"review":"i downloaded the app specifically for my swamp ass child his name is bart, bart is a mega fan of tr*mp so as any good parent would i downloaded this app so he could talk to his sugar daddy over the phone. after i downloaded this app a very low humming nose started blasting out if my phone speaker and that noise attracted small present like children that took away my bart. my bart left behind a trail of mixed nuts from costco. my instinct was to eat the raisins but turns out it was my rat peaunios feces. this fecal matter gave me the ability to see super well so i could see bart laying down his little nuts. i haven't found my baby yet... please call 206-930-3594","title":"bring back my bart!","userName":"stank ass mama swamp","date":"2020-07-09T18:51:46Z","isEdited":false,"rating":1}}]}