{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=124440","data":[{"id":"6174255079","type":"user-reviews","attributes":{"date":"2020-07-09T00:22:13Z","title":"I don’t like it","rating":1,"isEdited":false,"review":"I just don’t 🥱","userName":"dhsjdjfh"}},{"id":"6174254134","type":"user-reviews","attributes":{"date":"2020-07-09T00:21:53Z","title":"No❤️","rating":1,"isEdited":false,"review":"Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv ❤️Lauv❤️lauv❤️lauv❤️lauv ❤️Lauv❤️lauv❤️lauv❤️lauv ❤️Lauv❤️lauv❤️lauv❤️lauv Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv❤️ Lauv❤️lauv❤️lauv❤️lauv","userName":"ererrb"}},{"id":"6174253884","type":"user-reviews","attributes":{"date":"2020-07-09T00:21:48Z","title":"Horrible app","rating":1,"isEdited":false,"review":"Just No 🤮","userName":"donaldisanuglyrat"}},{"id":"6174253160","type":"user-reviews","attributes":{"date":"2020-07-09T00:21:33Z","title":"No❤️","rating":1,"isEdited":false,"review":"I said No❤️","userName":"No❤️098"}},{"id":"6174252817","type":"user-reviews","attributes":{"date":"2020-07-09T00:21:25Z","title":"Terrible","rating":1,"isEdited":false,"review":"App","userName":"jsjdjxjcjcjcjc"}},{"id":"6174252068","type":"user-reviews","attributes":{"date":"2020-07-09T00:21:09Z","title":"Just no.-","rating":1,"isEdited":false,"review":"No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no no no no, no no. No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no no no no, no no. No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no no no no, no no. No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no. No no no. No no no no no no. No no no no no? No no no no no. No no no, no no no. No, no no no. No no no no no! No no no no no no no. No, no no no. No no no no. No no no.","userName":"xo..Maddy"}},{"id":"6174252019","type":"user-reviews","attributes":{"date":"2020-07-09T00:21:08Z","title":"🤢🤢","rating":1,"isEdited":false,"review":"terrible","userName":"Partydud"}},{"id":"6174251879","type":"user-reviews","attributes":{"date":"2020-07-09T00:21:05Z","title":"Gen z","rating":1,"isEdited":false,"review":"@unusualbeing sent me","userName":"julia2973"}},{"id":"6174249826","type":"user-reviews","attributes":{"date":"2020-07-09T00:20:22Z","title":"Bad","rating":1,"isEdited":false,"review":"Bad. Just bad.","userName":"carlylho"}},{"id":"6174249774","type":"user-reviews","attributes":{"date":"2020-07-09T00:20:21Z","title":"I don’t like it✋👁👄👁","rating":1,"isEdited":false,"review":"Grosss","userName":"Molly_Yolo"}}]}