{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23370","data":[{"id":"6173505847","type":"user-reviews","attributes":{"date":"2020-07-08T19:48:03Z","isEdited":false,"userName":"genZrules lol","review":"This is probably the worst app I’ve ever downloaded it slowed my phone down and was a waste of data i have to take my phone to bet it fixed because this terrible app messed it up 10/10 wouldn’t recommend if i could give it 0 stars i would","rating":1,"title":"Disappointed"}},{"id":"6173493912","type":"user-reviews","attributes":{"date":"2020-07-08T19:44:00Z","isEdited":false,"userName":"Jools1118","review":"This website lags it doesn’t work properly and I couldn’t find anything that I needed.  How does he expect to win a presidency when he can’t even manage a website.  Definitely one of the worst sites I’ve ever used.  After using this I’m going to be withdrawing my vote.","rating":1,"title":"Literally awful"}},{"id":"6173489554","type":"user-reviews","attributes":{"date":"2020-07-08T19:42:29Z","isEdited":false,"userName":"roborizzle","review":"This app is terrible.  It took forever to download and it made my entire screen freeze. I had to do a hard shut down of my phone in order to get it working again. Every time I try to open the app, it happens again so I’ve given up on it.","rating":1,"title":"This app is the worst"}},{"id":"6173460920","type":"user-reviews","attributes":{"date":"2020-07-08T19:32:34Z","isEdited":false,"userName":"LT_87799","review":"They need to review this app. It completely shut my phone down multiple times. When it did open it froze and I had to restart my phone. You would think that someone that extorts money and children from this nation would actually pay for a decent app.","rating":1,"title":"Worst app ever"}},{"id":"6173460516","type":"user-reviews","attributes":{"date":"2020-07-08T19:32:26Z","isEdited":false,"userName":"GG swager","review":"This app experience is horrible. The app takes forever to download and makes my phone glitch. This app is extremely slow like our president when it comes to thinking and having common sense. DONT DOWNLOAD unless you want a glitchy app that ruins your phone will awful download speeds.","rating":1,"title":"GlITCHY APP"}},{"id":"6173460471","type":"user-reviews","attributes":{"date":"2020-07-08T19:32:25Z","isEdited":false,"userName":"itzzjayy","review":"I downloaded this app and opened it right away and my dresser fell over🙄 I did not give it permission to do that and it was rlly uncalled for... but then I decided that I will give it another try and it knocked my desk over and broke my favorite lamp🤬 this app is nothing but a peice of trash and it is just awful...(already deleted)","rating":1,"title":"Just awful"}},{"id":"6173457404","type":"user-reviews","attributes":{"date":"2020-07-08T19:31:21Z","isEdited":false,"userName":"chickenhead1157","review":"This is the worst app I have ever downloaded if I could give it 0 stars I would it takes forever to download and when it finally done it say the app is down don’t recommend it’s a waste of time. Also take up a lot of storage on your phone whatever you do don’t download this app","rating":1,"title":"THE WORST"}},{"id":"6173450840","type":"user-reviews","attributes":{"date":"2020-07-08T19:29:12Z","isEdited":false,"userName":"Kaiabelle","review":"I downloaded this app expecting to be able to support my Cheeto president 😌💅 but as it turns out 🥵 this app does nothing but play high pitched squealing music that attracts cockroaches and centipedes 😰but not only that😪 downloading the app also made my phone a hub for malware and all types of horrible, no good funny business. It is with a heavy heart that I must say... Shrek 2020 🥰😘😌💅✨","rating":1,"title":"Cheeto God 👹"}},{"id":"6173442487","type":"user-reviews","attributes":{"date":"2020-07-08T19:26:19Z","isEdited":false,"userName":"For the girls and gays","review":"I downloaded this app to support my favorite rotten orange but once it was downloaded (after days of waiting for the download to complete). I found my phone hacked!! It managed to get into my email and phone and eventually found my debit card!!! I’m pretty sure Trump used my money to buy more spray tan but now I’m broke!! NEVER USING THIS APP AGAIN!","rating":1,"title":"DON’T DOWNLOAD HACKED MY PHONE"}},{"id":"6173439914","type":"user-reviews","attributes":{"date":"2020-07-08T19:25:26Z","isEdited":false,"userName":"yuh✨","review":"I have never downloaded a worse app in my life!! Apple should delete this app already. I literally almost died and it gave my dog heebeejeebees. I’m so done with this president trying to kill me. I hate the app and it also took a whole month to download. The app also took up my whole space and it broke my phone no ✨j o k e✨🤪good night","rating":1,"title":"✨HATE IT!✨"}}]}