{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=43150","data":[{"id":"6068043960","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-12T19:50:55Z","review":"It was hard to operate and I did not like the lay out of the app at all. If you are a Trump supporter I recommend just checking up on Trumps Twitter every now and again.","userName":"laynuha","title":"Don’t Recommend this app"}},{"id":"6067797934","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-12T18:16:34Z","review":"so i downloaded this app because of course TRUMP 2020 but after signing up for an account it immediately notified me that to be a real bunker trumper i must sacrifice my first born child in the name of donald j trump himself. this was a huge red flag. but since trump is my king i must obey. #TRUMP #MAGA","userName":"Mmmmmmmmmmmmommmmmmmmmmmmy","title":"WTFF"}},{"id":"6066053031","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-12T08:35:10Z","review":"Love how the worst type of person is in office right now. Trump 2020? How much more damage can he cause, he hasn’t done any progress all he’s done is sent into a MORE separated nation. No change at all. Truly trash.","userName":"Delgrap","title":"Love!!!"}},{"id":"6064647404","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-11T22:37:30Z","review":"i downloaded this app and then the secret service came to my house, stole my dog, and then locked me inside of trumps closet for two weeks. Trump was in the bunker so thank god he was no where near but i will never forget the horrid smell.","userName":"............:)awesome","title":"screw donald"}},{"id":"6061154723","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-11T02:12:07Z","review":"The new hitler. The new fascist overlord. He says that he will protect your rights and yet he blinds you with rubber bullets and gases your central and South American siblings. He doesn’t care for you. He cares about money power and underaged girls he can take advantage of.","userName":"anti fascism rocks","title":"Disgusting boy"}},{"id":"6059968011","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-10T18:29:27Z","review":"So I named this title because that’s what I think off this. He stated chasing me in my sleep I have nightmares about a orange man chasing me. Then Obama saves me. I cried in tears of joy. But then  I saw the orange man and I cried real tears because he was i front of my eyes. This is why this app is POO.","userName":"briebrie.com","title":"poo"}},{"id":"6059918398","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-10T18:11:52Z","review":"DO NOT GET THIS APP!! It’s a scam and it ruins your device!! It seems you a BUNCH of spam messages and eventually it makes your phone/tablet etc stop working!! i had to get a knew PHONE bc of this app! it’s so bad!! it should be removed","userName":"Angggggieeeeeeeeeeeeeee","title":"BAD AND A SCAM"}},{"id":"6057670266","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-10T06:36:12Z","review":"All it said on the screen was “WRONG!”. Even when I tried clicking something all it said was “WRONG!”. I’m starting to think that i’m not the one who’s wrong here...","userName":"Leu leu","title":"App was not what I was expecting"}},{"id":"6057545604","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-10T05:47:51Z","review":"Trump wanted the death penalty for the Central Park Five he took out a full page ad in the paper calling for it. Back when he was just a businessman. He supports using weapons of war on civilians. This app is just propaganda.","userName":"itunesrequiresanickname","title":"Propaganda"}},{"id":"6056445334","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-09T22:33:27Z","review":"honestly wish i could give it less stars. overall shocked by the poor design and resources of this app!!!!! seriously feared for my life even attempting to download it. 10/10 DO NOT RECOMMEND","userName":"z.anastasia.r","title":"wow i was shocked"}}]}