{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=20930","data":[{"id":"6174734525","type":"user-reviews","attributes":{"rating":1,"title":"tomfoolery at its finest","review":"I quite frankly ADORE donald, so I was appalled to find that this app is a total sham. When I opened the app, some sort of realistic orange troll doll popped up and told me to vote for him for president. I nearly had a heart attack, I could have died. I don’t know what you people THINK Donald looks like, but lemme tell you right now he is a DUCK, not a troll. Get it right. Do better. (i’m melania btw)","userName":"kwikichiki","date":"2020-07-09T02:47:22Z","isEdited":false}},{"id":"6174724434","type":"user-reviews","attributes":{"rating":1,"title":"Wouldn’t even download","review":"Wanted to steal my wallet, my dog, my will to live, and my pet crow named thesaurus. I’ve never downloaded an app that had so many porn bots and viruses, it even asked me if the sun was purple, I said no but it disagreed with my facts telling me that it was indeed purple and if I didn’t see it I was a terrorist. My crow warned me but I didn’t listen and now I’m paying the price.","userName":"Ashly1121","date":"2020-07-09T02:44:22Z","isEdited":false}},{"id":"6174704311","type":"user-reviews","attributes":{"rating":1,"title":"no ❤️","review":"this app is so unhelpful! as soon as I downloaded it my phone crashed! it sent me at least 100+ texts and I will be speaking to a manager😡. i was able to get my phone turned back on and it sent me a notification every 5 seconds. I was glitching and every photo on my camera role turned into a cheeto🥵.","userName":"jdiy101","date":"2020-07-09T02:38:16Z","isEdited":false}},{"id":"6174689627","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE","review":"i wish i could give 0 stars. this app deported my neighbors, raped my daughter, gave my mom corona virus, turned my uncle racist, disregarded the lives of my black co-workers, let russia hunt my cousin in the military, took away the ability to adopt from my lbgtq+ sister, sent my baby niece to school during a pandemic, killed my dog for protesting oppression, and put up a statue of robert e lee in my front yard.","userName":"ABUDDYXD","date":"2020-07-09T02:33:52Z","isEdited":false}},{"id":"6174677175","type":"user-reviews","attributes":{"rating":1,"title":"SAD","review":"this app is the SAD of all apps. four years ago I could enjoy oranges without thinking about them. but now, they remind me of mr mac and cheese spray tan. every time I pick up an orange, I shudder. I get nightmares. this app has given me hallucinations of little oranges running around. think shrek 3 hallucination dream scene where shrek is freaking out about not pulling out. im scared. and above all, I am SAD","userName":"bewysad","date":"2020-07-09T02:30:10Z","isEdited":false}},{"id":"6174668187","type":"user-reviews","attributes":{"rating":1,"title":"Terrible, slow and freezes","review":"I hate this App. It is slow, always freezes and I can never load anything from it. Also right off the bat it asks for you phone number which is a big security issue. So no If I could give it zero stars I would. But I cannot so I give it a one star review","userName":"sanaahamid","date":"2020-07-09T02:27:35Z","isEdited":false}},{"id":"6174637010","type":"user-reviews","attributes":{"rating":1,"title":"Flores don’t get the app it’s a rlly bad app","review":"I went in and it asked for my phone number and I don’t give my phone number to anyone it was very glitchy so I don’t like it also when I tried it it was asking me my email and my address for a sec so no I don’t like this app at all and I don’t recommend it sorry the app gotta go .","userName":"jejfkdkrhnrkdifnsnfidod","date":"2020-07-09T02:18:37Z","isEdited":false}},{"id":"6174627556","type":"user-reviews","attributes":{"rating":1,"title":"Infrigement of my rights!","review":"After doing some data mining through the app I learned that this app tracks you! This app gains access to your location, camera, microphone, AND your keyboard. This means they have access to your entire personal life, AND can see the info you put in to buy stuff online. This app is awful!","userName":"Trump Supporter 202","date":"2020-07-09T02:15:55Z","isEdited":false}},{"id":"6174624567","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE APP","review":"You would think considering how great our president is this would be a goof app but NOPE. This app made my phone COMPLETELY shut itself down and I couldn’t turn it on for THREE DAYS. Then it stole my wife avocado and my kids Billie Eilish and Lauv from me! I was left with no money, family, or love. I’m currently writing this on Ellen’s smart fridge so that I can tell the world how BAD this app is!","userName":"Kiki siding","date":"2020-07-09T02:15:07Z","isEdited":false}},{"id":"6174615250","type":"user-reviews","attributes":{"rating":1,"title":"I went to hell and back","review":"When I got my this app I immediately. Descended into hell and even satan couldn’t believe I got the app do he sent me back after I went to hell I was greeted by the Cheeto i mean president him self and he was trying to kidnap me I had to fight my way outta his grasp but by then I was already covered in Cheeto dust now I have to get the dust outta my new shoes ugh 😑🙄","userName":"wantsomecandy","date":"2020-07-09T02:12:29Z","isEdited":false}}]}