{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=18190","data":[{"id":"6173565162","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T20:08:17Z","title":"THIS APP MADE MY LIFE WORSE","userName":"Cia_moon","review":"once i downloaded this app i immediately started to get bad luck! when i opened the app the blanket i had on my bed FLEW, when i say flew i mean it FLEW across my room. at first i thought it was a coincidence but then after a day with this app on my phone i i broke ALL my nails that i paid good money for. smh. after that i started to turn ORANGE like trump. WOW. everyone delete this bad luck of an app","rating":1}},{"id":"6173551938","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T20:03:49Z","title":"will have severe consequences","userName":"IAMLiGmA","review":"i was scrolling through the app and my one year old daughter saw trumps face. she then, understandably so, proceeded to scream and light the house on fire using gasoline. she killed everybody but me including herself. later i was sitting by the ruins and decided to take a break from mourning and continued to use the app. i started playing a video of one of trumps speeches, but the birds outside heard the noise and started screeching as loud as birds can in an attempt to drown out trumps voice. this caused millions of cockroaches and alligators to come towards me and attack me. currently leaving review from the hospital, just had to share. stay safe and remember, vote for trump!","rating":1}},{"id":"6173498377","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:45:28Z","title":"Worst app ever","userName":"kaliyaaliya","review":"Once I installed it it completely crashed as I opened it and then I tried again then my phone shut down, it took a while for me to get my phone to work again but gladly it turned back on. I will never download this app again because it almost ruined my phone which I saved up a lot of money for.","rating":1}},{"id":"6173494715","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:44:16Z","title":"horrible app","userName":"pApI i AdOrE yOu","review":"As soon as I opened the app I thought it was gonna work then all of a sudden when I got out of the app MY WALLPAPER CHANGED! my home screen was now an orange and and lock screen was an cockroach with the same hair as Donald Duck!Then the next day I got so many phone calls from random numbers telling me to try the new and improved orange tanner. I AM OUTRAGED THIS APP IS THE WORST I GOT SO MANY BAD THINGS OUT OF IT. A COCKROACH INFESTATION AND ORANGE TANNER THAT MADE ME ASHY WHICH NONE I WANTED SO DISAPPOINTED!🍊","rating":1}},{"id":"6173494370","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:44:09Z","title":"Don’t waste your time.","userName":"shdncoxdsifbx","review":"This app to weeks and weeks to fully download. It kept requesting for my location and it’s pointless. You receive spam calls. If I could give it a 0 star rating I would. Also trump has such a big mouth and post everything he wants to on Instagram why does he need his own app? 0/5 would NOT recommend","rating":1}},{"id":"6173486220","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:41:18Z","title":"it took ALL my information and now im getting random phonecalls from around the world","userName":"NO SPCEEE","review":"I downloaded the app filled in my info and now i getting RANDOM phone calls from around the world this app also almost killed me it sent someone to my house and i had to call the cops bc they had a gun this app is also useless and takes up to much space","rating":1}},{"id":"6173480409","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:39:17Z","title":"My name is Karen.","userName":"[{#]","review":"This app is a joke. It took sixth weeks to download and I wasted a yuge amount of my time. While waiting, I began to turn orange and my skin turned into a Cheeto. On top of that, my hair resembled corn and I am not happy about that. I would like to talk to the app creators lawyer because this is not acceptable. As a polished white woman who gets my way no matter what, I am upset with this app as well as its influencers. Unacceptable.","rating":1}},{"id":"6173469486","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:35:33Z","title":"UPDATE UPDATE UPDATE","userName":"trumpcankissmypinkass","review":"So I was walking in Washington today, then I saw that big fat disgusting orange of a man in a limousine as long as his insecurities and this man had THE AUDACITY to walk up to me and TELL ME, as a Muslim woman, to take off my hijab as it makes me look like an EGG i have NEVER been so ASHAMED to walk in public with a hijab on and you know what I did ? \nI told him that a man that looks as ugly as he is should NOT be shaming beautiful women as he looks like a rotten orange","rating":1}},{"id":"6173467980","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:35:02Z","title":"NO STARS","userName":"nickname._.create","review":"If I could put zero stars I would. First, the app just stayed on my homepage downloading for HOURS. When I tried to open it, it said that it wouldn’t accept my phone number because all phones matter!! The worst part is, it told me that I had an exclusive flag from Trump, but then my dad got the exact same message along with three of my friends😤😤 This is a scam.","rating":1}},{"id":"6173461381","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T19:32:44Z","title":"app made me poor.","userName":"karenworld","review":"i wanted to download this app to show my support for the one and only orange man. but when i tried to download it, it took five hours. then when i opened the app, i was being asked to pay 500 dollars!!!😡😡this is so rude!!! all i wanted to do was show support for the big man 😢😢😢 i tried reinstalling the app and when i did, guess what happened??? another payment of 7000 dollars!!!!!! what is this madness???? i am no longer a trump supporter 😭😭😭 this is outrageous !!!!! i cannot believe that one of my favorite (ex-favorite) people would do such thing to a loyal suporter like me 😢😢😢i am going to lose my house because of this 😭","rating":1}}]}