{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=51970","data":[{"id":"6174738947","type":"user-reviews","attributes":{"userName":"scarscar48","isEdited":false,"review":"This is the worst app ever it took forever to load and all of the stuff on the app made no sense. If I could give it 0 stars I would","rating":1,"date":"2020-07-09T02:48:44Z","title":"Trash"}},{"id":"6174737604","type":"user-reviews","attributes":{"userName":"cookie4413","isEdited":false,"review":"My phone was traumatized after I downloaded this app I have to make it take group classes of therapy just so it can get back working smh","rating":1,"date":"2020-07-09T02:48:18Z","title":"Ew"}},{"id":"6174737495","type":"user-reviews","attributes":{"userName":"joentreeea","isEdited":false,"review":"I was scrolling through it and it says that i was being hacked and tracked. It has asked for my credit card password and all of my personal information!!! DO NOT DOWNLOAD THIS APP YOUR BEING TRACKED BY DONALD TRUMP TO SEE IF YOUR FROM AMERICA OR NOT IF YOUR NOT ICE WILL COME GET YOU BE CAREFUL‼️","rating":1,"date":"2020-07-09T02:48:16Z","title":"THIS APP IS HORRIBLE"}},{"id":"6174736997","type":"user-reviews","attributes":{"userName":"savebarron2020eeee","isEdited":false,"review":"no pertinent info, causes glitching on my phone, too many notifications, shorty fake news- don’t know why it’s on the app store. trump lost my vote over the ridiculousness of what he has chosen to put in this app. i guess i was just uninformed abt who this guy was. also thought he might have been cool enough to figure out apps but no.","rating":1,"date":"2020-07-09T02:48:07Z","title":"terrible app"}},{"id":"6174732708","type":"user-reviews","attributes":{"userName":"fbsidbadi","isEdited":false,"review":"I can’t believe trump is our president. he talks like a 5 year old and all of his supporters have the IQ of a doorknob. take this app off the App Store please. It’ll make a lot of ppl happy.","rating":1,"date":"2020-07-09T02:46:50Z","title":"terrible app"}},{"id":"6174723310","type":"user-reviews","attributes":{"userName":"Reg.Mount","isEdited":false,"review":"this app is horrible!!! Trump, keep doing what you do best and stick to looking like a dirty cramped up antibiotic cheese puff, this app is a true disgrace","rating":1,"date":"2020-07-09T02:44:01Z","title":"Don't get unless you want your phone to be a virus"}},{"id":"6174717908","type":"user-reviews","attributes":{"userName":"qifb","isEdited":false,"review":"First of all how dare he even think of contacting me. Imagine letting a child molester sending you text....1/5 star. Truly upsetting this man has an app. Stream watermelon sugar by Harry😌✨","rating":1,"date":"2020-07-09T02:42:22Z","title":"Stealing of information"}},{"id":"6174717143","type":"user-reviews","attributes":{"userName":"fellow_zoomer","isEdited":false,"review":"This app promotes racist, sexist, homophobic, and xenophobic content. It is dangerous to the public as it encourages young thinkers to become a close minded bigot. I hope to God this app is taken down soon for the sake of the United States.","rating":1,"date":"2020-07-09T02:42:08Z","title":"Makes one vomit"}},{"id":"6174715772","type":"user-reviews","attributes":{"userName":"DestinyKaitlyn","isEdited":false,"review":"WORST APP EVER!!!!!! i left this app open & it stole my dog & my alpaca. wouldn’t recommend to my worst enemy. anyway, anybody know where i can get my dog back? i miss her.","rating":1,"date":"2020-07-09T02:41:42Z","title":"i would rate 0 starts if i could"}},{"id":"6174715408","type":"user-reviews","attributes":{"userName":"CherryRose09","isEdited":false,"review":"This app glitched my phone and tablet, gave me a virus, stole my private information, sends my location to other random people, and has been recording me without my permission!!!!! Absolutely ILLEGAL!!! DO NOT GET!!!","rating":1,"date":"2020-07-09T02:41:36Z","title":"WORST APP EVER CREATED"}}]}