{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=128860","data":[{"id":"6176214355","type":"user-reviews","attributes":{"rating":1,"review":"Uncle ruckus : This app contains so many racial slurs to our black community . They also promote racism and black face ! This is absolutely terrible . I would like this app deleted now . They need to re think this app and I don’t think it’s appropriate at all . Take this down 😡 \n It’s also promotes rape . This is no longer a app problem but a world problem . I think y’all should delete this before it become too much 🥰","userName":"Dawn 🥰","date":"2020-07-09T11:09:49Z","title":"Racial slurs smh","isEdited":false}},{"id":"6176209534","type":"user-reviews","attributes":{"rating":1,"review":"Worst app ever! My 11-year old daughter could code a better app. Took 4ever to download and crashes my phone constantly! And don’t allow it to send notifications or you’ll end up with a bunch of unwanted spam ads and other useless crap!","userName":"Deucifet","date":"2020-07-09T11:08:23Z","title":"Horrible!!!","isEdited":false}},{"id":"6176201341","type":"user-reviews","attributes":{"rating":1,"review":"this app killed my grandma\n grandma lives matter 👵✊\nRIP Anna Borshin 1957-2020 ❤️🧚","userName":"bgtfodac","date":"2020-07-09T11:05:51Z","title":"HORRIBLE","isEdited":false}},{"id":"6176197919","type":"user-reviews","attributes":{"rating":1,"review":"First of all I read that a lot of people said it took forever to download which is 100% TRUE! LIKE what the heckkkk. But I also don’t like how it says the app may use my location when not in use and it didn’t even asked permission to use my location 😡😡😡 and I also don’t like how you have to use your phone number to create an account like I personally don’t want a bunch of texts about rally’s I’m not gonna go to or petitions I’m not gonna sign. I am deleting this app as soon as I send this because I believe it is an absolute WASTE OF STORAGE on my phone. Thanks for listening to my ted talk 😌","userName":"whyarealltheynamestakennn","date":"2020-07-09T11:04:51Z","title":"WORST APP IVE EVER USED","isEdited":false}},{"id":"6176197746","type":"user-reviews","attributes":{"rating":1,"review":"RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE","userName":"TikTok gen Z 👻👻👻","date":"2020-07-09T11:04:48Z","title":"Gen z is afraid of nothing, well....... maybe spiders other than that nothing.","isEdited":false}},{"id":"6176191650","type":"user-reviews","attributes":{"rating":1,"review":"This is the worst app that has ever been created. I can’t stand it. Once I downloaded the app so that I could follow the campaign (to make fun of it ✨😻🧚‍♂️) it immediately wiped all my data!! On top of that, once I set my phone down, it exploded. I received 3rd degree burns and lacerations (I know that word from greys anatomy 🤧❤️) all over my arms. I had to be helicoptered to a hospital in D.C where I was on bed rest for a few weeks!! And not only that, I had PTSD from looking at Donald trumps face for so long while using his 2020 campaign. I kept dreaming that he was a piece of sh!t coming to murder me in the middle of the night!! I had to go to therapy for many days after that. I have been thoroughly traumatized by this app and I wrote this review in hopes of him getting impeachea-I MEAN, in hopes of warning other people of this horrific app 😤","userName":"Gabriela Alsua","date":"2020-07-09T11:02:55Z","title":"Ruined my life","isEdited":false}},{"id":"6176191584","type":"user-reviews","attributes":{"rating":1,"review":"It took my 3 tries to download this app and when it started downloading it didn’t finish till 3 days later. That’s crazy, it took so long! When I finally got to open the app a scary video of a white old man with a corn husk on his head wearing a red hat popped out of nowhere and started repeating, “make America android again.” At this point it was hacking all my other apps and data. I knew this was happening because my apps were malfunctioning and it deleted some apps and downloaded others. If you want better, trustworthy, reliable news don’t trust this supposedly #1 news app because it shouldn’t be an app at all!!!! Instead read your local newspapers or research about how America is only great for the rich white old men and how it continues to suppress minorities especially black lives and lgbtq people. Also research on other presidents because this one can’t even have an app work properly:/ sorry this app doesn’t work","userName":"lilhuddy🌈","date":"2020-07-09T11:02:53Z","title":"worst app ever!!! don’t recommend downloading at all!!!","isEdited":false}},{"id":"6176190349","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded the app only to heal my curiosity about this trump man.LET ME TELL YOU.   really PARANORMAL stuff started happening. 1) my TV began floating 2) my sister was possessed several times and she'd say very odd things about trumpet. I didn't give it much thought  until she shouted \"VOTE FOR TRUMP\" I quickly deleted the app and 1) my pet spinner returned from ded 2) I was accepted to every university 3) my mother got her dream job in pluto, and I'm 10 times happier. Live, laugh, love, laugh.","userName":"AVERYHONESTPERSON","date":"2020-07-09T11:02:31Z","title":"OMGAD","isEdited":false}},{"id":"6176185331","type":"user-reviews","attributes":{"rating":1,"review":"don't really care about what they say\nI'mma come back like a boomerang\nWon't let the haters get their way\nI'mma come back like a boomerang\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nI'mma come back like a boomerang\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nI'mma, I'mma come back\nThey can keep talking their talk\nBut I'mma keep walking my walk\nAnd I won't hear a sound\nYeah, they're just trying to see\nIf they can get the best of me\nWell, not this time around\nTalk to the phone\nLike they're all alone\nHide behind the screen\n'Cause they're just so mean\nBut we don't play it like that\nWe don't even fight back\nAll of the boys\nThey just brush it off\nSaying we're fake\nYeah\nNo, we're not\nTrying to throw us off track\nBut we know how to come back (hey, hey, hey)\nI don't really care about what they say\nI'mma come back like a boomerang\nWon't let the haters get their way (hey, hey, hey)\nI'mma come back like a boomerang\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nI'mma come back like a boomerang (hey, hey, hey)\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nI'mma, I'mma come back\nTry to, try to make me stop\nBut I'mma climb it to the top\nJust look how far I've gone\nBigger, better, faster, stronger\nYeah, see I ain't just a talker\nCatch me if you can, hey\nCatch us if you can, hey!\nTalk to the phone\nLike they're all alone\nHide behind the screen\n'Cause they're just so mean\nBut we don't play it like that, what?\nWe don't even fight back, uh-huh\nAll of the boys\nThey just brush it off\nSaying we're fake, yeah\nNo, we're not\nTrying to throw us off track\nBut we know how to come back\nHey, you!\nI don't really care about what they say\nI'mma come back like a boomerang, hey, hey!\nWon't let the haters get their way\nI'mma come back back back like, I'm, I'm, I'm, I'm, I'mma\nTry try to throw us off track, hey, hey, hey! I'm, I'm, I'm, I'm, I'm a, hey, hey, hey!\nWe know how to come back\nOoh, whoa\nI don't really care about what they say\nI'mma come back like a boomerang\nWon't let the haters get their way\nI'mma come back like a boomerang\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nOoh, ooh, whoa, ah\nI'mma come back, I'mma, I'mma come back\nBigger better faster stronger\nYeah, see I ain't just a talker\nCatch me if you can, hey\nCatch us if you can, hey, hey, hey, hey, hey!","userName":"im already tracer.","date":"2020-07-09T11:00:56Z","title":"my thoughts on this app","isEdited":false}},{"id":"6176181728","type":"user-reviews","attributes":{"rating":1,"review":"I HAD THE WORST EXPERIENCE EVER WITH THIS APP. NOT ONLY DID IT NOT WORK BUT AS WELL STOLE ALL OF MY PRIVATE INFROMATION. I DO NOT RECOMMEND THIS APP TO ANYONE. BE AWARE THEY WILL STEAL ALL OF YOU LR PRIVATE INFORMATION AND SEND IT TO CHINE. 😡😡😡😡😡😡 I AM A VERY ANGRY PERSON NOW","userName":"kikem veanys","date":"2020-07-09T10:59:51Z","title":"HORRIBLE","isEdited":false}}]}