{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=48880","data":[{"id":"6174062087","type":"user-reviews","attributes":{"review":"This is the worst app I’ve ever seen. It’s filled with glitches and I think it’s even going to hack my phone. It needs to be removed off the App Store IMMEDIATELY. Super unsafe and is brain washing people","title":"Wow just wow","rating":1,"date":"2020-07-08T23:11:37Z","userName":"alexcias1234","isEdited":false}},{"id":"6174061017","type":"user-reviews","attributes":{"review":"I was hopeful that this was going to be a nice app full of friendly people, But to my surprise they were all rude, racist, and homophobic. I started to get angry and it forced me to break my Caterpillar. R.I.P Tommy I will always love you","title":"Tommy the caterpillar","rating":1,"date":"2020-07-08T23:11:15Z","userName":"very concerned Karen","isEdited":false}},{"id":"6174048174","type":"user-reviews","attributes":{"review":"I opens the at and saw an orange man with blonde hair it scared the crap out of me I think his name was like trump or something like that so you need to get your crap together and fix your app","title":"No just no","rating":1,"date":"2020-07-08T23:06:21Z","userName":"every nockname is taken","isEdited":false}},{"id":"6174046895","type":"user-reviews","attributes":{"review":"So first while I was eating my pet hampster I opened the app and my hampster disappears so the app stole my dinner but then the chair I was sitting in was stolen by a horse that was robbing my house so then I had to hit the horse with my mom the horse then died of robux","title":"Um yea this app is not good","rating":1,"date":"2020-07-08T23:05:52Z","userName":"fhdbbd","isEdited":false}},{"id":"6174043264","type":"user-reviews","attributes":{"review":"It take away you money when you download the app and it is stupid app it just crashes every time you get to the app","title":"Badddddd","rating":1,"date":"2020-07-08T23:04:28Z","userName":"jbug fan","isEdited":false}},{"id":"6174040757","type":"user-reviews","attributes":{"review":"This app is not helpful and makes you want to leave and never come back to the USA because of what it is and how it looks","title":"Horrible","rating":1,"date":"2020-07-08T23:03:31Z","userName":"mocha5034","isEdited":false}},{"id":"6174038457","type":"user-reviews","attributes":{"review":"okay so when i open the app, there's a gross pic of bunker boy with his cheeto hair. i threw up and puked all over my clean couch. then theres these paragraphs about how much he hates black people, and being awfully racist. he is showing children that its okay to be hateful? its okay to make people feel bad about their race? if i could give it zero stars, i would.","title":"why. whats the point of this.","rating":1,"date":"2020-07-08T23:02:39Z","userName":"v c xgefsgtjbm v","isEdited":false}},{"id":"6174033692","type":"user-reviews","attributes":{"review":"And shoes they were not being loyal and there where ugly pics of Donald Orange duck ow I mean are stupid President Donald trump I saw a vid of a man tanning it’s self it was so mean and trump smells like dirty knuckles with raw fish","title":"I opened the app to it saying I want to still your Fridge microwave","rating":1,"date":"2020-07-08T23:00:53Z","userName":"evarhonadelaire","isEdited":false}},{"id":"6174024283","type":"user-reviews","attributes":{"review":"I downloaded this app to pay my respects for cheeto man but quickly realized that there shouldn’t be an app for cheeto man if cheeto man is dead! Also this app fed my dog my apple slices, how unbelievably rude! I do believe cheeto man is enjoying not being alive.","title":"R.I.P Cheeto Man","rating":1,"date":"2020-07-08T22:57:21Z","userName":"fiu🤔🤔🤔","isEdited":false}},{"id":"6174018854","type":"user-reviews","attributes":{"review":"This app is ridiculous. Not only is the news bias but this app makes my phone glitch. Way too many notifications have been sent. TERRIBLE! NASTY!","title":"Nasty","rating":1,"date":"2020-07-08T22:55:19Z","userName":"zeldastarry","isEdited":false}}]}