{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38010","data":[{"id":"6173568195","type":"user-reviews","attributes":{"rating":1,"userName":"CoochieLips3000","review":"Exported all my data, pictures and IP address to some place in the UK. Also, it flying scissor kicked my grandmother in the throat. The worst part about this is that I can’t take legal pursuit against a non-physical physical app.","date":"2020-07-08T20:09:17Z","title":"Worst app I’ve ever had on my phone","isEdited":false}},{"id":"6173552694","type":"user-reviews","attributes":{"rating":1,"userName":"Mr. bigboypants","review":"The taste of this app on the contents does not apply to my taste buds therefore        un-immaculate. The quality of of this dish I’d like if I’m at the beach with a orangutan but the orangutan is making unjustly decisions therefore needs to be put down. And put the remains scattered across the zoo where it belongs.","date":"2020-07-08T20:04:03Z","title":"Bored","isEdited":false}},{"id":"6173552461","type":"user-reviews","attributes":{"rating":1,"userName":"adeline_999","review":"this app is just bad in a multitude of ways. the apps lags and crashes AT LEAST 50% of the time i’m on. poor programming, poor delivery, and poor development. try better.","date":"2020-07-08T20:03:59Z","title":"couldn’t stand this process","isEdited":false}},{"id":"6173533654","type":"user-reviews","attributes":{"rating":1,"userName":"i crossed","review":"This is horrible takes forever to download. And once it is all that it shows is a Cheeto  with corn for hair. And then my phone got a whole lot of racism, sexism, and all that bad stuff now it is a virus do not get this app.","date":"2020-07-08T19:57:38Z","title":"Do not download","isEdited":false}},{"id":"6173528099","type":"user-reviews","attributes":{"rating":1,"userName":"genz rules the world173","review":"Don’t do it, it made my phone glitchy and I had to delete it immediately plus it is filled with racist and sexist people who think they are better than everyone.","date":"2020-07-08T19:55:44Z","title":"Terrible app","isEdited":false}},{"id":"6173524375","type":"user-reviews","attributes":{"rating":1,"userName":"Trump's Mothet","review":"This joke of an app made my phone crash and thus left me having to pay $200 to fix it. After I tried so hard to restart my phone that it got stuck in a boot loop! Thanks a lot Donald!! 🤬🤬🤬🤬🤬🤬","date":"2020-07-08T19:54:27Z","title":"-10/10 DO NOT RECOMMEND","isEdited":false}},{"id":"6173521848","type":"user-reviews","attributes":{"rating":1,"userName":"angry user>:(","review":"I downloaded this app and my phone started glitching and lagging really bad and now it’s overheating too. This app is horrible and shouldn’t be on anything until they fix it.","date":"2020-07-08T19:53:30Z","title":"Messed up my phone","isEdited":false}},{"id":"6173506468","type":"user-reviews","attributes":{"rating":1,"userName":"Sofia163715","review":"Horrible I can not say anything good about this app it glitches and it very delayed and don’t even get me started on how long it took to download (3days ) I was sooooo disapointed","date":"2020-07-08T19:48:15Z","title":"Glitches and takes forever to download","isEdited":false}},{"id":"6173505308","type":"user-reviews","attributes":{"rating":1,"userName":"PRETTYGALWHOISANONYMOUS","review":"The graphics are just horrid! It makes me barf!! I can’t even stomach scrolling. This app is the worst, annoying, and incredibly hard to use. It’s super difficult to learn how to use it. Too many ✨steps✨. PLEASE DELETE APP, this app is disgusting.","date":"2020-07-08T19:47:51Z","title":"HORRIBLE","isEdited":false}},{"id":"6173497761","type":"user-reviews","attributes":{"rating":1,"userName":"monicaesq12","review":"I downloaded the app and I have to admit it was TERRIBLE, all about it wasn’t right and this app is obviously for the uneducated. I hope people’s education can improve and don’t download an app like this. \n\nThank you for your understanding.","date":"2020-07-08T19:45:16Z","title":"Worst app EVER","isEdited":false}}]}