{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36930","data":[{"id":"6178261582","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:12:57Z","title":"Worst app I’ve ever downloaded","rating":1,"review":"As an independent, I find this app extremely repulsive. The wording is intentionally misleading and infers false information about the election. Do not download if you are looking for campaign information!! Please refer to unbiased news outlets such as politico or NPR.","userName":"HMBell"}},{"id":"6178252551","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:09:44Z","title":"I hate Donald trump","rating":1,"review":"Reason why I gave it one star is because Donald Trump a disgrace to the world is deleting TikTok so I decided to do something about it and gave it one star so the App will go away and we will need to get a new president cause he need to go bye-bye","userName":"ppoooooiiopoojfjfj"}},{"id":"6178246519","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T21:07:32Z","title":"Terrible","rating":1,"review":"Once the app was download weird stuff kept happening to my phone. Every time I opened the app it would go to a black screen and close the app. Couldn’t even get to use it. ONE STAR FOR THAT","userName":"jqnct"}},{"id":"6178172088","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T20:41:15Z","title":"Worst app ever","rating":1,"review":"I am honestly so disappointed by this app. I got it looking for more information about Trump’s campaign but the app repeatedly made my phone crash or just froze. The app flat-out doesn’t work.","userName":"SkyBlueMango"}},{"id":"6178168287","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T20:39:57Z","title":"DO NOT DOWNLOAD","rating":1,"review":"Hi! I downloaded this app in order to support trump and the entire app and my life began to glitch. I began having racist and homophobic views and willing disregarding everyone’s need of basic human rights. I don’t recommend if you would like to keep your sanity.","userName":"Kimtay1322"}},{"id":"6178167011","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T20:39:30Z","title":"bad","rating":1,"review":"So at first i was really enjoying this app, it was working fine and all until a picture of trumps face popped up and made the whole app crash. He messed up the app as he did with America 🤷🏻‍♀️","userName":"Lillyisok"}},{"id":"6178159593","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T20:36:56Z","title":"terrible app","rating":1,"review":"I got this app to see what was going on but the moment I opened it, it started to make my phone crash. Now on any app i’m on it crashes. 😳Terrible app it should be taken down.","userName":"aareebean"}},{"id":"6178159232","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T20:36:49Z","title":"THIS APP STEALS YOUR REFRIGERATOR!!","rating":1,"review":"ATTENTION DO NOT GET THIS APP! IF YOU GET IT YOU WILL COME HOME AND YOUR REFRIGERATOR WILL BE STOLEN WHEN YOU LEAST EXPECT IT! i’ve seen some reviews saying they steal refrigerators. i disregarded this information, thinking i was safe. turns out trump personally looks for your house address via this app and STEALS YOUR REFRIGERATOR! no one is safe! don’t download!","userName":"Pinsanneedles123"}},{"id":"6178141936","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T20:30:55Z","title":"Straight garbage","rating":1,"review":"I downloaded this app to try to keep up to date with information and it crashed repeatedly when I tried to use it. This does not deserve to exist.","userName":"gb151923"}},{"id":"6178130587","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T20:27:07Z","title":"Terrible","rating":1,"review":"This app kicked me out constantly while using it. My phone started glitching since this app was installed and it takes tremendous amount of space. It’ll harm your phone.","userName":"elyrodrgz"}}]}