{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23260","data":[{"id":"6174783572","type":"user-reviews","attributes":{"title":"SOFIA THE FIRST","userName":"Oompa Loomp the first","date":"2020-07-09T03:02:21Z","review":"I woke up today and my dog had turned into a cat and the cat scratched my face and then my brothers arm stated creaking. Then the app opened I saw an Oompa Loompa but then I realized it was just the awful president so I closed the app and deleted it but then my cat dog ate my brothers arm off so we had to go to the store and buy a new one but the store was soled out so now my brother is armless.","rating":1,"isEdited":false}},{"id":"6174778029","type":"user-reviews","attributes":{"title":"Horrible App","userName":"pmatpemdas","date":"2020-07-09T03:00:39Z","review":"I downloaded this app with hopes of rewarding myself where I very well received the opposite. Almost like the app was working against me and trying to make my entire life turn upside down. Please do yourself a favor and rate this app as 1 star so we can remove it from the Apple Store and save others!","rating":1,"isEdited":false}},{"id":"6174733617","type":"user-reviews","attributes":{"title":"disappointed 😔","userName":"ezags","date":"2020-07-09T02:47:07Z","review":"when I opened the app, I was asked if I would like notifications. How dare they?! No, I would not like notifications about how our Cheeto of a president is going to ruin our country. I will always remember the Cheeto man but this app needs a lot of improvements. Very disappointed. Do better.","rating":1,"isEdited":false}},{"id":"6174723668","type":"user-reviews","attributes":{"title":"!DONT DOWNLOAD!","userName":"AlondraG24","date":"2020-07-09T02:44:08Z","review":"As soon as i downloaded it i kept getting messages and notifications ALL day! Almost around 50 notifications in an hour. I also realized that my phone started slowing down and getting glitches...right after I downloaded this app! It’s aggravating how misleading and terrible this app is!!! DONT DOWNLOAD.","rating":1,"isEdited":false}},{"id":"6174717422","type":"user-reviews","attributes":{"title":"Bro literally attacked my kid","userName":"buntedbaby","date":"2020-07-09T02:42:13Z","review":"this app is so scary, literally bunted my baby across the room when i opened it. not worth the sweat nor time of waiting the few seconds to download. opened the app they wanted me to make an account heck no. Anyways my baby suffered severe trauma from seeing the weird orange guy on the front. don’t download end of discussion.","rating":1,"isEdited":false}},{"id":"6174696586","type":"user-reviews","attributes":{"title":"WORST APP EVER","userName":"kfodneosnfkf","date":"2020-07-09T02:35:57Z","review":"this app gave me so much fake news on what’s going on and also i just don’t like like the app in general i’m tired of seeing this weird cheeto looking figure idk if it’s a glitch but it’s nasty and ugly also it left the same cheeto figure but naked on my wallpaper and i was scared and so were my family members so please remove the app","rating":1,"isEdited":false}},{"id":"6174694676","type":"user-reviews","attributes":{"title":"Awful","userName":"hsshkjcdthnvdeyijgf","date":"2020-07-09T02:35:22Z","review":"I can’t believe this app was actually created! It’s not easy to figure out and I can’t stand the sight of that much orange on the screen. Right when I clicked on the app, I wanted to throw my phone out the window. I don’t want to see a pedo on my screen ever again!!!!! Horrible app and deserves to be deleted.","rating":1,"isEdited":false}},{"id":"6174689922","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","userName":"anonymous38562","date":"2020-07-09T02:33:57Z","review":"Worst app I have EVER used. Full of glitches much like this “president’s” campaign. 10/10 do not recommend. Use your time and data to download useful, reliable apps to give you full coverage of the 2020 election. If I could give this app lower than 1 star I would. Made me want to die and I almost lost my faith in humanity.","rating":1,"isEdited":false}},{"id":"6174686128","type":"user-reviews","attributes":{"title":"Disappointed","userName":"Nishatrafa","date":"2020-07-09T02:32:48Z","review":"As soon as I opened the app, I got a notification that said the app could sense that I was brown. I continually got notifications stating that I either delete the app or get deported. Honestly, this was so unexpected and I thought better of our great leader. If I could give this app less than one star I would.","rating":1,"isEdited":false}},{"id":"6174673912","type":"user-reviews","attributes":{"title":"SO MUCH GLITCHING","userName":"Coconut320.gt","date":"2020-07-09T02:29:12Z","review":"my phone was working so well before i downloaded this app! now it won’t stop glitching and randomly turning off my phone battery now goes from 100 to 0 in an hour! this is ridiculous. DO NOT DOWNLOAD. also who ever downloads this app after reading this will die in 2 days and go to hell so don’t. love u🧚🏻🧚🏻🧚🏻","rating":1,"isEdited":false}}]}