{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=17500","data":[{"id":"6174285798","type":"user-reviews","attributes":{"isEdited":false,"title":"No bueno...","rating":1,"review":"So my name is Paul Ese Brewtality and when i got the app all i saw was a big Cheeto man working out on the whole app!!! Then on everything else including my wallpaper was FILLED with the Cheeto man. And all i could see to say for the rest of the day was “Trump 2020” like who tf is that??? I went to reserve some tickets and bag some merch for the Cheeto man but dang... i forgot to water the driveway. Anyways Stan Nicki for clear skin and Trump 2020... but on a gravestone :) <3","date":"2020-07-09T00:32:56Z","userName":"Paul Ese Brewtality"}},{"id":"6174281949","type":"user-reviews","attributes":{"isEdited":false,"title":"This is Horrible.","rating":1,"review":"When I downloaded this app it ruined my phone . It got viruses and it made my battery go straight to 2%. Also a scary Naked Tan person picture was on it. Every time I try downloading it There’s always an inappropriate picture or something that scares me on it. Also there were DEATH threats in one of the paragraphs. This app will forever be the worst app. Death Threats are NOT OKAY! 😭😭😡😡❌❌❌❌❌❌❌","date":"2020-07-09T00:31:39Z","userName":"𝚋𝚞𝚓𝚢𝚎𝚜"}},{"id":"6174278684","type":"user-reviews","attributes":{"isEdited":false,"title":"Think this is HUGE? The best really? BIG MISTAKE!","rating":1,"review":"I usually don’t write reviews but this is just so awful I had to speak up . The audacity that is the Apple App Store is beeeyyyyyooooonnndd me . When opening the app the T in the middle spins .. I get dizzy easily . We were off to a bad start . Then the horrible .. the disgusting .. the tragedy that is cheetoh tan Trump popped up . 🤮 At least warn against graphic images . I mean come on .","date":"2020-07-09T00:30:33Z","userName":"Smileyouroncamera"}},{"id":"6174278215","type":"user-reviews","attributes":{"isEdited":false,"title":"Absolutely ✨not✨","rating":1,"review":"This app is very weird because it shows a picture of a rap1st, who also is very very racist, so racist that a certain group (👀) bows down to him as if he is God which makes me feel like I’m in some sort of cult based off of systemic oppression and only gives opportunities to the top 1%... oh wait👁👄👁(eat the rich). Not to mention the man is very ugly and probably smells like a basement floor","date":"2020-07-09T00:30:24Z","userName":"karen🗣"}},{"id":"6174265449","type":"user-reviews","attributes":{"isEdited":false,"title":"sis this just AINT IT","rating":1,"review":"I was HORRIFIED with what I saw on this app. A few days after I downloaded it my computer started randomly showing me clips of naked cheetos and t-t-TRUMP. I AM TRAUMATIZED. Then, soon after that.... MY TV STARTED PLAYING “Trump sings like a tomato 🍅👁👄👁🍅” it was truly horrific. And to make all matters worse, this app is just terrible and has “Trump” in it which just makes it automatically horrible. Thank you for your time. 🤡🤡🤡🤡🤡🤡🤡","date":"2020-07-09T00:25:50Z","userName":"urhotcheetomom"}},{"id":"6174264465","type":"user-reviews","attributes":{"isEdited":false,"title":"DO NOT DOWNLOAD","rating":1,"review":"First of all it took 10 hrs just to download (not fake news). Second of all I almost died of a heart attack because I have an irrational fear of Cheetos and that was the first thing to pop up. Still have ptsd from that. I just wanted to download the app to support my lord leader of this great nation but instead it resulted in ptsd from a Cheeto popping up right when the app was opened. VERY disappointing!","date":"2020-07-09T00:25:28Z","userName":"mackie.42000"}},{"id":"6174255004","type":"user-reviews","attributes":{"isEdited":false,"title":"horrible and life threatening","rating":1,"review":"when i opened the app i saw a terrifying picture of the dude’s SAGGING double chin🤚🏼 like isn’t he rich or something???? can’t he like get it fixed ??? CHILE anywayssss and then i saw his clenched fist which i KNOW for a fact are cold and crusty 😖. i felt very very threatened by the fist, not that it looks scary but the fact that the people who handshake that filthy hand are walking around this earth. horrible.","date":"2020-07-09T00:22:12Z","userName":"mattybraps👁👅👁"}},{"id":"6174233238","type":"user-reviews","attributes":{"isEdited":false,"title":"terrible!!!!","rating":1,"review":"completely unreliable source. why would you want an app that supports a narcissist that is ungrateful about it’s people and stubborn?? this little orange president got his little feelings hurt over an app tiktok? that actually has brought a lot of people together? sounds a bit sus to me, anywho, ACAB ! BLM ! the tiktok army will stay strong! if tiktok gets banned get a vpn or download byte, we will make it work. GENZ IS TOO POWERFUL FOR DIS WORLD, WE ARE THE CHANGE. WE ARE BADA*S!!!!","date":"2020-07-09T00:14:35Z","userName":"Lola (B)"}},{"id":"6174221164","type":"user-reviews","attributes":{"isEdited":false,"title":"VERY BAD APP","rating":1,"review":"I got this app to praise our spray tan king. But when I got it and opened the app, it started to yell “hola nino” numerous times. And the thing is I amd NOT bilingual, so this app was very insulting to my kind. Then the telling stoped. THEN, get this, spray tan king came to my house and stole my parents and ran over them😔. It’s okay tho because he gave us $100 after that and said “trump 2020”. I WOULD NOT RECOMMEND THIS APP. Take it down now. Thank you 🕸🦟🦞","date":"2020-07-09T00:10:05Z","userName":"nortalagoski"}},{"id":"6174218053","type":"user-reviews","attributes":{"isEdited":false,"title":"Absolutely appalled!","rating":1,"review":"Upon downloading this app I was met with a devilish elf that stole everything that I owned! He told me that for this damning sin I deserved nothing more than the dirt below my feet! I was forced to attempt to decipher his riddle which eventually lead to no more than the death of myself along with everyone I love! I absolutely regret downloading this monstrosity of an app and it has completely ruined my life! Do NOT download!!!!!","date":"2020-07-09T00:08:58Z","userName":"robotkin69696969"}}]}