{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=17760","data":[{"id":"6174970529","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"This app ruined my phone and my life!!!!","review":"The virus I got from this app is more contagious than COVID-19 not only did it try and delete all my info they stole my debit and credit card info and drained my account of all  funds ( which is a lot since I make well over 7 figures), I have not seen a worse app in my life it forced to buy new phones for me and my 17 kids🧚‍♂️✨🧚✨🧚✨🧚✨🧚✨🧚✨🧚✨🧚‍♂️✨🧚‍♂️","date":"2020-07-09T03:58:14Z","userName":"6 eyrie"}},{"id":"6174963891","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Annoying glitches!!!","review":"This app has so many bugs and glitches and sometimes lags so hard my whole phone screen freezes. I literally had to reboot my phone and it still kept lagging. I had to delete the app so it wouldn’t crash my entire system. Not the quality I expect from MY president! Disappointed.","date":"2020-07-09T03:56:09Z","userName":"luke_h05"}},{"id":"6174946633","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"DONT DOWNLOAD❗️❗️❗️❗️❗️❗️","review":"ABSOLUTELY DISGUSTING. after using this app i no longer support trump and his maggots. when i opened the app i was greeted with a “hello monkey n*gg*r if you don’t support donald j trump we will send someone to hang you and rule it as a suicide.” i also realized that when i downloaded this app i started to lose my gorilla grip puss puss and i can’t help but think these two are related. 10/10 would NOT recommend this app or supporting tr*mp","date":"2020-07-09T03:50:47Z","userName":"eugvbkjfxcsd"}},{"id":"6174925190","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"ABSOLUTELY AWFUL","review":"Immediately regretted downloading this app (I almost puked). My mom and my dad were furious after discovering the app on my phone. This app DESTROYS LIVES AND ERASES BRAINCELLS. You might think I’m being dramatic, but I am simply expressing my contempt in a colorful way. My words are written to portray my hatred for this AWFUL APP. I should be paid to make up for the atrocities committed, but I will settle with having this app TAKEN DOWN. \n\nNOT EPIC AT ALL - 0 / 10 STARS","date":"2020-07-09T03:44:10Z","userName":"wolfie7877"}},{"id":"6174921298","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"this app cut off my right hand","review":"It is a dark time for the Rebellion. Although the Death Star has been destroyed, Imperial troops have driven the Rebel forces from their hidden base and pursued them across the galaxy.\n\nEvading the dreaded Imperial Starfleet, a group of freedom fighters led by Luke Skywalker has established a new secret base on the remote ice world of Hoth.\n\nThe evil lord Darth Vader, obsessed with finding young Skywalker, has dispatched thousands of remote probes into the far reaches of space….","date":"2020-07-09T03:42:58Z","userName":"addi broadfoot"}},{"id":"6174918423","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Disgusting","review":"This is terrible. It’s set up terrible. The person behind it is terrible. Please, for all things holy, delete this off the store to help us all. It’s despicable and I feel bad that people even have to see this. If I could give this negative stars I would, even a zero. But since I can’t, read my 1 star as absolutely nothing. That’s what this is worth","date":"2020-07-09T03:42:08Z","userName":"NothankyouTrumpets"}},{"id":"6174918385","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Disgusting","review":"Downloaded the app and it immediately scanned my face and declared me Mexican, which I am, however it locked me out of the app and threatened me with a wall. I tried to delete and re download, this time with my white friend and it let her use it!!!!😡 This need to be fixed immediately I do not want to have to depend on my friend to use this horrible disgusting trash of an app.","date":"2020-07-09T03:42:07Z","userName":"Hey619"}},{"id":"6174896388","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Awful and full of fake news, racist comments, and untrue statements","review":"Wow. I downloaded this app in hopes of learning about Trumps platform and his views, but it’s all lies, I’ve looked up the facts and articles in the app and everywhere else I look they say it’s false. Donald Trump is also very racist, sexist, and narcissistic. If you are going to get this app, get it only to give it a bad rating and then delete the app.","date":"2020-07-09T03:35:35Z","userName":"republican2648"}},{"id":"6174876825","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"worst app!!","review":"Right after I downloaded this app my mom texted me saying our grandma was in the hospital in critical condition. A few days later I deleted this app and my grandma made a full recovery. I decided to download it again and my dog passed out right in front of me and died a few hours later. Every time I download the app something awful happens. Do not recommend.","date":"2020-07-09T03:29:52Z","userName":"juliana jj"}},{"id":"6174868433","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"false advertising","review":"when I first downloaded this app I thought I was going to get great unbiased informative information on Donald Trump but instead I got cynical remarks about other candidates and their political stand and overall the agendas pushed were just not fair and obviously for his cult followers to trash other candidates but not hold there own accountable for the things he has done","date":"2020-07-09T03:27:26Z","userName":"Cle Evans"}}]}