{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=41540","data":[{"id":"6173522247","type":"user-reviews","attributes":{"date":"2020-07-08T19:53:38Z","title":"DONT DOWNLOAD THIS APP🍊","isEdited":false,"userName":"Yaboi.Brain","review":"I was on this app and it’s doesn’t work it just takes me to a lot trash. I download it again it still trash but with an orange with it 🍊and a male with a brown wig . I’m fairly disappointed in Apple for putting this nonsense on the App Store.","rating":1}},{"id":"6173512851","type":"user-reviews","attributes":{"date":"2020-07-08T19:50:25Z","title":"Please delete this app.","isEdited":false,"userName":"smell my tiny feet😻😻","review":"I tried downloading it took like almost 2 hours to download, but when I tried voting it said “Biden 2020”, then I saw a big orange! I suggested you guys to delete this app, and never get it it’s so bad.","rating":1}},{"id":"6173510559","type":"user-reviews","attributes":{"date":"2020-07-08T19:49:38Z","title":"Disgusting","isEdited":false,"userName":"\"snowflake\"","review":"This app literally hacked my phone!!!! Every time I open the app the Russian National Anthem begins playing and a big burly redneck calls my phone. I don’t understand how this app even does such a thing! Do not download","rating":1}},{"id":"6173509590","type":"user-reviews","attributes":{"date":"2020-07-08T19:49:19Z","title":"Scarred for life","isEdited":false,"userName":"prickly_bitch","review":"This app took  MONTHS to download even though my wifi is great and when it did download it glitched very badly and an orange man showed up on my screen which i have ptsd from and my therapy appointment it tomorrow DO NOT DOWNLOAD I HAVE NOT STOPPED CRYING BC OF THE ORANGE MAN WHO LOOKS LIKE HE WANTS TO GIVE YOU A KISS, HE WILL EAT YOU HE WILL NOT GIVE YOU A KISS","rating":1}},{"id":"6173507425","type":"user-reviews","attributes":{"date":"2020-07-08T19:48:35Z","title":"DO NOT DOWNLOAD","isEdited":false,"userName":"mkpoe","review":"this app is so bad, it took almost three hours to download, it’s constantly crashing and has so many bugs in it. i don’t recommend!!! this app should be taken down it’s the worst","rating":1}},{"id":"6173497603","type":"user-reviews","attributes":{"date":"2020-07-08T19:45:13Z","title":"horrible","isEdited":false,"userName":"gracie85456","review":"after i downloaded this app (which it took multiple days to download) it started saying weird things like “i know where you live” and “make sure you know where your family is” after days of this happening my whole family went missing and we found them dead 5 days after they went missing","rating":1}},{"id":"6173491539","type":"user-reviews","attributes":{"date":"2020-07-08T19:43:10Z","title":"Disgusting","isEdited":false,"userName":"iakwkss","review":"This app is horrible took about a month to download gave me a virus and kept on kicking me out!! Like what the hell?!?! It also attracted so many snakes like eww the app also just looked disgusting and ugly!!! I hate this app so so so much!!!!!","rating":1}},{"id":"6173474424","type":"user-reviews","attributes":{"date":"2020-07-08T19:37:16Z","title":"Horrible App","isEdited":false,"userName":"Fellow conservative👍","review":"I wanted to support my president so I got this app but it took a whole day to download. When it finally downloaded it automatically changed my wallpaper to trump getting penetrated. I was so horrified and have to go to therapy now. PLEASE DON’T DOWNLOAD WILL CAUSE TRAUMA!!!!","rating":1}},{"id":"6173472992","type":"user-reviews","attributes":{"date":"2020-07-08T19:36:46Z","title":"👎","isEdited":false,"userName":"tictoktoldmeto","review":"This is the absolute worst app I have ever used in my entire life. I do not recommend this app. There are glitches throughout the app and loads slow. The news on this app is outdated and untrue in most situations.","rating":1}},{"id":"6173466063","type":"user-reviews","attributes":{"date":"2020-07-08T19:34:21Z","title":"Just a waste of space","isEdited":false,"userName":"Rosie00003","review":"Honestly I had little to no expectations for this app. But once I opened it I felt an overwhelming sense of disappointment. My children can’t play on it. It should be removed.","rating":1}}]}