{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42530","data":[{"id":"6177804345","type":"user-reviews","attributes":{"title":"Horrible terrible app","isEdited":false,"date":"2020-07-09T18:42:07Z","review":"I got this app and it was really bad. It jump scared me at first when this orange Cheeto puff popped up on the screen and then erased everything off my phone. It made me want to take a bath with a toaster, WOULDN’T RECOMMEND","userName":"It's Brittany 💅","rating":1}},{"id":"6177799162","type":"user-reviews","attributes":{"title":"Take the app down","isEdited":false,"date":"2020-07-09T18:40:34Z","review":"I was waiting to support our “orange”man till I downloaded this app and I had to wait two whole week for this stupid app to download it was a waste of my time","userName":"sddjd ah","rating":1}},{"id":"6177775842","type":"user-reviews","attributes":{"title":"Nooo","isEdited":false,"date":"2020-07-09T18:33:28Z","review":"I tried do get in the app but it didn’t work, it kept crashing. I tried deleting it and getting it again but it still didn’t work. I hate this app.","userName":"Abdiel Eias","rating":1}},{"id":"6177771974","type":"user-reviews","attributes":{"title":"Terrible","isEdited":false,"date":"2020-07-09T18:32:20Z","review":"This app is terrible. I didn’t even use the app but supporting Trump and his campaign means you support the following: homophobia, racism, sexism, xenophobia (MUST I CONTINUE??). He’s a terrible president and definitely doesn’t deserve to stay in office.","userName":"osir11","rating":1}},{"id":"6177752219","type":"user-reviews","attributes":{"title":"No good","isEdited":false,"date":"2020-07-09T18:26:23Z","review":"This app is the worst I clicked on it and it took me back to my home screen 3 times! I didn’t even get to see how terrible this app was which is very disappointing.","userName":"zozzozoozozozozoz","rating":1}},{"id":"6177738456","type":"user-reviews","attributes":{"title":"no","isEdited":false,"date":"2020-07-09T18:22:13Z","review":"I opened the app to see a Cheeto on my screen I look over and my m and m’s started doing renegade this app is making my candy DANCE GET THIS APP OUTTA HERE also this roach just climbed up the wall looking like the Cheeto I saw on my screen","userName":"Magnumpihot","rating":1}},{"id":"6177722489","type":"user-reviews","attributes":{"title":"Terrible","isEdited":false,"date":"2020-07-09T18:17:26Z","review":"This app was just absolutely awful, I tried downloading it and it just crashed my phone. There’s absolutely nothing good coming out of this app.","userName":"12221j","rating":1}},{"id":"6177709629","type":"user-reviews","attributes":{"title":"Sparkles","isEdited":false,"date":"2020-07-09T18:13:35Z","review":"So I actually got the app and it worked for like 3 days and now it’s acting up and my phone shuts off every time I try to open it so I deleted it .","userName":"Wassupppp love it btw","rating":1}},{"id":"6177709386","type":"user-reviews","attributes":{"title":"Why trump is bad","isEdited":false,"date":"2020-07-09T18:13:31Z","review":"He tells ppl to drink bleach for corona. He says he will take away funds from from schools if we go back and the numbers keep going up anyway and he don’t ever care","userName":"libdjjs","rating":1}},{"id":"6177694772","type":"user-reviews","attributes":{"title":"constant diarrhea","isEdited":false,"date":"2020-07-09T18:09:07Z","review":"I downloaded this app to see what Trump has in mind while I was on the toilet. while on the app, it cause me to have explosive and constant diarrhea. it was so powerful, I had to get my butthole stitched closed. 🚽💩","userName":"Keni F.","rating":1}}]}