{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8490","data":[{"id":"6175496140","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T07:07:19Z","isEdited":false,"userName":"saint laurant","review":"I got the app on Monday and it didn’t load up until today and just to open it and see a big orange on front screen this is not right I was horrified this app should not be allowed for download with such a scary thing on the front page at-lest put something blue this app also had corn on the front page for some odd reason this app is just worthless don’t spend your time and space trying to get this app running I’m shaking my head with anger😡😡😡","title":"This app is trash"}},{"id":"6175435686","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T06:43:25Z","isEdited":false,"userName":"Alizay88","review":"This app took FOREVER to download. It took 10 hours to download and I’ve NEVER had to wait 10 HOURS for an app to download into my phone. Not only did it take forever once it was downloaded it was EXTREMELY SLOW!!! The app definitely had a TERRIBLE effect on my phone knowing once it was downloaded my phone was acting slower than it ever has! The app never worked and it had an awful affect on my phone and the app itself had many bugs!! I DO NOT recommend this app to ANYONE!","title":"HORRIBLE APP!!!😡"}},{"id":"6175303795","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T05:52:42Z","isEdited":false,"userName":"SoSadAmerica","review":"This is that app that he actually refers to when he says “fake news!” From “winning” to “hundreds, millions of people tell me I’m up in the polls.” This app represents an incompetent, delusional, inhumane being. From thinking science can be subjective and a matter of political opinion to not caring at all for his people. This app as well as the person behind it are dangerous and certainly a virus to you and your phone. Deserves negative stars for it doesn’t deserve to represent the stars on our flag.","title":"FAKE NEWS!!! Deserves to be deleted!!!"}},{"id":"6175286947","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T05:46:00Z","isEdited":false,"userName":"gabyyyyyyyyyy:)","review":"i was like that was a cute little girl with her hair cut and her bangs are too much for me too omg yess yess is a time of a avacado day to be happy and i is a great time for me and i was like that one time we had to get it back from a little while and it wasn’t a bad thing to say it is so weird to have a little time with it but it is so much better and it was like that i is a little hard for us but it is a little too big and it was like that we just went and had to him. I COULD KEEP WRITING BUT I HAVE TO GO WALK MY PET ELEPHANT.","title":"WORST APP EVER!!!!"}},{"id":"6175208976","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T05:16:29Z","isEdited":false,"userName":"orange you glad im back","review":"This app is so awful I would have to force my fingers to give more than 1 star. It doesn’t even deserve that. It’s so horrible it makes me wish I callus go to school for working in technology so that I could delete the app completely. This app makes me want to vomit because I don’t like oranges. His wrinkly face makes me actually want to get Botox when I’m older and I hate needles. In conclusion do not download this app you will throw up. And it’s a waste of space.","title":"Worst thing I’ve ever downloaded"}},{"id":"6175126292","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T04:47:47Z","isEdited":false,"userName":"Ismael lyke Dek","review":"First off as soon as I downloaded the app it got super slow and after one minute It started to get a little glitchy then after around three minutes it got really hot and then shut off I had to take it to Walmart to see if they could repair it. So, so disappointed after that I gave it another chance I went on the app once again and realized everything I read on there was the most terrible dumb advise anyone could ever read.","title":"The absolute worst!"}},{"id":"6174976149","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T04:00:04Z","isEdited":false,"userName":"Xxloser._.forlifxX","review":"This app is terrible. As soon as I downloaded this app my phone started acting up, it started glitching and taking forever to download text messages, photos, pages, etc. My phone would just shut off at random and I’d get notifications from people in Russia and Syria. I got worried that my phone could be easily hacked and my information could get sold. So I decided to delete this app. This app is terrible! Don’t download it! My phone hasn’t acted the same since!","title":"Trump 2020 app"}},{"id":"6174967660","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:57:21Z","isEdited":false,"userName":"lnogeuhegki","review":"I got a good job today and I got to get my car back in the morning and I got a couple things I got a little extra extra to do a good day today so I’m coming to my phone and then coming home yyI yeti got me some stuff for you to come back to the office I got a little bit extra to do that and I got my phone back and I got my car I had my phone and got my phone back to my phone back in a phone and got it I had it for a phone phone I was in my phone back to phone I had","title":"I"}},{"id":"6174963219","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:55:56Z","isEdited":false,"userName":"alice-gray","review":"Soon as I download the app and opened it, you could immediately tell all the bugs and issues, it started to glitch the very second I opened it and to make matters worse it glitched my entire phone!!!! Probs gave me brain damage. Could I file for compensation from the ptsd i got from seeing my phone go exorcist mode? It all went down hill just like it did after the 2016 elections, just one big dive, head first, into rock bottom. A terrible shame really","title":"Immediately Crashed"}},{"id":"6174922674","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:43:23Z","isEdited":false,"userName":"Fivestar123","review":"This app has no business being available on the App Store. I have had nothing but problems with this app. \nTo begin with, the app has poor quality images and content. The app often glitches and is unresponsive while I am trying to use it \nThere is a lot of racism and hate speech happening on this app and it is not suitable for any audience to view. The words and content is horrific and is offensive to so many viewers. \nNeeds to be deleted immediately","title":"A disgrace to the App Store"}}]}