{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37160","data":[{"id":"6174906361","type":"user-reviews","attributes":{"date":"2020-07-09T03:38:30Z","rating":1,"title":"Horrible app to use it’s disgustingly stupid and not a good app","userName":"gesele11","review":"This is a freaking horrible app who decided on making this horrible thing what is this when I saw it I almost threw up its crazy and not a very good app to use","isEdited":false}},{"id":"6174894965","type":"user-reviews","attributes":{"date":"2020-07-09T03:35:08Z","rating":1,"title":"Worst thing ever","userName":"this is long Ftrump","review":"I was trying to use the app so I went to the Samsung store and asked for a refund. But they said they can only give out chickens. So then I rode my pet ant to Europe and then they told me how Gen Z won I was like true dat! So I swam back and deleted the app","isEdited":false}},{"id":"6174889918","type":"user-reviews","attributes":{"date":"2020-07-09T03:33:40Z","rating":1,"title":"my wallpaper is the cheetos schmeat and i can’t change it","userName":"cat_pillow_","review":"the second i opened the app, it started glitching crazy and my phone started going off. this creepy photo with bunker boys dingdong became my wallpaper and i couldn’t change it 😭😭 my pet ferret went nuts after seeing my phone flashing and he bit me. now i have a broken phone with trumpies eenie teeny weenie as my wallpaper and a medical bill for a ferret bite 😭 0/10 recommend this trash app.","isEdited":false}},{"id":"6174887255","type":"user-reviews","attributes":{"date":"2020-07-09T03:32:52Z","rating":1,"title":"God awful loading screen","userName":"DTBGCDY","review":"I tried to enjoy it, I really did, but the quality, the glitching, I hated it! Genuinely hated it. Plus who chose that weird picture of the orange guy in the first slide? Made me physically nauseated. Anyways yea I do not recommend whatsoever.","isEdited":false}},{"id":"6174885550","type":"user-reviews","attributes":{"date":"2020-07-09T03:32:22Z","rating":1,"title":"TERRIBLE. I LOST MY PARENTS","userName":"Saccarii","review":"Worst app ever. i opened it and all the sudden items in my house kept getting replaced with stainless steel earring backs. I DONT HAVE MY EARS PIERCED. AND THEN I KEEP LOSING THEM.  also if anyone sees my parents PLEASE contact me... i lost 2 earring backs that showed up on my parents bed one morning. DONT GET THIS APP IF U LOVE UR FAMILY. I AM ALSO NOW HOMELESS","isEdited":false}},{"id":"6174876354","type":"user-reviews","attributes":{"date":"2020-07-09T03:29:44Z","rating":1,"title":"DISGUSTANG","userName":"BCookes","review":"this app immediately started glitching and stole all of my passwords and information from my phone. It continues to glitch so much that my phone started smoking and eventually exploded which then destroyed my whole house","isEdited":false}},{"id":"6174863349","type":"user-reviews","attributes":{"date":"2020-07-09T03:25:57Z","rating":1,"title":"disgusting.","userName":"fifjvjfjfjsnckgkbj","review":"did you know that this app tried to kill our family dog? not a joke. i was just chilling playing flappy bird, then all of a sudden, a giraffe came out and tried to play cards with me! and i was like, “woah dude, i have a boyfriend” and the tuna fish pulled out a glock from his back pocket!!! she sent my mother to the hospital and they told her it was just hair lice and that she had two days to live. wow. wishing that i could rate even lower than one star.","isEdited":false}},{"id":"6174859208","type":"user-reviews","attributes":{"date":"2020-07-09T03:24:43Z","rating":1,"title":"Complete Trash!  Will try to delete other apps!","userName":"OneOldKid","review":"If you even try to disagree with this app it will troll through your phone and try to delete other apps!  Uninstall immediately!","isEdited":false}},{"id":"6174855133","type":"user-reviews","attributes":{"date":"2020-07-09T03:23:31Z","rating":1,"title":"mAkE tHe ApP gReAt AgAiN","userName":"lex9283749292","review":"I thought we were making things gReAt AgAiN but this app didn’t do that. It glitches ALL THE TIME. This self claimed twitter and tech savvy leader should learn how to make a better app. DO NOT WASTE YOUR TIME. If I could give this app 0 stars I would!!","isEdited":false}},{"id":"6174847856","type":"user-reviews","attributes":{"date":"2020-07-09T03:21:23Z","rating":1,"title":"There wasn’t a 0 star option","userName":"Lindana309","review":"I gave this an 1 star but in reality it should have been a 0. This app was TERRIBLE! Can’t stop glitching, putting up false ads & propaganda. At one point it made my phone heat up. Totally unusable.","isEdited":false}}]}