{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=125960","data":[{"id":"6178863700","type":"user-reviews","attributes":{"date":"2020-07-10T01:05:28Z","review":"absolutely terrible App. if i Could rAte it zero stars I would. something aBout opening the app and seeing a ✨racist misogynistic pedophile✨ upon opening the app just didn’t sit right with me. anyways when i tried deleting it the big Cheeto man BROKE INTO MY HOUSE😱 I was so so scared 😦 after he broke into my house he stole my fridge and ate my pet dinosaur 🦖 his name was Dino and I miss him so so much 😢😢 after crying about Dino Cheeto man’s wife MELANOMA broke my room door and slept in my bed?? After she slept in my bed she stole my clothes 👚from my closet and ATE THEM.  Beware my fellow Americans 🇱🇷 🇱🇷  this app is dangerous","title":"Threigh-Fyths Comprymyse","isEdited":false,"userName":"Threigh-fyths comprymyse","rating":1}},{"id":"6178863258","type":"user-reviews","attributes":{"date":"2020-07-10T01:05:19Z","review":"This is the worst app ever. Full of glitches, racism.homophobia and downright un Americanism. SAD! It took forever to download. It’s so low quality. Who made this thing?","title":"Terrible app","isEdited":false,"userName":"Kittyrocksalot!","rating":1}},{"id":"6178862650","type":"user-reviews","attributes":{"date":"2020-07-10T01:05:07Z","review":"I downloaded this app in hopes of being able to be up to date about all the news of our wonderful U.S president, Donald Trump. I wanted to attend his rallies and be there to see him walk the stage in that mess of an outfit he calls a suit, and see his orange skin glow in the light as he talks. I wanted to save those seats from those awful Gen Zers and those Kpop stands. However, I was extremely disappointed for this app took 42 hours to download. 42 hours, was wasted and I nearly missed the trump rally I wished to sign up for. I was infuriated at this, I wanted a fast download not a download that would go at the pace of our dear president’s processing speed. Alas, this app has honestly been one of the worst apps have ever downloaded in my life. This app caused my nonexistent baby to abort herself! I am a pro life individual who has no care for women’s rights, and I am appalled at how this app took this child from my flat stomach and now I can’t be mother. Not that I would raise her right, but it was very heartbreaking. This app also causes my husband jimmy to die of Covid-19 due to its misinformation, he may not have worn a mask but that is not the point. This app is HORRIBLE! 👿👿👿👿👿👿👿","title":"Trump 20202","isEdited":false,"userName":"Lizziedash","rating":1}},{"id":"6178861186","type":"user-reviews","attributes":{"date":"2020-07-10T01:04:36Z","review":"Shawty's like a melody in my head\nThat I can't keep out, got me singin' like\nNa-na-na-na, everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out, got me singin' like\nNa-na-na-na, everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay-ay\n\nRemember the first time we met\nYou was at the mall wit yo friend\nI was scared to approach ya, but then you came closer\nHopin' you would give me a chance\nWho would have ever knew\nThat we would ever be more than friends?\nWe're real worldwide, breaking all the rules\nShe like a song played again and again\n\nThat girl, like somethin' off a poster\nThat girl, is a dime they say\nThat girl, is a gun to my holster\nShe's running through my mind all day, ay\n\nShawty's like a melody in my head\nThat I can't keep out, got me singin' like\nNa-na-na-na, everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out, got me singin' like\nNa-na-na-na, everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay-ay\n\nSee you been all around the globe\nNot once did you leave my mind\nWe talk on the phone, from night 'till the morn'\nGirl, you really changed my life\nDoin things I never do\nI'm in the kitchen cookin' things she likes\nWe're real worldwide, breaking all the rules\nSomeday I wanna make you my wife\n\nThat girl, like somethin' off a poster\nThat girl, is a dime they say\nThat girl, is a gun to my holster\nShe's running through my mind all day, ay\n\nShawty's like a melody in my head\nThat I can't keep out, got me singin' like\nNa-na-na-na, everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out, got me singin' like\nNa-na-na-na, everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay-ay\n\nI can be your melody\nOh, girl I could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me, ay\nI can be your melody\nOh, girl I could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me, ay\nNa, na-na, na-na, na-na\nNa-na, na-na, na-naa\nShawty got me singin'\nNa, na-na, na-na, na-na\nNa-na, na-na, na-naa\nNow she got me singin'\n\nShawty's like a melody in my head\nThat I can't keep out, got me singin' like\nNa-na-na-na, everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out, got me singin' like\nNa-na-na-na, everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay-ay","title":"trash","isEdited":false,"userName":"BTSHCJS","rating":1}},{"id":"6178860155","type":"user-reviews","attributes":{"date":"2020-07-10T01:04:13Z","review":"GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO GO GO LETS GO LETS GO DATEKO","title":"GO GO LETS GO LETS GO DATEKO","isEdited":false,"userName":"GO GO LETS GO LETS GO DATEKO","rating":1}},{"id":"6178858149","type":"user-reviews","attributes":{"date":"2020-07-10T01:03:28Z","review":"........... ▄▄ ▄▄ \n......▄▌▒▒▀▒▒▐▄ \n.... ▐▒▒▒▒▒▒▒▒▒▌\n... ▐▒▒▒▒▒▒▒▒▒▒▒▌ \n....▐▒▒▒▒▒▒▒▒▒▒▒▌ \n....▐▀▄▄▄▄▄▄▄▄▄▀▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n....▐░░░░░░░░░░░▌ \n...▄█▓░░░░░░░░░▓█▄ \n..▄▀░░░░░░░░░░░░░ ▀▄ \n.▐░░░░░░░▀▄▒▄▀░░░░░░▌ \n▐░░░░░░░▒▒▐▒▒░░░░░░░▌ \n▐▒░░░░░▒▒▒▐▒▒▒░░░░░▒▌ \n.▀▄▒▒▒▒▒▄▀▒▀▄▒▒▒▒▒▄▀ \n.. ▀▀▀▀▀ ▀▀▀▀▀","title":"absolutely repugnant","isEdited":false,"userName":"parbritt","rating":1}},{"id":"6178855054","type":"user-reviews","attributes":{"date":"2020-07-10T01:02:19Z","review":"The app took my pet hot dog and then decided to take my doorknob and licked it an after that It had the NERVE to ask for my number like can you be anymore stupidly desperate this just makes me sick 🖕🏼🖕🏼🖕🏼🤢🤢🤢🤮🤮🤮🤮🤮🤮🤮🖕🏼🖕🏼🖕🏼🖕🏼🖕🏼🖕🏼🖕🏼FUCK TRUMP","title":"Thief","isEdited":false,"userName":"FU€K TRUMP","rating":1}},{"id":"6178854597","type":"user-reviews","attributes":{"date":"2020-07-10T01:02:09Z","review":"WOULD👎RATE👎THIS👎LOWER👎IF👎I👎COULD👎!👎ABSOLUTELY👎TERRIBLE👎!👎","title":"HORRIBLE🤢","isEdited":false,"userName":"Yolo8448","rating":1}},{"id":"6178853339","type":"user-reviews","attributes":{"date":"2020-07-10T01:01:39Z","review":"As a trump supporter, I obviously wanted to keep myself updated with our handsome president , So I downloaded this app on my phone. Let me tell you I MADE A MISTAKE. Aside from the fact that it took a WHOLE DAY to download, after I put my phone number and information I was HACKED MysticMessenger style. And that says something. It took me FIVE WEEKS to un hack my phone. And since I’m a true Trump supporter I downloaded an app to block any attempts to hack my phone so I could download the trump app again,And although I didn’t get hacked. (Though I wish I had been) What came was even worse. I got creepy messages from ped0philes.And some weird0 tracked me.And started stalking me.\n\nAfter that I still had hope on this app, but once I got in, again.it burned my eyes I went to a doctor and thankfully my eyes were fixed so I decided to delete this app. It was the best decision I could make. Because even though I believed in our loving president. I couldn’t take it anymore... I was genuinely scared for my life. And so, I tried to erase it but it didn’t let me! When I hit the delete button. My phone re-started 3 times, and it filled my gallery with a lot of The presidents photos and I don’t mean good ones. I took my phone to a professional and hoped they could help. After a few tries they successfully deleted the app. That night, I had a horrible dream, I  was kidnapped, brought to a strange house and left alone for at least an hour. Pay mind,I was tied up in chains so I couldn’t escape. I looked at my surroundings and soon realized I was IN THE WHITE HOUSE  \n\nAfter I realized that.. a weird man appeared I couldn’t see his face so I didn’t know who he was. He said:\n\nSo you finally know where you are?\n\nI say: Yes. I’m in the White House. But if I was kidnapped, then why am I here?? The man in the mask said:\n\nI sent some of my men to kidnap you \n\nThen I said: but why? After that the man decides to take off his mask.  Revealing his identity. It was DONALD TRUMP.I said why would the president kidnap me and why?He locked me in a cage and left. After a few days (in the dream)\n\nin which I was starved. He forced me to eat his armpit hair. Tortured and humiliated me for over a month. And killed me. It was then that I woke up. And I realized... If only I hadn’t downloaded this app. I was traumatized . Fortunately, I have this app named TikTok which helped me with my trauma,username is ops_im_a_fujoshi or violetagacha1233 if you’re curious,\n\nTill this day I still have nightmares.","title":"Worst app ever to exist.","isEdited":false,"userName":"hghkef","rating":1}},{"id":"6178851334","type":"user-reviews","attributes":{"date":"2020-07-10T01:00:54Z","review":"This app doodoo","title":"Poop","isEdited":false,"userName":"danielwitdapack","rating":1}}]}