{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=82360","data":[{"id":"6173379926","type":"user-reviews","attributes":{"review":"You know, the other day I was just hanging out and randomly had the amazing idea to download the Trump 2020 app. Now I LOVE Trumo, my favorite parts about him being his deep hatred of minorities and the way he’s saving out country and souls from the evil satanist libtards! However, this app really didn’t do it for me (title drop). First off, when I downloaded the app it asked me to input my skin color to check if I was white. This was the best part of the app for me, because it can filter out all of those libtards and minorities who are sneaking onto the app and then leave absurd 1 star reviews. Next though, the app summoned a group of cockroaches (mentioned in previous reviews) to my house. I told my white conservative family that I could handle the bugs, but they proceeded to charge my whole white conservative family and tried to eat us alive! We barely fought them off and although we got away, we all had major life threatening injuries. I knew I would have to deal with these injuries immediately, as everyone in my white conservative family had had one or both of their arms cut off. So, I rushed to grab a bible and prayed for our health. As an intelligent conservative, I know better than to trust the liberal propaganda that is western medicine. Unfortunately, Jesus didn’t do too much for our wounds, although he did save our souls, and collectively lost 12 arms. Anyways, I wasn’t to happy about that feature of the app. Please change it so it’s more accessible to non cockroach tamers.","date":"2020-07-08T19:04:38Z","userName":"nick👍👍🤡r","title":"Didn’t do it for me","rating":1,"isEdited":false}},{"id":"6173378221","type":"user-reviews","attributes":{"review":"it took so long to download. i kept waiting for about 10 days for it to finish downloading. super disappointed","date":"2020-07-08T19:04:02Z","userName":"chupaculo69","title":"took long","rating":1,"isEdited":false}},{"id":"6173353202","type":"user-reviews","attributes":{"review":"Terrible app","date":"2020-07-08T18:55:20Z","userName":"hebejebelebe","title":"Absolutely awful","rating":1,"isEdited":false}},{"id":"6173337050","type":"user-reviews","attributes":{"review":"this app is disgusting it took nearly 3 weeks to download i don’t recommend anyone to download this. it’s bring cockroaches to you home.","date":"2020-07-08T18:49:40Z","userName":"issa_pandaaa🤙🏽","title":"don’t get the app.","rating":1,"isEdited":false}},{"id":"6173334165","type":"user-reviews","attributes":{"review":"THIS TOOK OVER A WEEK TO DOWNLOAD AND WHEN IT FINALLY DID I COULDNT SEE ANYTHING!! I WISH I COULD GIVE THIS A ZERO STAR RATING! DONT WASTE YOUR TIME ON THIS CRAP!!! IT TOOK UP SO MUCH OF MY STORAGE I HAD TO BUY MORE. I THINK IT GAVE MY PHONE VIRUSES TOO!! FRIENDS AND FAMILY HAVE BEEN GETTING RANDOM LINKS TO DOWNLOAD THIS HORRIBLE APP THROUGH TEXT WITHOUT ME EVEN SENDING ONE!! I WOULD EXPECT SO MUCH BETTER FROM THE PRESIDENT. IM SO ENRAGED. DONT WASTE YOUR TIME!!!","date":"2020-07-08T18:48:39Z","userName":"Vanissa Will Turner","title":"MAKES THE PRESIDENT LOOK HORRIBLE!!!!","rating":1,"isEdited":false}},{"id":"6173332146","type":"user-reviews","attributes":{"review":"worst app ever. it kept glitching, and leaving the app. TERRIBLE do not recommend.","date":"2020-07-08T18:47:57Z","userName":"prertygirl","title":"bad","rating":1,"isEdited":false}},{"id":"6173322850","type":"user-reviews","attributes":{"review":"trump is racist","date":"2020-07-08T18:44:47Z","userName":"Mr.LatinoHispanic","title":"Black lives matter and Hispanic lives matter","rating":1,"isEdited":false}},{"id":"6173320301","type":"user-reviews","attributes":{"review":"He’s pushing blm propaganda on our children 😡 there are talks about banning 1 million moms","date":"2020-07-08T18:43:55Z","userName":"Miagirl200","title":"Horrible","rating":1,"isEdited":false}},{"id":"6173302118","type":"user-reviews","attributes":{"review":"I may be only 13 but I know my rights and I have the freedom of speech and trump wants to take that away by banning TikTok BOO trump 2020","date":"2020-07-08T18:38:06Z","userName":"Ur Friendly spider","title":"TRUMP BAD","rating":1,"isEdited":false}},{"id":"6173301136","type":"user-reviews","attributes":{"review":"It was just awful. It was gross and he should not delete TikTok!!?!?!?!","date":"2020-07-08T18:37:47Z","userName":"bruh177363738","title":"Awful","rating":1,"isEdited":false}}]}