{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=82780","data":[{"id":"6175219678","type":"user-reviews","attributes":{"userName":"TRVIRVJ","rating":1,"isEdited":false,"title":"Hate","date":"2020-07-09T05:20:20Z","review":"Glitches"}},{"id":"6175219638","type":"user-reviews","attributes":{"userName":"Anayeli Hernandez","rating":1,"isEdited":false,"title":"No😁","date":"2020-07-09T05:20:19Z","review":"Everyone give this app a one star"}},{"id":"6175175994","type":"user-reviews","attributes":{"userName":"Kwebe19","rating":1,"isEdited":false,"title":"ABSOLUTELY TERRIBLE","date":"2020-07-09T05:04:42Z","review":"This app took my pet rock and abused it until it voted for Trump. We must stop the abuse by taking down the app 😡😡😡😡 #BIDEN2020"}},{"id":"6175170081","type":"user-reviews","attributes":{"userName":"sjdkebeifbw","rating":1,"isEdited":false,"title":"This app sinks","date":"2020-07-09T05:02:38Z","review":"Literally I installed this app and my phone started to smell like old cheese and soggy pickles. It was bad man."}},{"id":"6175162287","type":"user-reviews","attributes":{"userName":"theinternetlovesbernie","rating":1,"isEdited":false,"title":"Horrible App!","date":"2020-07-09T04:59:54Z","review":"My horrifying story about a lego took place on September 12, 2012, where I was playing Mario Kart at Rainbow Road, as Toad, of course, and all of a sudden I hear a loud knock on a door at   approximately 168 decibels. I pause Mario Kart, and peek out my window to see who it is, and I see a shadowy figure that resembles Barney. I run out the back door to try to escape from Barney. As soon as I get out of my house, I run North trying to find the nearest 7 11 to rob so I have enough money to travel to Romania, change my name, and hide from Barney forever. Once I get to the 7 11 I politely ask the cashier to give me money, and I explain why I need it, and he says he won’t give me money, but he will let me come with him to travel to Brazil, but I have to hide in his suitcase in the plane ride. I tell him that I can go, but the only problem was that that we’re leaving the next week on Friday at 6:30AM so I have to hide from Barney for a week. I ask him if I can stay at his house. He says that I can, but I have to stay in his basement, and I can’t come out until the plane ride. He leaves the store and gives me a ride to his house. I am very grateful for the ride. While we are riding in the car, we have a moment of silence until he tells me that he is my father, but he left me at birth because he couldn’t deal with my mom who wouldn’t stop feeding me nutritious bud light. Once I get to his house, he shows me my room and makes me a packet of beef ramen with a tablespoon of hot sauce. Little did I know that it was drugged. I instantly go into a coma, and 1 year goes by that I am in that coma until I wake up in a room with Barney. I try to get up from the bed, but I can’t because he tied me up. Barney puts flex tape on my mouth so I can’t scream for help then he pulls out a gun. I try to wiggle my way out, but I can’t. He points the gun at my foot and counts to three then he shoots. Little did I know that there was actually a red 4x4 lego in the gun after he shoots he lets me go. However, before Barney lets me go, he tells me I have to download this app. I downloaded this app, and this app has to be one of the most horrific, terrifying app I have ever downloaded! 0 stars if I am able to rate it."}},{"id":"6175154259","type":"user-reviews","attributes":{"userName":"Dave373793","rating":1,"isEdited":false,"title":"Terrible app","date":"2020-07-09T04:57:11Z","review":"The app is broken just like our president! #genz"}},{"id":"6175127981","type":"user-reviews","attributes":{"userName":"Brandon8376282","rating":1,"isEdited":false,"title":"Worst App Ever","date":"2020-07-09T04:48:19Z","review":"I downloaded this app and it is terrible. There is this scary orange clown that pops out! Not good for my heart condition."}},{"id":"6175113313","type":"user-reviews","attributes":{"userName":"micronisa","rating":1,"isEdited":false,"title":"DO NOT GET THIS APP","date":"2020-07-09T04:43:33Z","review":"It’s always glitching, freezing, and runs so slow."}},{"id":"6175109742","type":"user-reviews","attributes":{"userName":"Callie Ihnen","rating":1,"isEdited":false,"title":"literal trash.","date":"2020-07-09T04:42:22Z","review":"downloaded the app to see the hype... it’s terrible. glitches, horrible people, and even more horrible content. don’t waste your time."}},{"id":"6175096684","type":"user-reviews","attributes":{"userName":"sawyer2412","rating":1,"isEdited":false,"title":"Terrible","date":"2020-07-09T04:38:07Z","review":"This app is terrible it gave my phone a virus."}}]}