{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=7730","data":[{"id":"6173488671","type":"user-reviews","attributes":{"review":"I CANNOT describe who designed this app, and somehow it was accepted?! The app took SO long to download, it made all the other apps i was on LAG. After it was downloaded it couldn’t do anything because it was so slow!!!! Later then my device started heating up when it never does. I had to get a fan and just wait it off. NOT even the worst part, it was playing WEIRD MUSIC about Kanye being a trump supporter and running for president to make trump win..?! ODD..! Plus the music attracted moldy cheeto puffs like a magnet and it was HORRID! 1/5 stars :(","title":"HORRIBLE AND UNACCEPTABLE","userName":"bast angle game","isEdited":false,"date":"2020-07-08T19:42:10Z","rating":1}},{"id":"6173470185","type":"user-reviews","attributes":{"review":"✌︎︎ USA not just one state so next time you wanna come out with an app find someresons to really help trump .just wants power and that dose not help a BIT this is so Bad and glitchie we should not have to suffer you just want power and wont help our comuinty when you want to tell us HOW to really make our world and USA a wayyyyy better place let us know cuse Rn I don’t see the standing up for what’s right and helping our USA better let’s stand up for what’s right not wrong and Rn your all the wrong c ✌︎︎Madi 2020 out","title":"There is no reason this is even a app😤","userName":"TikTok Dogo cookie","isEdited":false,"date":"2020-07-08T19:35:48Z","rating":1}},{"id":"6173452154","type":"user-reviews","attributes":{"review":"when I opened this app my IQ dropped to 7, I got kicked out of university, I lost my wife and kids, I was forced to just keep churning and churning butter until my arms fell off and then I had to learn how to eat with my feet. This led to the problem that I had nothing to walk with and so I had to train my lung capacity to expand so that I could continue to be mobile lest I die of starvation. Now I can no longer play the saxophone and I was once a world known musician. All because of this app and it’s terrible maintenance and content","title":"ruined my LIFE","userName":"anita shlang","isEdited":false,"date":"2020-07-08T19:29:40Z","rating":1}},{"id":"6173438840","type":"user-reviews","attributes":{"review":"Since downloading this app I’ve had terrible dreams. Mr. trump visited me in my dreams to take me to Christmas past, Christmas present and Christmas yet to come. It wasn’t so much that the trips themselves were really bad, however, Mr. trump was very touchy feely. On top of that, he smelled like salami. I do not recommend following him into any dreamscapes. I’ve since deleted the app and have adorned the wall beside my bed with as many dream catchers as I can afford at the moment which sadly is not many ( he also robbed me blind while I was stuck in Christmas yet to come).","title":"Bad bad dreams","userName":"Evil Kate","isEdited":false,"date":"2020-07-08T19:25:05Z","rating":1}},{"id":"6173422563","type":"user-reviews","attributes":{"review":"I tried downloading this app multiple times in order to be closer to Mr. Trump and it took around three days to actually download. I feel I missed out on so much and am very saddened. Upon opening the app, it crashed 24 times and then when I finally got it to work, ads wouldn’t stop popping up about “male enhancement pills”. Is that really necessary? I was just trying to keep up with my President and only left with an understanding of why people vote blue (especially with all the proof if you know what i’m talking about).","title":"TERRIBLE!!!","userName":"bootswiththefurrr","isEdited":false,"date":"2020-07-08T19:19:39Z","rating":1}},{"id":"6173420887","type":"user-reviews","attributes":{"review":"This is the worse app to ever be created and I hope this gets taken down because this makes no sense and I hope Karen sees this and Donald Trump with his orange lookin self 🍊 and I hope Melina leaves you so you can marry your daughter you child rapist and I wish you would take down TikTok or make another racist comment because you have no idea how powerful this generation is all I’m saying is that anyone who reads this put a 1 star rating so it’ll get taken down and 1 star equals how quicker he gets out the White House.","title":"To an Orange Clown","userName":"unicornlove<3","isEdited":false,"date":"2020-07-08T19:19:04Z","rating":1}},{"id":"6173386092","type":"user-reviews","attributes":{"review":"as soon as i open the app i saw this horrid, revolting, ugly, saggy faced old orange man and immediately went into shock and got sent to the hospital. i now have nightmares about it. if i could give it a 0 star i would. it’s as if his little trumplets are behind all of it and almost made me die. we should arrest the cops that killed breonna taylor. and defund the police. they also sent me to the hospital just by looking at them the are a danger to society. so trump if your seeing this i think you’d look amazing🥰🌈🧚in your death bed💘✨🤩. nice talking to you bunker boy","title":"GAVE ME A SEIZURE","userName":"trump hater #2747583848372774","isEdited":false,"date":"2020-07-08T19:06:48Z","rating":1}},{"id":"6173374173","type":"user-reviews","attributes":{"review":"This app is awful. Customer service is awful. It seems to be like there’s a reoccurring issue for everyone where when I open the app loud music starts blaring and my phone starts to overheat. I’m convinced that this app is a scam and can possibly download a virus. I’m going to get my phone checked tomorrow because now it randomly opens the app EVEN WHEN I HAVE DELETED IT. I’ve tried contacting the app developers but they are no help. Do not download this app unless you want to pay $120 for an appointment to fix your phone.","title":"THE WORST APP I HAVE EVER SEEN","userName":"Amaya Gaus","isEdited":false,"date":"2020-07-08T19:02:35Z","rating":1}},{"id":"6173370148","type":"user-reviews","attributes":{"review":"This app is HORRIBLE! The offensive and inappropriate images,videos,and posts on here make me wanna bleach my eyes. There were links in some places that took you to the black market where they were selling Barron trumps stuff and sex trafficking little girls. I support trump but it’s clear he’s a pervert and a so much more. This makes me wanna hop on a fairy and drive off into the marina trench. I’d rather like to watch a live show of Java the hut and lord farquad having sex to the frozen soundtrack then have to experience what I’ve seen on this app.","title":"This app has ruined my life","userName":"@woopdeboop on tiktok","isEdited":false,"date":"2020-07-08T19:01:12Z","rating":1}},{"id":"6173324776","type":"user-reviews","attributes":{"review":"i downloaded this app thinking that it would be beautiful just like my sugar daddy trump, then after i downloaded it my dog started levitating and saying 💅🏻TRUMP 2020 and i was like yes doggy💙 you know who your daddy is🧚🏻‍♀️🧚🏻🧚🏻‍♂️ and then my furniture started attacked my cardboard cutout of TRUMP😭😫😳🤭🧚🏻‍♀️and then my dog sat on my couch and started attacking my whole house and now my house is DeAdDdDd💅🏻😭thanks a lot orange Cheeto racist pedaphile cage locker DaDdY😘💅🏻🧚🏻‍♀️🥳🥵🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡\ntherefore, this app didn’t pass the vibe check, but everyone that is on the critical side of this app did🥳💅🏻🥳😘🤩🧚🏻🧚🏻‍♀️🧚🏻‍♂️👑 \n     love, ur mommy","title":"TRASH🥳","userName":"brooklynxbrooke","isEdited":false,"date":"2020-07-08T18:45:26Z","rating":1}}]}