{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27400","data":[{"id":"6175583763","type":"user-reviews","attributes":{"userName":"Ih8trump69","date":"2020-07-09T07:40:28Z","isEdited":false,"review":"I literally opened this app and there it was. Pictures of Donald trump and Jeffrey Epstein. And then all of a sudden I saw something showing trump not being able to drink water? What kinda guy can’t drink water by himself? Just awful. Like the 130k corona virus deaths that are his fault. Awful.","title":"This app is worse than his policies 🤢🤮","rating":1}},{"id":"6175577162","type":"user-reviews","attributes":{"userName":"Ph4nt0mGir1??","date":"2020-07-09T07:37:58Z","isEdited":false,"review":"very bad app. right when I got on it I was completely offended by the totally non orange walrus on my screen. And my eyes may be bleeding, but i’ll be fine :) Then it asked for my phone number, which was not very husbandly of him considering he has a wife and several children with her. :|","title":"nope.","rating":1}},{"id":"6175575512","type":"user-reviews","attributes":{"userName":"Cakeblaze","date":"2020-07-09T07:37:24Z","isEdited":false,"review":"✨I opened the app to find this weird Cheeto of a man standing there, ugliest thing I’ve ever seen. I downloaded this app with the expectation of having things about Trumpets on there such as practice scales, tips for cleaning, fun songs to learn, etc. really disappointed that there’s an orange man on my screen.✨","title":"Absolutely disgusting","rating":1}},{"id":"6175574533","type":"user-reviews","attributes":{"userName":"Shauntoochie","date":"2020-07-09T07:37:03Z","isEdited":false,"review":"This app is absolute TRASH!!! The developer should be absolutely ashamed of him/herself for making complete garbage like this. I don’t ever want to open this app again. I can’t unsee what I’ve seen! This person should be fired, in fact they should fire themselves. I’ve been scared for life now!","title":"Trash","rating":1}},{"id":"6175561479","type":"user-reviews","attributes":{"userName":"EricaSade","date":"2020-07-09T07:32:17Z","isEdited":false,"review":"I downloaded this app to support our wonderful President but I am extremely disappointed! This app ruined my phone and now I need to go get a new one. Can you believe that?! Now I have a broken phone because I wanted to be a good citizen. Beware and do not download this app!!!","title":"Terrible","rating":1}},{"id":"6175553679","type":"user-reviews","attributes":{"userName":"abc123🥺😔","date":"2020-07-09T07:29:23Z","isEdited":false,"review":"This app didn’t even work and it took way to long to finish downloading. Why should I wait a week for a app to be on my phone. Needs so much improvement as well since the lag was beyond belief. Also I really hate this Cheeto of a man.","title":"Literally the absolute worst","rating":1}},{"id":"6175551930","type":"user-reviews","attributes":{"userName":"emily jero","date":"2020-07-09T07:28:48Z","isEdited":false,"review":"this app hacked into my credit & debit cards and bought trump merchandises WITH ALL MY MONEYYY so now i’m broke and have to work the streets with my bestie tt and deal with crack heads and let me tell you they are weird one of them asked me to lick the bottom of their feet cause it was burning cause of the demons -10 /10 do not recommend","title":"HORRIBLE APP","rating":1}},{"id":"6175550532","type":"user-reviews","attributes":{"userName":"natebaylor5","date":"2020-07-09T07:28:14Z","isEdited":false,"review":"This app is literal garbage. I downloaded it and immediately, my phone crashed because of the quantity of my personal information it tried to upload directly to the Chinese government. If i could give it 0 stars, I would.","title":"...I am gonna leave","rating":1}},{"id":"6175550278","type":"user-reviews","attributes":{"userName":"chillyman:)","date":"2020-07-09T07:28:08Z","isEdited":false,"review":"This app is absolutely disappointing. I couldn’t believe that it took a day to download and everything about the layout of it made me feel sick. How am I supposed to support my non racist, non homophobic, women supporting, great president. I am really disappointed. I thought my sexy orange could do better","title":"HORRIBLE","rating":1}},{"id":"6175414083","type":"user-reviews","attributes":{"userName":"kevin faulconer","date":"2020-07-09T06:34:58Z","isEdited":false,"review":"Crashed my phone countless times, interfered with the functionality of my banking and news apps. I could FEEL myself becoming stupider as I used this app... unsurprising, I guess. Anyway, don’t waste your time here... there are other, better ways to expose yourself as a brainless idiot.","title":"Embarrassing!!!","rating":1}}]}