{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=16390","data":[{"id":"6172632715","type":"user-reviews","attributes":{"title":"Do not get this app!!","date":"2020-07-08T15:13:07Z","isEdited":false,"rating":1,"review":"This is legitimately the worst app ever made. I got this app to find reasons if trump is a good president or not, and that did not show at all within the app, it was just spreading more lies. On top of that, the app took hours upon hours to install which my phone downloads content within minutes. This app need a lot of work or needs to be taken down immediately.","userName":"z1.4"}},{"id":"6172606023","type":"user-reviews","attributes":{"title":"Bad","date":"2020-07-08T15:05:37Z","isEdited":false,"rating":1,"review":"The app smelled so bad probably cause it’s trash and the smell attracted huge rats that kidnapped my dog and fed it HOT DOGS that’s basically cannibalism it also tried to light my house on fire with my dog inside eating the hot dogs I deleted the app but it downloaded again by itself it then continued to light all of teddy bears on fire it then tried to drown my fish so plz if u don’t want huge rats lighting ur house and teddy bears on fire and ur fish drowning don’t download this app!!!!!","userName":"bdpveovs"}},{"id":"6172484908","type":"user-reviews","attributes":{"title":"Absolutely atrocious","date":"2020-07-08T14:31:52Z","isEdited":false,"rating":1,"review":"This app is god awful not only are the graphics the grossest things you’ve ever seen, they continued to speed propaganda and false information. The app took a total of 1 year to download and it completely rendered my phone useless. I don’t know why they tried to advertise Cheetos so much, but I found that to be a disgusting marketing strategy. If I could give it zero stars I would.","userName":"Mike Litorus II"}},{"id":"6172291491","type":"user-reviews","attributes":{"title":"Cheeto’s got to go","date":"2020-07-08T13:39:18Z","isEdited":false,"rating":1,"review":"This app is the absolute worst! The glitches were ~astronomical~ and the interface was not only hideous but not user friendly in any way. It represents a pitiful attempt at brainwashing, leaving me to believe that anyone capable of believing such nonsense is in fact a brainless zombie following a fake cause. I have zero doubts that this app is extremely detrimental to the community and should be taken down immediately.","userName":"Goodbye Cheeto"}},{"id":"6172133518","type":"user-reviews","attributes":{"title":"Very Horrible","date":"2020-07-08T12:55:24Z","isEdited":false,"rating":1,"review":"he was very racist i do not want a racist as my president and more importantly apple i am disappointed in you for allowing this horrible horrible man to have his own app he called black people the n-word and i feel that if you have this app up your just as racist as him he is a horrible person not only racist but a rapist he is sexually attracted to his daughter that is disgusting and i will not stand for it","userName":"very very very horrible"}},{"id":"6172074020","type":"user-reviews","attributes":{"title":"Do not download this app this... for your safety 😖","date":"2020-07-08T12:38:08Z","isEdited":false,"rating":1,"review":"I wanted to download this app for our show stoping orange of a president who never comes without surprises ❤️  and suddenly my door flew open and oranges kept flinging at me from outta no where and when I had enough I realized it was the app so I quickly deleted the app and everything was back to normal so pls don’t download this app if you wanna go thru the trauma like I did 🤧","userName":"crazxyprincesesssss25789"}},{"id":"6171276015","type":"user-reviews","attributes":{"title":"✨🧚‍♀️ worst app in LIFE time I tell you 🧚‍♀️✨","date":"2020-07-08T08:11:41Z","isEdited":false,"rating":1,"review":"I don’t feel the need too write a whole story about this horrible, worthless, everything in the bad book app. all i got too say and what I’m gonna say. It’s a horrible app, and I advise you too never download it and a little tip, don’t even bother checking it out. (I checked it out definitely) and it was HORRIBLE. Morale of the story it’s HORRIBLE and give it a 1 star rating. byeee.","userName":"air.breeze"}},{"id":"6155234992","type":"user-reviews","attributes":{"title":"No!","date":"2020-07-04T05:52:27Z","isEdited":false,"rating":1,"review":"I was so TERRIFIED when I opened this app! It completely wasted my battery and it ate up all my wifi! AND once I saw this orange mans face on my screen, I THREW MY WHOLE PHONE IN THE TRASH! My iphone felt dirty. After I threw my iphone away.. I thought everything was back to normal. But then I started having nightmares about the ORANGE FACE! and I connected the dots... It’s MY president😨😭. Please do not download this app. Fact news. All one sided. Save yourself. 💋","userName":"sarahchaveanja"}},{"id":"6148855245","type":"user-reviews","attributes":{"title":"Do not get this app!","date":"2020-07-02T15:31:34Z","isEdited":false,"rating":1,"review":"This app is encrypted with some sort of virus that send messed up messages to all of your contacts! I’m sorry to say that I’m sorry I didn’t get back to you I wanna was the day I wanna was a good night I hope you have a good day love with your mom is dumb app that you don’t know about it but I gotta go get it and then give it a one star review stupid! Oh my gosh I’m gonna is the day I wanna was a time outrageous.","userName":"862552894"}},{"id":"6147696960","type":"user-reviews","attributes":{"title":"Poor app design","date":"2020-07-02T09:50:18Z","isEdited":false,"rating":1,"review":"Right off the bat we are treated to a view up Trumps nostrils. Then it just gets worse and worse. They asked for my phone number. I gave it. And all that happened was my texts BLEW UP. Next it takes up WAY TOO MUCH SPACE ON MY PHONE! The age limit is ridiculous. If there is gonna be an age limit it SHOULD be voting age. Cause why have minors right? It’s not like he really really really really REALLY REALLY likes kids.","userName":"Lexi123446569822"}}]}