{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=141310","data":[{"id":"6179436827","type":"user-reviews","attributes":{"title":"Trash","review":"This is the very worst app ever made. The worst. WORST. I am very smart and educated on cellular phones and these apps. Very smart. Maybe a genius. But I can for sure tell you that this app is bad. I have other very smart people telling me that it is bad also. Smart people. Maybe the smartest in the world. They hate it too. All good Christian Americans hate this app too. China loves it - and you know we can’t trust anything that CHIIIINA thinks is good. They are all just commies trying to destroy the country, and they love this cell phone app. Don’t download it. One download is a vote for commies and China.","date":"2020-07-10T04:30:03Z","rating":1,"userName":"marandakr","isEdited":false}},{"id":"6179436797","type":"user-reviews","attributes":{"title":"Yerrrrr","review":"Banned TikTok bet you won’t you a scared little orange 😂😂😂😂😂😂🤡🤡🤡🤡🤡","date":"2020-07-10T04:30:03Z","rating":1,"userName":"trumps grass","isEdited":false}},{"id":"6179436744","type":"user-reviews","attributes":{"title":"This app ruined my life","review":"This app not only took 8 years to download but once it did I opened it to a haunting photo of some ✨rotten orange✨staring at me... I started to cry and tried to run away but I ran into the street and got hit by a smart car (the car exploded upon impact so luckily I had to damage). When I came back to look at my phone again the app had taken all my information and had donated all my money to North Korea. I then got a call saying if I needed to vote trump 2020 (I’m 7 i can’t vote) or else the sniper on the roof outside was going to kill me (I’m genZ though so that’s chill).","date":"2020-07-10T04:30:02Z","rating":1,"userName":"fight me cheeto","isEdited":false}},{"id":"6179436775","type":"user-reviews","attributes":{"title":"Lags","review":"Lags too much","date":"2020-07-10T04:30:02Z","rating":1,"userName":"islwkne 6788&","isEdited":false}},{"id":"6179436622","type":"user-reviews","attributes":{"title":"Pure trash","review":"Just like our president. Sad to say he’s our president","date":"2020-07-10T04:29:59Z","rating":1,"userName":"barackobam a","isEdited":false}},{"id":"6179436463","type":"user-reviews","attributes":{"title":"DON’T DOWNLOAD THIS APP!","review":"I downloaded this app for updates on Mr. President Trump’s amazing campaign but when I did it gave my phone malware and now my photos are all of tentacle hentai!!!!! Is this a joke by the libtards??????!!! DONT GET THIS APP OR YOURE LETTING MARXISM TAKE OVER!!!!","date":"2020-07-10T04:29:56Z","rating":1,"userName":"KCrox1234321","isEdited":false}},{"id":"6179436353","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","review":"This app took forever to download and then it ate my cat.","date":"2020-07-10T04:29:54Z","rating":1,"userName":"daizygirl16","isEdited":false}},{"id":"6179436271","type":"user-reviews","attributes":{"title":"Horrible app don’t recommend","review":"Worst app ever when I downloaded the app trying to get to know my president but  this app was really weird after I stopped looking at the app I heard some type of ringing tone in my ear saying trump 2020 all lives matter and then a big old orange pop up on my phone saying you better not delete the app  so I deleted the app and now I modified by what I saw don’t recommend","date":"2020-07-10T04:29:52Z","rating":1,"userName":"happy stacy","isEdited":false}},{"id":"6179436289","type":"user-reviews","attributes":{"title":"Worthless app","review":"Almost as worthless as him!","date":"2020-07-10T04:29:52Z","rating":1,"userName":"donnie jr. no one loves me","isEdited":false}},{"id":"6179436115","type":"user-reviews","attributes":{"title":"WORST APP EVER DO NOT BUY 😡","review":"Ok, first of all, it took forever to download. If I could guess, it took about 4-5 days to download. It stole all of my information and data about me. Second of all, it completely destroyed my phone, and deleted all of my emails and messages. If I could rate this lower than 1 star, then I would.","date":"2020-07-10T04:29:49Z","rating":1,"userName":"AnaBee4","isEdited":false}}]}