{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36410","data":[{"id":"6176471417","type":"user-reviews","attributes":{"isEdited":false,"title":"WORST APP EVER!!!!","userName":"Cupcakeinvasion715","date":"2020-07-09T12:23:46Z","review":"This app is something else. It toke weeks to download and when it finally downloaded, it spawned a bunch of monkeys to my grandpa’s house wearing boots. They said they were looking for Dora, but I only knew where Diego was ,so they took all my clothes and ran away. 😭","rating":1}},{"id":"6176464635","type":"user-reviews","attributes":{"isEdited":false,"title":"Horrible app","userName":"cheetahlover04","date":"2020-07-09T12:21:54Z","review":"Yeah but you didn’t mean it was just a bit too late to go get to the vet and get him a job lol I wanna do you think you might be able to find out what time you do it haha is that a day I can drive","rating":1}},{"id":"6176379584","type":"user-reviews","attributes":{"isEdited":false,"title":"DO NOT GET THIS APP 🤢🤮🤮🤮","userName":"poooopppoyy","date":"2020-07-09T11:58:28Z","review":"It took about 75 years to download  when i downloaded it the app killed my dog and my cat and destroyed my tv and then forced me to vote for trump or he will find me and i got a call from trump saying if i dont vote for trump not nice things will happen to me 🤦‍♂️","rating":1}},{"id":"6176343196","type":"user-reviews","attributes":{"isEdited":false,"title":"This app gave me a period for 425 days straight!","userName":"applebottomjeansjessica","date":"2020-07-09T11:48:13Z","review":"Ugh i love my wonderful president Trump but he gave me a period for longer than a year! The app took 6 days to download, once it finally did i coughed up blood! PURPLE BLOOD, then when it fell it spelled out REPUBLICAN! don’t download this app!","rating":1}},{"id":"6176322747","type":"user-reviews","attributes":{"isEdited":false,"title":"Fake News","userName":"Thx fendhngbsfb","date":"2020-07-09T11:42:26Z","review":"The WORST. I downloaded this thinking it was an app highlighting the political policies of Donald J. Trump but this is obviously the Democrat’s idea of a satirical joke filled with fake news and ignorant, self-aggrandizing, cult-like verbiage. Highly recommend you don’t download if you’re a TRUE trump supporter.","rating":1}},{"id":"6176230258","type":"user-reviews","attributes":{"isEdited":false,"title":"The app gave me a virus!","userName":"kkaren😬😬😬","date":"2020-07-09T11:14:40Z","review":"I could not keep the app up and going! It kept crashing and then crashing my other apps! I hope my data doesn't get sold to another country like China!","rating":1}},{"id":"6176215096","type":"user-reviews","attributes":{"isEdited":false,"title":"HORRIBLE","userName":"Kjschaffer","date":"2020-07-09T11:10:03Z","review":"This app is HUGELY awful. It is NOT making America great again. It is slow sends terrible messages. I would NOT recommend this app to anybody and it is BIGLY horrendous... and I would know. I know more about bigly horrendous apps than anybody! Do not download !!","rating":1}},{"id":"6176140625","type":"user-reviews","attributes":{"isEdited":false,"title":"ghost","userName":"bsbeb fbsjeje","date":"2020-07-09T10:47:12Z","review":"This app took about a year to download and when It download their was a wall asking me if I was Mexican it American the audacity of it asking me that question if their was a 0 star rating i would put that rating in a heartbeat","rating":1}},{"id":"6176090727","type":"user-reviews","attributes":{"isEdited":false,"title":"SO MANY PROBLEMS","userName":"d3annnnn0","date":"2020-07-09T10:31:29Z","review":"This app is absolutely ridiculous. So many bugs. Every time I try to buy merch as well it says unavailable. I was going to vote for trump, but now I’m voting for Biden because this app a disgrace to the American people. We need to invest in more AMERICAN I.T. Jobs. God bless the USA 🇺🇸","rating":1}},{"id":"6176079057","type":"user-reviews","attributes":{"isEdited":false,"title":"Review","userName":"benji1239","date":"2020-07-09T10:27:48Z","review":"Honestly worst app ever it took hours to download and ended up freezing on the app and still I can not get my phone to work. I was forced to buy a new phone after getting this app.","rating":1}}]}