{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24820","data":[{"id":"6133809240","type":"user-reviews","attributes":{"review":"When I opened this app it called me the n word and told me to kill my self. They sent someone to my house and they broke my grandmothers ankles, stepped on my bearded dragon and them force my mom to play the dumb bobbing apples game but instead of apples it was fishes from my fish tank. R.I.P Patrick. This app is horrible I hope it gets deleted soon. 😤😡🥵🤬🤯","userName":"all my homies hate trump","rating":1,"isEdited":false,"date":"2020-06-29T00:19:34Z","title":"Is this what trump stands for ??😤🤮🖕🏾😡"}},{"id":"6126496324","type":"user-reviews","attributes":{"review":"I was really excited to see what our great president’s app would look like. I was horribly disappointed. Outdated graphics and information that wasn’t correct in terms of rallies! I downloaded this to stay in touch! I’m better off checking my newspaper! From 1995!","userName":"MAGA-t","rating":1,"isEdited":false,"date":"2020-06-27T03:53:27Z","title":"Not well organized"}},{"id":"6124636225","type":"user-reviews","attributes":{"review":"I can’t believe I have to explain this to people. DONALD TRUMP IS A WHITE SUPREMACIST. Dont believe me? Do yourself a favor and look up ‘steps to fascism’ in google. Currently? We’ve checked about 8 of those ten rules. This man is a disgrace to this country, and anyone who votes for him should really rethink their life choices. I’m ashamed to call myself an American because of this man.","userName":"Twocanes","rating":1,"isEdited":false,"date":"2020-06-26T15:51:58Z","title":"Disgraceful"}},{"id":"6120965479","type":"user-reviews","attributes":{"review":"The interface of this app is just awful. There’s way too much orange and it’s hard to look at, even when just opening the start screen. If I could give it 0 out of 5 stars, I absolutely would. Would NOT recommend this to anyone.","userName":"Anna R Key","rating":1,"isEdited":false,"date":"2020-06-25T17:19:20Z","title":"Really poor UI"}},{"id":"6093483110","type":"user-reviews","attributes":{"review":"I thought this app was going to show me why I should support trump, and how good of a Christian he is since everyone claims he is. Soon after downloading it, I realized that it was just an online meeting hub for the K K K. I wish they would at least title it that way so I didn’t have to download to find out. So disappointed, don’t download.","userName":"Rebecca Sandoval","rating":1,"isEdited":false,"date":"2020-06-18T22:59:48Z","title":"SO MISLEADING"}},{"id":"6093207098","type":"user-reviews","attributes":{"review":"i downloaded this in hopes to become more educated. instead, the app hacked my personal information. i lost access to my main email that i’ve been using for years, and it stole my credit card info after i tried to buy a MAGA hat directly from the app. Trump, you lost a voter","userName":"Lucy Eldridge","rating":1,"isEdited":false,"date":"2020-06-18T21:10:52Z","title":"STOLE MY CREDIT CARD INFO"}},{"id":"6065246402","type":"user-reviews","attributes":{"review":"This is terrible I downloaded the app kan eolgure geureochi mothan taedo what????\nGanyeorin mommae sok garyeojin volumeeun du baero\nGeochimeopsi jikjin guji bojin anchi nunchi\nBlack hamyeon pink urin yeppeujanghan savage\nIs happening????\nWonhal ttaen daenoko ppaetji\nNeon mwol haedo kallo mul begi\nDu sonen gadeukan fat check\nGunggeumhamyeon haebwa fact check\nNun nopin kkokdaegi\nMul mannan mulgogi\nJom dokae nan toxic\nYou hokae I'm fox\nDu beon saenggakae\nHeunhan namdeulcheoreom chakan cheogeun mot hanikka\nChakgakaji ma\nSwipge useojuneun geon nal wihan geoya\nAjigeun jal moreugetji\nGuji wonhamyeon test me\nNeon bul bodeusi ppeonhae\nManmanhan geol wonhaetdamyeon\nOh wait 'til I do what I do\nHit you with that ddu-du ddu-du du (Ah yeah, ay yeah!)\nHit you with that ddu-du ddu-du du (Ah yeah, ay yeah!)\nJigeum naega georeoganeun georin","userName":"karennoreallyimkaren","rating":1,"isEdited":false,"date":"2020-06-12T02:42:35Z","title":"I think I got hacked?????"}},{"id":"6065109298","type":"user-reviews","attributes":{"review":"Therasd nothing more irritatsnng than doemloadibg an app nd it causeees irrrwverdible damage to yourl boody. As soon as the app was fully downloaded and clialked open, a boltts of lighting struick me inssife my house. I was rushed to the hospital and unforetunatlyu have been strippped of the use of all of my limbs and appendages, on the brifhjt side I was able to type tis with myu tongue.","userName":"I.AJ.I","rating":1,"isEdited":false,"date":"2020-06-12T01:47:47Z","title":"Thisd app put me in a full booody castr"}},{"id":"6061492066","type":"user-reviews","attributes":{"review":"I downloaded this because of my immense love and respect for our one true leader, Donald Trump! Anything that he asks me to do, I do without question because I know my true place in this country as a woman. That is why I keep myself barefoot and pregnant at all times. Would any man like a sandwich?","userName":"Phanessamorgan274829173783&2","rating":1,"isEdited":false,"date":"2020-06-11T04:26:41Z","title":"I have been let down"}},{"id":"6058003772","type":"user-reviews","attributes":{"review":"As soon as I downloaded this app I had MAGA hats start flying at me from all directions out of NOWHERE. They overwhelmed me and I had to lock myself in the bathroom. I’m currently sitting on my toilet with a rioting bunch of MAGA hats outside the door telling me that my shorts make me look slutty. Im scared and hungry and I’m not sure what to do anymore. Would not recommend.","userName":"LeyLeyRose","rating":1,"isEdited":false,"date":"2020-06-10T08:36:25Z","title":"I’m scared"}}]}