{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30190","data":[{"id":"6173042046","type":"user-reviews","attributes":{"rating":1,"title":"Fascist Gov","date":"2020-07-08T17:14:11Z","userName":"I don't have one ok","isEdited":false,"review":"I hate this app. It is horrible in every single way. I came on here to see more political facts and turns out this app is literally the worst thing I’ve ever downloaded . After being a republican for many years I have turned blue. Sad where this country is"}},{"id":"6173021265","type":"user-reviews","attributes":{"rating":1,"title":"EXPLODED ALL MY ELECTRONICS","date":"2020-07-08T17:07:45Z","userName":"lollyboppy","isEdited":false,"review":"i supported phat orange king all my life and i saw he had an app so i downloaded the app of course and as soon as i got it it caused a MAJOR virus that exploded my phone and every electronic in the house. please don’t download take the app down i had to start an only fans to get afford my electronics back 🤪😳"}},{"id":"6173012410","type":"user-reviews","attributes":{"rating":1,"title":"WORST APP IN THE WORLD","date":"2020-07-08T17:05:00Z","userName":"maddie10100","isEdited":false,"review":"This app is literally so stupid none of it makes sense. There’s no setting to change the language or to have the articles read it to you out loud. This app is made for very few people it’s so stupid and honestly at this point I’m deleting it it’s an awful app"}},{"id":"6173011635","type":"user-reviews","attributes":{"rating":1,"title":"Worst app in history","date":"2020-07-08T17:04:46Z","userName":"cheledoss","isEdited":false,"review":"It took about took Two WEEKS just to finish downloading and when I loaded the page it made this weird noise and killed my dog and goats so I was crying and it also brought a lot of mosquitoes to my house so i can’t even go outside to get grocies"}},{"id":"6173010690","type":"user-reviews","attributes":{"rating":1,"title":"a waste of space.","date":"2020-07-08T17:04:30Z","userName":"misssannarose","isEdited":false,"review":"if this orange, stupid, racist, useless guy wants to try and take away tik tok, he should think again. gen z already ruined his dumb little rally so what makes him think we’re not gonna fight against him again? anyways if you vote for this guy, you’re a DUMMO. yeah, i said it, the ultimate roast."}},{"id":"6173009647","type":"user-reviews","attributes":{"rating":1,"title":"The most incredible app ever!!","date":"2020-07-08T17:04:10Z","userName":"BubbleButtBuddy$","isEdited":false,"review":"Okay absolutely in love with this app, love TRUMP DADDY. Love how I can keep up with everything around going on around trump. Oh, I don’t see any terrible inhuman allegations against him. Darn if I were to see those maybe would’ve 5 starred the app. Now I’m actually disappointed. :(("}},{"id":"6173008009","type":"user-reviews","attributes":{"rating":1,"title":"THIS APP IS HORRIBLE!!!","date":"2020-07-08T17:03:40Z","userName":"Gg mia vanna","isEdited":false,"review":"This app took WAY TOO LONG TO DOWNLOAD!!!!!When I finally got it to download it gave my phone so many glitches! My phone became soooo hot unbelievable!!! The last thing is that I wanted to get it to help make AMERICA GREAT AGAIN, BUT this app is doing the opposite of that!!!! Never again I DO NOT recommend to get or download this app EVER!!!!"}},{"id":"6173005557","type":"user-reviews","attributes":{"rating":1,"title":"Do NOT get!","date":"2020-07-08T17:02:56Z","userName":"GalaxyCupcake_Girl","isEdited":false,"review":"I believe in fully supporting our lovely president, Donald the Trumpet. Now, you may be wondering why I’m so disappointed in this app, eh? Well for one, if turns out this is not an app for Donald the trumpet! Like who else is more important than him?!?! I feel scammed off an app. Do not download it’s not for the trumpet."}},{"id":"6172995734","type":"user-reviews","attributes":{"rating":1,"title":"Horrible app","date":"2020-07-08T17:00:00Z","userName":"and_i_oop","isEdited":false,"review":"When I logged on I found out that he eat cockroaches and Beatles which is disgusting 🤮and I when I got on to the app it started to play horrible music and everyone in my neighborhood was wondering what the sound was. So please apple take off this app!!!!!!😘"}},{"id":"6172952460","type":"user-reviews","attributes":{"rating":1,"title":"awful app","date":"2020-07-08T16:46:41Z","userName":"The Washington P0st","isEdited":false,"review":"this app took up most of the storage on my phone and took WAY TOO LONG to download. It took about a week which is outrageous compared to other apps. The set up of the app also wasn't the best. it was very hard to figure out how to work the app"}}]}