{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=89120","data":[{"id":"6174028295","type":"user-reviews","attributes":{"rating":1,"review":"This app is the worst app I have ever downloaded It is just Ew","title":"The worst","date":"2020-07-08T22:58:54Z","userName":"dogybobet","isEdited":false}},{"id":"6174027995","type":"user-reviews","attributes":{"rating":1,"review":"My tio is in Mexico rnnnnn I can’t see him also #saveBarronTrump","title":"No 🤢","date":"2020-07-08T22:58:47Z","userName":"no 🤢","isEdited":false}},{"id":"6174023963","type":"user-reviews","attributes":{"rating":1,"review":"crashed my phone just like he crashed the economy and this country","title":"broke my phone","date":"2020-07-08T22:57:14Z","userName":"tiktoksentmehere202000000000","isEdited":false}},{"id":"6174023759","type":"user-reviews","attributes":{"rating":1,"review":"i opened it up and saw a cheeto on the front page! this is horrifically inconsiderate due to my deathly allergy of cheetos! i can’t believe this. 1 star 😡","title":"horrible app, belongs to the streets","date":"2020-07-08T22:57:09Z","userName":"eggchaps","isEdited":false}},{"id":"6174017649","type":"user-reviews","attributes":{"rating":1,"review":"terrible app so bad. not helpful at all. misleading and not easy to maneuver","title":"HORRIBLE APP","date":"2020-07-08T22:54:54Z","userName":"cupcakegal11","isEdited":false}},{"id":"6174015254","type":"user-reviews","attributes":{"rating":1,"review":"Did it for TikTok","title":"Dislike this app very much","date":"2020-07-08T22:54:01Z","userName":"gerorge6","isEdited":false}},{"id":"6174001837","type":"user-reviews","attributes":{"rating":1,"review":"10/10 would not recommend.","title":"Cuz u deleting tik tok.🙈🧚‍♂️✨","date":"2020-07-08T22:48:55Z","userName":"hskekcnmen","isEdited":false}},{"id":"6173995557","type":"user-reviews","attributes":{"rating":1,"review":"When I opens the app I saw something I can’t unsee. I SAW AN ORANGE WALKING. I AM SO SCARED RIGHT NOW.","title":"I may have nightmares after this","date":"2020-07-08T22:46:35Z","userName":"JUAN IS DADDY","isEdited":false}},{"id":"6173994885","type":"user-reviews","attributes":{"rating":1,"review":"Glitchy app. Very bad","title":"Don't get this","date":"2020-07-08T22:46:21Z","userName":"borgbella3","isEdited":false}},{"id":"6173989715","type":"user-reviews","attributes":{"rating":1,"review":"Danganronpa: Trigger Happy Havoc, known in Japan as Dangan Ronpa: Kibō no Gakuen to Zetsubō no Kōkōsei (ダンガンロンパ 希望の学園と絶望の高校生) is a Japanese visual novel game developed by Spike Chunsoft, and the first game in the Danganronpa series. It was released in Japan on November 25, 2010, for PlayStation Portable, and was later ported to PlayStation Vita, iOS/Android, PlayStation 4, and PC. A demo of the game called Dangan Ronpa: Kibō no Gakuen to Zetsubō no Kōkōsei (Trial Version), with a modified version of the first chapter, was released exclusively in Japan on October 10, 2010. The game was later localized and released in English by NIS America on February 11, 2014. Hope's Peak Academy is home to Japan's best and brightest high school students — the beacons of hope for the future. But that hope suddenly dies when Makoto Naegi and his classmates find themselves imprisoned in the school, cut off from the outside world and subject to the whims of a strange, murderous little bear named Monokuma. He pits the students against each other, promising freedom to anyone who can murder a fellow classmate and get away with it. It's up to you to find out who Monokuma really is, and why you've been taken from the world you once knew. But be careful what you wish for — sometimes there's nothing more deadly than the truth...\"In Danganronpa: Trigger Happy Havoc, the player controls Makoto Naegi, a student at Hope's Peak who is forced into a killing game with other students. Each chapter is divided into two parts: School Life, in which the player can explore the academy and progress through the story, and the Class Trial, in which the player must deduce the culprit of a murder. During School Life, the player can explore the school grounds in the first-person perspective. In certain locations, the player moves a crosshair cursor to converse with other characters and interact with various objects. Examining specific objects yields the player Monocoins, which can be redeemed for presents from The All-Mighty Monomono Machine located in the school's store. As the game progresses, more areas in the academy become available along with places that were sealed off in the previous chapter(s) on accessible floors. School Life is separated into two sections: \"Daily Life\" and \"Deadly Life\". In Daily Life, the players converse with other characters and progress through the story. When speaking with other characters, some comments can be \"reacted\" to reveal new information. Daily Life also features \"Free Time\" segments, where the player can spend their time with other characters and give them presents, which in turn reveals more information about them and unlocks \"skills\", which aid the player in certain aspects of the Class Trial, and \"skill points\", which determine the number of skills that can be used. Once a murder has occurred, the game transitions into Deadly Life, where the player must look for clues throughout the academy. Evidence and testimonies, or \"Truth Bullets\", are stored in the player's e-Handbook. After all possible Truth Bullets are found, the game shifts to the Class Trial. In the Class Trial, the students must discuss among themselves who the killer is. The game’s logic difficulty will determine how the facts are shown, and determine how logical they are (the logic difficulty can be changed in the settings at almost anytime). The Class Trial consists of four main game modes: Nonstop Debate, Hangman's Gambit, Bullet Time Battle, and Closing Argument. The most common of these is the Nonstop Debate, in which characters will discuss their thoughts on the case. During these sections, the player is armed with \"Truth Bullets\", metaphorical bullets containing evidence relevant to the case. To break the debate, the player must find a lie or contradiction among the \"weak points\" - words highlighted in yellow - in the characters' arguments and shoot them with the correct truth bullet. In Hangman's Gambit, the player must shoot specific letters to spell out a clue. Bullet Time Battle is a one-on-one debate against another student featuring rhythm-style gameplay. As the opponent makes remarks, the player must press buttons in time to the beat to lock onto the remarks and shoot them down. To close out the case, Closing Argument is a puzzle in which the player pieces together a comic strip depicting how the murder went down. Occasionally, the player must answer a multiple-choice question and present a shred of evidence to progress through the Class Trial. The player's \"Influence\" among the other students is represented by hearts, which is reduced whenever the player makes errors in shooting contradictions or presenting evidence and is slightly replenished once the player does otherwise. The game ends if the player loses all their Influence, or if they run out of time during a segment. At the end of a trial, the game ranks the player's performance and rewards them with Monocoins. When the player completes a chapter, a screen with outlines of every student's silhouette appears. Text at the top of the screen displays \"Surviving Students\" - though moments later, the casualties' sprite colors change to show their status change from alive to deceased as the number on the bottom changes accordingly to the number of surviving students.","title":"Terrible App!","date":"2020-07-08T22:44:22Z","userName":"Kaeru-Deshi","isEdited":false}}]}