{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22470","data":[{"id":"6174888403","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:33:13Z","title":"Bad!!","isEdited":false,"userName":"Going to fun","review":"My anime waifu has been erased from existence. I’m beyond disappointed, I don’t know how I’ll go on. Please fix this, please. I can’t live without her or breathe without her or feel without her. I’m just an empty shell of a human being without her in my life. God please, bring her back. You’ve taken everything away from me!!! How dare you!!!!!"}},{"id":"6174887739","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:33:01Z","title":"BEWARE!!","isEdited":false,"userName":"Tink9797","review":"I downloaded this because I wanted to to support my president after these meddling kids started ruining him, but BEWARE!! My fellow trump clan, this is a networking site to allow women, gays, and minorities to discuss gaining equal rights and promote spreading of truthful news!! We can’t let that happen!! We must only listen to fake news or mr. president will not be re elected. This app is bad bad bad!"}},{"id":"6174883687","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:31:52Z","title":"A republican turning democrat ❤️👄❤️","isEdited":false,"userName":"kanye vs biden 2020","review":"This app contains bigotry, racism, sexism, fake news... you name it! This app contains all of the problems that our world is facing today. It promotes hate and is run by a man suspiciously as dumb as the gum i had to scrape off of the bottom of my shoe today. Anyways, horrible app. you’re better off voting for Biden in the 2020 election than to download this app."}},{"id":"6174849443","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:21:51Z","title":"WORST APP EVER!!!!","isEdited":false,"userName":"DADDYANONYMUSBIGDICK_69","review":"This app caused made my grandma late bc it was nighttime and my sister was late for her birthday bc we celebrated it yesterday and my Dinosaur said yes so I finally remembered to turn off the beans but then I remembered I had to die so I skated to my house and drop my car keys but then I realized my phone died so I charged it on my hat, in conclusion this app sucked and Apple pls take it down"}},{"id":"6174864902","type":"user-reviews","attributes":{"rating":5,"date":"2020-07-09T03:26:24Z","title":"GREAT!!!","isEdited":false,"userName":"hannah2772","review":"All the reviews are just hate but if you are looking for a good app to tell you all the TRUE updates and info on Trump and the U.S this is a great app :)"}},{"id":"6174829986","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:16:07Z","title":"Made my phone freak out😡😡","isEdited":false,"userName":"Definetly Legal✨✨","review":"As soon as I opened the app my phone randomly started glitching and then stopped working for 2 HOURS! It took me forever to delete the app as I kept getting blocked by pop up adds for Russian mail order brides. I am severely disappointed with the quality of this app and strongly suggest NEVER DOWNLOADING!"}},{"id":"6174825109","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:14:43Z","title":"WORST APP EVER!!!","isEdited":false,"userName":"nivvgirl2","review":"This has made my phone a LIVING HELL. Non-stop notifications EVEN when I turn them OFF, constant glitching making my phone shut down every time I open it, everything is so slow. THIS NEEDS TO BE TAKEN DOWN! As soon as I installed it for 5 minutes I immediately uninstalled! Never have been so disappointed"}},{"id":"6174810858","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:10:32Z","title":"let me tell you this","isEdited":false,"userName":"hannah from twt","review":"24 nuguboda deo ppalli eoreuni doen geosman gata\nMy life has been a movie all the time\nHae tteuneun goseuro dallyeosseo every single night\nNuguui naeire gabwassdeon geosdo gata\n\nOn sesangi neomu keossdeon geu sonyeon\nKeep on runnin' errday mic jabadeureo\nFriends ridin' subway, I'll be in airplane mode\nJeon segyereul rock on I made my own lotto\n\nBut neomu ppareun geonji nohchyeobeorin heunjeongi\nDon't know what to do with\nAm I livin' this right?\nWae naman dareun sigonggan sogin geolkka\n\nOh I can't call ya\nI can't hol' ya\nOh I can't\nAnd yes you know yes you know\n\nOh I can't call ya\nI can't touch ya\nOh I can't\nLet me know\nCan I someday finna find my time\nFinna find my time\nSomeday finna find my time"}},{"id":"6174809479","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:10:06Z","title":"WORST APP EVER!!","isEdited":false,"userName":"HanRama","review":"Disgusting. Abomination. Deplorable. I was just minding my own business, watching Fox News on my phone, when the trump app kept opening by itself! I thought deleting it and re downloading would help but nothing!! Can’t believe they can’t have a decent app for this campaign. A shame, I think I’ll be voting for Biden instead!!! A complete OUTRAGE!!!!!!! 😡😡😡"}},{"id":"6174782745","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T03:02:05Z","title":"A terrible app","isEdited":false,"userName":"ken_kaneki55","review":"Honestly I think this app is TRASH. I downloaded it to get the latest news on the campaign but my phone started to act up and I went to have it checked, and it had TWO very harmful viruses and I lost all my contact and photos while it was being fixed I absolutely dispose this app"}}]}