{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=2650","data":[{"id":"6173628202","type":"user-reviews","attributes":{"review":"I downloaded this app in all hopes of all of my hopes and dreams coming true. What it doesn’t tell you in the app store description of this app is that it will ruin your LIFE. After downloading this app and inputting all of my information, i could feel eyes on me at all times. I didn’t feel safe anymore. Is president Trump stealing my information? Is he watching me? I feel violated and scared. My children and cats are terrified. Every second becomes harder and harder as I wonder how much time i have left. Worrying for my life at the ripe age of only 37 should not be a concern after only trying to support my president 😔. I am scared and disgusted. Delete this app before anyone else has to experience this kind of fear in their life.","date":"2020-07-08T20:30:25Z","title":"Disgusting, Disappointing, and plain out HORRIBLE.","rating":1,"isEdited":false,"userName":"Hot M&M"}},{"id":"6173569035","type":"user-reviews","attributes":{"review":"I downloaded this up to support our beloved Cheeto president, it took about a day or so to download which was okay because I had things to do like take my fish on a walk and teach my dog how to fly. anyway back to the point once I opened the app it kicked me out and my phone started to glitch and it never turned back on, I had to use my iguanas phone for the next couple of days until I got another phone. I started to read all trustworthy reviews that were left and my God I was baffled. bad luck, ovens turning on without anyone’s permission, about a week for this app to download (I thought mine took a long time), dogs levitating. OMG MY DOG KNOWS HOW TO FLY NOW! Anyway ninjas attacking! This app needs to be taken down now!!! DO NOT I REPEAT AND I NEVER REPEAT MYSELF BUT I REPEAT DO NOT DOWNLOAD THIS APP!!! ❌❌❌❌❌","date":"2020-07-08T20:09:35Z","title":"Kanye 2020","rating":1,"isEdited":false,"userName":"kanya 2020"}},{"id":"6173543405","type":"user-reviews","attributes":{"review":"This app is horrible the first thing that came up was an orange man, he scared me. I almost had a panic attack and that was my first time ever getting one. Then they make you sign up how dare they. And they want you to put in your phone number, how do we know that their not gonna call us and take us away. And they orange man is still on my screen I want him off 😡 ain’t nobody want to see him he’s very scary even my little was crying when he saw him, that’s not very nice. Then he be looking like a whole elote with his hair he needs to fix that. And he says make America great again 😒 but uhm he didn’t do anything before soooo..... but anyways never download this app it’s horrible and it’s fake just like the orange man himself. That’s all for today folks see ya later ✌️","date":"2020-07-08T20:00:55Z","title":"worst app ever","rating":1,"isEdited":false,"userName":"Jessica7737"}},{"id":"6173435095","type":"user-reviews","attributes":{"review":"ever since i got it its always been glitchy the furst time i opened it it immediately kicked me out i had to open THREE times to even get it to work I didnt have problems with it for a two days and then all of a sudden the apl started working EXTREMELY slow under my own wifi when i had all the bars the app was just refusing to go as fast as other apps when i tried to use to sign up for an event the problem of me getting kicked out of the app came back again and when i was trying to change the email i put in AGAIN it said that my email was INVALID it was the exact same email I use for work I cant believe the an app made by such a rich man functions worse than a school computer.I do not reccomend this apo AT ALL","date":"2020-07-08T19:23:50Z","title":"THIS IS A TERRIBLE APP","rating":1,"isEdited":false,"userName":"TrueTigerGirl"}},{"id":"6173372978","type":"user-reviews","attributes":{"review":"This app is terrible. I don’t know where to begin. When it finally downloaded after 3 days, the first thing I see is a cheeto as the cover. Now, I don’t expect to see some glorious cover, but a cheeto? I am allergic to cheetos so naturally my face began to swell up. I immediately try to blow up the app, but in the process my phone blew up too. It cost me good money!! In this whole process, when my phone blew up, cheeto dust sprayed everywhere and my dog sniffed it and turned into a cheeto. I expected better. My dog is now in the cheeto puff factory being turned back but now she is permanently orange. Patriotic I suppose... Very disappointed though. Do not buy unless you want a cheeto dog and have a cheeto allergy. I have not stopped sneezing ever since.","date":"2020-07-08T19:02:11Z","title":"Instructions not clear. Dog is now a cheeto","rating":1,"isEdited":false,"userName":"Sofia Mangel"}},{"id":"6173250310","type":"user-reviews","attributes":{"review":"after the app finally downloaded after 68.3 hours, once i opened it, i couldn’t close it! it took up the whole screen and would only allow me to listen to trump speeches and his songs. this caused me to literally go deaf!! the speeches would play constantly and attract rats, snakes, and spiders which i am DEATHLY AFRAID OF and his little orange face would be the only thing on my phone at all times. once my mom saw this predicament, she became visually impaired and her 20/20 vision became legally blind!! we tried to delete the evil and even went to the witch doctor but even she couldn’t solve the problem. please don’t download this app to just give it a rating that wouldn’t be very nice, this is a real story and others need to have their voices heard!! #settleforbiden2020","date":"2020-07-08T18:21:17Z","title":"RUINED MY FAMILY’S LIFE","rating":1,"isEdited":false,"userName":"Hannah—bannah™"}},{"id":"6173146831","type":"user-reviews","attributes":{"review":"so I decided to download this app because I wanted to give my president chetto puff another chance to be president but then I realize how slow it took me to download this it literally took me three days and my Wi-Fi is superior and it crashes every time I go on it so I can’t even see the app so so far then and then I tried so hard and it finally lets me get on like after like three days and then it was a super bad quality I could barely swipe to stuff and everything plus what I saw Donald Trump‘s face on it I saw his spray tan and I’ll ugly as hell so I just wanted to tell you guys that because I don’t want a president of the United States to have an ugly spray tan so yeah if Trump ever sees this fix your spray tan because you look like a whole cheeto puff. thanks","date":"2020-07-08T17:47:36Z","title":"my Horrible experience 🤢","rating":1,"isEdited":false,"userName":"cheeto👁👄👁"}},{"id":"6173134986","type":"user-reviews","attributes":{"review":"Sooo I downloaded this app because I was scrolling in tiktok and A lot of people we’re saying download this app. So idc I listened to the people and I Open the app for the first time and I heard my door Bell ring. I was really confused🤔Then I saw a 🎃 with a blond wig on and I was so confused it was walking 🚶!!!! I was so scared to open the door so I rain in my room and yelled out the window saying “ what do you want walking pumpkin with a wig on” then it said “ vote for me I can change your life” then I got scared cuz is was doing a dance and singing “ I want to put you in seven positions for 70 minutes” to my next door neighbor so then I looked on my phone and I saw the app and the walking pumpkin with the wig was on there so I deleted the app and you won’t Believe it the walking pumpkin was gone🤗","date":"2020-07-08T17:43:53Z","title":"Don’t download","rating":1,"isEdited":false,"userName":"kaelani dardar"}},{"id":"6173129337","type":"user-reviews","attributes":{"review":"i tried to download this app at least 30 times and each time i clicked the download button i would hear a horrible screech in the sky!!!! AND WHEN I WAS FINALLY ABLE TO DOWNLOAD IT TOOK DAYYYYSSSS. i am not the type of person to leave horrible reviews like this, but this is the WORST service i have received in YEARS!!!!! Apple should be ashamed of having this app in the app store!!! AND BECAUSE OF HOW MANY TIMES I HEARD THE SCREAMING I HAVE permanentttttt HEARING LOSS!!!! I can’t hear a thing in my left ear and i am going to be paying bills for my medical treatment for the REST OF MY LIFE! It is so difficult to get a job with this disability because a hard of hearing worker can pose a danger when working in telecommunications for nuclear launch codes!!!!!! DO NOT DOWNLOAD THIS APP!!! IT WILL RUIN YOU FOR THE REST OF YOUR LIFE!!!!!!!!!","date":"2020-07-08T17:42:06Z","title":"HORRIBLE SERVICE!!!! WORST APP!!!!","rating":1,"isEdited":false,"userName":"piercethewolf"}},{"id":"6173083459","type":"user-reviews","attributes":{"review":"I recently been able to vote, 18 or woo hoo, so I downloaded the app and I was so disappointed. To start out well I was downloading the app it took six hours and at first I played it off as my Internet slow or my phone just doesn’t have very much storage left but now it gets worse. I filled out all the information right before I went to bed. When I woke up I found thirty missed calls. I had just gotten this phone number and now I have all these spam calls. Of course I went into the app and everything was flashing. I didn’t know what to do so I powered off my phone and left it for a couple hours and when I got back on it sent me to safari and guess what I got... a virus. Thanks trump really appreciate it!","date":"2020-07-08T17:27:27Z","title":"Words cannot describe this app","rating":1,"isEdited":false,"userName":"sarah.836m"}}]}