{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=19660","data":[{"id":"6178096933","type":"user-reviews","attributes":{"date":"2020-07-09T20:15:50Z","title":"Most dysfunctional app ever","rating":1,"isEdited":false,"userName":"rpeacock25","review":"Honestly didn’t have super high hopes that this app would work well but I thought it would at least get the job done and not really effect me or my phone usage. But it crashed so many times. Made the most annoying noises and sounds and kept calling me slurs and glitched so much that it made me wanna die."}},{"id":"6178092985","type":"user-reviews","attributes":{"date":"2020-07-09T20:14:34Z","title":"best app i have ever used❤️✨","rating":1,"isEdited":false,"userName":"chisjsjsi","review":"STOP IF YOU AGRRED WITH WHAT I SAID LET ME TELL YOU SOMETHING. Donald trump is a racist, sexist, fat orange potato. there are so many things wrong with this man and you chose to support him? and for all the people who support him and say they are “christians or catholic” need help. in the bible everyone knows the only person who can judge us is god. yet u still choose to support a man who only likes white people?"}},{"id":"6178088485","type":"user-reviews","attributes":{"date":"2020-07-09T20:13:03Z","title":"hackers","rating":1,"isEdited":false,"userName":"it..me7362","review":"so i got this app to see what he had to say about the whole epidemic, but instead of seeing anything good all it did was make my phone slow , it’s lagging, i keep getting random spams and even though i did the “stop” thing to remove messages , i still get them , and i’m sure the government is stalking us because my phone randomly updated after getting this app and i found out there’s a tracker now that helps you know if “you were in contact” with a infected person but in reality i’m sure it’s just hackers trying to track all of us . gen z wake up ."}},{"id":"6178072948","type":"user-reviews","attributes":{"date":"2020-07-09T20:08:00Z","title":"ZERO STARS","rating":1,"isEdited":false,"userName":"Cejaatan","review":"I downloaded this app to keep up with the big orange ra(p/c)ist at the White House, number 45 himself. But it always glitches and I think it installed malware onto my phone. My phone keeps tweakin out now and I think the app is emitting poisonous gas from my phone’s speakers. I opened the app again and was immediately met with a stroke. I think this app is trying to kill me"}},{"id":"6178064921","type":"user-reviews","attributes":{"date":"2020-07-09T20:05:18Z","title":"Complete and absolute trash","rating":1,"isEdited":false,"userName":"hehshh11","review":"This is the worse app I ever seen🤢🤮 honestly I don’t know why this app is useful to some people. This app is the equivalent to getting kick in the private area. This app is just painful to look at and I don’t see nobody using it. I hope It get taken down and this my way of helping to make that happen"}},{"id":"6178026574","type":"user-reviews","attributes":{"date":"2020-07-09T19:52:45Z","title":"no❤️","rating":1,"isEdited":false,"userName":"Quallin ALL BarBz","review":"I was so happy and excited to get this app to support our great ❤️orange❤️ president but it is just so horrible! I cannot stand how bad the glitches are and it just closes by itself all of a sudden stan nicki minaj for clear skin and noah mills for a fat juicy booty i miss emhulu so much i will also miss Quinn on tiktok he really cured my depression his laugh is the best also corey the bagel i love your cursive ✨medium iced coffee✨"}},{"id":"6177992881","type":"user-reviews","attributes":{"date":"2020-07-09T19:41:41Z","title":"👁👄👁","rating":1,"isEdited":false,"userName":"Randy mcBob","review":"this app is absolute trash, like the kind of trash you can smell a mile away. it crashes all the time, i can’t delete the app off my phone, nothing makes sense on it, there’s a weird orange guy that keeps popping up on my screen. please help, idk what to do. the amount of misleading information on this app is ASTRONOMICAL! don’t waste your time on it."}},{"id":"6177987208","type":"user-reviews","attributes":{"date":"2020-07-09T19:39:50Z","title":"No good, Very disappointing","rating":1,"isEdited":false,"userName":"Leiaaaaamichaelis","review":"I don’t understand why this app exists. It is a worthless no good piece of trash. Why does a incompetent president who can’t even form a proper sentence or thought for that matter, need a app. This is extremely extremely stupid and makes no sense to even download. He is such a unprofessional man and doesn’t have the slightest idea what he is doing."}},{"id":"6177946809","type":"user-reviews","attributes":{"date":"2020-07-09T19:26:42Z","title":"Glitch","rating":1,"isEdited":false,"userName":"ass poop cheeks","review":"I downloaded this app to see what President Trump is going to do with the next four years that he potentially has and it took me weeks to download and when I finally open the app after four weeks he gave me a ton of glitches my phone wasn’t working for about a month and they gave me viruses"}},{"id":"6177933700","type":"user-reviews","attributes":{"date":"2020-07-09T19:22:28Z","title":"ruined my life","rating":1,"isEdited":false,"userName":"BDLCT","review":"thanks to this app it hacked my phone and then proceeded to tell my father to jump off a cliff and then he did so because he is extremely suicidal. Now my dad is gone thanks to this app. It ruined everything for me. I also got fired because this app kept sending my constant notifications and my grandma now has disowned me."}}]}