{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8050","data":[{"id":"6176335821","type":"user-reviews","attributes":{"date":"2020-07-09T11:46:06Z","rating":1,"title":"SCAM","userName":"Trump is a predator","review":"This app is a SCAM! When you download, it takes all your information off of your phone and sells it. After it steals your information, it sends an email to all of your contacts that downloads a virus onto their device, so it can steal their information too! I feel so unsafe after downloading this app and am afraid my constant location has been sold to traffickers because since downloading this app I have been being followed and say someone hiding under my car. DO NOT DOWNLOAD!","isEdited":false}},{"id":"6176333542","type":"user-reviews","attributes":{"date":"2020-07-09T11:45:27Z","rating":1,"title":"Didn’t believe the reviews","userName":"Michellepiazzax","review":"I didn’t believe the reviews I only believe my savior, Donald J. Trump but it’s true. After downloading, my phone started getting crazy, I started getting scary phone calls and they knew my address. I brought my phone to my cousin that works in tech and said that the app was collecting all of my info and selling it off to other people, I couldn’t believe it!!! He also explained how it isn’t a secure app so really anyone could hack into it and get into my phone. No thanks!!!","isEdited":false}},{"id":"6176289297","type":"user-reviews","attributes":{"date":"2020-07-09T11:32:35Z","rating":1,"title":"AWFULL 😡","userName":"delete this trash app","review":"this took 3 days to download and once it downloaded my phone started glitching like crazy! i ended up having to go to the Apple store and they couldn’t figure out what was wrong either they ask what had happened and i explained how it all started when i downloaded our presidents app and they looked at me with a face of sadness, they have had thousands of ppl return broke phones all bc of the viruses this app downloads to your phone. 0/10 would not recommend to anyone","isEdited":false}},{"id":"6176015851","type":"user-reviews","attributes":{"date":"2020-07-09T10:07:24Z","rating":1,"title":"Terrible.","userName":"denayaaaaaaaa","review":"I’ve never been so upset over an app it took 4 DAYS to download AND its not even cool so i waisted my time. it takes up sooooo much space for this little app that doesn't even do much. when i tell you i had the worst time i really mean it. it’s boring, un-educating, useless, and unnecessary. Apple, why did you even PASS this app to be allowed on the app store. its so TRASH and its not needed especially when its THIS BAD. i got bored within seconds of opening the app. i am dissatisfied and disappointed. DO BETTER.","isEdited":false}},{"id":"6175880456","type":"user-reviews","attributes":{"date":"2020-07-09T09:22:45Z","rating":1,"title":"Most Yuckie🤮","userName":"john stamos🥵🥵✨🔥","review":"This app is Yuckie really yuckie, I can’t believe it, it doesn’t work at all when I open it, it says we are now taking your money. And like it took my whole money and now I can’t buy robux and new Minecraft skins. This app is trash I just want robux. Totally do not recommend, ugly, yuckie app. Then soon it tracked my address and got a email saying “we are now going to use your money for robux for Barron Trump,” like what did Barron ever do wrong isn’t his dad rich. So again totally don’t recommend, it took my robux.","isEdited":false}},{"id":"6175830296","type":"user-reviews","attributes":{"date":"2020-07-09T09:06:11Z","rating":1,"title":"WORST APP EVERR","userName":"GoShox505","review":"UGH I wish I could give this app zero stars! It took 3 full days to completely download onto my phone. When I tried to delete it, trumps voice came through my phone saying “You will never delete the best app ever created. Some say it’s the best app.” Then, my lock screen was changed to the worst picture ever!! It was a picture of Trump!!!! The last and worst thing that happened was my credit card number was stolen, and 2,000 trump flags were purchased!!! I can’t believe it. DO NOT DOWNLOAD!!!!!!!!!","isEdited":false}},{"id":"6175690501","type":"user-reviews","attributes":{"date":"2020-07-09T08:18:35Z","rating":1,"title":"No, I’m homeless now","userName":"wear your masks!!","review":"I got the app to support our orange president but it took days for it to download and when it finally downloaded I started to get multiple virus on my phone. After a few days of my phone glitching this app stole all my personal data including my credit card information. They stole all my money and I couldn’t pay any of my bills so now I’m homeless in a fake pandemic that is just the “flu.” At least I don’t need a mask cause if our orange president is wearing one I won’t wear either.","isEdited":false}},{"id":"6175659663","type":"user-reviews","attributes":{"date":"2020-07-09T08:08:05Z","rating":1,"title":"Worst App Ever","userName":"bunkerboyz","review":"This app took three weeks to download, and when it finally did it crashed my phone. My screen went completely black and would only play creepy Halloween horror sounds. Then the chanting began. I could hear a male voice chanting something in Russian, and then random images started flashing without my control. Next thing I knew all the lights went out in my house and every dog on the street started howling. So yeah this app gave me a demonic infestation, DO NOT download it under any circumstances!!!!!","isEdited":false}},{"id":"6175631246","type":"user-reviews","attributes":{"date":"2020-07-09T07:57:50Z","rating":1,"title":"Terrible app!","userName":"MelanieTucker","review":"This app took several hours to download. The buttons in the app don’t work. And it asked for my mobile phone number and didn’t delete my number from it’s calling list. I haven’t figured out a way to eliminate the text messages from popping up on my phone therefore draining my battery. This app has no benefits at all. It would be better for you to light your phone on fire then to download this app. This app is a dumpster fire. Kind of like his presidency. DO NOT UNDER ANY CIRCUMSTANCE DOWNLOAD THIS APP.","isEdited":false}},{"id":"6175616344","type":"user-reviews","attributes":{"date":"2020-07-09T07:52:22Z","rating":1,"title":"WORST APP EVER","userName":"cameron5838","review":"literally took a whole day to download! once i opened the app my phone crashed and i couldn't turn it back on for hours. i tried opening the app again later and got bombarded with advertisements and viruses- completely frying my phone. i legit have to get a new one now. not only that, but all my gmail accounts that were on that phone are now full with spam emails from the trump administration. i can't believe this app is even allowed on the app store, i'm absolutely livid.","isEdited":false}}]}