{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=88800","data":[{"id":"6177916412","type":"user-reviews","attributes":{"date":"2020-07-09T19:16:47Z","isEdited":false,"review":"I opened the app only to be appalled by a disgusting image of a senile old crusty dingy old cheetoh orange monstrosity. I ✨immediately✨went into cardiac arrest and fell into my oven that was heated to 9000 degrees. The oven couldn’t handle it so it thrusted it’s self off a nearby cliff. I plummeted down 7000 feet onto a burning building. My entire body was engulfed  with flames. My charred skin ripped off as i stood up. I dragged myself out of the burning debris while my bare bloody skin dragged against the concrete, only to see a blonde scraggly wig flying through the air. After seeing that i went back into the flames. EMT arrived and i was hauled into the ambulance. They started rushing to surgery and the cart was tripped by a trump 2020 sign and i plummeted out of the hospitals window. Luckily the car broke my fall, but it started driving away. I lay there unable to move my neck. The car stopped and a was picked up and loaded onto a conveyor belt. It started moving and i saw many other packages. I was crushed down until i was shaped like a box, i was put inside a box and taped up. There was no air in it so i passed out from asphyxiation. When i woke there was scissor tearing into me by the young child opening the package. When he saw me he got so scared he threw the scissor up and ran away. The scissors landed into one of my arteries and i started bleeding out. U felt a sharp pain in my armpit and realized it was my phone. I pulled it out and went into the trump app. The image of trump made me barf all over my screen, i fought through it and wiped it off my screen. I held down on the app and then pushed the arrow in the corner. Suddenly i started to evolve out of my box shape and my skin started growing back. All of my blood started sucking back into my body and all the pain went away😌 i stood up and walked out of the little boys house all the way back to my house. My oven had magically appeared back into my kitchen and i was happy as could be. I DO NOT RECOMMEND THIS APP IF YOU DO NOT WANT THIS TO HAPPEN TO YOU!!!","userName":"ddcvbbvxxdruj","rating":1,"title":"Orange cheetoh🤢"}},{"id":"6177899388","type":"user-reviews","attributes":{"date":"2020-07-09T19:11:10Z","isEdited":false,"review":"Stupid fascist app. And poor quality! SAD!!","userName":"EatGrammar","rating":1,"title":"Down with the Fascist Military Police State"}},{"id":"6177897581","type":"user-reviews","attributes":{"date":"2020-07-09T19:10:36Z","isEdited":false,"review":"absolutely horrible made my phone crash and gave me so many virus’","userName":"122329bf","rating":1,"title":"horrible"}},{"id":"6177854709","type":"user-reviews","attributes":{"date":"2020-07-09T18:56:59Z","isEdited":false,"review":"I downloaded this in honest hopes. I wanted to support MY cheeto. Sadly, as soon as i pressed download, i realized my mistake. It was fat too late to reverse it. As my phone began downloading the app, it also began erasing important documents, contacts, pictures, and txts off my phone. At such a rapid rate, i couldnt do anything to stop it. All i could do was watch them go down the drain as regretted my recent decisions. Feeling rarher defenseless, and have literally no other app, or web browser on my phone once Trumps app finished downloading, i decided i had not much else to loose. I opened the app. There enlies my second huge mistake.  I opened to app to find it scrambled. Almost like the app was never officially finished. No matter, i kept going. It asked for my name, number, social security, and address. There was no way id put all of that in, so i just put my name and number hoping it would get me past the sign up screen and into the vast nothingness of Trump's app. Ooh and it worked too! However it was not a vast nothingness i was met with, instead, i was met with spam calls and texts almost instantly. I looked at some of my texts, and to my horror realized it was Trump himself. Demanding i finish setting up my personal info, and to vote TRUMP 2020 or else i'd suffer the consequences. I refused, i revolted, i deleted the app. However it is now too late for me. I am hiding. I hear him, knocking at my door, munching away at his Mcdonald's burger. My nostrils are filled the smell of soggy cheetos, fake beef, and one hella sweaty man. TAKE THIS AS A WARNING. IDK HOW MUCH TIME I HAVE LEFT. DONT DOWNLOAD. DONT GIVE INTO HIS WISHES.","userName":"sadipair1227","rating":1,"title":"DANGEROUS!!!!"}},{"id":"6177847153","type":"user-reviews","attributes":{"date":"2020-07-09T18:54:46Z","isEdited":false,"review":"This app is horrible and I hate it😾","userName":"Tickytoky😼","rating":1,"title":"Terrible"}},{"id":"6177844649","type":"user-reviews","attributes":{"date":"2020-07-09T18:54:00Z","isEdited":false,"review":"I just wanted to give it one star","userName":"gotdatpot","rating":1,"title":"Garbage🤮🤮🤮"}},{"id":"6177818938","type":"user-reviews","attributes":{"date":"2020-07-09T18:46:24Z","isEdited":false,"review":"He got a shrimp how u gon be president and have a shrimp","userName":"boigsters","rating":1,"title":"This low key trash"}},{"id":"6177794270","type":"user-reviews","attributes":{"date":"2020-07-09T18:39:05Z","isEdited":false,"review":"Bad","userName":"babyfacesylvia","rating":1,"title":"He is a horrible man rapes and everything 😒⚠️"}},{"id":"6177788599","type":"user-reviews","attributes":{"date":"2020-07-09T18:37:22Z","isEdited":false,"review":"I downloaded this app and immediately contracted chlamydia and herpes I’m not joking","userName":"sandwich meat 290","rating":1,"title":"Stds"}},{"id":"6177759581","type":"user-reviews","attributes":{"date":"2020-07-09T18:28:36Z","isEdited":false,"review":"this app started downloading all of my information😖","userName":"Bet-Birai","rating":1,"title":"trash app doesn’t work"}}]}