{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=100800","data":[{"id":"6174742738","type":"user-reviews","attributes":{"userName":"trump no more","date":"2020-07-09T02:49:54Z","review":"i hates this so negative and disrespectful i hates this so much should be deleted.","rating":1,"isEdited":false,"title":"terrible"}},{"id":"6174732314","type":"user-reviews","attributes":{"userName":"ashley vian","date":"2020-07-09T02:46:43Z","review":"Trump is diminishes all identities expect white men. This app promotes white supremacy. Trump is no good.","rating":1,"isEdited":false,"title":"WORST APP"}},{"id":"6174729532","type":"user-reviews","attributes":{"userName":"margaretrmm","date":"2020-07-09T02:45:52Z","review":"i dont like it","rating":1,"isEdited":false,"title":"Worst App Ever!!"}},{"id":"6174722988","type":"user-reviews","attributes":{"userName":"skultist","date":"2020-07-09T02:43:56Z","review":"I open app and it say me racist 😏😏. pls stop!!","rating":1,"isEdited":false,"title":"Racist app"}},{"id":"6174719790","type":"user-reviews","attributes":{"userName":"unknownchickenbananas","date":"2020-07-09T02:42:56Z","review":"This app is the worst. Take it down App Store!!","rating":1,"isEdited":false,"title":"TAKE THE APP DOWN"}},{"id":"6174716354","type":"user-reviews","attributes":{"userName":"jdkdjdbdhfk","date":"2020-07-09T02:41:53Z","review":"Obama for president","rating":1,"isEdited":false,"title":"Don’t get"}},{"id":"6174715561","type":"user-reviews","attributes":{"userName":"user20304050","date":"2020-07-09T02:41:39Z","review":"This app is almost as garbage as his spray tan and toupee!","rating":1,"isEdited":false,"title":"worst app ever!"}},{"id":"6174703138","type":"user-reviews","attributes":{"userName":"amados6969","date":"2020-07-09T02:37:54Z","review":"interestingly my identity was stolen and i received a speeding ticket directly after downloading. not a coincidence .","rating":1,"isEdited":false,"title":"literal garbage"}},{"id":"6174702337","type":"user-reviews","attributes":{"userName":"Abigail Reeves","date":"2020-07-09T02:37:40Z","review":"this app ruined my life. when you download it it begins to track you location, which allows them to sell your information. my information was sold to the worst of the worst, which was only the beginning of a series of unfortunate events. \n1. my car was tampered with. i woke up one morning to go to church (being a christian, of course) only to find that my mirrors had been turned. this seems minor, but caused me to be late! this has continued to happen every single night, meaning i’m always late.\n2. i lost my job. after having to stop and fix my mirrors every morning, i gained a reputation at work. after several late mornings, my boss called me into his office. i was fired.\n3. i lost my wife. no woman wants a jobless and depressed man. one thing led to another and i’m signing divorce papers on a gloomy sunday morning.\n4. i lost my home and children. my wife took everything and left me to the streets. my only possessions were my dog and two breath mints that i had in my pocket. i became homeless.\nat this point i was living on the streets. i’m grateful that my family was not hurt by the people tampering with my car. my wife may have left me, but i loved her. i found things to be grateful for, i found happiness.\nand then they took my dog.\nthese muddling thieves took everything from me through to their petty crimes, but this one was personal. this one cut deep. \ni lost all of my happiness then. i lost my will to live.\nthis app seems to be a great way to follow up with the campaign of our fearless leader, but it’s a foil.  it’s a way to steal your information and sell it for profit. \nplease, save yourself. don’t put yourself through what i did.","rating":1,"isEdited":false,"title":"Ruined My Life"}},{"id":"6174683797","type":"user-reviews","attributes":{"userName":"jEsSlYnNn","date":"2020-07-09T02:32:08Z","review":"it’s never to late to delete this app 🙈🥰✨❤️","rating":1,"isEdited":false,"title":"take my review into consideration <3"}}]}