{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=122370","data":[{"id":"1439818784","type":"user-reviews","attributes":{"review":"Tried to share a link to a FB political group but it wanted me to post on my personal page. \n\nWe compartmentalize friends from both sides of the isle and have more subtle words for influencing our liberal friends.","isEdited":false,"title":"Needs a better share link feature","date":"2016-08-27T01:51:49Z","rating":4,"userName":"TopperNashville"}},{"id":"1478105799","type":"user-reviews","attributes":{"review":"Basic info and shows what he and his campaign are up to. Good app. Too bad liberals are using the review page to post their typical hate rather than rating the app. Get your heads out of the sand libbies and start acting like Americans or the very least, adults.","isEdited":false,"title":"God app","date":"2016-11-04T01:08:31Z","rating":5,"userName":"Leftin"}},{"id":"1465664049","type":"user-reviews","attributes":{"review":"Of course the name resounds for Trump supporters.  This app makes it fun to keep up with the campaign. I had wondered where headquarters in my town was and sure enough there is a locator.  Love the updates and will be using this app daily through the rest of the campaign. #MAGA!","isEdited":false,"title":"America First!","date":"2016-10-12T22:25:18Z","rating":5,"userName":"Carpools"}},{"id":"1452686432","type":"user-reviews","attributes":{"review":"Through my wife's encouragement I downloaded the app. I've found it to be a great way to stay informed, receive and share accurate Trump news/updates, collect poll data and get others engaged in this election.","isEdited":false,"title":"Great App","date":"2016-09-20T04:36:04Z","rating":5,"userName":"MarkLevenda"}},{"id":"1460983623","type":"user-reviews","attributes":{"review":"Team Trump, this app makes me feel part of the Trump Train even though I can't travel to the Trump events this fall.  No worries, though, the voting polls are just down the street in our little fishing village, and I'm voting Trump!","isEdited":false,"title":"Thank you for this engaging app!","date":"2016-10-04T16:41:33Z","rating":5,"userName":"arcticpei"}},{"id":"1440431247","type":"user-reviews","attributes":{"review":"So nice to just tap the app, and get newsfeed and instant updates. Without this app...you have to watch the Clinton News Network and all the other far left news outlets and filter out all the bias.","isEdited":false,"title":"Love checking this app!!!","date":"2016-08-28T04:29:33Z","rating":5,"userName":"Shawn&Carman"}},{"id":"1453439840","type":"user-reviews","attributes":{"review":"I've subscribed to everything Trump. This is a top notch app. There are activities for you to do as well such as crossword puzzles, and surveys. Nice way to keep involved with the campaign by communicating with the rest of other Trump supporters","isEdited":false,"title":"Make America great again","date":"2016-09-21T13:49:00Z","rating":5,"userName":"Pazgazer"}},{"id":"1479975443","type":"user-reviews","attributes":{"review":"As a gay male in California I fully support Donald Trump to be my President of the US. Half of the country doesn't pay into taxes due to the fact their is no jobs. We need more companies here! It'll greatly reduce the millions of Americans living off welfare and EBT.","isEdited":false,"title":"Impressive, Most Impressive","date":"2016-11-07T00:36:01Z","rating":5,"userName":"MysitcOrchid"}},{"id":"1441979717","type":"user-reviews","attributes":{"review":"This app will help you stay connected to the campaign. The media won't tell you the whole story. Get the true info on the campaign in this app. We are gonna make it happen folks! Whether Hillary likes it or not!","isEdited":false,"title":"Trump! Trump! Trump!","date":"2016-08-31T00:49:23Z","rating":5,"userName":"Bieberenia"}},{"id":"1477173819","type":"user-reviews","attributes":{"review":"I love the app!!! So much more organized and simple to use compared to the one Hillary is running. It makes sense though cause she probably made it herself because she has no support. She has lies on her app to just like her campaign.","isEdited":false,"title":"Trump Pence","date":"2016-11-02T08:15:35Z","rating":5,"userName":"Bodeji"}}]}