{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29340","data":[{"id":"6177784515","type":"user-reviews","attributes":{"title":"WARNING","review":"Don’t dowload this app my phone froze and I couldn’t do anything but thats not that worse part when I tried getting in the app i heard my dog barking when I went outside he was floating and ants were eating him while my cow started mooing and i don’t have a cow.","rating":1,"date":"2020-07-09T18:36:08Z","isEdited":false,"userName":"THIS APP WILL KILL YOU"}},{"id":"6177769552","type":"user-reviews","attributes":{"title":"Does not even deserve a star","review":"Hello people. I recently downloaded the app in order to see what it is about. It has a very bad quality impact on everyone. My flowers do not let me sing to them anymore and they are very upset about it. Hope you are happy Trump","rating":1,"date":"2020-07-09T18:31:36Z","isEdited":false,"userName":"chicken empanadas"}},{"id":"6177765186","type":"user-reviews","attributes":{"title":"Terrible! Very bad!","review":"Wow this app is one of the worst I’ve ever seen! And I know apps! I really do! People tell me everyday that I’m one of the best at reviewing apps and this one is just sad. It really is. It’s ugly. It’s terrible. I’ve never seen anything like it. Don’t download this app if you know what’s good for you!","rating":1,"date":"2020-07-09T18:30:18Z","isEdited":false,"userName":"e_emilyj"}},{"id":"6177737870","type":"user-reviews","attributes":{"title":"Trump is deserves to go to jail","review":"He has broken the lawSeveral times he doesn’t deserve to have an app based on him he’s an ungrateful human beingWho deserves nothing the applestore should take down this app because it was very crappy and glitchy and I did not understand it whatsoever","rating":1,"date":"2020-07-09T18:22:03Z","isEdited":false,"userName":"lolvereejej"}},{"id":"6177736388","type":"user-reviews","attributes":{"title":"no💜","review":"I was super excited to give trump soooo much support 💖😌 & all my money (because he is not a millionaire already xo👨‍🎤) but this app just kept crashing & it seemed to invade my privacy👙by CONSTANTLY sending me notifications!!! NOT TO MENTION the app is supporting a racist🗣🗣🗣🗣🗣🗣🗣! So no this app is no good & will ruin your phone🚨🚨","rating":1,"date":"2020-07-09T18:21:36Z","isEdited":false,"userName":"Wagnes5566"}},{"id":"6177660098","type":"user-reviews","attributes":{"title":"Trash🤢🤮🤮🤮🤮🤮","review":"This app is the worst app in the world. They took my information off my phone. Scammed me into flying to Africa and didn’t show up leaving me with nothing. Then once I was rescued and came back he tried to press charges for ATTEMPTED MURDER!! Which I should be charging him for so NEVER get this app.","rating":1,"date":"2020-07-09T17:58:07Z","isEdited":false,"userName":"LaYvThomas"}},{"id":"6177648771","type":"user-reviews","attributes":{"title":"I HATE TRUMP","review":"SO BASICALLY MY DOG LOVED TRUMP AND HE WOULD EVEN TRY AND BUY TICKETS TO HIS CAMPAIGNS OR WHATEVER SO HE DECIDED TO DOWNLOAD THIS APP TO HIS HIS PLANS BUT THEN HE SEARCHED DONALD DUMP UP AND THERE IT WAS HE SAW IT THAT MR DUMP IS RACIST A STALE CHEETO SOME MIGHT SAY IT WAS A TAN GONE WRONG THEN HE PUTS MEXICAN AND HISPANICS KIDS IN CAGES AND KEEPS TELLING BLACK PEOPLE TO GO BACK TO AFRICA FIRST OF ALL WHITE PEOPLE AREN’T EVEN A. RACE TO BEGIN WITH THEY  WE’RE EVOLVED BY THIS FILIPINOS AND PLUS IF IT WASNT FOR SLAVES THEY WOULDN’T BE ABLE TO SAY MAKE AMERICA GREAT AGAIN WE PICKED THEIR COTTON GREW THERE CROPS OUR BLACK ANCESTORS DID THAT NOT THE WHITES SO THERE FOR TO ALL THEY RACIST WHITE PEOPLE AND TRUMP BTW THIS APP IS HORRIBLE IT KEPT MESSING UP MY PHONE AND TOOK UP A WHOLE LOT OF STORAGE AND PLUS RATE THIS APP 1 STAR AND O U ALMOST FORGOT TO ALL THE RACIST WHITE PEOPLE KISS MY BIG BLACK BUTTTTTTT BYE NOW TOOTLES","rating":1,"date":"2020-07-09T17:54:26Z","isEdited":false,"userName":"TRUMP IS A STALE CHEETO"}},{"id":"6177643066","type":"user-reviews","attributes":{"title":"eewie","review":"absolutely disgusting. i got the app because I wanted to see what was up and every time I got a message I went in to a coma from seeing a fat oompa loompa which apparently is our president currently. so unless you would like to go into a coma I do not recommend","rating":1,"date":"2020-07-09T17:52:38Z","isEdited":false,"userName":"RWP1969z"}},{"id":"6177641299","type":"user-reviews","attributes":{"title":"This app made me die😡🤬😡","review":"I was getting this app but it took a few years to download and now i’m 92 years old, then when i opened it I was forced to go blind from all of the whiteness on the app and then my bones broke from the everything and umm yeah then i died from internal bleeding","rating":1,"date":"2020-07-09T17:52:04Z","isEdited":false,"userName":"WallCleaner69"}},{"id":"6177634248","type":"user-reviews","attributes":{"title":"The downfall of the App Store","review":"Worst app in the App Store. The App Store is downgrading with this app if they keep nobody would like to buy in the App Store because of it. This app is the worst app I’ve ever been in so much racism in it and the App Store is with nah nobody gonna wanna be here because of it and because the App Store is supporting it 😡.","rating":1,"date":"2020-07-09T17:49:48Z","isEdited":false,"userName":"emily generation Z"}}]}