{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33740","data":[{"id":"6179112071","type":"user-reviews","attributes":{"date":"2020-07-10T02:36:26Z","rating":1,"isEdited":false,"userName":"Rhia22101","review":"I think there’s some sort of glitch with the app because every time I open it my phone turns black and starts blaring some sort of high pitched ringing sound? Dunno, it’s kind of suspicious, but definitely don’t download it. Trust me.","title":"DO NOT DOWNLOAD"}},{"id":"6179109688","type":"user-reviews","attributes":{"date":"2020-07-10T02:35:34Z","rating":1,"isEdited":false,"userName":"Justin4855","review":"I downloaded this app yesterday day and I felt like someone was watching me because my phone kept taking pictures and I wasn’t even on the photos app I think this app some how hacked Into my phone","title":"🤢🤢🤢"}},{"id":"6179095697","type":"user-reviews","attributes":{"date":"2020-07-10T02:30:21Z","rating":1,"isEdited":false,"userName":"Geezythagreat","review":"I had this for a year now and it tried to steal my info so don't download this unless you want to have your info stolen and sold it really is a very bad app cause it wont let you do anything for me","title":"Read this now!!"}},{"id":"6179099461","type":"user-reviews","attributes":{"date":"2020-07-10T02:31:47Z","rating":5,"isEdited":false,"userName":"Doctor doom88","review":"Besides the fake reviews that trash this app, it is a solid app, with great web design and features!","title":"BEST APP EVER!"}},{"id":"6179077645","type":"user-reviews","attributes":{"date":"2020-07-10T02:23:48Z","rating":1,"isEdited":false,"userName":"DarthClaire","review":"This app is terrible. Every time it updates, it completely goes against something that was promised in a previous update. Inconsistent and unreliable","title":"Updates Keep Contradicting Past Info"}},{"id":"6179064297","type":"user-reviews","attributes":{"date":"2020-07-10T02:18:56Z","rating":1,"isEdited":false,"userName":"just concerned and confused","review":"This app is absolutely awful. Why should an app supporting a xenophobic, homophobic, transphobic, misogynistic, discriminatory, sexist, and racist person even exist? Ridiculous. I have no idea who came up with that idea. Also this app glitches all the time. Such bad quality.","title":"BAD APP ALERT"}},{"id":"6179060330","type":"user-reviews","attributes":{"date":"2020-07-10T02:17:29Z","rating":1,"isEdited":false,"userName":"Gisselle Sanchez 💖💖💖","review":"As a TrUmP sUpPoRtOr I was looking for a better way to stay updated. And this app was horrendous! It hacked into all of my things. Would not recommend. If you want real updates go on TikTok. That would help a lot more than this app! 👿","title":"Horrible"}},{"id":"6179033575","type":"user-reviews","attributes":{"date":"2020-07-10T02:07:33Z","rating":1,"isEdited":false,"userName":"mad girl 69","review":"i am very disappointed! this “app” called my child a racial slur and then beat the crap out of me. then my phone exploded from the tremendous amount of storage that this so called app takes up on my cellular device. do NOT recommend","title":"HORRIBLE !!"}},{"id":"6179011277","type":"user-reviews","attributes":{"date":"2020-07-10T01:59:31Z","rating":1,"isEdited":false,"userName":"Kdizzle1303","review":"IF YOU VALUE YOUR LOIFE... DON’T DOWNLOAD THIS APP MATE. If I could give this app zero out of five stars I would, but unfortunately that is not an option. This is a garbage app that clearly doesn’t pass the vibe check. This app literally slower than internet explorer. Don’t download it periodt.","title":"STAY AWAY FROM THIS APP"}},{"id":"6178990985","type":"user-reviews","attributes":{"date":"2020-07-10T01:52:00Z","rating":1,"isEdited":false,"userName":"red.white.blue.","review":"I had to delete the app because it was slow and took up more space on my phone than advertised... don’t waste your time with it","title":"I wish this app wasn’t so slow"}}]}