{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=50740","data":[{"id":"6172619797","type":"user-reviews","attributes":{"title":"BAD‼️","userName":"jakejjejsi3d","rating":1,"review":"this app is garbage I bought a lot of merch and none of it ever showed up what a rip off I hope this app gets taken off the App Store. Trump is a greedy man that likes to scam people. AND HE BETTER NOT GET RID OF TIKTOK I HOPE HE KNOWS GEN Z IS COMING FOR YOU😈😈👩🏽‍🦲","isEdited":false,"date":"2020-07-08T15:09:28Z"}},{"id":"6172609745","type":"user-reviews","attributes":{"title":"black lives matter","userName":"manny is president","rating":1,"review":"this is the worst app ever. for many reasons. it is very slow and glitchy. it’s difficult to understand how to use it. also i don’t understand why anyone would want this app. trump is a horrible person. he’s racist, misogynistic, homophobic, xenophobic, and many more bad term. he is uneducated, a rapist, and a horrible, horrible person.","isEdited":false,"date":"2020-07-08T15:06:40Z"}},{"id":"6172556194","type":"user-reviews","attributes":{"title":"Ok I’m ranting","userName":"dncbdbd","rating":1,"review":"I swear if you mess with tiktok you career is ended  no one but boomers like your racist booty hole what Else do you want us to do in quarantine like tiktok is all we have do you want us to break your rules","isEdited":false,"date":"2020-07-08T14:51:53Z"}},{"id":"6172555725","type":"user-reviews","attributes":{"title":"Trash","userName":"kid with game","rating":1,"review":"Yeah uhhh this app is about trump so I already don’t like it it’s trash it glitches I only bought because it was on a tiktok but their apparently shutting that down so  yea one star","isEdited":false,"date":"2020-07-08T14:51:45Z"}},{"id":"6172518059","type":"user-reviews","attributes":{"title":"overall, really bad","userName":"RachieM1010","rating":1,"review":"i wanted to download this app to decide who to vote for in the upcoming election as it is the first time i will be able to vote. however, the app took forever to download and when i eventually opened it, it kept crashing and i was not able to use it. i do not recommend it at all and will be voting for biden in the 2020 election","isEdited":false,"date":"2020-07-08T14:41:08Z"}},{"id":"6172501635","type":"user-reviews","attributes":{"title":"DO NOT BUY THIS APP","userName":"DillonGoodwill","rating":1,"review":"I signed up for the messages and was sent pictures of the presidents shrimp multiple times. When i say shrimp it was maybe an inch long. Do not buy this app!","isEdited":false,"date":"2020-07-08T14:36:29Z"}},{"id":"6172490321","type":"user-reviews","attributes":{"title":"To Trump","userName":"queen.mariah","rating":1,"review":"Let’s start of with that he hate black people I don’t support people who don’t support me he is the reason all these black people are dying today","isEdited":false,"date":"2020-07-08T14:33:21Z"}},{"id":"6172460995","type":"user-reviews","attributes":{"title":"WORST APP EVERRRRRR","userName":"lilysupset","rating":1,"review":"Not user friendly l, it’s incredibly hard to understand what’s going on, and some of these ideas are just outrageous!! And inhumane!! It’s honestly terrifying that people are in favor of these ideas!","isEdited":false,"date":"2020-07-08T14:25:28Z"}},{"id":"6172443728","type":"user-reviews","attributes":{"title":"Horrible","userName":"Squirrel lover 8667","rating":1,"review":"This app keeps trying to take away my rights and is routinely working with Russia. There is fascism all over this app and it is incredibly frustrating and concerning. Hated it","isEdited":false,"date":"2020-07-08T14:20:49Z"}},{"id":"6172436911","type":"user-reviews","attributes":{"title":"gave my phone a virus","userName":"thatbrattskyler","rating":1,"review":"Not only does this app have tons of malfunctions, it gave my phone some sort of virus. I can barely use it anymore. Thanks a lot.","isEdited":false,"date":"2020-07-08T14:18:58Z"}}]}