{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=135010","data":[{"id":"6172240700","type":"user-reviews","attributes":{"userName":"Karenp29","isEdited":false,"title":"Trump","review":"shdjhdhdhdhd","date":"2020-07-08T13:25:11Z","rating":1}},{"id":"6172239914","type":"user-reviews","attributes":{"userName":"read this okay?","isEdited":false,"title":"it ✨sucks✨","review":"idk who would like this app and if i could i would rate it 0 stars😻🧚🏼‍♀️❤️🙈👅🧸","date":"2020-07-08T13:24:59Z","rating":1}},{"id":"6172236790","type":"user-reviews","attributes":{"userName":"Valerieodaly","isEdited":false,"title":"No tee hee.hor horrible.","review":"When I first got the app, it kicked me out.i tried to get in again, kicked me out. Sooooo this app is useless.never want too use it again in my life.this app makes me throw up.NO ONE buy this app.its worthless.btw black lives matter. Thank you and good bye. JUSGWJD BEJEHEUWBHSUWHWJWJSJWJHEHWHWHEHEHEJJEJEJEJEJEJEJEJEJEJEJEJEJEJEJEEJNENDNDNDNRNFNFNDNRNFNNRDJJDNFNFNFNFNRNRNRNRNRNRNRNRNRNRNRNRNRNRNRNRNRNNRNRNRNRNNapp is disgustingJSJEJEJEJEJEJEJJEKEKEKEKEKKEKEKEKEKE","date":"2020-07-08T13:24:06Z","rating":1}},{"id":"6172233789","type":"user-reviews","attributes":{"userName":"man who watches you","isEdited":false,"title":"This app gave me hot Cheeto skin","review":"When I downloaded this awful app I suddenly had hot Cheeto skin, like the president. Whatever his name is, hot Cheeto man? Probably. But anyways I give this app a one star. I would have gave it zero, I guess it’s just pity points. I hope you know, you should really delete this app. Because this app causes hot Cheeto cancer, good day! 🧚🏾‍♂️✨🧚🏼‍♀️\n\nShawty had them Apple Bottom Jeans (jeans)\nBoots with the fur (with the fur)\nThe whole club was lookin' at her\nShe hit the floor (she hit the floor)\nNext thing you know\nShawty got low low low low low low low low\nThem baggy sweat pants and the Reebok's with the straps (the straps)\nShe turned around and gave that big booty a smack (a smack)\nShe hit the floor\nNext thing you know\nShawty got low low low low low low low low\nI ain't never seen nothin' that'll make me go, this crazy, all night spendin' my dough\nHad a million dollar vibe and a bottle to go\nDem birthday cakes, they stole the show\nSo sexual, she was flexible\nProfessional, drinkin' X and O\nHold up wait a minute, do I see what I think I whoa\nDid I think I seen shawty get low\nAin't the same when it's up that close\nMake it rain, I'm makin' it snow\nWork the pole, I got the bank roll\nI'mma say that I prefer them no clothes\nI'm into that, I love women exposed\nShe threw it back at me, I gave her more\nCash ain't a problem, I know where it goes\nShawty had them Apple Bottom Jeans (jeans)\nBoots with the fur (with the fur)\nThe whole club was lookin' at her\nShe hit the floor (she hit the floor)\nNext thing you know\nShawty got low low low low low low low low\nThem baggy sweat pants and the Reebok's with the straps (the straps)\nShe turned around and gave that big booty a smack (a smack)\nShe hit the floor\nNext thing you know\nShawty got low low low low low low low low\nHey\nShawty what I gotta do to get you home\nMy jeans full of gwap and they ready for stones\nCadillacs Maybachs for the sexy grown\nPatrone on the rocks that'll make you moan\nOne stack (come on)\nTwo stacks (come on)\nThree stacks (come on, now that's three grand)\nWhat you think I'm playin' baby girl\nI'm the man, I'll ain't dealin' rubber bands\nThat's what I told her, her legs on my shoulder\nI knew it was ova, that henny and Cola got me like a Soldier\nShe ready for Rover, I couldn't control her\nSo lucky oh me, I was just like a clover\nshawty was hot like a toaster\nSorry but I had to fold her, like a pornography poster she showed her\nShawty had them Apple Bottom Jeans (jeans)\nBoots with the fur (with the fur)\nThe whole club was lookin' at her\nShe hit the floor (she hit the floor)\nNext thing you know\nShawty got low low low low low low low low\nThem baggy sweat pants and the Reebok's with the straps (the straps)\nShe turned around and gave that big booty a smack (a smack)\nShe hit the floor\nNext thing you know\nShawty got low low low low low low low low\nWhoa shawty\nYeah she was worth the money\nLil mama took my cash, and I ain't want it back\nThe way she bit that rag, got her them paper stacks\nTattoo above her crack, I had to handle that\nI was on it, sexy woman, let me shownin'\nThey be want it two in the mornin'\nI'm zonin' in them rosay bottles foamin'\nShe wouldn't stop, made it drop\nshawty did that pop and lock, had to break her off that gwap\nGal was fly just like my glock\nShawty had them Apple Bottom Jeans (jeans)\nBoots with the fur (with the fur)\nThe whole club was lookin' at her\nShe hit the floor (she hit the floor)\nNext thing you know\nShawty got low low low low low low low low\nThem baggy sweat pants and the Reebok's with the straps (the straps)\nShe turned around and gave that big booty a smack (a smack)\nShe hit the floor\nNext thing you know\nShawty got low low low low low low low low","date":"2020-07-08T13:23:17Z","rating":1}},{"id":"6172236614","type":"user-reviews","attributes":{"userName":"Mel-Kardashian","isEdited":false,"title":"Annoying","review":"First off I open up this app and it asks me for my number? I don’t want to give out that info to whatever government tech worker runs the app for the President. But ok, so next it asks me for my name and zip code.... NOO! That was extremely annoying and I didn’t feel comfortable giving that out to an app. I’ll give it another try but than that’s it. Hope this was helpful for anyone\nWhere a mask\nAnd stay 6 feet if y can\nAnd always wash hands and keep up hiGene","date":"2020-07-08T13:24:03Z","rating":2}},{"id":"6172233315","type":"user-reviews","attributes":{"userName":"njGuy68","isEdited":false,"title":"The worst app","review":"Why i downloaded this was to only give a bad review bc i want my fav app(tiktok)not to ge banned by and ornage so im givkng a bad review to keep a app that keeps my memeories so if this ornage bans it this is why i want this app off the app store bc who in the hell wanted to get thos that has trump i respect trump supporters but i ain't one.now I want this app off the App Store and if it it’s not I will make a whole other complain😌","date":"2020-07-08T13:23:09Z","rating":1}},{"id":"6172231474","type":"user-reviews","attributes":{"userName":"hfdxfgrcvgvggg","isEdited":false,"title":"Hhdtgfdhgghfdfgdhdgfh","review":"Worst app ever","date":"2020-07-08T13:22:39Z","rating":1}},{"id":"6172228961","type":"user-reviews","attributes":{"userName":"kabdd","isEdited":false,"title":"Bad vibes","review":"first thing this app took forever to download and i have the best wifi. also the app is age restricted 🤚🏼most of trumps support comes from kids that can’t think for themselves yet so he’s blocking out all of his support next the app is completely useless there’s nothing on there that’s worth it with they Mr.Cheeto is in surprised he didn’t make the app cost money considering how terrible he’s rally went me and my 13 family members got tickets but couldn’t make it we had to walk our pet sunflower 🌻 but this app take way to much and is a waste of time much like Trump himself","date":"2020-07-08T13:21:57Z","rating":1}},{"id":"6172228535","type":"user-reviews","attributes":{"userName":"Xxomq_kay3leeXx","isEdited":false,"title":"Orange 🍊 face","review":"SOOO my first reason is I heard dat Orange 🍊trynna take roblox down like no if he does I swear ima go offffff and my second reason is ORANGE HEAD trynna take down TikTok NOOOOO like NOOO- And don’t even get me started how bad this app is: The minute I got in the app it glitches like what? And it always glitches to the way I had to delete like thank goodness 😅 I didn’t even want dat app anyway ;-; you know what FIX. YO. APP. ORANGE 🍊 FACE! You know what lemme send this and leave","date":"2020-07-08T13:21:50Z","rating":1}},{"id":"6172226184","type":"user-reviews","attributes":{"userName":"j let me in","isEdited":false,"title":"THE APP PUNCHED MY DEAD GRANDMA😭","review":"the app had sum how came on my phone and i didn’t notice it cuz it was hiding liek a lil puss puss n then outta nowhere IT GREW LEGS N PUNCHED MY GRANDMA( she was in the sink washing) BUT JN HER COOTER😳😭😭 NOT RECOMMENDED( unless u wanna get an uppercut in ur cooch🤦‍♀️🧚‍♂️✨)","date":"2020-07-08T13:21:10Z","rating":1}}]}