{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22690","data":[{"id":"6053072202","type":"user-reviews","attributes":{"date":"2020-06-09T03:02:32Z","isEdited":false,"userName":"diamondcall03","rating":1,"review":"This is by far the worst app I have ever had in my whole life. Do not I repeat do not get this app!!!! It gave my phone a virus!!! I’m very very upset about this. It said that it would help me but noooo it did the opposite of help. It has ruined my entire life.!! I recommend this app to my grandma and her phone battery got drained smh","title":"Worst app ever it killed my grandma"}},{"id":"6179167126","type":"user-reviews","attributes":{"date":"2020-07-10T02:56:50Z","isEdited":false,"userName":"Hdghdgssfvcfbccv","rating":1,"review":"I wanted to see the wonderful things president trump was doing, weary of the fact that all the comments seem so negative. I was so sad to find out that it was in fact true and my information has officially been sold to a cult. It’s called #trump2020 and it must be stopped. Settle for Biden2020.","title":"sold my information to a CULT"}},{"id":"6179074441","type":"user-reviews","attributes":{"date":"2020-07-10T02:22:35Z","isEdited":false,"userName":"Calleigh.","rating":1,"review":"Do not with this app. It literally hacked everything I own. My refrigerator started running so I had to go and catch it, my microwave messed with the radio waves and started playing Panic! At The Disco. Not to mention, my cat with half an Ai brain stood on its back legs and did the Macarena. The only good thing is my Siri refers to me as “My Naughty Little Rope Bunny” now. One star.","title":"One star."}},{"id":"6179069595","type":"user-reviews","attributes":{"date":"2020-07-10T02:20:55Z","isEdited":false,"userName":"Tanu Darling","rating":1,"review":"Initially I got this app to support Trump for 2020, but I am dissatisfied. Once I opened the app it started to crash, and it took forever to download! After I had the app for a couple of days, foreigners started calling from all over the world and asking for social security numbers. Overall don’t get this app.","title":"Awful App"}},{"id":"6179064243","type":"user-reviews","attributes":{"date":"2020-07-10T02:18:55Z","isEdited":false,"userName":"Awesomesause person","rating":1,"review":"i downloaded this app to support the old rotting orange with dementia for president 2020❤️✨ however, it  hacked my phone, and stole ALL of my information and the app itself was poorly organized and it tried to fill my head with false information and terrible fake news. 10/10 would not recommend","title":"DONT DOWNLOAD THIS APP"}},{"id":"6179002319","type":"user-reviews","attributes":{"date":"2020-07-10T01:56:12Z","isEdited":false,"userName":"EvilPiplup","rating":1,"review":"As Simon Cowell once said, “It’s a no from me.” and I stand by that. This app also made my brain cells disintegrate and I’m sure it happened to others. The only people that would willingly download this app is his flock of close minded sheep. If I could rate this a zero I would, but a one is close enough.","title":"Horrible and a waste of space"}},{"id":"6178971544","type":"user-reviews","attributes":{"date":"2020-07-10T01:44:57Z","isEdited":false,"userName":"Donald \"Jenius\" Trump","rating":1,"review":"I recently downloaded this app to keep up with the presidential race but when I did a picture of a hideous wanna be dictator popped up asking for my mobile phone number, obviously to try and then me into a Chinese communist and steal my freedom. I later realized that what I had seen was just Donald Trump and I became even more terrified.","title":"DON’T DOWNLOAD"}},{"id":"6178970088","type":"user-reviews","attributes":{"date":"2020-07-10T01:44:23Z","isEdited":false,"userName":"cdizzleshizzle","rating":1,"review":"I’m constantly getting push notifications asking for donations, literally two or three every 10 minutes. It’s a little much. I’m all for supporting my president, but a few donations is all I can afford. They want to push you to donate more with this app.","title":"Always asking for money"}},{"id":"6178957611","type":"user-reviews","attributes":{"date":"2020-07-10T01:39:52Z","isEdited":false,"userName":"Kyanari2222222222","rating":1,"review":"I can’t believe how bad this was. How did this app get past production? It took FOREVER to download and when it finally did, it crashed my phone. It’s hard to navigate and I tried to get the notifications to go off and it kept spamming my phone. Literally the worst app ever. I’m so disappointed.","title":"Worst App"}},{"id":"6178879522","type":"user-reviews","attributes":{"date":"2020-07-10T01:11:11Z","isEdited":false,"userName":"nottrump2020BLM","rating":1,"review":"Took a whole week to download and then when I could finally open the phone it gave my phone a virus that caused it to shutdown for a whole month. When it finally came back on my phone started saying horrible things and Siri kept saying All Lives Matter. DON’T DOWNLOAD!!!","title":"Worst app ever"}}]}