{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=41000","data":[{"id":"6136034243","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Really Bad!!!","review":"I was downloading the app so I could stay in touch with what the president is up to and I opened the app to see a nude of our president!!!! I was u could unsee it and makes me sick thinking about it. Don’t download unless your a pervert!","userName":"Helping tthe team","date":"2020-06-29T13:52:00Z"}},{"id":"6135697337","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"i couldn’t believe it!!!","review":"earlier this morning i had ventured outside to give my grass the well needed cut it deserved. natural i cut it with scissors bc detail is EVERYTHING! in the midst of my cutting my scissors broke😭 i was in utter disbelief bc they were the new cut the crap break yo mamas back 3000s. AND I INVESTED ALL MY BITCOIN IN THEM. SUCH A SHAME😔","userName":"Vegan😊","date":"2020-06-29T12:16:30Z"}},{"id":"6134771205","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"worst app i’ve ever used","review":"it has made me feel EXTREMELY unsafe. and I know that all of the other reviews can agree with me. I hope no one gets this app as it has ruined my life and has made me terrified. please listen and DO NOT GET THIS APP","userName":"nsmgirl101","date":"2020-06-29T06:48:50Z"}},{"id":"6134055428","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"very very traumatizing","review":"I was devastated when i got this app everything was white washed followed south xenophobia and white supremacy o nooooo i have suffered too much while here i would not recommend a single thing coming from this cheeto \n\n#riptrump","userName":"nickandlancermarried","date":"2020-06-29T01:57:05Z"}},{"id":"6134766172","type":"user-reviews","attributes":{"isEdited":false,"rating":5,"title":"Disgusting","review":"All this app does is spread false information 🧚‍♀️","userName":"JordanElizabeth010203","date":"2020-06-29T06:46:45Z"}},{"id":"6134007109","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Trash","review":"This man really is a joke. I was gonna give him the benefit of the doubt and really try to understand him. But trying to listen to him is like having a conversation with a donkey, one sided. This is all fake news and propaganda.","userName":"marcey7","date":"2020-06-29T01:38:37Z"}},{"id":"6133827866","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"DONT DOWNLOAD THIS BS","review":"i am absolutely disgusted by this app, i’m never ever downloading this app ever again!!! it gave me chlamydia i’m am super scared now! i have to see a doctor now. please i am warning you don’t and i mean DONTTT download this app pleaseee!!!! it well give you chlamydia!!!! no joke worst app EVERRRR!!!!","userName":"nalgas✨","date":"2020-06-29T00:27:02Z"}},{"id":"6133640883","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Bruh","review":"I hate this app I was pooping and I was gonna say Trump is great but the I didn’t because he’s not then a snake came out the toilet then I had to go to my roof to check the WiFi cause it doesn’t work at all","userName":"nail the best","date":"2020-06-28T23:13:52Z"}},{"id":"6132569882","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This app is just really bad","review":"Don’t get me wrong, Biden isn’t a great pick either. But Biden doesn’t have an app that spams my phone with calls and texts. For that reason (and the whole racism thing) I’m gonna have to vote Biden in 2020","userName":"Kjro22","date":"2020-06-28T16:25:48Z"}},{"id":"6125425291","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"HORRIBLE","review":"It asks you for your politic beliefs and if you don’t agree with everything trump thinks it asks you to put in a credit card. So basically if yo-yo don’t decide to be trumps slave it makes you pay for everything right winged people GET FOR FREE!! I WAS CONSIDERING BECOMING MORE REPUBLICAN BUT THIS APP RUINIED IT!! VERY HORRIBLE DO NOT GET!!! SAVE YOUR TIME","userName":"......reviewgirl.......","date":"2020-06-26T20:51:59Z"}}]}