{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=142600","data":[{"id":"6179284195","type":"user-reviews","attributes":{"date":"2020-07-10T03:38:15Z","isEdited":false,"userName":"fuckorange","review":"What a horrible app. Nobody wants to see a nazi carrot screaming hate and lies with breath smelling of murdered children and hate. Disgusting. I would not recommend this app to anyone","rating":1,"title":"Worst app ever"}},{"id":"6179284068","type":"user-reviews","attributes":{"date":"2020-07-10T03:38:12Z","isEdited":false,"userName":"1kchottie","review":"If this isn’t the most trashy app I have ever seen. The design quality on it is horrible it looks like something I did as a part of my intro to computer science class. None of the buttons work and it takes five minutes for it to switch pages. Honestly I’m wondering who cleared for the release of this app because they and everyone else who had a hand in making it need to be fired.","rating":1,"title":"Atrocious"}},{"id":"6179283855","type":"user-reviews","attributes":{"date":"2020-07-10T03:38:08Z","isEdited":false,"userName":"Ehehdhdbhdgshs","review":"I tried downloading this app (it took 5 days) and it just wasn’t worth my time. My phone was overheating, after just minutes of having it on my phone. I tried uninstalling it but every time I tried my whole phone froze. (I have a brand new phone.) I tried 6 or 7 more times and finally figured out that I have to delete it from the applications in my settings. The app in general gives NO information, yet asks to view all of my personal information. Don’t download this app!","rating":1,"title":"HORRIBLE"}},{"id":"6179283751","type":"user-reviews","attributes":{"date":"2020-07-10T03:38:05Z","isEdited":false,"userName":"yeet chaleet","review":"When i opened the app, i think i will if it did. But not when sidewalk can isnt, the meatloaf was boiled 🙄🙄","rating":1,"title":"TERRIBLE!!!!!"}},{"id":"6179283675","type":"user-reviews","attributes":{"date":"2020-07-10T03:38:04Z","isEdited":false,"userName":"zsrtkvtkct","review":"Trump showed up at my door.","rating":1,"title":"Poopoo"}},{"id":"6179283678","type":"user-reviews","attributes":{"date":"2020-07-10T03:38:04Z","isEdited":false,"userName":"evanmarsch","review":"Do","rating":1,"title":"When I downloaded this app it was like I took the wort drug it was bad"}},{"id":"6179283502","type":"user-reviews","attributes":{"date":"2020-07-10T03:38:00Z","isEdited":false,"userName":"saveBarron2O2O","review":"To all the people saying gen z is trolling because of our beloved app is getting taken down and we should stop wasteing our time\n\nOK BOOMER 💩🤪\n\nI hope Donny Boi Cheeto man who can’t drink a glass of water or walk up a ramp  reads these 🥰\n\nPs Don’t take tik tok down or we will Roasty Toasty you more. We will take you to the ground.  Don’t threaten to take tik tok away it’s the only thing getting us through this mess you’ve put us in","rating":1,"title":"GEN Z WILL TAKE OVER"}},{"id":"6179283442","type":"user-reviews","attributes":{"date":"2020-07-10T03:37:59Z","isEdited":false,"userName":"bellarosejl0730","review":"This app is terrible do not download it people on this app are annoying and they don’t know what they’re talking about","rating":1,"title":"Gen z for the win"}},{"id":"6179283453","type":"user-reviews","attributes":{"date":"2020-07-10T03:37:59Z","isEdited":false,"userName":"bunbacon","review":"So I downloaded this app in hopes for a better life, because I have been promised that this app will help me with my Mac and cheese addiction, however, once I opened the app, I have been teleported to Easter Island????? WHAT??? I JUST NEEDED TO PLANT A BEANSTALK!!! They also knew somehow that I was in the bathroom taking a fat dump and told me my dog’s sister’s husband’s sister had an eating disorder!! THIS APP IS TRACKING US IM YELLING ALL OF YOU DON’T WASTE YOUR TIME AND YOUR STORAGE FOR THIS PIECE OF TRASH","rating":1,"title":"WHERE ARE MY KPOP ALBUMS😡😡"}},{"id":"6179283242","type":"user-reviews","attributes":{"date":"2020-07-10T03:37:55Z","isEdited":false,"userName":"poiljk","review":"Goodbye app","rating":1,"title":"Not worth it at all"}}]}