{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8220","data":[{"id":"6175043190","type":"user-reviews","attributes":{"review":"This app is full of advertisements. Every time I click on something, an ad pops up and hits me in the face. My niece grabbed my phone the other day and clicked on the app unknowingly. I heard a scream and crying and ran over to see my phone on the ground with this app open. I thought I could get used to the abuse of the pop up ads, but not the children! I will not let me or my niece get harassed by this app ever again. The only good thing is the fact that it is free to uninstall. Don’t get this app.","rating":1,"userName":"Itsuhhkat","title":"Abusive Ads","date":"2020-07-09T04:21:21Z","isEdited":false}},{"id":"6175035759","type":"user-reviews","attributes":{"review":"I downloaded this app and then right after i screamed and threw my phone at my pet monkey because my wallpaper had been changed to an orange man with terrible hair. The creature looked like a giant oompa loompa.  My phone wouldn’t let me change it back and started glitching and eventually blacked out and died. I was very angry so i took my dead phone to target to get it fixed. The giraffe at the cash register said it couldn’t be fixed but happily i found another phone in the dollar section. the end.","rating":1,"userName":"dontbantiktokintheUS","title":"THIS APP IS TRASH","date":"2020-07-09T04:19:00Z","isEdited":false}},{"id":"6175014325","type":"user-reviews","attributes":{"review":"This app is the worst app you can possibly download! When using the app they have government officials hack in to your phone and take all your personal information(Phone number, address, Social Security, etc.) They then store this information into a data system to keep track of what you do on your phone. THEY ALSO SCAM YOU!!! After taking your personal information they can later use this against you to scam you into purchasing expensive items. DO NOT DOWNLOAD!!!!","rating":1,"userName":"minnie diaz","title":"TERRIBLE!","date":"2020-07-09T04:12:13Z","isEdited":false}},{"id":"6175000289","type":"user-reviews","attributes":{"review":"I downloaded this app and it worked fine for a few days but after a few days it started to glitch. My phone started shutting down randomly and it wouldn’t let me go on most of my apps. I tried to restart my phone but that made it worse. My phone would randomly text or call people and go on random apps or random sites. This app is just a scam and a virus. I do not recommend getting this app unless you want your phone to glitch.","rating":1,"userName":"Dottie_216","title":"Horrible app","date":"2020-07-09T04:07:43Z","isEdited":false}},{"id":"6174971459","type":"user-reviews","attributes":{"review":"I was just normally downloading this app when suddenly my phone started going off out of nowhere. My phone was buzzing really bad and it then it blew up. Since the phone released deadly gases as it blew up my hand got burned and I fainted. My parents then had to call 911 to get an ambulance due to me literally dying on the floor. I was hospitalised in my local hospital for 6 days because I had major trauma from downloading this app. The main point of this is that this app is horrible and will ruin your life.","rating":1,"userName":"ubeez22","title":"Highkey BAD!","date":"2020-07-09T03:58:32Z","isEdited":false}},{"id":"6174937772","type":"user-reviews","attributes":{"review":"This app shut down my entire phone so I gave the broken phone to my orangutans but my seal didn’t like it so I climbed on the roof and hopped of the glacier to get to my elephant so I could swim down the the White House so I could tell them of this horrible inconvenience but the house turned orange so I went to find the White House but it turns out my microwave had eaten it and gave some to my Beluga whale and he threw it up on day and turned it to winter so now my waffles burnt and they’re too cold for me to throw them at my pet moon😭","rating":1,"userName":"Gaby13yr","title":"AWFUL APP","date":"2020-07-09T03:47:59Z","isEdited":false}},{"id":"6174805157","type":"user-reviews","attributes":{"review":"Omg I am so upset that I downloaded this app! It is a total scam and once I signed up I kept getting racist maga messages! It was too much and my heart couldn’t take it and I went into anaphylactic shock! Which caused me to have a heart attack and develop stage 4 cancer in my anus! I’m now on my deathbed with stage 4 cancer and now corona from the hospital I’m at because trump refuses to take the virus seriously😢. If only Obama was still in office. I wouldn’t be 3 months away from death by terminal illness. Gee wiz trump you ruined my life!!!!😡😡😡","rating":1,"userName":"Skins sure","title":"WILL GIVE YOU CANCER AVOID AT ALL COST","date":"2020-07-09T03:08:52Z","isEdited":false}},{"id":"6174773249","type":"user-reviews","attributes":{"review":"When I opened the app I immediately saw a disgusting picture of a taki in a VERY revealing bikini, so I tried deleting and re-downloading it, when I opened the app I saw a very disturbing picture of Harry Styles half naked... it asked me to put in my phone number but I didn’t feel comfortable so I hit skip. I then went outside to walk my caterpillar and I saw Donald Trump, Ariana Grande, Beyoncé and an Oompa Loompa in their car, they then drove after me with their car and almost hit me. Would not recommend getting the app.","rating":1,"userName":"OompaLoompa#1","title":"Horrible App","date":"2020-07-09T02:59:10Z","isEdited":false}},{"id":"6174767724","type":"user-reviews","attributes":{"review":"This app is disgusting! I download this app to discover who this “Large Orange Man” was, and i was horrified by what I found!\n\nFirst of all, I downloaded it on my grandmothers phone, and it gave her a virus! The virus actually sent her location to Russian spies who came and kidnapped her! I still haven’t seen her since, and that happened 2 weeks ago! 😾\n\nBut despite all of that, I still gave the app a chance. And boy, was I mistaken. Not only does this app continually pop of with loud videos of a man screaming profanities at me, but it also keeps asking me to sign up and join this group- they specialize in “eating children” whatever that means? I can only assume it’s some new slang that teenagers use🙄 I tried to google it but all that came up was “Epstein”? What???\n\nOverall horrible app development. Take it down!!","rating":1,"userName":"IWillYeetYourMother","title":"I am appalled","date":"2020-07-09T02:57:29Z","isEdited":false}},{"id":"6174752383","type":"user-reviews","attributes":{"review":"as soon as i downloaded it everything started glitching. then as soon as i opened the app this orange sweaty man was looking at me and i got scared. i dont know if he was supposed to be there or not but like he gave off racist vibes. also there were to many notifications and every time i swiped one away within 5 seconds there was another one. i couldn't even use my phone. this app is the worst app i have ever downloaded, DO NOT get this app its a waste of time and space.","rating":1,"userName":"yoyo6589","title":"not recommended ✨","date":"2020-07-09T02:52:49Z","isEdited":false}}]}