{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30710","data":[{"id":"6173277105","type":"user-reviews","attributes":{"isEdited":false,"review":"This app is terrible it takes so much time to download and when you even finish downloading it you can’t do much with it. It even sometimes crashes and sends you back out of the app","date":"2020-07-08T18:30:07Z","userName":"Angus Yoing","title":"Terrible app","rating":1}},{"id":"6173267998","type":"user-reviews","attributes":{"isEdited":false,"review":"absolutely terrible app it downloaded viruses onto my phone, i had a problem at the tech store even when i went to go get this fixed. i am completely disappointed and encourage everybody to stay away from this app. BERNIE 2020","date":"2020-07-08T18:27:06Z","userName":"liberalsocialistmama","title":"harmful","rating":1}},{"id":"6173263790","type":"user-reviews","attributes":{"isEdited":false,"review":"this app kept glitching and every time it did, it sent out a wave of electricity that killed all the animals on my farm😧🤧 now that we have no cows we can’t make money or eat and had to sell our land for food😤 we ran out of food and now have nothing and are being sent to the middle of the ocean bc trump hates all people who aren’t cis, straight, white men and we identify as not that.😖😢 so sad, now we all live in the ocean. bc of this app and that disgusting, scum of the earth, pervert donald trump","date":"2020-07-08T18:25:44Z","userName":"Ashis910","title":"glitches killed my farm😓","rating":1}},{"id":"6173242028","type":"user-reviews","attributes":{"isEdited":false,"review":"This was the worst quality worst internet worst working app I’ve ever had it was in affective and glitch the whole time don’t waste your storage on the app it’s a dumb waste of time,money,and space don’t make the same mistake I made.😡","date":"2020-07-08T18:18:35Z","userName":"litty12543$#","title":"🥶Bad quality 😡","rating":1}},{"id":"6173241129","type":"user-reviews","attributes":{"isEdited":false,"review":"I would give it 0 stars if possible🙄it took 2 whole months to download and it glitches out every time I open it. This app is almost as bad as our current president. Bye never using this app again! It shouldn’t even be an app. Pointless.","date":"2020-07-08T18:18:17Z","userName":"Dan oh ny","title":"WORST APP EVER!🤬🤬","rating":1}},{"id":"6173224452","type":"user-reviews","attributes":{"isEdited":false,"review":"Our country is run by pedophiles and billionaires. The 2-party system is broken beyond repair and every election, the American people are either strong-armed into picking between 2 degenerates or too stupid to be anything but a cog in the system anyway","date":"2020-07-08T18:12:44Z","userName":"Average Mitch","title":"Awful app, awful person","rating":1}},{"id":"6173209767","type":"user-reviews","attributes":{"isEdited":false,"review":"My family has supported the trumps for years and I can’t believe how badly this app is designed. There’s no weed friendly option, there is a horrible button that just deletes the records for the lgbtqia+ population. It’s so confusing freak this.","date":"2020-07-08T18:07:53Z","userName":"Yoyoyoitsme420","title":"Disappointed","rating":1}},{"id":"6173198479","type":"user-reviews","attributes":{"isEdited":false,"review":"I wish there was a 0 star review because ever since I got this app a lot of things have been happening like my credit cards were drained and I have been seeing weird things happen in my house so I just deleted the app 🥰","date":"2020-07-08T18:04:06Z","userName":"gen Z!!","title":"Corn head","rating":1}},{"id":"6173192300","type":"user-reviews","attributes":{"isEdited":false,"review":"Every time I open it. It’s keep signing me out, and it’s keeps showing me a lot of racist by him and his supporters and I don’t like that. This app is terrible and I don’t see why people would download it. This is not good for America, get rid of it plz","date":"2020-07-08T18:02:06Z","userName":"Rt Sinister","title":"This app is broken and so bad","rating":1}},{"id":"6173182331","type":"user-reviews","attributes":{"isEdited":false,"review":"so let’s start off with the apps cover itself , the whole app is just so ugly and very laggy. and trumps face when i first tapped on the app made it even worse! i think this app should BE DELETED!!! it’s so terrible and very very bad quality","date":"2020-07-08T17:58:56Z","userName":"trumps biggest hater","title":"this app is horrible","rating":1}}]}