{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27870","data":[{"id":"6177189709","type":"user-reviews","attributes":{"title":"Keeps crashing,","userName":"Annabella, your local libral","isEdited":false,"date":"2020-07-09T15:36:56Z","rating":1,"review":"This app works terribly. It keeps crashing and work let me do anything in it. I was hoping better from the president of our country but apparently him and his yes men can’t even make an app right. I would give it no stars if I could"}},{"id":"6177187881","type":"user-reviews","attributes":{"title":"It said I had to sign up","userName":"Helga Karen","isEdited":false,"date":"2020-07-09T15:36:25Z","rating":1,"review":"I don’t want to sign up to see why the talking orange is still president I would rather listen to the annoying orange. It also said it was gonna hack my phone in the terms and conditions and make it so i only see trump supporters on social media."}},{"id":"6177185110","type":"user-reviews","attributes":{"title":"Terrible App!","userName":"Wildo da Dildo","isEdited":false,"date":"2020-07-09T15:35:39Z","rating":1,"review":"I downloaded the app with high hopes. I expected it to be filled with content that I’d enjoy. For example, pictures of children in cages, or white propaganda, but instead, it was just a picture of some absolute moron standing on stage! I will never download this app again!"}},{"id":"6177161566","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD!!","userName":"....BLM!:&/9/@/'ns","isEdited":false,"date":"2020-07-09T15:29:00Z","rating":1,"review":"Every time I opened the app my phone would freeze and I would have to restart it over and over again. No my phone is slower over all and takes forever to load other apps or a page in safari"}},{"id":"6177148654","type":"user-reviews","attributes":{"title":"The worst app","userName":"just wht trump","isEdited":false,"date":"2020-07-09T15:25:25Z","rating":1,"review":"I have no idea why this app keep kicking me off for no reason I thought it was my finger touching it but I let my phone sit there on it’s own and it kicked me off so don’t get this app and it also was showing my location and I don’t like that"}},{"id":"6177145170","type":"user-reviews","attributes":{"title":"✨🧚‍♂️terrrible🧚‍♂️✨","userName":"orange umpa lumpa cheeto","isEdited":false,"date":"2020-07-09T15:24:27Z","rating":1,"review":"after DAYS of the app downloading I finally opened it up to see an orange umpa lumpa and it scared me to death that I dropped my croissant this app then hacked my phone and it would wouldn’t let in to other apps like my favorite tik tok and if u ban tiktok ohhhh boyyyy no one from this generation will like you so have fun hunny!🧚‍♂️"}},{"id":"6177119334","type":"user-reviews","attributes":{"title":"yucky","userName":"Hover board wanted","isEdited":false,"date":"2020-07-09T15:17:19Z","rating":1,"review":"this app is truly terrible .. keeps crashing and it absolutely makes no sense I cannot believe people enjoy having this app on theirs phone. It’s awful and simply having downloaded it for two seconds shows it"}},{"id":"6177098803","type":"user-reviews","attributes":{"title":"Absolutely Disgusting","userName":"Animal crossing freak","isEdited":false,"date":"2020-07-09T15:11:35Z","rating":1,"review":"I downloaded this app to get updates and reminders on Trump’s plans for the 2020 election. However, when I got into the app the first notification I saw was a direct message from Trump to Biden. In this message Trump offered Biden “30 minutes of good head”. I am absolutely disgusted."}},{"id":"6177073232","type":"user-reviews","attributes":{"title":"Bugs","userName":"maurenmilton","isEdited":false,"date":"2020-07-09T15:04:34Z","rating":1,"review":"This app continues to make my phone crash and I have to use a soft reset every time I use it. I expected better from the greatest president we’ve ever had. If he can’t make a phone app run smoothly how can he save our country from the turmoil!! Sad!!"}},{"id":"6177060370","type":"user-reviews","attributes":{"title":"Terrible","userName":"ltdbec","isEdited":false,"date":"2020-07-09T15:01:01Z","rating":5,"review":"The app was terrible, kept shutting down."}}]}