{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=18990","data":[{"id":"6177438171","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"This app is HORRIBLE!!!","review":"This app has gotten me into so much trouble when I downloaded as soon as I did I was kidnapped by and orange man in a suit and next thing you know I woke up in a very bright room with Trump 2020 signs everywhere!! Next, the orange dude was actually the president and forced me to say Trump 2020 to get out! I said it, but he never let me out :( (Rumor is I’m still there till this day).","date":"2020-07-09T16:48:43Z","userName":"Tay Tay ❤️‼️"}},{"id":"6177431059","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Spamming porn","review":"Ok so when I looked inside the app when I got it the was a lot of spam porn and then It showed two girls one cup but instead of a cup it was a bowl and instead of girls it was boys and then out of nowhere an ompaloompa came out of my closet and I think it’s bc of the app also I fell of the Effie tower and I floated in a pool bc of this app this app is so bad and disgusting and it took me 4 weeks to download smh","date":"2020-07-09T16:46:29Z","userName":"ciengjfdnfjrjdbg"}},{"id":"6177430468","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Terrible","review":"this is one of the worst apps made in existence. it’s always giving me false information, it keeps making my phone crash, nonstop notifications and it’s always somehow running in the background. the fact that our terrible president even has this app is terrible. also screw trump for taking away tik tok","date":"2020-07-09T16:46:19Z","userName":"kingmelina"}},{"id":"6177357737","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Wanted to love it...","review":"I wanted to love this app so much! I’d do almost anything to support MY president but this app took so long to download! 😩Not only did it take so long to download but whenever I’d open the app, it would crash right away!!! 😡 I’ll continue to support President Trump my own way, without this horrible app and I’d recommend the same to others! 😤","date":"2020-07-09T16:24:58Z","userName":"Nicole Tillin"}},{"id":"6177351406","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"The app is awful","review":"It took forever to download, it is extremely laggy, I could barely read anything, and when I figured out how to set it up I kept getting spammed with notifications and it was so bad my phone shut off. It would let me do anything in the app and it kept showing a picture of this ugly Cheeto puff.","date":"2020-07-09T16:23:10Z","userName":"corgis rule 9"}},{"id":"6177348770","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"HORRIBLE!!!","review":"When I first opened the app i was so repulsed that i threw up. Everything about this app is horrible. it made me and everyone who knows me have bad luck the whole time i had it. My mom fell down the stairs and her head fell off. Then, my cat fell from the roof of my house and kicked the bucket. I then had a nightmare that the cheeto got elected again and i woke up sweating. DO NOT GET THIS APP!! I REPEAT, DO NOT GET THIS APP!!","date":"2020-07-09T16:22:24Z","userName":"♡ anna ♡"}},{"id":"6177347516","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"0/10 recommended, absolutely TERRIBLE","review":"there’s been so much going on in the world and so many rumors concerning with trump , my curiosity led me to come to this app and see what he has planned . not even 10 minutes into use my phone started crashing . for someone that has such a huge platform with so much money you’d expect a high quality app","date":"2020-07-09T16:22:03Z","userName":"elizabethrodriguez"}},{"id":"6177323506","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"What a Mess","review":"I am just trying to get some baseline information of Trump as a candidate to see how I’m going to vote in 2020 and all I’m bombarded with is advertisements, slant pieces on the other candidate and no real substantive information. It’s like a bad infomercial with a lot of clickbait included. You would think as much money as they spent there would be something substantive to see.","date":"2020-07-09T16:15:20Z","userName":"Tempestorm"}},{"id":"6177317086","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"DISGUSTING","review":"i downloaded the app because i was genuinely curious to see what was up because this has been the most popular app lately but it tooo several hours to download and asked for way too much personal information!!! completely wiped my phone and hacked all my accounts i couldn’t get into my instagram after this DO NOT DOWNLOAD 😊😊😊🥰❤️❤️❤️😹 very bad","date":"2020-07-09T16:13:36Z","userName":"harrystylessockofcumm"}},{"id":"6177313339","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Full of spam and glitches!!","review":"It seems like there’s a lot of reviews currently so maybe the app is just slow but it’s constantly crashing, freezing on adds you can’t close out of and now I’m getting emails from porn sites!!!! Would not recommend! My son uses this device who knows what he’s seen now!!!!","date":"2020-07-09T16:12:35Z","userName":"alyyyyroseeeee"}}]}