{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=138030","data":[{"id":"6179810576","type":"user-reviews","attributes":{"userName":"esthergarvia","rating":1,"isEdited":false,"title":"Payback😌✨","date":"2020-07-10T06:42:15Z","review":"This is payback for taking away our app and made us great and gave us a voice"}},{"id":"6179810546","type":"user-reviews","attributes":{"userName":"kennedi☺️","rating":1,"isEdited":false,"title":"Horrible","date":"2020-07-10T06:42:14Z","review":"This app is horrible it took forever to download and the quality of it is horrible and they put a Cheeto puff in place of the picture of the president."}},{"id":"6179809971","type":"user-reviews","attributes":{"userName":"annarjh","rating":1,"isEdited":false,"title":"Won’t work?","date":"2020-07-10T06:41:59Z","review":"I’ve tried this several times now. It either won’t load and my phone freezes to the point I have to turn it off completely. Or I go put in my phone number and it freezes. Update is needed"}},{"id":"6179809225","type":"user-reviews","attributes":{"userName":"Da Kwik Bawss","rating":1,"isEdited":false,"title":"no ❤️","date":"2020-07-10T06:41:45Z","review":"i woke up 8 days ago to this app personally downloading on my phone by itself.bi will be honest i saw it and thought about downloading it and mentioned it to a fellow friend. i guess it decided to take matters into their own hands and download it by themselves, which i am beyond shocked about. as soon as it downloaded it deleted my tik tok and every picture of me leaving my white best friend to be the only one in my camera roll. it even redownloaded the pictures of my ex who is also white . i grew upset and got a text PERSONALLY from trump asking me what was wrong.. i explained it to him and the perv decided to tell me if i give him what he wants then he’ll give me what i want. what the HELL does that even mean, my heart hurt and i was saddened. he proceeded to tell me after i refused, that i had nothing to lose because i was a blackie w no job. sir must have not done his research because i do have a job ! ifk about you but that’s not an app i wanna vibe w"}},{"id":"6179808557","type":"user-reviews","attributes":{"userName":"Not Jenni","rating":1,"isEdited":false,"title":"You Should Know the Truth","date":"2020-07-10T06:41:30Z","review":"Sam, \n\nThe first night at bed when you left, Ron made out with 2 girls and put his head between a cocktail waitress's breasts. Also was grinding with multiple fat women.\n\nWhen you left crying at klutch, Ron was holding hands and dancing with a female and took down her number. \n\nMultiple people in the house know, therefore you should know the truth."}},{"id":"6179808398","type":"user-reviews","attributes":{"userName":"Diakomarunongmagengles","rating":1,"isEdited":false,"title":"Unfortunately unfortunate !","date":"2020-07-10T06:41:26Z","review":"Hindi ko nagustuhan tong app na to dahil akala ko magiging mabuti para sa kinabukasan ko pag dinownload ko siya. Yun pala, hindi. Di lang dahil sa mapangit ang layout ng app, mukhang maraming problema ang taong binoto ng mga puti para maging presidente. Hindi ko maintindihan. At hindi lang yun! Mukhang di rin niya sineryoso yung birus nung bagong punta nun sa Amerika kaya ngayon maspangit ang kalagayan ng mga tao sa Amerika kesa sa mga ibang bansa. Nakakaawa naman. Isa pa, mukhang mapag-aglahi, seksismo at mukha siyang dalandan ! Naku po ! Bakit niyo siya binoto... yan tuloy ang pangit ng app :-("}},{"id":"6179808089","type":"user-reviews","attributes":{"userName":"NOURDBB","rating":1,"isEdited":false,"title":"Complete scam","date":"2020-07-10T06:41:20Z","review":"I thought it was an app, but no, it was a waste of time, sick and weird propaganda"}},{"id":"6179807923","type":"user-reviews","attributes":{"userName":"GreyGang23","rating":1,"isEdited":false,"title":"Apps a Joke, just like our President","date":"2020-07-10T06:41:16Z","review":"Just done with everything he has done in only 4 years; life has changed but America is not becoming “Great again,” in fact I am 20 years old and have never actually lived during a presidency where the laws they are passing are directly effecting me, and not for the better of course. So 1 Star 🥴"}},{"id":"6179807296","type":"user-reviews","attributes":{"userName":"SOPHIE H G 121","rating":1,"isEdited":false,"title":"no.","date":"2020-07-10T06:41:02Z","review":"This app is unbelievable! -10/10. Just no. I don’t think so kimosabe. Not today."}},{"id":"6179807138","type":"user-reviews","attributes":{"userName":"trump is no bueno","rating":1,"isEdited":false,"title":"Terrible","date":"2020-07-10T06:40:59Z","review":"This app is completely horrible and deserves to be taken down just like all of the racist statues still standing in America. It’s a No ❤️ from me"}}]}