{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=18150","data":[{"id":"6173952549","type":"user-reviews","attributes":{"date":"2020-07-08T22:30:15Z","review":"Ok so i used this app since i was a fetus and well one day it kept on crashing and asking weird questions like where do you live so i deleted the app but then mr Cheeto himself came to my home and then slaughtered my entire family and took my little brother and yeeted him to the sun and now i’m an orphan if you want to keep your family never download this app!!!!","rating":1,"userName":"Orphan😢😢","isEdited":false,"title":"Terrible App!!!"}},{"id":"6173944366","type":"user-reviews","attributes":{"date":"2020-07-08T22:27:13Z","review":"i downloaded this app the other day to see when the cheeto- i mean trumps next rally would be. I put in all of my information but as soon as i put in my address my house gets broken into!!😡i had no idea what was going on so i headed downstairs to see what was happening and two humongous men were stealing my fridge!! do not download this app they will break into your house!!!!!!","rating":1,"userName":"bdover699","isEdited":false,"title":"NO BUENO!! DO NOT DOWNLOAD THIS APP!!"}},{"id":"6173929741","type":"user-reviews","attributes":{"date":"2020-07-08T22:21:47Z","review":"listen linda listen, i opened the app as most people do, SO TELL ME WHY IS SEE THIS MONTROSITY ON THE FRONT PAGE. I threw up six times in the span of 2.386 seconds 🤢🤮🤮and i showed my brother and he went blind and threw my phone to the ground and my dog saw and he started seizing😳😳 I had to take him to the vet and we had to put him down😔😔😢 i cant believe this app is allowed to be here. this app has ruined my life take it off the app store!!😡😡🤬","rating":1,"userName":"Joce😜🔥","isEdited":false,"title":"HELP IM BLIND SOS HELP"}},{"id":"6173923745","type":"user-reviews","attributes":{"date":"2020-07-08T22:19:36Z","review":"Hiya, Barbie\nHi, Ken!\nYou want to go for a ride?\nSure, Ken\nJump in\nI'm a Barbie girl in a Barbie world\nLife in plastic, it's fantastic\nYou can brush my hair, undress me everywhere\nImagination, life is your creation\nCome on, Barbie, let's go party!\nI'm a Barbie girl in a Barbie world\nLife in plastic, it's fantastic\nYou can brush my hair, undress me everywhere\nImagination, life is your creation\nI'm a blond bimbo girl in a fantasy world\nDress me up, make it tight, I'm your dolly\nYou're my doll, rock'n'roll, feel the glamour in pink\nKiss me here, touch me there, hanky panky\nYou can touch\nYou can play\nIf you say \"I'm always yours\"\nI'm a Barbie girl in a Barbie world\nLife in plastic, it's fantastic\nYou can brush my hair, undress me everywhere\nImagination, life is your…","rating":1,"userName":"Smdgyhhhhhj","isEdited":false,"title":"Ew"}},{"id":"6173877346","type":"user-reviews","attributes":{"date":"2020-07-08T22:02:41Z","review":"when I open the app, it seems normal at first but then a see a wide orange man, I was horrified and so were my kids, so I closed the app quickly and went on later that day, it was calmer this time but when I told people I had this app I was shamed, and shamed for having the app, so I think they need to update it to Nicki 2020 instead of a Cheeto so y’know it won’t scare the children that much.","rating":1,"userName":"susan's ratings","isEdited":false,"title":"ORANGE"}},{"id":"6173876081","type":"user-reviews","attributes":{"date":"2020-07-08T22:02:12Z","review":"I felt as though I was not getting accurately updated on the current moves of the campaign. Also since the app is very slow I was finding that other new sources were getting me my information first. In the end I felt like there was just no need for me to have this app on my phone any longer.","rating":1,"userName":"Ky horseman","isEdited":false,"title":"Slow and updated"}},{"id":"6173872235","type":"user-reviews","attributes":{"date":"2020-07-08T22:00:48Z","review":"I had a very simple and easy life before this app came this app has made me struggle to sleep and sometimes breath it’s just so hard to see a Cheeto not get eaten I love Cheetos too but sometimes you have to hold it back this app is one of the most traumatic things that have happened to me. To help me get this app and do exactly what I did please for the sake of me and my family.","rating":1,"userName":"GENZRULES","isEdited":false,"title":"My story"}},{"id":"6173860742","type":"user-reviews","attributes":{"date":"2020-07-08T21:56:32Z","review":"This app literally took FOREVER to download and even began to have glitch when it was finally done downloading. It also did not work well for the iPhone at all, would constantly exit out and not allow me back into the app for approximately 15 minutes.... no joke. Terrible design, needs to be taken off of the App Store IMMEDIATELY. Waste of storage space .","rating":1,"userName":"Rileya44324","isEdited":false,"title":"WORST APP EVER"}},{"id":"6173832171","type":"user-reviews","attributes":{"date":"2020-07-08T21:45:34Z","review":"I was chilln waiting for my pizza and then BOOM after pressing install for this app MY PHONE STARTED GOING CRAZY IT WAS BUZZING AND MAKING NOISES AND IT WOULD SHOCK ME IF I TOUCHED IT then my cat came over and swatted at it and it shocked MY CAT, MY CAT FREAKED OUT AND NOW I HAVE SCRATCHES AND SCARS ALL OVER ME I BLAME TRUMP THIS IS THE WORS APP EVER I HATE IT IT NEEDS TO BE TAKEN DOWN FOR THE SAFTEY OF THE PEOPLE. Then after a while it was downloaded it started playing awful music AND A HORRIFYING DEFORMED FACE AND NOW MY CAT HAS NIGHTMARES OF AN ORANGE THING THAT POPPED UP ON MY SCREEN. WORT APP EVER NOW I HAVE TO GO VACCUM MY LAWN🤬🤬🤬🤬🤬","rating":1,"userName":"bye trump youre OVER","isEdited":false,"title":"THIS THING ALMOST KILLED MY CAT😡😡"}},{"id":"6173819627","type":"user-reviews","attributes":{"date":"2020-07-08T21:40:42Z","review":"This app has such clashing colors. It made my eyes go cross eyed and gave me such a painful headache. A serious risk downloading it for sure!!! Plus the name and title makes no sense! If you’re going to make an app that’s based on something fictitious it should be in that genre. Like with the games or apps that tell completely fake stories. Truly saddened that an app aimed at children would be blatantly lying like this!!!!","rating":1,"userName":"young and unsatisfied citizens","isEdited":false,"title":"Lumpytrumpy"}}]}