{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25160","data":[{"id":"6173661709","type":"user-reviews","attributes":{"isEdited":false,"userName":"acab😌✨","review":"this app is terrible. if i could rate or 0 stars i would. crashes every time it open and makes my phone glitch so bad!! i wanted to why the white supremacists like this dude so much and still can’t understand why. felt like a downloaded a virus when i downloaded this crappy app.","title":"DONT DOWNLOAD","date":"2020-07-08T20:42:22Z","rating":1}},{"id":"6173660837","type":"user-reviews","attributes":{"isEdited":false,"userName":"mehak_22","review":"I downloaded the app because I had reached my peak boredom in life and decided I wanted to hear what the orange man had to say. But as soon as I downloaded the app, I felt off. I couldn’t quite put my finger on it so I stood up and looked in the mirror and BEHOLD. I WAS ORANGE. Never in my life have I been so disgusted. Never downloading the app again worst app ever.","title":"I’m scarred","date":"2020-07-08T20:42:05Z","rating":1}},{"id":"6173657026","type":"user-reviews","attributes":{"isEdited":false,"userName":"BLACK LIvES MATTERERRRRR","review":"The app is so so utterly hard to use I can’t even imagine people using it and thinking it works. I can barely press anything and once I do it takes over a minute to load. Typos. Bad graphics. Everything is horrible and could be improved.","title":"Can barely use","date":"2020-07-08T20:40:43Z","rating":1}},{"id":"6173638402","type":"user-reviews","attributes":{"isEdited":false,"userName":"uR mUM 🤠","review":"please don’t buy this app made my fish drown. he was my best friend and this app took him away from me. don’t download this app unless you want something seriously HORRIBLE to happen. this app is absolute T R A S H and no one should ever be tricked into getting it. after downloading this app it has made me scared for the lives of domestic fish.","title":"DONT BUY IT MADE MY FISH DROWNED","date":"2020-07-08T20:34:03Z","rating":1}},{"id":"6173604074","type":"user-reviews","attributes":{"isEdited":false,"userName":"aisha fakhar","review":"this app is so bad!!!! took like 5 weeks to download and it lags!! it even hacked my phone and made me look like a bad person! DO NOT DOWNLOAD THIS APP!!!! it’s a trick and it will steal all of your personal information! no matter how much you love trump, your personal information like your credit card number is NOT worth it!! DO NOT GET IT!!!!!","title":"TERRIBLE APP","date":"2020-07-08T20:21:48Z","rating":1}},{"id":"6173599120","type":"user-reviews","attributes":{"isEdited":false,"userName":"ghwejejsb","review":"This app has a terrible lag. The pictures come up so blurry and have a terrible quality. I also can’t hear anything. Every 3.2 seconds there is a add even after I paid for no advertisements. I do not recommend downloading this app","title":"This is a terrible app","date":"2020-07-08T20:20:00Z","rating":1}},{"id":"6173585345","type":"user-reviews","attributes":{"isEdited":false,"userName":"Eggwithay","review":"This app produced a sound that made me and my dog unable to breathe when opened. It also made bugs come out of my monkey’s ears. I don’t even know the point of the app! I downloaded it thinking it was club penguin but it isn’t and I’m VERY disappointed. If I were a Karen, I would speak to the manager. Very dissatisfied.","title":"Terrible","date":"2020-07-08T20:15:13Z","rating":1}},{"id":"6173569415","type":"user-reviews","attributes":{"isEdited":false,"userName":"Ethan M C","review":"This app took ages to download, and I have amazing wifi!!! It also, crashes multiple times while in use. This app needs to be taken off the app store, and worked on! It was so bad, that honestly, it should get took off the app store and never added back.","title":"Terrible app!!!","date":"2020-07-08T20:09:43Z","rating":1}},{"id":"6173563503","type":"user-reviews","attributes":{"isEdited":false,"userName":"Person With Braincells","review":"WORST APP EVER! There are no words to explain my disappointment. All I wanted was to be able to see what bunker boy was up to recently but the app took weeks to download. There also must have been a virus in the app due to the inhuman coloration on Mr. Trumps face, it made him look like “😗🍊” I wish I could give this app negative  stars. Anyways...🙂","title":"I DO NOT RECOMMEND!","date":"2020-07-08T20:07:43Z","rating":1}},{"id":"6173560270","type":"user-reviews","attributes":{"isEdited":false,"userName":"trumpsbf4l","review":"Very unimpressed by this app. The layout is juvenile. My middle school computers project was more advanced than this. The font choice is blinding. It’s very hard to look at and interact with. Needs many updates and many changed to the user interface. Also, this app is so slow. 1 Star. Very bad.","title":"Very unimpressed","date":"2020-07-08T20:06:36Z","rating":1}}]}