{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42740","data":[{"id":"6174797040","type":"user-reviews","attributes":{"date":"2020-07-09T03:06:28Z","rating":1,"isEdited":false,"userName":"t rex lover 24","review":"This app is mean. Me and my friend where talking and the app called her fat and ugly. Then a T. rex came and it made him cry too. We went to McDonald’s and saw some other dinosaur getting a whopper. Anyways this app is mean don’t get it.","title":"Terrible app"}},{"id":"6174795413","type":"user-reviews","attributes":{"date":"2020-07-09T03:05:59Z","rating":1,"isEdited":false,"userName":"unsolved mysteries","review":"I really wanted an educated opinion about literally anything along with correct grammar, punctuation, and spelling; but, to no avail. 10/10 would NOT recommend this app.","title":"Didn’t get what I was looking for.."}},{"id":"6174794817","type":"user-reviews","attributes":{"date":"2020-07-09T03:05:49Z","rating":1,"isEdited":false,"userName":"ama4024","review":"I can not believe how unbelievably terrible the interface of this app is. I don’t understand how to do anything on it, and it makes no sense. Please delete this disgrace from the App Store.","title":"Terrible App"}},{"id":"6174789299","type":"user-reviews","attributes":{"date":"2020-07-09T03:04:06Z","rating":1,"isEdited":false,"userName":"settleforjoe","review":"george floyd. breonna taylor. atatiana jefferson. aura rosser. stephon clark. botham fean. philando castille. alton sterling. michelle cusseaux. freddie gray. fanisha fonville. eric garner. akai gurley. gabriella nevarez. tamir rice. michael brown. tanisha anderson. those are just a few of black and innocent people killed by cops. say their names. black lives matter. and don’t mess with gen Z","title":"worst app ever!!!"}},{"id":"6174782695","type":"user-reviews","attributes":{"date":"2020-07-09T03:02:04Z","rating":1,"isEdited":false,"userName":"hzishsboajsv","review":"I downloaded this app because I wanted to keep myself informed. I can tell you right now that this was very inappropriate and very insulting. I do not recommend.","title":"Absolutely. Horrible."}},{"id":"6174782575","type":"user-reviews","attributes":{"date":"2020-07-09T03:02:01Z","rating":1,"isEdited":false,"userName":"taryn<3.","review":"Right when I got this app my phone started glitching and getting viruses left and right. I would advise everyone not to get this app it is a regret of mine.","title":"This app is just horrible"}},{"id":"6174776468","type":"user-reviews","attributes":{"date":"2020-07-09T03:00:09Z","rating":1,"isEdited":false,"userName":"RACHEL4513683","review":"This app completely ruined my phone. It made it glitch to the point where I was no longer able to use it. Horrible app would not suggest.","title":"BAD APP"}},{"id":"6174774903","type":"user-reviews","attributes":{"date":"2020-07-09T02:59:41Z","rating":1,"isEdited":false,"userName":"yoana1011","review":"And it says that the White House is full of garbage and they said that they’re going to kill everybody","title":"Made me cry because I stole my food from my fridge and they told me that black lives don’t matter"}},{"id":"6174763760","type":"user-reviews","attributes":{"date":"2020-07-09T02:56:16Z","rating":1,"isEdited":false,"userName":"Julia Gottschalk","review":"The app tracks your data, how horrible. It’s a serious threat to our national security. I think we better remove this app from the Apple store.","title":"Full of fake news"}},{"id":"6174757243","type":"user-reviews","attributes":{"date":"2020-07-09T02:54:17Z","rating":1,"isEdited":false,"userName":"kasmith13","review":"By downloading this app you are giving it permission to access all your photos and steal any data off of your phone","title":"Stealing your data"}}]}