{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=122380","data":[{"id":"1437496834","type":"user-reviews","attributes":{"title":"Sad!","date":"2016-08-22T20:50:26Z","isEdited":false,"rating":1,"review":"Horrible app. The user friendly features aren't user friendly at all. The app asks to read your contacts and pretty much take all information off your phone. Really unprofessional. The interface after I FINALLY logged in was cluttered and annoying. Asks you to donate via notifications every 5 minutes. Keeps crashing and locking my phone up. Was designed overseas. Horrible app.","userName":"Djdoublexl180"}},{"id":"1478650165","type":"user-reviews","attributes":{"title":"GO Trump GO","date":"2016-11-04T22:20:58Z","isEdited":false,"rating":5,"review":"HillaryClinton is a liar and a criminal. She should be in jail. Donald Trump will fix what Obama ruined in America. Hillary will cause even more problems and she doesn't even care about terrorists or killing people, since she obviously did it herself. So I say once more, GO TRUMP GO!!!!","userName":"Hillary4prison636739901-/:24"}},{"id":"1440138171","type":"user-reviews","attributes":{"title":"Fabulous and Fun!","date":"2016-08-27T14:45:51Z","isEdited":false,"rating":5,"review":"Only Donald Trump and his team would come up with such a fabulous and fun app!!! He will going to Make American Great Again!!!!! (The Clintons must be stopped by any and all measures!).\nBe a true part of history and the Trump train 🚂🇺🇸💨 download and enjoy!!!!","userName":"Kimi1901"}},{"id":"1480596481","type":"user-reviews","attributes":{"title":"Do it TRUMP","date":"2016-11-08T01:36:40Z","isEdited":false,"rating":5,"review":"Perfect. Please go out and support our man The Donald. We must stand together. If not Hilary has claimed her place for history to repeat once again. In a nation where her and Obama did a great job of tarnishing this country from within.","userName":"Twon cat"}},{"id":"1469633594","type":"user-reviews","attributes":{"title":"Amazing!","date":"2016-10-19T23:20:05Z","isEdited":false,"rating":5,"review":"I love the design and functions of the app. Really easy to guide through the app and discover everything about it. Would definitely recommend to my republican friends!","userName":"Peter769515"}},{"id":"1453904984","type":"user-reviews","attributes":{"title":"ON THE TRUMP TRAIN SINCE DAY 1!!!","date":"2016-09-22T11:14:56Z","isEdited":false,"rating":5,"review":"Wonderful idea to keep people engaged politically. A prelude app for TRUMP. Once Mr. Trump is President, an app such as this would be great to #MAGA one person at a time. Because I believe it truly will take each and every one of us to make America great again. America First!","userName":"Thepowerofnow"}},{"id":"1435843612","type":"user-reviews","attributes":{"title":"This app makes me want to make America great again!","date":"2016-08-20T00:31:53Z","isEdited":false,"rating":5,"review":"This app makes me want to make America great again, can't wait to see what the updates have in store. Keep earning those action points!","userName":"Trump for president 2k16"}},{"id":"1441153599","type":"user-reviews","attributes":{"title":"Get the facts straight","date":"2016-08-29T12:14:15Z","isEdited":false,"rating":5,"review":"This is the only way / best way to bi-pass the lies from the media. Receive updates on issues, appearance, poll rating, and have access to Mr Trump giving you a voice he wants to listen.","userName":"palinane"}},{"id":"1439853221","type":"user-reviews","attributes":{"title":"Amazing!!","date":"2016-08-27T03:21:24Z","isEdited":false,"rating":5,"review":"This shows he cares and wants you to not only understand him and his campaign but get you involved and help others get involved. Never seen any politician want so much input from supporters!! Amazing","userName":"ThePowerOverU"}},{"id":"1453567291","type":"user-reviews","attributes":{"title":"Amazing App","date":"2016-09-21T18:54:52Z","isEdited":false,"rating":5,"review":"This app is super useful and informative. Allows you to keep up with the Trump train and not miss a single thing. You here it from the man himself first, rather than from media. Recommend to download.","userName":"IrvinLesh"}}]}