{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=20120","data":[{"id":"6175456541","type":"user-reviews","attributes":{"title":"The worst app","date":"2020-07-09T06:51:30Z","isEdited":false,"userName":"davilce","rating":1,"review":"This app is the worst the app is so glitchy it took me about 20 minutes to load. Honestly one of the worst apps ever. I just downloaded it to help but oh my. This just horrible. Oh an also I hate the bright colors that it displays and the hate that this person gives to the world just don’t get it it will save your life."}},{"id":"6175380881","type":"user-reviews","attributes":{"title":"Extremely slow","date":"2020-07-09T06:22:06Z","isEdited":false,"userName":"hnelly07","rating":1,"review":"This app is so slow. It also won’t open when I click on is. I try to open it and it won’t open. Every time I do open it hacks my phone. I don’t trust this app. Please. Don’t get this app. It’s a total waste of time. Only dumb, racist, sexist, fascist, absolutely worse than the devil people get this app. So please. Just don’t. 🧚🏽‍♀️"}},{"id":"6175377477","type":"user-reviews","attributes":{"title":"Bad😹😾","date":"2020-07-09T06:20:46Z","isEdited":false,"userName":"hahsbdshzhebbs","rating":1,"review":"First of all this took me 100 weeks to download and RIGHT WHEN UT DOWNLOADED I had a man with a trump hat ring my doorbell. When I woke up the next morning my house was covered in trump stickers and now all I have are weird stains on my windows. If I could give this app a lower review I would but there’s no option for 0 stars. 0/10 don’t recommend end of story."}},{"id":"6175300872","type":"user-reviews","attributes":{"title":"TRASH","date":"2020-07-09T05:51:31Z","isEdited":false,"userName":"bryce hall✨","rating":1,"review":"LITERALLY STRAIGHT GARBAGE LIKE WHAT EVEN IS THIS. IMAGINE VOTING FOR SOMEONE WHO IS RACIST, SEXIST, AND HOMOPHOBIC. LETS NOT FORGET HOW HE ALSO SAID HE WOULD DATE HIS DAUGHTER. POLITICS ASSIDE I WANT MY PRESIDENT TO BE A GOOD PERSON AT THE END OF THE DAY. TRUMP IS DISGUSTING!!!! also this app made me fart a lot and cause lots of diarrhea. it made me sick and also stole my dog. we’ve been looking for my poor puppy for eight years. trump stole him. also this app is the reason lilhuddy cheated on charli. she definitely deserves better than him. so stan charli damelio for clear skin✨🧚‍♂️"}},{"id":"6175182374","type":"user-reviews","attributes":{"title":"Terrible.","date":"2020-07-09T05:06:56Z","isEdited":false,"userName":"Me.............. :)","rating":1,"review":"This app made all of my living room furniture come to life and try to kill me. Do you know how hard it is to kill a sectional? Not to mention how my tv started to laugh at me as I was attacked. I will never again be using this app and will NOT recommended it to anyone. Who knows what might have happened if I didn’t have my chainsaw in my oven."}},{"id":"6175091393","type":"user-reviews","attributes":{"title":"WORST APP EVER","date":"2020-07-09T04:36:24Z","isEdited":false,"userName":"yojan mendez","rating":1,"review":"so when i went out i wanted to buy me an orange from walmart . when i saw that the app had trump on it i said 2 my self “hmm trump has an orange face he could maybe help me with choosing the right orange, considering his face is orange” SOO , o went ahead and asked the app what orange i should get , next thing you know my orange disappears. till this day i wonder where my orange could be"}},{"id":"6175064041","type":"user-reviews","attributes":{"title":"Gave My Dog Cancer????","date":"2020-07-09T04:27:48Z","isEdited":false,"userName":"seriassly","rating":1,"review":"I downloaded this app to see if there was any news about DT and turns out when I opened the app my dog immediately started throwing up and having explosive diarrhea all over the house and we took her to the vet and now she has cancer?! I cant believe this app made my dog have cancer. Thanks a lot Donald DUMP! You flop and racist! You’ll be hearing from my lawyers!!"}},{"id":"6175059136","type":"user-reviews","attributes":{"title":"please read if you wanna live","date":"2020-07-09T04:26:18Z","isEdited":false,"userName":"trumps nudes","rating":1,"review":"I was so happy to get this app Hahahaha but then I got a warning and it says if I don’t delete this app right away, ICE was gonna come and take me away (I’m Mexican) I was sooooo scared so I deleted it right away. Friendly reminder :) trump DOES NOT LIKE ANY OTHER RACE but his own kind so please if you love yourself don’t support this corpse lol. Anyways goodbye have a blessed day y’all"}},{"id":"6174986427","type":"user-reviews","attributes":{"title":"HORRIBLE APP IN THE WORLD 🤮🤮","date":"2020-07-09T04:03:18Z","isEdited":false,"userName":"ratatatatatatttatatatatattata","rating":1,"review":"HORRIBLE. my pet chicken and i came from mexico to eat carne asada and then i said “oh, there’s a president app, let me get it.” but once i got it my pet chicken started choking a bat and then i hit my chicken but then he started coughing and then BOOM that’s how the coronavirus started SO I SUGGEST do NOT i said DO NOT, buy this app, i started the pandemic because of the DUMB app. \nhi trump, yes i crossed the border and you didn’t even know. ;)"}},{"id":"6174936534","type":"user-reviews","attributes":{"title":"disgusting","date":"2020-07-09T03:47:36Z","isEdited":false,"userName":"tessa brooks dabbb","rating":1,"review":"This is the worst app ever made. It is all false information. All of the content is brainwashing material for Americans. If you download this app, it could steal all your information and act like a virus. Very dangerous and scary news on here. For the sake of our country, do NOT get this app. What if radiation from the phone goes into your body? No thanks. Thank you, next."}}]}