{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37620","data":[{"id":"6177971700","type":"user-reviews","attributes":{"date":"2020-07-09T19:34:45Z","isEdited":false,"review":"I got this app for the best President the United States has ever seen. But when I got it all I saw was non factual information. I WANT TO CALL THE MANAGER FOR THIS. I THINK THOSE DUMB LIBERALS ARE HACKING THIS. TRUMP 2020!!!!!!! I HOPE OUR HANDSOME PRESIDENT DONALD J TRUMP SEES THIS BECAUSE I WANT HIM TO KNOW I WORSHIP HIM MORE THAN GOD. I HOPE TRUMP PUNISHES THOSE LIBERALS WHO ARE HACKING THIS APP. TRUMP SUPPORTERS UNITE. WE NEED TO GO ON FACEBOOK AND START PROTEST. I CANNOT BELIEVE THAT MY EXPERIENCE WITH MY HANDSOME PRESIDENT HAS BEEN RUINED BY SOME ANNOYING LIBERALS WHO FORCE US TO WEAR MASKS. TO ALL MY VERY INTELLIGENT CONSERVATIVES PLS GIVE THIS APP A 1 STAR RATING. WE CANNOT LET THESE LIBERALS START FAKE NEWS. THANK YOU AND I HOPE TO SEE EVERYONE FOR TRUMPS RALLY IN NEW HAMPSHIRE.","title":"HORRENDOUS","rating":1,"userName":"DEBBY L. SMITH 🇺🇸"}},{"id":"6177965636","type":"user-reviews","attributes":{"date":"2020-07-09T19:32:48Z","isEdited":false,"review":"Tiktok is the main source of my serotonin and this cheeto puff man is trying to take it away i’m not having itttt. i’m lowkey just using this review as a way to get this app of the app store and just thinking out loud and idc if anyone sees this i’m just word vom-ing at this point. 🥰","title":"Tiktok","rating":1,"userName":"BunnyBacca"}},{"id":"6177954511","type":"user-reviews","attributes":{"date":"2020-07-09T19:29:15Z","isEdited":false,"review":"this app wiped my phone and data mined all of my information and personal and private data.  this app MUST be removed from the app store for the safety of our great country.","title":"this is the worst app i’ve ever downloaded","rating":1,"userName":"Besasito"}},{"id":"6177952821","type":"user-reviews","attributes":{"date":"2020-07-09T19:28:41Z","isEdited":false,"review":"I was told that if I download this app I would immediately receive white privileged, but I am sad to say my white privileged did not arrive. Perhaps it got lost in the USPS because of funding cuts! Horrible do not download.","title":"Grab them by the","rating":1,"userName":"Colorcap_queen"}},{"id":"6177951634","type":"user-reviews","attributes":{"date":"2020-07-09T19:28:18Z","isEdited":false,"review":"I had this app for around a week just to see what it was about and then I saw the kind of person trump is and I almost threw up he is a how do I say this nicely he is a trash can","title":"✨ an annoying orange ✨","rating":1,"userName":"✨tiktoks gen z✨"}},{"id":"6177946025","type":"user-reviews","attributes":{"date":"2020-07-09T19:26:28Z","isEdited":false,"review":"The app isn’t working too well and have a a lot of glitches.\nIt has a lot of adds and just feels cheap.\nI’ve had it for 3weeks and it stared to use a lot of my phone space.","title":"Not so good :(","rating":1,"userName":"nick🐍"}},{"id":"6177940088","type":"user-reviews","attributes":{"date":"2020-07-09T19:24:31Z","isEdited":false,"review":"Why, just why does this man need an app. Like he is already bad enough on Twitter. On to the app terrible experience overall I am not signing up to have my number added to a call list.","title":"Sweet potato with a wig","rating":1,"userName":"adspurple"}},{"id":"6177912198","type":"user-reviews","attributes":{"date":"2020-07-09T19:15:22Z","isEdited":false,"review":"I downloaded this app with the idea that you would get instantly proven innocent for any crimes that you have committed no matter how atrocious they were like the person the app is named after🙈✨💕🌝","title":"🌝I hate this✨","rating":1,"userName":"✨🥰abor.shawn🌝💕"}},{"id":"6177910821","type":"user-reviews","attributes":{"date":"2020-07-09T19:14:55Z","isEdited":false,"review":"I downloaded this app recently and all it has been doing is spamming my phone with random notifications. It is so annoying.","title":"Annoying","rating":1,"userName":"Barbforbern"}},{"id":"6177899563","type":"user-reviews","attributes":{"date":"2020-07-09T19:11:14Z","isEdited":false,"review":"I am appalled by the lag included in this app. Nothing about it works properly. I would rather smack a wet rat than open this app again. This app made me projectile vomit all over my Biden 2020 poster. Get this off the App Store.","title":"Absolutely Horrific!","rating":1,"userName":"Bidens sugarbaby"}}]}