{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=49110","data":[{"id":"6172677768","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T15:25:50Z","rating":1,"review":"Terrible app!! It was the worst app I had ever seen in my life it took FOREVER to download! It was really glitchy and it kept kicking me out!! It had WAY TO MAY ADS!! And I was asking me to answer 5 surveys! This was terrible!!","userName":"jas and jae","title":"WORST APP EVER DO NOT GET!"}},{"id":"6172663609","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T15:21:49Z","rating":1,"review":"i was trying to support my awesome president bc that’s what good citizens do and this app is just trash like him like bruh if u have hella money why can’t u fix this well yuh y’all prolly can fix this by taking it down 🙈😁","userName":"juanalalocsjdudidksoskd387373","title":"CANCELLED THIS APP"}},{"id":"6172663574","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T15:21:49Z","rating":1,"review":"As a good christian woman i was horrified when after i downloaded this app, my whole family was ruthlessly slaughtered by lucifer him self. i blame nasty cheeto mans app for this because he’s an idiot and should eat woodchips.","userName":"PANICING AT THE DISCO","title":"This app is satanic."}},{"id":"6172660034","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T15:20:50Z","rating":1,"review":"This app made my mom go to jail. We won’t deal with this crappy app any longer. It also stole my credit card. Orange man is not helping his campaign by having this ridiculous app. The orange man belongs in jail not my mother!!!","userName":"trump 2020 ✨in jail✨","title":"F Trump"}},{"id":"6172656600","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T15:19:53Z","rating":1,"review":"Trump is the worst person on this planet today and gets praised to much for his own good! He is so misogynistic, racist, and all around horrible for America! Make America great again by getting rid of Trump!!!","userName":"MarieElizabeth","title":"This app is trash!!!"}},{"id":"6172646291","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T15:16:58Z","rating":1,"review":"this app took hours to download and once i finally open the app it glitched me out! any time i try to open the app i get kicked out. Terrible app, deserves 0 stars","userName":"naomieee5577","title":"DONT GET!"}},{"id":"6172637338","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T15:14:24Z","rating":1,"review":"This was a terrible app, don’t get it!!!!!, Trump is a disgusting person, this app should be taken down already, he is racist, sexist, rapist, homophobic, transphobic, biphobic, wants slavery back, he’s a racist orange man, we deserve Obama back","userName":"fairy567832","title":"Don’t get it"}},{"id":"6172620990","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T15:09:48Z","rating":1,"review":"This app is the dumbest app is the world :) nobody likes trump and everyone likes tiktok and I worked so hard for my followers and there just gonna throw that away just bc trump got his feelings hurt on what tiktok did! Wow such a baby!!! THIS CANT HAPPEN bruhhh","userName":"PinkCheakPanda","title":"UR TAKING DOWN TIKTOK?"}},{"id":"6172593633","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T15:02:14Z","rating":1,"review":"It’s was buggy and slow. The set up was confusing and I couldn’t find much information. It’s was almost as bad as the man himself!","userName":"Half rica","title":"Worst app in the App Store."}},{"id":"6172581019","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T14:58:46Z","rating":1,"review":"It’s always glitching 😡 and it causes a lot of bugs. It overloads my phone with notifications 25/7 and I’m getting sick and tired of hearing this reminders from the 🍊. PERIODT","userName":"Karlita_C","title":"This app is horrible 🍊 ✨🧚‍♀️"}}]}