{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24570","data":[{"id":"6174705613","type":"user-reviews","attributes":{"userName":"georgia lumpkin","review":"this app is really bad. every time i go on it it makes me vomit because i hate oranges and they have pictures of a big orange all over it with really small hands. he is really ugly and stupid. i hope someone eats the orange on the page so i can stop looking at it. i am definitely deleting this app because i hate it. maybe we should make a different app of someone who isn’t a racist, homophobic, rapist, republican fart head of a person. thanks for understanding and i’m sorry you work for a doo doo head you must feel so ashamed","date":"2020-07-09T02:38:38Z","isEdited":false,"rating":1,"title":"makes me shart and vomit"}},{"id":"6174704837","type":"user-reviews","attributes":{"userName":"rain smoke","review":"I was trying to order tacos on this app but instead it was trying to play this weird orange on my screen, I don’t want that. Also this app runs so slow. For example I was trying to open it and it kept crashing. I don’t recommend this app.","date":"2020-07-09T02:38:25Z","isEdited":false,"rating":1,"title":"Not worth anything...."}},{"id":"6174673401","type":"user-reviews","attributes":{"userName":"gm74527","review":"This app is a HUGE scam and you should NEVER download it. As soon as i opened the app it gave my phone a virus, wiped it completely clean and sent all of my personal information to scammers. Worst app ever made and the Trump administration should really look into the problems that this app caused me and everyone else i know who has it. DO NOT DOWNLOAD!!!!!!!","date":"2020-07-09T02:29:03Z","isEdited":false,"rating":1,"title":"VIRUS DO NOT DOWNLOAD"}},{"id":"6174669285","type":"user-reviews","attributes":{"userName":"voldemortlover123","review":"I got this app to, ya know, be up on the times with our president. It glitched so hard! Voldemort started whispering sensually in my ear saying that he wouldn’t even go there. It was so strange. Then he told me to get a bagel so at least something good came out of the encounter. Hope the glitch gets fixed soon!","date":"2020-07-09T02:27:55Z","isEdited":false,"rating":1,"title":"Unbelievably Huge Waste"}},{"id":"6174667400","type":"user-reviews","attributes":{"userName":"CatsWithHats97","review":"I tried to share my wonderful knowledge on how the lefties are a bunch of snowflakes, but I didn’t realize that I had MY OWN privileges to begin with 😭 How can I scream at people at a WalMart or Target if there’s no “insult snowflake” option??? I’m SO frustrated 😡😡 0/10. Brb on my way to scream at young people because I can’t get into Costco without a mask.","date":"2020-07-09T02:27:21Z","isEdited":false,"rating":1,"title":"I COULDNT BREATHE"}},{"id":"6174653606","type":"user-reviews","attributes":{"userName":"Lizzy Wright","review":"it took me 13 times to actually download this app it was absolutely ridiculous! it kept saying something about you must be a white sup- to download or like hail hitl- and once it finally started to work even the slightest it kept trying to convince me ALM is a thing or that the confederate flag isnt racist ? like?","date":"2020-07-09T02:23:23Z","isEdited":false,"rating":1,"title":"Waste of space"}},{"id":"6174649459","type":"user-reviews","attributes":{"userName":"Shortluna","review":"I downloaded this app and photos of crazy Steve (from drake and Josh) just started appearing. They took over my phone. My wallpaper, my contact photos, my nudes. All crazy Steve. It’s insane. Since then all I dream about is crazy Steve. Every waking moment I think of him. All because of this app. Save your self, don’t download.","date":"2020-07-09T02:22:08Z","isEdited":false,"rating":1,"title":"Crazy Steve"}},{"id":"6174639955","type":"user-reviews","attributes":{"userName":"Nickkk526","review":"This app is a total disaster, it was developed by some low IQ developer for some low energy candidate. Some people you know you look at all these people who are saying wow this app is tremendous. You know what I say? WRONG. SAD. Awful ratings too, you should see my apps they get ratings like nobody’s ever seen believe me","date":"2020-07-09T02:19:28Z","isEdited":false,"rating":1,"title":"Terrible, it’s a disaster, SAD"}},{"id":"6174639104","type":"user-reviews","attributes":{"userName":"donny should die","review":"WARNING! This application will give your phone chlamydia. Not only is blatant and flagrant racism encourages, but necessary for this app to function properly. I took my chicken nugget for a walk and the oven said, HOLA NINOS AHHHHH. So I went back to the prison and asked to speak to the manager only to be escorted by their superhero to the nearest rollercoaster.","date":"2020-07-09T02:19:14Z","isEdited":false,"rating":1,"title":"he takes our app, so we take his ❤️"}},{"id":"6174626509","type":"user-reviews","attributes":{"userName":"samuelman123","review":"This app is the worst. It isn’t helpful with information on rallies and how to support our president. I can’t believe that the trump administration would think this was a good platform because clearly it is not. It needs a lot of reconstruction and needs to be revamped to be more affective.","date":"2020-07-09T02:15:38Z","isEdited":false,"rating":1,"title":"Needs improvement"}}]}