{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=93130","data":[{"id":"6064623006","type":"user-reviews","attributes":{"isEdited":false,"userName":"corahafer","review":"i hate everything about this app","title":"don’t download","date":"2020-06-11T22:27:45Z","rating":1}},{"id":"6040909267","type":"user-reviews","attributes":{"isEdited":false,"userName":"baddest one of them all","review":"It was horrible, DO NOT recommend. They hacked me. 0/10","title":"🙄🙄🙄","date":"2020-06-06T03:07:34Z","rating":1}},{"id":"6036293962","type":"user-reviews","attributes":{"isEdited":false,"userName":"losloslid","review":"It keeps glitching because \"Are ya' sure she ain't dead?\" The crazy man with the backyard hat spoke. My eyes fluttered open, though it was blurry. \"I didn't touch her, I swear.\" ... That voice... Obama? I blinked and stared at the m. A security guard was interrogating the group. \"She's awake I see. So, she isn't dead. But I still need answers from you all so I can know what happened.\" \"I just wanted to pee.\" Spoke a man's voice. He had a hat that read 'Jake'. I pulled myself up a little more, surprised to see everybody I had met today. Lizzie was scolding that Nolan kid. She yelled, \"I swear, if you had anything to do with this young lady getting hurt, you won't hear the end of it!\"have not!\" Lizzie's tone was like a mothers. Johnathan, the one with the backyard hat, squirmed over his desk like a baby kitten who's trying to climb something to big for itself. He landed on his side and screamed \"HE'S INNOCENT!\" In reply, a tiny velociraptor screech sounded from my right. There was a tiny sniffle after that. It was nick, the one who had carried me to the bathroom to meet Obama. I got up and hugged him. \"Thank you animal friend.\" \"What the frick.\" Said the Nick. The 4 ft tall Danny Tanner hissed from the shadows, looking very very salty. He had a broken phone in his hand. I then heard the sound of a dog chewing on trash. It was trash, laying on the Josh's lap eating a paper cup from the trash. The Josh stroked the dog slowly, an angry scowl on his face. All my new friends were here. But why..? Then I saw my loved one approach me...Obama. Obama closed his eyes, though not dulling the sparkle in his eyes. He looked over to the security guard. \"Carmella, I don't think her actions deserve Then I saw my loved one approach me...Obama. Obama closed his eyes, though not dulling the sparkle in his eyes. He looked over to the security guard. \"Carmella, I don't think her actions deserve any severe punishment. And her head looks perfectly fine after falling. The only punishment I see fit for her, is that we keep her here over the night to talk more of her crimes.\" Wait.. + What crimes? T remembered what I had done to the wax sculpture... The red lipstick kisses on it.. Had Obama found it? \"Fine.\" Muttered Carmella. \"As long as she doesn't sleep in our room, we're fine with it.\" Spoke one of the kids that had approached me with Danny Tanner and Nick. The Emo one, Hannah, was the one that spoke. Next, came the smaller one, Heather. \"The bathrooms are ours at night!\"","title":"It keeps glitching","date":"2020-06-05T01:21:53Z","rating":1}},{"id":"6031409531","type":"user-reviews","attributes":{"isEdited":false,"userName":"isaac_something","review":"0/10, ran by a terrible person","title":"I love Donald Trump 🧚‍♂️⚡️ but on a gravestone 🥰💕","date":"2020-06-03T20:42:24Z","rating":1}},{"id":"6179189206","type":"user-reviews","attributes":{"isEdited":false,"userName":"Mar_Monate","review":"Froze my phone ! Showed racist and hateful content !!! I’m so offended and disgusted !","title":"WORST APP EVER","date":"2020-07-10T03:05:09Z","rating":1}},{"id":"5894533853","type":"user-reviews","attributes":{"isEdited":false,"userName":"Brofish","review":"Great app","title":"Great app","date":"2020-05-02T20:22:06Z","rating":5}},{"id":"6179164502","type":"user-reviews","attributes":{"isEdited":false,"userName":"I DON'T LIKE YOU AT ALL","review":"No, just no to ALL of it","title":"i hate this app","date":"2020-07-10T02:55:52Z","rating":1}},{"id":"6179149036","type":"user-reviews","attributes":{"isEdited":false,"userName":"colombianithawww","review":"Don’t download or you’re a simp","title":"Baddddd","date":"2020-07-10T02:50:03Z","rating":1}},{"id":"6179119556","type":"user-reviews","attributes":{"isEdited":false,"userName":"jehhdhdirbrhffhfvriddhddidi","review":"Do I really have to say that much about this app IT IS A TRUMP APP I AM LEAVING A BIG FAT 1 STAR REVIEW","title":"The worst app on the planet","date":"2020-07-10T02:39:08Z","rating":1}},{"id":"6179114083","type":"user-reviews","attributes":{"isEdited":false,"userName":"Addison Rose.","review":"it’s such a bad app. it took so long to download and it would not let me in ✨💅🏻","title":"horrible","date":"2020-07-10T02:37:08Z","rating":1}}]}