{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=139060","data":[{"id":"6179656636","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:36Z","isEdited":false,"title":"TO ALL THE PATRIOTS LOOKING TO DOWNLOAD PLEASE READ","review":"This app is damaging the minds of our elderly. It is exposing cult like practices to its viewers and calling it’s brainwashed followers “patriots”. Please don’t get this app or else you might end up brain dead and uneducated just like them!","userName":"Arrrrrrrttttt","rating":1}},{"id":"6179656574","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:35Z","isEdited":false,"title":"so disappointed.","review":"i had high hopes for this app and the trump campaign but once again i was let down. my email was spammed with propaganda that basically was fascism on trump’s part. they repeated asked me to donate money to supper them coming up with different prizes and awards stating that i was hand picked by the president because he knew i would donate. i feel as if my privacy has been invaded and that i’m being used for my money with nothing to gain from this. am i just a piggy bank to you? how dumb do you think i am to believe that you actually care about me and will hang my name up in your office if i donate? i feel used and utterly disgusted. any support i had disappeared which each email i received. do better.","userName":"trump was my inspiration","rating":1}},{"id":"6179656443","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:32Z","isEdited":false,"title":"DONT DOWNLOAD","review":"DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD DONT DOWNLOAD hi","userName":"man of riches","rating":1}},{"id":"6179656257","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:29Z","isEdited":false,"title":"Terrible","review":"Nothing but propaganda supporting old racists and baiting supremacists","userName":"zavandas","rating":1}},{"id":"6179656114","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:26Z","isEdited":false,"title":"Hi trump how ya doin?","review":"first of all this app is weird. don’t touch tik tok or you’ll regret it hun. and if i’m a snowflake, baby winter is coming.\nenjoy a h.s wattpad fan fiction, written by the lovely kidlava111\nSo I was working at Starbucks when I tripped over holding boiling hot coffee onto..... HARRY STYLES! Harry ignored the fact that he had extremely hot coffee on him and he asked me out on a date! I walked home by myself and I got jumped by a man! But don't worry zayn could hear my screams from 38193729372 Miles away and beat up the man and stayed in my home. We then bumped into Liam and told him that I was dating Harry. He then kicked and punched the wall and fought zayn. I ran off too Harry but I saw him dating another girl!!!! I got so angry I cried about it and wrote fanfics about it and ate ice cream.","userName":"skylarcat0179","rating":1}},{"id":"6179656062","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:25Z","isEdited":false,"title":"Terible","review":"Terible just terible","userName":"ISABELLA NICE","rating":1}},{"id":"6179655989","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:23Z","isEdited":false,"title":"This app is trash","review":"This app glitches my whole entire phone which costed 400$ to fix and the app is made so poorly that I honestly think a toddler developed it I don’t even know why this app is still on the App Store and Abe to download because of all of my PERSONAL INFORMATION that it HACKED. Like I’m not joking it literally hacked into my back account please for the love of god do not download this app or use it at all","userName":"hehehdkxhfjeks","rating":1}},{"id":"6179655945","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:22Z","isEdited":false,"title":"HORRIBLE","review":"Took forever to download, lags, not user friendly AT ALL. Has serious issues. Zero stars","userName":"fdt-cr","rating":1}},{"id":"6179655677","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:16Z","isEdited":false,"title":"HORRIBLE we Stan Charli 👑 and go off @unusualbeing!!GEN Z 4 life!","review":"Overall a horrible app and horrible name! Trump supporters what in the universe do you see in this monster that can “make America great again” I do not understand! He is not making America great in any possible way! Everything going on right now in America is because he is ignorant racist and so many more things that the trump supporters don’t want to see! He is disgusting! He said that if his daughter wants his daughter he would date her! That is DISGUSTING!! So many people are suffering because of the choices trump has done in the White House/government! Please trump supporters you have to have your mind open because he is not a good person! Please!! Oh and the app is horrible! Thanks for letting me rant!! ❤️bye stay safe fellow NOT trump supporters! Luv y’all 😷✊🏻✊🏼✊🏽✊🏾✊🏿🇲🇽🇺🇸","userName":"gagfejfsjfsfbjyahkodyevfox","rating":1}},{"id":"6179655603","type":"user-reviews","attributes":{"date":"2020-07-10T05:44:15Z","isEdited":false,"title":"Bad app, do not waste your time.","review":"Terrible app. Not as advertised. Takes forever to load and then crashes repeatedly. Don’t download - waste of space and time.","userName":"MN1948","rating":1}}]}