{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=85590","data":[{"id":"6175551614","type":"user-reviews","attributes":{"date":"2020-07-09T07:28:41Z","isEdited":false,"title":"WORST APP EVER!!","userName":"!debp","review":"under no circumstances get this app! unless you want a racist, misogynistic, rapist, man baby for president **WOULD NOT RECOMMEND!!** anyways... vote 4 biden✨✨","rating":1}},{"id":"6175549532","type":"user-reviews","attributes":{"date":"2020-07-09T07:27:50Z","isEdited":false,"title":"app is horrible!!","userName":"Miranda sings!!!","review":"the app took like 6 hours to download and it’s so much storage!!! i don’t recommend getting this god awful app!","rating":1}},{"id":"6175543423","type":"user-reviews","attributes":{"date":"2020-07-09T07:25:35Z","isEdited":false,"title":"no ❤️","userName":"TheEmpressEvie","review":"Once upon a time there was a lovely princess. But she had an enchantment upon her of a fearful sort, which could only be broken by Love's first kiss. She was locked away in a castle guarded by a terrible fire breathing dragon. Many brave knights had attempted to free her from this dreadful prison, but none prevailed. She waited in the dragon's keep in the highest room of the tallest tower for her true love and true love's first kiss. Like that's ever going to happen. What a loony. Shrek Beware Stay out I think he's in here. All right. Lets get it! Hold on. Do you know what that thing can do to you? Yeah. He'll groan into your bones for his brains. Well actually that would be a giant. Now Ogres, huh, they are much worse. They'll make a soup from your freshly peeled skin. They'll chew your livers, squeeze the jelly from your eyes. Actually, it's quite good on toast. Back, back beast, back! I warned you! Right. This is the part, where you run away. Yeah! And stay out. Wanted. Fairytale creatures. Right, this one is full. Take it away. Give me that. Your fine days are over. -25 pieces of silver for the witch. Next. -Come on. Sit down there! And be quiet! This cage is so small. You wouldn't turn me in. I'll never be stubborn again. I can change. Please, give me another chance. Oh, shut up! Next. What do we got? This little wooden puppet. I'm not a puppet, I'm a real boy. Five shillings for the possessed toy. Take it away. No! Please, don't let them do it! Next. What do you got? Well, I've got a talking donkey! Right. Well that's good for ten schillings, if you can prove it. Oh, go ahead fella. Well? He's just a li..., just a little nervous. He's really quite a chatterbox. You boneheaded donkey! That's it. I have heard enough. Guards! No, no, he talks, he does! I can talk. I love to talk. I've talked to... Get her out of my sight! -No, no, I swear! Hey, I can fly. -He can fly! -He can fly! He can talk! -That's right, fool! Now I'm a flying, talking donkey! You might have seen house fly, maybe even a superfly. But I bet you ain't never seen a donkey fly! Seize him! Get him! This way! Hurry! You there. Ogre. -I. By the order of lord Farquaad. I am authorized to place you both under arrest. And transport you to designated resettlement facility. Oh really? You and what army? Can I say something to you? Listen, you were really, really something, back there. Incredible. Are you talking to... ...me? Yes, I was talking to you. Can I just tell you that you were really great back there with those guards. They thought that was all over there. And then you showed up and BAM. There was tripping on over themselves like babes in the woods. That really made me feel good to see that. Oh, that's great. Really. Man, it's good to be free. Now, why don't you go celebrate your freedom with your own friends? But I... I don't have any friends. And I'm not going out there by myself. Hey wait a minute. I have a great idea... I'll stick with you. You and me in green fighting machine. Together we'll scare the spin if anybody crosses us. Oh, a, that was really scary. Maybe you don't mine me saying. If that don't work, your breath will certainly do the job done, 'cause... you definitively need some tic-tac or something, 'cause your breath stinks! Man you've ??? my note! Just like the time... ...and then I ate some rotten berries. Man I had some strong gases leaking out of my but that day. Why are you following me? I'll tell you why. 'Cause I'm all alone, there is no one here, beside me. My problems have all gone. There's no one to derive me. But you got to have free ... -Stop singing! Well, it's no wonder, you don't have any friends. Wow! Only a true friend would be that truly honest. Listen! Little donkey. Take a look at me! What am I? A... ...really tall? No! I'm an Ogre. You know, grab your torch and pitchforks. Doesn't that bother you? Nope. Really? -Really really. Oh? Man, I like you. What's your name? A..., Shrek. Shrek?! But do you know, what I like about you, Shrek? You've got that kind of: \"I don't care what nobody thinks of me\" thing. I like that, I respect that, Shrek. You're all right. Uh, look at that. Who would wanna live in a place like that? That would be my home. Oh, it is lovely. Just beautiful. You know you're quite a decorator. It's amazing what you did with such a modest budget. I like that boulder. That is a nice boulder. I guess, you don't entertain much, do you? I like my privacy. You know I do to. That's another thing, we have in common. Like I hate it when you got somebody in your face. You try to give them a hint and they won't leave. And then there's that big occurred silence, you know? Can I stay with you? -What? Can I stay with you, please. Of course! -Really? No. -Please! I don't want to go back there. You don't how is like to be concerned like a freak. Well..., maybe you do. But that's why we have to stick together! You got to let me stay! Please! Please! OK, OK. -But one night only. -Huh, thank you! A, what are you do... No! This is going to be fun. We can stay up late, swap the manly stories. And in the morning... I'm making waffles. Where do I sleep? Outside! Oh, a, I guess that's cool. You know, I don't know you and you don't know me... ... so I guess, outside is best for me. Here I go. Good night. I do like that half door. I'm a donkey all alone outside. Sit by myself outside, I guess. I'm all alone, there's no one here beside me. -I thought, I told you to stay outside. -I am outside. Well James. This is far from the farm, but what choice do we have? It's not... What a lovely bed. -Got you! I found some cheese. Awful stuff. -Is that you Gordon? -How did you know? Enough! What are you doing in my house?","rating":1}},{"id":"6175541699","type":"user-reviews","attributes":{"date":"2020-07-09T07:24:57Z","isEdited":false,"title":"worst app in the world","userName":"miguel👾","review":"The app took about 8 hours to download and showed me trumps nudes😔😔👎🏽","rating":1}},{"id":"6175539320","type":"user-reviews","attributes":{"date":"2020-07-09T07:24:05Z","isEdited":false,"title":"Bad😬","userName":"guesswho;)","review":"Don’t even waste your time bro.","rating":1}},{"id":"6175535587","type":"user-reviews","attributes":{"date":"2020-07-09T07:22:43Z","isEdited":false,"title":"this app hacked my phone","userName":"snapchat-nyejhaslays","review":"this app took 5 days to download and is being very laggy and hacked my phone and took data i am very angry at this app","rating":1}},{"id":"6175514556","type":"user-reviews","attributes":{"date":"2020-07-09T07:14:37Z","isEdited":false,"title":"Do not Download","userName":"weyiphsvbbdsmmg","review":"It took so long to download and is full of dull nonsense about the donald trump","rating":1}},{"id":"6175505133","type":"user-reviews","attributes":{"date":"2020-07-09T07:10:53Z","isEdited":false,"title":"100% DO NOT RECOMMEND","userName":"kayduwkjduwlahdbkf","review":"If I could leave a zero star review I would in a heartbeat not only did this app take 98 years to download but the moment it did my life was never the same as soon as it downloaded my nipples fell off my body and disintegrated right before my very eye I tried to draw them back on but they just kept disappearing after I recovered from the shock I realized I wasn’t in my house anymore I was in the White House and Donald trump himself was bathing in Cheeto dust right in front of me and beckoned for me to join him I immediately declined and tried to go back to my house but was stopped by a giant Cheeto who told me if I didn’t vote for trump I would be turned into a Cheeto and crushed up and used as his foundation moments before my demise melania trump herself ran in and rescued me and said she can’t leave but she can help me escape then when I returned home and tried to delete my app jfk busted into my home with his brain still seeping out on the floor said that if I delete this app he will bite off my toes like Cheetos and feed them to his wife I tried to run but my bones in my legs turned into Cheeto dust and I couldn’t run them my mom came home and found me lying on the floor trying to escape jfk she immediately chopped off the rest of his head with a machete and scooped me up and now we are on the run I am afraid for my life and it is all because of this dad gum app NEVER GET THIS APP plus I ran out of radishes and that pain of running out of radishes stays with you forever a skeleton man came and tried to show me his new sneakers I said sorry bone bag but a spider lives in my brain and the and now all that’s in my head is a tall glass of water and my son immediately died this app destroys families and it will destroy this country just like this Cheeto boy is doing","rating":1}},{"id":"6175441266","type":"user-reviews","attributes":{"date":"2020-07-09T06:45:34Z","isEdited":false,"title":"Pizza pasta bagangaroo","userName":"pizza pasta bangaroo 🧀🥖🍕","review":"Terrible just the worst trump himself called me and called me slurs absolutely no respect for the Italians and my brother 🧀🥖🍕 pizza pasta bagangaroo","rating":1}},{"id":"6175224320","type":"user-reviews","attributes":{"date":"2020-07-09T05:22:00Z","isEdited":false,"title":"Don’t download this app","userName":"cfddskfsfn","review":"Worst app ever it wastes storage and steals your money","rating":1}}]}