{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=18510","data":[{"id":"6173713057","type":"user-reviews","attributes":{"date":"2020-07-08T21:01:00Z","title":"Worst app Ever not worth it","rating":1,"isEdited":false,"userName":"Ashlees.m","review":"Took forever to download, once it finally downloaded it wouldn’t start up. Kept kicking me out of the app really did not expect this from the app was really looking forward to using this app 🥺 and verryyy sad I won’t be able to use it since it’s got multiple issues. Would not recommend, sorry."}},{"id":"6173679613","type":"user-reviews","attributes":{"date":"2020-07-08T20:48:48Z","title":"this app is probably made by satan","rating":1,"isEdited":false,"userName":"(: (; ..........,..","review":"while opening the app first of all, I tripped down the stairs and almost broke a leg, so I think its cursed with bad spirits, and I can’t be manifesting anything negative so ya. Secondly this app takes up too much space on my phone, and I cannot possibly allow that. Mr president, I hate u and ur app now because of this!! Also it keeps glitching❤️(it keeps glitching btw)"}},{"id":"6173672553","type":"user-reviews","attributes":{"date":"2020-07-08T20:46:12Z","title":"Disgusting.","rating":1,"isEdited":false,"userName":"TrumpIsAPed0ph1le","review":"ive been a big supporter since the beginning, and downloaded this app to get information about trump and current events. I open the app and the first thing that popped up on my screen was an ad featuring Donald Trump naked! I was disgusted! if I could rate it 0 stars i would.  i will not be supporting him any longer! He seems to be praying on young children with these ads!"}},{"id":"6173672254","type":"user-reviews","attributes":{"date":"2020-07-08T20:46:06Z","title":"What a horrible app","rating":1,"isEdited":false,"userName":"yatusabes_ema","review":"I still don’t know why this app is even in the App Store it should be taken down ! This app made my phone glitch really bad the only reason I even downloaded it was to see what the hype was abt Donald trump but I regret downloading this app my phone now has a lot of viruses this is a dumb app that should be token off . I’m sure a lot of people can agree with me."}},{"id":"6173634214","type":"user-reviews","attributes":{"date":"2020-07-08T20:32:33Z","title":"Don’t waste your storage or time","rating":1,"isEdited":false,"userName":"VictoriVicki","review":"This app is absolutely horrible. I normal don’t write reviews for apps, but I made an exception for this abomination of all apps. Everything written on it are full of lies, that make me want to vomit. It does not update its user often, so many of the applications are not available. Don’t waste your storage on this one. This app made me hate Trump. #Biden2020"}},{"id":"6173620920","type":"user-reviews","attributes":{"date":"2020-07-08T20:27:51Z","title":"ABSOLUTELY HORRIBLE","rating":1,"isEdited":false,"userName":"wnduejebbddjn","review":"This app is horrible. It took so long to download. I went to walk my caterpillar and it still wasn’t downloaded. Additionally the colors on the app the word “Trump” induce intense nausea and body aches. Once the app downloads you are taken to a page where there is a hideous orange man with his fist up and it will immediately make you vomit. That man is so hideous. -20/10 would not recommend this app."}},{"id":"6173616083","type":"user-reviews","attributes":{"date":"2020-07-08T20:26:07Z","title":"Don’t download!!","rating":1,"isEdited":false,"userName":"death slip","review":"This app made me feel so sad when it turned my dog into an 18 year old child, I cannot control him and he now has the the ability to vote, he’s still marking better decisions than most Americans but he is a dog, and I would like him back. Also it made me trade out all my adult beverages for white claw, and all my nerf guns are now loaded with 115 gr jacketed hollow points, DO NOT GET THIS APP!!!"}},{"id":"6173616014","type":"user-reviews","attributes":{"date":"2020-07-08T20:26:05Z","title":"Glitches A lot","rating":1,"isEdited":false,"userName":"SamanthaLy123","review":"i know that there are a lot of kids giving one star reviews because of tiktok, but the app actually did make my phone glitch and after a while the app wouldn’t even open at\nall. I tried re downloading it but it still did not work, it might be my older phone but it wasn’t a good experience."}},{"id":"6173603704","type":"user-reviews","attributes":{"date":"2020-07-08T20:21:40Z","title":"awful app","rating":1,"isEdited":false,"userName":"cmulford12","review":"the worst app I’ve ever downloaded. as soon as I opened it my phone crashed and I had to buy a new one. then I tried to download it again and my phone started smoking. I think this app contains the devil or something that keep possessing my phone and then destroying it. I do not recommend getting this app nor do I recommend voting for the racist rapist it sponsors."}},{"id":"6173597412","type":"user-reviews","attributes":{"date":"2020-07-08T20:19:24Z","title":"Why you shouldn’t get this terrible app","rating":1,"isEdited":false,"userName":"The facts101","review":"This app is disgusting. It doesn’t even deserve one star. It gives you information that isn’t even true. You DO NOT need this app. It’s terrible. This app will help you with nothing. It’s a shame that apple still lets this app exists, because it’s useless. Just don’t get this app and it will help you more then getting it."}}]}