{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24510","data":[{"id":"6175796919","type":"user-reviews","attributes":{"review":"when you first download it, everything looks good but when you sign up your whole phone starts glitching. If you read the terms and conditions closely it states that the Trump Campaign will access any activity on your phone. I do not recommend!","title":"terrible","userName":"eydien","date":"2020-07-09T08:55:01Z","isEdited":false,"rating":1}},{"id":"6175736754","type":"user-reviews","attributes":{"review":"I was told this app could update me about public restrooms that are open during the coronavirus pandemic. You know, they’re called “Dump Rallies” I think? Anyways, they’re all too far from where I live and unfortunately already filled with feces. Please do not use this app.","title":"Would not recommend.","userName":"Trump Supporter ~UWU~","date":"2020-07-09T08:34:20Z","isEdited":false,"rating":1}},{"id":"6175710031","type":"user-reviews","attributes":{"review":"I was actually looking forward to this but the app first of all didn’t even download after several attempts but it also stole all my information and now I won’t stop getting random robo calls it’s horrible!!! If I could give this app 0 stars I would!! Please don’t get this app!!!!","title":"DONT GET THIS APP","userName":"ChessyPeanut","date":"2020-07-09T08:25:11Z","isEdited":false,"rating":1}},{"id":"6175680344","type":"user-reviews","attributes":{"review":"It took over two days to download and when it did it hacked my phone and took my information with out my consent. It started to flood my email and messages with a bunch of scam links. It took up so much storage and drained my battery mega fast. Rate it 0/10 do not recommend!","title":"HORRIBLE","userName":"drsbbshsbsh","date":"2020-07-09T08:15:10Z","isEdited":false,"rating":1}},{"id":"6175667795","type":"user-reviews","attributes":{"review":"NOT A GOOD APP AT ALL. DO NOT DOWNLOAD. This app practically spit in my face with how slow it is with loading times. Not to mention it’s literally run with nano processors that cause it to take a million years to give you what you want. Also it’s dedicated to a racist, sexist, and homophobic president, so there’s that. Absolutely do not recommend, spend your time elsewhere","title":"THE WORST","userName":"mikepence69420","date":"2020-07-09T08:10:51Z","isEdited":false,"rating":1}},{"id":"6175650092","type":"user-reviews","attributes":{"review":"this app gave my phone a HORRIBLE virus. they called my phone nonstop for 24 hours straight. not to mention, every time I opened any other app it IMMEDIATELY crashed. I had to get a completely new phone and new number. absolutely horrible. so much money wasted !!! the gays would never do me like this. 😞","title":"hot garbage !!!! 😤😤","userName":"Patsyyyyyyyyyyyyyyyyyyyy","date":"2020-07-09T08:04:41Z","isEdited":false,"rating":1}},{"id":"6175642381","type":"user-reviews","attributes":{"review":"I am absolutely astonished at how awful this app is !!!! I wanted to support my amazing president and it took 5 hours to download and when I tried to click on the app it shut out! I just wanted my parents to be proud of me for supporting their favorite Cheeto.😔 Now I guess I’ll have to sleep on the cold basement floor tonight. 😪","title":"Horrible","userName":"Ashley22❤️❤️","date":"2020-07-09T08:01:54Z","isEdited":false,"rating":1}},{"id":"6175610716","type":"user-reviews","attributes":{"review":"The worst app i’ve EVER downloaded. I came here expecting to see the campaign of a wonderful president and all i found was something disgusting. It doesn’t capture who my president is AT ALL. i am ultimately dissapointed and will never be the same again from this app. PLEASE take this app off the store.","title":"Dissapointed all around","userName":"lametings","date":"2020-07-09T07:50:20Z","isEdited":false,"rating":1}},{"id":"6175595616","type":"user-reviews","attributes":{"review":"the app is awful... it took way too long to download and just glitched constantly not good at all, I couldn’t find anything educational or productive on this app. it helped me on no way shape or form and no one should get the app it will probably put a virus on your phone. it’s not worth it. worst app ever","title":"do not!!!","userName":"user2579","date":"2020-07-09T07:44:53Z","isEdited":false,"rating":1}},{"id":"6175573156","type":"user-reviews","attributes":{"review":"First and foremost the app wouldn’t even let me sign in most of the time and it would log me out out of nowhere and then it would keep on asking to rate the app and if I didn’t rate it it would keep in login me out so for you patience and ours you you not download the app","title":"This app suckkkkkkkkkssssss!!!!","userName":"deadbringer248","date":"2020-07-09T07:36:30Z","isEdited":false,"rating":1}}]}