{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35380","data":[{"id":"6173578966","type":"user-reviews","attributes":{"review":"It hacked my phone so that everything was in Chinese for 2 weeks after taking forever like 3 days to download! when i finally opened the app donald trump was animated saying some very inappropriate things! this is so gross!","rating":1,"userName":"ᴄᴛʜᴇᴘᴇᴀᴄʜ","title":"Worst app ever","date":"2020-07-08T20:12:59Z","isEdited":false}},{"id":"6173573763","type":"user-reviews","attributes":{"review":"This is a bad app and I would never recommend to anyone I was told that I needed to pay how ever I said I couldn’t and they wouldn’t stop begging now I support Trump but this eight here this app is horrible and I will never use again","rating":1,"userName":"2020 booiiiiiiii","title":"Terrible","date":"2020-07-08T20:11:13Z","isEdited":false}},{"id":"6173562582","type":"user-reviews","attributes":{"review":"This app took weeks to download and trump said he was going to send me a check and have yet to get it also the slow and the app have trackers and scammers called my phone asking about this app","rating":1,"userName":"antiniqueportis","title":"Horrible","date":"2020-07-08T20:07:23Z","isEdited":false}},{"id":"6173556344","type":"user-reviews","attributes":{"review":"this is just horrible. The app keeps crashing and glitching out. It won’t even let me access the app without my entire phone screen just go to black. Ridiculous. Should be removed from App Store.","rating":1,"userName":"Cynthia Smith127","title":"WORST APP","date":"2020-07-08T20:05:17Z","isEdited":false}},{"id":"6173555551","type":"user-reviews","attributes":{"review":"Made me get diarrhea not once but 5 times, this app also took 3 HOURS to load plus the supporters of this app are racist. Would NEVER download again please do not waste your time on this app it is horrendous. Thank you 🤡👑😻","rating":1,"userName":"Manu3444","title":"Absolutely horrible","date":"2020-07-08T20:05:01Z","isEdited":false}},{"id":"6173552369","type":"user-reviews","attributes":{"review":"if i could give this ZERO stars, i would!! NOTHING about this app runs smoothly and i am SORELY disappointed, but not surprised, with the trump administration (in more ways than one). the orange man on this app was very unappealing and unattractive. will NOT be recommending this app to ANYONE else in the future.","rating":1,"userName":"thiccie meg","title":"HORRIBLE APP >:(","date":"2020-07-08T20:03:57Z","isEdited":false}},{"id":"6173538651","type":"user-reviews","attributes":{"review":"Whenever I see the five star reviews i \nusually think their bots. Because this app is so terrible if you want to save some time download subway surfers instead. It’s easier to use cheaper and more ad free.","rating":1,"userName":"snook ums","title":"Don’t get ...","date":"2020-07-08T19:59:21Z","isEdited":false}},{"id":"6173531481","type":"user-reviews","attributes":{"review":"I have never seen such a worst app honestly like don’t get it it’s so pointless it also had some orange faced guy pop up on my screen multiple times 🟠 like I think that it is installing a virus into my phone 🤬🤬🤬","rating":1,"userName":"sj_wrld","title":"Worst app ever","date":"2020-07-08T19:56:54Z","isEdited":false}},{"id":"6173531205","type":"user-reviews","attributes":{"review":"this app needs to be deleted 🤮 it’s glitchy, doesn’t work, and sent me notifications when i told it not to. it even says my notifications are off in settings but it still sends them to\nme. DONT GET THIS APP ITS HORRIBLE","rating":1,"userName":"Carmily","title":"terrible app✨","date":"2020-07-08T19:56:48Z","isEdited":false}},{"id":"6173530235","type":"user-reviews","attributes":{"review":"This app took forever to download and when finally got to use it crashed. Later while having the app still on my phone my phone crashed and now I can't open a lot of apps on my phone. DO NOT GET THIS APP!!!!!","rating":1,"userName":"Eilytorres","title":"Worst app ever","date":"2020-07-08T19:56:27Z","isEdited":false}}]}