{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27020","data":[{"id":"6174148123","type":"user-reviews","attributes":{"title":"I feel unsafe using this app","review":"Every time I use this app I feel like I lose a piece of my soul and sanity, it really don’t recommend anyone getting it! It also promotes socially destructive ideologies such as racism, fascism, homophobia and uses abusive and offensive language that shouldn’t be used to represent any country on the face of Earth.","date":"2020-07-08T23:43:11Z","userName":"wherearemyyams","rating":1,"isEdited":false}},{"id":"6174126716","type":"user-reviews","attributes":{"title":"Icky icky ew","review":"This app is predatory. It preys on young girls and spreads STDs like wildfire. The app itself is so flawed, biased, and racist I can’t bear to look at it any longer. It should be taken off the App Store and outlawed in this country. It spreads a message of hate. I’d rather stick my entire head into a beehive than see this man- I mean app- succeed in any way possibly.","date":"2020-07-08T23:35:09Z","userName":"loveMEbugzy","rating":1,"isEdited":false}},{"id":"6174115969","type":"user-reviews","attributes":{"title":"horrible app.","review":"this is unreal! I have to DOWNLOAD an app to see an absolute small minded cheeto? the cheeto is so orange, that not even an orange can match this things colour! this is absolutely unreal. why is this even in the app store? anyone who owns this app is an uncultured swine. a bastard. and most importantly. whoever made this app.. your moms a... you can finish the sentence yourself! 😇","date":"2020-07-08T23:31:13Z","userName":"The Karen across the Street","rating":1,"isEdited":false}},{"id":"6174097762","type":"user-reviews","attributes":{"title":"THIS APP SHOULD BE BANNED 😞💔","review":"i download the app because my pet lizard\ntold me too but the minute i did i ended up seeing a cheeto man SMALL PP , i dropped my phone after seeing the disturbing image and almost died by getting hit by a bus bc of the disgusting image on my brain , THIS APP SHOULDNT EXIST and if you continue letting this app be available YOU’RE A PART OF THE PROBLEM 😖😩🤬","date":"2020-07-08T23:24:35Z","userName":"Add more artists","rating":1,"isEdited":false}},{"id":"6174085473","type":"user-reviews","attributes":{"title":"Extremely offensive","review":"I downloaded the app to see Mr. Chito man just pop up on my screen he’s got a racist kind of night not really acting like he’s extremely racist so I don’t know why anybody would support him but if you do then you’re weird and also I’m writing this out for like one","date":"2020-07-08T23:20:01Z","userName":"gahjdjndbzhrr","rating":1,"isEdited":false}},{"id":"6174075767","type":"user-reviews","attributes":{"title":"How can someone want to download this app","review":"I understand that trump is better than some presidents, but his app is just so disgusting like this just makes him look like even worse of a person. So please don’t download this app. Honestly I think you should write a bad review too.","date":"2020-07-08T23:16:41Z","userName":"NbN_Speed","rating":1,"isEdited":false}},{"id":"6174073358","type":"user-reviews","attributes":{"title":"Gen z is stronger","review":"This app literally made me projectile vomit all over the place because I had to look at bunker boy’s cheap spray tan as soon as I opened the app! 🤢😷how he gonna be rich and still can’t afford a decent spray tan or wig? Like chile 🥴also, we seriously don’t need his temper tantrums anymore...like why is he always mad???","date":"2020-07-08T23:15:47Z","userName":"Why-Would-you?","rating":1,"isEdited":false}},{"id":"6174072247","type":"user-reviews","attributes":{"title":"Don’t get!!!","review":"Omg omg omg it asked for my phone number!!!! I can’t! This app will still your private information and give it to the government. This lil Cheeto dude or whatever his name was, is going to track you and then kidnap you because he knows your address and he will force you to vote 😤😤😤 do not get this app!!","date":"2020-07-08T23:15:21Z","userName":"BabyRooo","rating":1,"isEdited":false}},{"id":"6174067739","type":"user-reviews","attributes":{"title":"Retarded app","review":"This app was not functional and I had to see the horrifying picture of a Cheeto with yellow hay onto of it that was talking! A Cheeto isn’t supposed to talk! It was honestly terrifying, my eyes are scared for life...I need to rinse them with bleach. I never want to see that Cheeto or orange or whatever that thing was again. This app is just..a no 🤡","date":"2020-07-08T23:13:37Z","userName":"Kcarren","rating":1,"isEdited":false}},{"id":"6174062691","type":"user-reviews","attributes":{"title":"Excuse me","review":"Unforgivable!!! When I opened the app videos and pictures do this small orange baby screaming and when I tried to close the app the screaming kept going so I smashed my phone so it can stop working and now I had to go buy a new one thanks a lot! You guys own me a new phone 😡","date":"2020-07-08T23:11:49Z","userName":"gxknsshsg","rating":1,"isEdited":false}}]}