{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30650","data":[{"id":"6173697777","type":"user-reviews","attributes":{"rating":1,"userName":"shrekilleoneal","isEdited":false,"review":"Do NOT download this! It installs a virus called Trump 2020 on your iPhone! If you open it you’ll be met with nothing but the feeling of being super racist without actually doing anything at all. Overall, super disappointing and kinda scary. Don’t recommend.  0/10.","title":"Kinda Racist :/","date":"2020-07-08T20:55:21Z"}},{"id":"6173696697","type":"user-reviews","attributes":{"rating":1,"userName":"peachcummy","isEdited":false,"review":"App doesn’t work well at all. What a terrible app it needs to be off the App Store all it does is freeze your screen on a picture of what seems to be a dusty cheeto :( very scary do not recommend","title":"Wish I could give it less than 1 star","date":"2020-07-08T20:54:58Z"}},{"id":"6173690434","type":"user-reviews","attributes":{"rating":1,"userName":"🍊🍑🐀","isEdited":false,"review":"This app is the worst app EVER. I was unable to stream Shrek and and my pet beaver was traumatized for life. I fear it may never be able to drink water normally again. The neighborhood rats teamed up to destroy me!! They ripped my heart to pieces, and despite being white the police was unable to help me. Please delete the app.","title":"Delete this app 🤮","date":"2020-07-08T20:52:43Z"}},{"id":"6173684127","type":"user-reviews","attributes":{"rating":1,"userName":"thisisforraxhel257890","isEdited":false,"review":"For one when it took forever to download. Once it did my phone keep glitching, and it would kick me off the app. Now my phone won’t turn on and I’m writing this review off of my laptop. Hopefully it won’t make my laptop break too.","title":"Worst App ever","date":"2020-07-08T20:50:26Z"}},{"id":"6173669499","type":"user-reviews","attributes":{"rating":1,"userName":"annamariebuddy","isEdited":false,"review":"So I decided to download this app and give it a try. I was very excited to start using it however it took about a WEEK to fully download and it took up SO MUCH storage!!!! I also kept being asked if I wanted to buy Cheetos which really confused me.","title":"Do NOT download!","date":"2020-07-08T20:45:08Z"}},{"id":"6173665855","type":"user-reviews","attributes":{"rating":1,"userName":"andvrbbedbsb","isEdited":false,"review":"It took me 4 weeks to install this stupid app!!! I hate it so much because it’s not worth the wait!! I waited far too long for nothing!!!!! I was up waiting for it to install and it never loaded!!!!!!!!!!!!!!!!!! Absolutely worst app ever!!!! This app needs to be deleted ASAP!!!!!!!!!! DO NOT EVER GET THIS APP!!! IM WARNING YOU!!!!!! IT IS NOT WORTH IT!!!!!","title":"Horrible app","date":"2020-07-08T20:43:50Z"}},{"id":"6173662926","type":"user-reviews","attributes":{"rating":1,"userName":"Boring bri","isEdited":false,"review":"I should have listened to the other reviews. This app could not be worse if it tried. I genuinely liked nothing about it, it is set up horribly, and I am embarrassed to have ever downloaded it. I would give it 0 stars if possible","title":"Don’t get","date":"2020-07-08T20:42:47Z"}},{"id":"6173661276","type":"user-reviews","attributes":{"rating":1,"userName":"shellmushroom","isEdited":false,"review":"I waited an hour for this app to download and then when I went on the app, it wouldn’t let me go back on? Why would they have an app you can not even go on? Not worth downloading. Disappointing in the least!","title":"Not worth the download 😡","date":"2020-07-08T20:42:14Z"}},{"id":"6173658976","type":"user-reviews","attributes":{"rating":1,"userName":"Gen Z🧚🏻‍♀️","isEdited":false,"review":"Absolutely terrible, as soon as I opened the app, it would just be a blank screen saying “all apps matter”. I was unable to educate myself about our president and therefore would not recommend anyone to download this app.","title":"All apps matter","date":"2020-07-08T20:41:25Z"}},{"id":"6173657177","type":"user-reviews","attributes":{"rating":1,"userName":"hdksgskdhsk","isEdited":false,"review":"I thought this was an app to watch videos of Annoying Orange!!! But this new actor who plays Annoying Orange isn’t funny anymore, but I have to hand it to him: he really nailed the orange bit. Maybe start a spin-off called annoying Cheeto?? Just a thought","title":"NOT what I thought 🍊","date":"2020-07-08T20:40:46Z"}}]}