{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=86880","data":[{"id":"6177575147","type":"user-reviews","attributes":{"review":"I DO NOT RECOMMEND!!! It was the worst app ever. I tried to open it and get educated on our wonderful president trumpand it wouldn’t even let me in without me getting six different adds all about liberals😡 when I finally got in it started playing music that summoned the demons in my house (just got rid of them two days ago) after I did some cleansing and Sageing and wearing garlic around my neck I finally got them out but then I tried to open the app again and this time and get this rats came. I’ve heard about a few ppl having the rat problem and I went searching on google all it said was that I had to travel to the sacred mountain of oranges and sacrifice a tiny orange Cheeto well like any rational person does I went to the White House and ask the kids in the basement where I could find a tiny orange Cheeto they said that Donald trump wee wee was about the size maybe smaller so we gathered up and made a plan we were going to steal his wee wee for the sacrifice. I sent two of the children up to occupy him which consisted of putting a gag ball in his mouth and tying him up in a chair fully naked and secure the Cheeto. As the kids were coming back with the Cheeto they saw the secret service coming, wait that’s not the secret service!!! That’s Oompa Loompas!!! The Oompa Loompas came to help and they killed off all the rest of the secret service men!!! They were coming to help everyone in the basement escape!! As we were escaping with the Cheeto in a bag we saw Barron trump and knew what we had to do. We needed to save him but I had to take the Cheeto to the sacred orange mountain. So I said my goodbyes and told them to take Barron trump to a secure house and wait there. As I was making my way to the sacred orange mountain I saw the monkeys from wizard of oz hurtling towards me. I had to fight them off so I grabbed what was closest to me a stick but no this was not ordinary stick this was hermiones wand as I waved it started shooting sprits of magic to the monkeys and started to shrivel them up leaving them looking like the paw in monkeys paw in WW Jacobs short story. After this task i kinda got lost so I asked THE MAP where to go he told me but not before swiper swiped the Cheeto wee wee I was terrified but I said swiper no swiping and he didn’t swipe. I suddenly teleported to the mountain of oranges where I then sacrificed the Cheeto wee wee and i got rid of the rats. But long story short this app is vile.","userName":"limabean_05","date":"2020-07-09T17:30:51Z","rating":1,"title":"WORST APP EVER🤢","isEdited":false}},{"id":"6177562355","type":"user-reviews","attributes":{"review":"i tried really hard to get the app open but it kept on glitching i dont know why","userName":"Danefi","date":"2020-07-09T17:26:42Z","rating":1,"title":"bad","isEdited":false}},{"id":"6177552819","type":"user-reviews","attributes":{"review":"According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don't care what humans think is impossible. Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let's shake it up a little. Barry! Breakfast is ready! Ooming! Hang on a second. Hello? - Barry? - Adam? - Oan you believe this is happening? - I can't. I'll pick you up. Looking sharp. Use the stairs. Your father paid good money for those. Sorry. I'm excited. Here's the graduate. We're very proud of you, son. A perfect report card, all B's. Very proud. Ma! I got a thing going here. - You got lint on your fuzz. - Ow! That's me! - Wave to us! We'll be in row 118,000. - Bye! Barry, I told you, stop flying in the house! - Hey, Adam. - Hey, Barry. - Is that fuzz gel? - A little. Special day, graduation. Never thought I'd make it. Three days grade school, three days high school. Those were awkward. Three days college. I'm glad I took a day and hitchhiked around the hive. You did come back different. - Hi, Barry. - Artie, growing a mustache? Looks good. - Hear about Frankie? - Yeah. - You going to the funeral? - No, I'm not going. Everybody knows, sting someone, you die. Don't waste it on a squirrel. Such a hothead. I guess he could have just gotten out of the way. I love this incorporating an amusement park into our day. That's why we don't need vacations. Boy, quite a bit of pomp... under the circumstances. - Well, Adam, today we are men. - We are! - Bee-men. - Amen! Hallelujah! Students, faculty, distinguished bees, please welcome Dean Buzzwell. Welcome, New Hive Oity graduating class of... ...9:15. That concludes our ceremonies. And begins your career at Honex Industries! Will we pick ourjob today? I heard it's just orientation. Heads up! Here we go. Keep your hands and antennas inside the tram at all times. - Wonder what it'll be like? - A little scary. Welcome to Honex, a division of Honesco and a part of the Hexagon Group. This is it! Wow. Wow. We know that you, as a bee, have worked your whole life to get to the point where you can work for your whole life. Honey begins when our valiant Pollen Jocks bring the nectar to the hive. Our top-secret formula is automatically color-corrected, scent-adjusted and bubble-contoured into this soothing sweet syrup with its distinctive golden glow you know as... Honey! - That girl was hot. - She's my cousin! - She is? - Yes, we're all cousins. - Right. You're right. - At Honex, we constantly strive to improve every aspect of bee existence. These bees are stress-testing a new helmet technology. - What do you think he makes? - Not enough. Here we have our latest advancement, the Krelman. - What does that do? - Oatches that little strand of honey that hangs after you pour it. Saves us millions. Oan anyone work on the Krelman? Of course. Most bee jobs are small ones. But bees know that every small job, if it's done well, means a lot. But choose carefully because you'll stay in the job you pick for the rest of your life. The same job the rest of your life? I didn't know that. What's the difference? You'll be happy to know that bees, as a species, haven't had one day off in 27 million years. So you'll just work us to death? We'll sure try. Wow! That blew my mind! \"What's the difference?\" How can you say that? One job forever? That's an insane choice to have to make. I'm relieved. Now we only have to make one decision in life. But, Adam, how could they never have told us that? Why would you question anything? We're bees. We're the most perfectly functioning society on Earth. You ever think maybe things work a little too well here? Like what? Give me one example. I don't know. But you know what I'm talking about. Please clear the gate. Royal Nectar Force on approach. Wait a second. Oheck it out. - Hey, those are Pollen Jocks! - Wow. I've never seen them this close. They know what it's like outside the hive. Yeah, but some don't come back. - Hey, Jocks! - Hi, Jocks! You guys did great! You're monsters! You're sky freaks! I love it! I love it! - I wonder where they were. - I don't know. Their day's not planned. Outside the hive, flying who knows where, doing who knows what. You can'tjust decide to be a Pollen Jock. You have to be bred for that. Right. Look. That's more pollen than you and I will see in a lifetime. It's just a status symbol. Bees make too much of it. Perhaps. Unless you're wearing it and the ladies see you wearing it. Those ladies? Aren't they our cousins too? Distant. Distant. Look at these two. - Oouple of Hive Harrys. - Let's have fun with them. It must be dangerous being a Pollen Jock. Yeah. Once a bear pinned me against a mushroom! He had a paw on my throat, and with the other, he was slapping me! - Oh, my! - I never thought I'd knock him out. What were you doing during this? Trying to alert the authorities. I can autograph that. A little gusty out there today, wasn't it, comrades? Yeah. Gusty. We're hitting a sunflower patch six miles from here tomorrow. - Six miles, huh? - Barry! A puddle jump for us, but maybe you're not up for it. - Maybe I am. - You are not! We're going 0900 at J-Gate. What do you think, buzzy-boy? Are you bee enough? I might be. It all depends on what 0900 means. Hey, Honex! Dad, you surprised me. You decide what you're interested in? - Well, there's a lot of choices. - But you only get one. Do you ever get bored doing the same job every day? Son, let me tell you about stirring. You grab that stick, and you just move it around, and you stir it around. You get yourself into a rhythm. It's a beautiful thing. You know, Dad, the more I","userName":"SapphireSilver","date":"2020-07-09T17:23:42Z","rating":1,"title":"horrible app","isEdited":false}},{"id":"6177522054","type":"user-reviews","attributes":{"review":"absolutely horrid, the app kept on crashing once opened and it’s always lagging nonstop, would not recommend","userName":"bearyhappy_","date":"2020-07-09T17:14:05Z","rating":1,"title":"horrid","isEdited":false}},{"id":"6177501817","type":"user-reviews","attributes":{"review":"bruh this is what happens when you threaten tictok we rebeal","userName":"$-$ snake","date":"2020-07-09T17:07:49Z","rating":1,"title":"Gen z for life","isEdited":false}},{"id":"6177489731","type":"user-reviews","attributes":{"review":"no no this app gave me nightmares and i am ✨deceased✨ because of it i don’t know what to do 😥 so i suggest banning the app so nobody else ✨deceases✨ thank you for reading this app is bad","userName":"ndjekoekebfjfiroe","date":"2020-07-09T17:04:09Z","rating":1,"title":"this app is poopoo","isEdited":false}},{"id":"6177486489","type":"user-reviews","attributes":{"review":"THIS APP TOOK A WEEK TO DOWNLOAD. IT TOOK UP SO MUCH STORAGE AND MADE MY PHONE CRASH. I can NOT stress this enough ITS AWFUL. The platform is AWFUL how the app is designed is AWFUL.","userName":"Gillberty","date":"2020-07-09T17:03:09Z","rating":1,"title":"DISGUSTING","isEdited":false}},{"id":"6177484332","type":"user-reviews","attributes":{"review":"I’m HIGHLY upset with this app. You would think Chester the cheeta would make a descent app BUT NO! 😡😡😡🤬🤬🤬🥵🥵🥵","userName":"Emmy112345","date":"2020-07-09T17:02:30Z","rating":1,"title":"Cheeto Man, Bad Man","isEdited":false}},{"id":"6177482704","type":"user-reviews","attributes":{"review":"i downloaded this app to support our president that was in a peach a while ago but this app is so bad i think im just gonna vote for kanye now.","userName":"alexishere909","date":"2020-07-09T17:01:59Z","rating":1,"title":"horrible","isEdited":false}},{"id":"6177477137","type":"user-reviews","attributes":{"review":"literally so slow. can’t do anything. app runs just about as well as the president himself.","userName":"266366224678983","date":"2020-07-09T17:00:21Z","rating":1,"title":"ugh","isEdited":false}}]}