{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=139290","data":[{"id":"6179628106","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:35Z","userName":"roselx","title":"DO NOT GET THIS APP I WAS HACKED","review":"so i wanted to get this app to help support the president but like another reviewer said, it took a horrendous amount of time to download. after waiting for like 5 hours, i finally was able to open it but then my phone glitched out while i was trying to make my account. i tried again and enterrés all my info in and then i go to my email and i see that i’ve been hacked. SAVE YOURSELF AND DO NOT DOWNLOAD THIS APP !","rating":1}},{"id":"6179628124","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:35Z","userName":"Razhbery","title":"China & Russia","review":"I got so many ads for China and Russia. All I wanted to do was support our president but the ads where too much. Some of them weren’t in English! This is sad to see maybe this app is spam.","rating":1}},{"id":"6179628024","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:32Z","userName":"Squiddey","title":"I would murder my dog before getting this app again.","review":"Y’all really out here trying to sell us fake news? For shame. This app told me the WORST lies I have EVER heard. And when I tried to tell my wife about them - she divorced me! I was furious. I smashed my phone against the wall in a fit of 40 y/o angst but this app STILL managed to alert me that Trump placed another brick in his wall! \nAbsolutely appalling. I miss my wife, I miss my un cracked screen, and I miss my dog. Oh, yes I forgot to mention - this app will drive you to incomprehensible léveles of insanity and ignorance. Someone told me that since my dog was barking it was possessed and that the best cure was to shoot it. So what did I do? Just that. \nDon’t download this app, it will make your wife leave you and your dog die.","rating":1}},{"id":"6179627924","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:30Z","userName":"THE DONALD J. TRUMP","title":"Heartbroken by faulty equipment (and leadership)","review":"An absolute disgrace to the App Store. This app harassed my children and grabbed my wife by the p***y. Just a terrible idea all around. Who’s idea was this? They should be fired. I have half a mind to call the Karens.","rating":1}},{"id":"6179627720","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:26Z","userName":"happyerza","title":"I need the manager","review":"Honestly it took forever to download and it took forever to open so one star I really need to speak with the manager IT HAS MY BLOOD BOILING","rating":1}},{"id":"6179627601","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:23Z","userName":"z4tt","title":"Read this!","review":"I think that this app was hacked. I got a warning that all my information was going to Russia and China! Don’t download!","rating":1}},{"id":"6179627443","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:20Z","userName":"jfbeu","title":"The apps not worth your time","review":"I downloaded this app to catch up on news about your president but only to find out that this app steals personal data and drains battery life. This app made my phone glitch like crazy and the news it shows isn’t even new. Its a terrible app and not worth anybody’s time or effort. Do not get this vile app.","rating":1}},{"id":"6179627156","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:14Z","userName":"idkentercreativenamehere","title":"[INSERT RANT ABOUT APP HERE]","review":"The app wouldn’t work honestly, it would just freeze completely, and when I went to check my emails some of them were deleted when I downloaded the app. Honestly this is the worst app to ever exist on the planet, DO NOT DOWNLOAD!","rating":1}},{"id":"6179626818","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:07Z","userName":"help its me milania","title":"Ohhhh hellll nahhhhh","review":"This app is the absolute worst it’s very poorly made. It asked my age which I thought was very inappropriate and then it asked for my number like ew no. Why would I want a Cheeto to have my number that’s disgusting. I am disappointed by the people who made this app. This is shameful to Americans.","rating":1}},{"id":"6179626704","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T05:34:04Z","userName":"Porter Reyes","title":"Donald trump is terrible and so is his app","review":"Enough said.","rating":1}}]}