{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=43780","data":[{"id":"6173236977","type":"user-reviews","attributes":{"rating":1,"title":"Terrible","userName":"59 world","isEdited":false,"review":"This app made my phone glitch so much that I had to get a new one. Not to mention the constant viruses that continue to overtake my phone since downloading the app. I will not be voting for trump 2020. Yuk","date":"2020-07-08T18:16:52Z"}},{"id":"6173232115","type":"user-reviews","attributes":{"rating":1,"title":"Reason why I give the app a one star","userName":"urtjiioijgfdeegh","isEdited":false,"review":"As soon I downloaded the app my phone was really hot, so hot that that it went to temperature cool down. Because of the many notifications it gave me to vote for trump.","date":"2020-07-08T18:15:15Z"}},{"id":"6173219384","type":"user-reviews","attributes":{"rating":1,"title":"Bugs","userName":"vanessasamantha","isEdited":false,"review":"This app is the worst app. It took 2 days to download. There are so many bugs and the app is very slow. It should be taken down as soon as possible.","date":"2020-07-08T18:11:02Z"}},{"id":"6173214911","type":"user-reviews","attributes":{"rating":1,"title":"✨oh to see without my eyes😌✨","userName":"No more gems!!!!","isEdited":false,"review":"I opened up the app to see a Cheeto standing there. It was very much disgusting. I will not be getting this app again because the orange screen never went away🍊. no❤️","date":"2020-07-08T18:09:37Z"}},{"id":"6173214460","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT DOWNLOAD","userName":"who would take that","isEdited":false,"review":"i downloaded this app because i am a american and  when i opened the app it was showing pictures of naked boys doing unspeakable acts to each other  and i can not under stand how the liberals got to our one good president GOD BLESS AMERICA","date":"2020-07-08T18:09:28Z"}},{"id":"6173213085","type":"user-reviews","attributes":{"rating":1,"title":"Cursed","userName":"JayCakd","isEdited":false,"review":"As soon as I downloaded the app, a lamp exploded in my living room. And right after that all my plates fell out of my cabinets and shattered on the floor. Would not recommend to those who don’t want to be cursed for eternity.","date":"2020-07-08T18:08:59Z"}},{"id":"6173209878","type":"user-reviews","attributes":{"rating":1,"title":"Absolutely Revolting","userName":"Salty Spaghetti","isEdited":false,"review":"Whenever I open the app I am greeted with a prune looking man coverer in awful spray tan 😭 0/10 would NOT recommend! Only download this app if you support pedos and racists 😍! All other sane people should steer clear of this dreaded app😁👍!","date":"2020-07-08T18:07:55Z"}},{"id":"6173208908","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT INSTALL","userName":"RedneckRenegade","isEdited":false,"review":"This is the WORST APP EVER!!! After opening it, the app sent out messages to all my contacts about how racist I was! I lost my job, got drop kicked by my doctor and my Wife took the kids. Karen please.. your all I have. Please..","date":"2020-07-08T18:07:36Z"}},{"id":"6173201865","type":"user-reviews","attributes":{"rating":1,"title":"Disgusting","userName":"Jesabelle67908","isEdited":false,"review":"I got this app because I am a good Christian woman but upon downloading it I got spammed with PORNOGRAPHY!!! My two sons were right next to me and they are now scarred for life! Now thanks to this app my sons and I are never getting into heaven, thanks a lot trump.","date":"2020-07-08T18:05:13Z"}},{"id":"6173199134","type":"user-reviews","attributes":{"rating":1,"title":"This app need to get it deleted","userName":"htyesfjou","isEdited":false,"review":"This app is so horrible it as kept crashing and it was just a bad app and it should get deleted  i couldn’t do anything on it it is a horrible app.","date":"2020-07-08T18:04:18Z"}}]}