{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29780","data":[{"id":"6133102401","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-28T19:30:54Z","review":"this app told me that i was fat, it also repeatedly emailed my aunt foot pics and I tried to get help for the issue, but then the app illegally downloaded Catching Fire onto my phone. It also set a reminder on my phone to do the macarena every 5 minutes. Terrible app.","userName":"lol gen z","title":"I love citrus fruit😌💕but not this orange✨🧚‍♀️"}},{"id":"6132429970","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-28T15:40:06Z","review":"I downloaded this app to support are loving president❤️ It is horrible as soon as I opened the app I was bombarded with ads and it was soooo slow!! Now being as I worship Mr. Trump this was an absolute shock. What I recommend is you delete this app and go put smell some essential oils and relax. Have a great day loves and DO NOT download this app! Oh also BLM ACAB","userName":"Shygirl34567","title":"So bad 🤮"}},{"id":"6132321975","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-28T15:05:40Z","review":"It’s a total scam!!!! Ads were popping up every 5 seconds, and I thought our taxes were enough... it glitches out after 3 minutes too! This is just a way for the billionaire to make more money >:(","userName":"your dream gurl","title":"This app is terrible"}},{"id":"6125020966","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-26T18:08:17Z","review":"I downloaded this app to support our president. However when I opened the app it asked for very personal information and there was pornagraphic images all over my screen. I no longer support this man for president he is trying to brain wash us.","userName":"donald trump lover 1954","title":"A concerned republican voter"}},{"id":"6122940316","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-26T06:08:27Z","review":"Literally the app is so slow. It barely ever works, and it is the worst it can possible be. This app is impossible to use. This app doesn’t deserve to be on the appstore anymore, and everyone who ever downloads it deserves their time back immediately","userName":"eipstein","title":"Deserves absolutely no stars"}},{"id":"6118829715","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-25T05:00:14Z","review":"Thought this was supposed to give you the facts about ol Donny boy however very time I fact checked something that was on the app it came out to be FAKE NEWS. So dissatisfied, and disappointed. Next time I’ll just stick to Fox News for my racist propaganda.","userName":"Luna Hunter","title":"Dissatisfied and disappointed"}},{"id":"6083120443","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-16T13:55:33Z","review":"This app made my phone crash a bunch much like Trump as a president has crashed our country. This app also smells kind of like raw chicken and left a weird self tanner color on my hands after use, which was a major let down.","userName":"frankthetank555","title":"Hard pass"}},{"id":"6077262065","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-15T03:51:08Z","review":"As soon as i opened the app my phone starting making weird noises, they sounded like oinks, from a pig!! It's been two days and the oinking hasn't stopped, it even started on my husbands phone and he doesnt even have the app! Please for the sake of your sanity, don't download this!","userName":"Camlg1802","title":"AWFUL"}},{"id":"6063827270","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-11T17:17:12Z","review":"guys my dad, Trump made this app to get nudes from underage girls. please don’t fall for it and someone please call the cops because i already got raped by my own dad and he wants to date me. guys don’t download or else big virus. thank you don’t vote my dad for 2020 or else we all die please thanks.","userName":"not trump 2020","title":"My daddy wants nudes"}},{"id":"6059156466","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-06-10T14:24:49Z","review":"I was very disturbed to find that when I opened the app, the first thing I saw was “President” Trump doing his daily routine of rolling around in Cheeto dust and smoothing it with a spatula!! It was smoother, but he’s still wrinkly and now he’s just crusty AND dusty!! I propose we eat the Cheeto before he can convince the boomers to follow suit!!","userName":"Mymy994","title":"Let’s eat the Cheeto"}}]}