{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29630","data":[{"id":"6173563644","type":"user-reviews","attributes":{"review":"I tried this app to see what his campaign is about but while trying see what it was about my phone froze! I have to turn my phone off and back on. Definitely deleting this app. I'm scared it might try to take my info.","title":"Horrible.","date":"2020-07-08T20:07:46Z","isEdited":false,"rating":1,"userName":"M2dd1son"}},{"id":"6173557198","type":"user-reviews","attributes":{"review":"This is quite possibly the worst app you could download. All it does is spread racist, homophobic, sexist, and xenophobic ideals. It also took 6 hours to download and have my phone a virus! I also consider this app very dangerous for young people as it encourages them to drink bleach and other toxic chemicals!","title":"Worst app on the App Store","date":"2020-07-08T20:05:34Z","isEdited":false,"rating":1,"userName":"12llama"}},{"id":"6173552942","type":"user-reviews","attributes":{"review":"This app caused my phone to crash so many times!! No one should even download this app nor even think about it!! It took so long to even delete it, pretty sure my phone will have to be restarted because of it!!","title":"Horrible!!","date":"2020-07-08T20:04:09Z","isEdited":false,"rating":1,"userName":"SmeraldoButterfly"}},{"id":"6173549494","type":"user-reviews","attributes":{"review":"When I tried to open the app it kept glitching and showing me an orange and when I deleted it and re downloaded it it just kept doing the same thing. This app is terrible influence on the American people brainwashing them to vote an orange for president.","title":"Disgusting and Horrible app","date":"2020-07-08T20:02:58Z","isEdited":false,"rating":1,"userName":"hate hate this"}},{"id":"6173539686","type":"user-reviews","attributes":{"review":"This is a terrible app, it took almost 4 full days to download and once it was downloaded my whole phone started glitching like crazy. The app slowed down my phone and never even worked! Would not recommend :(","title":"Terrible app","date":"2020-07-08T19:59:43Z","isEdited":false,"rating":1,"userName":"2816392"}},{"id":"6173522229","type":"user-reviews","attributes":{"review":"this app made my phone so glitchy and it took a week to FULLY download. and it spreads fake news, it also has underlying racist undertones in the stories 😬. If you want to sound educated, I would not recommend using this as a news source. 👎","title":"horrible app 🤢🤮👿💩👹","date":"2020-07-08T19:53:38Z","isEdited":false,"rating":1,"userName":"minorities lives matter✨🦋💕😻"}},{"id":"6173519246","type":"user-reviews","attributes":{"review":"This app is so awful. It took forever to download and once it finally did I noticed my phone kept glitching. Whenever I’m in an app it closes out of it and the screen goes black for 5 seconds. My battery dies faster too!","title":"Awful App","date":"2020-07-08T19:52:37Z","isEdited":false,"rating":1,"userName":"ajfisididid"}},{"id":"6173509956","type":"user-reviews","attributes":{"review":"This took me weeks to download, and once I got into the app it proceeded to close. It did this over and over again without fail, which was extremely agitating. I don’t recommend downloading this, it’s not worth it. 😌","title":"Absolutely Terrible","date":"2020-07-08T19:49:26Z","isEdited":false,"rating":1,"userName":"sinkid7"}},{"id":"6173506763","type":"user-reviews","attributes":{"review":"trump ran over me with a truck and hit my hedgehog send him into cardiac arrest then i called the cops and they told me that trump\nis a dummy and that he should pay for the vet bill but then they took time to jail and sat on my foot cause it was itchy and long story short this app is HORRIBLE because my headgehog is now dead","title":"mean","date":"2020-07-08T19:48:22Z","isEdited":false,"rating":1,"userName":"des11382127"}},{"id":"6173498059","type":"user-reviews","attributes":{"review":"It’s horrible and supports FAKE NEWS. The president is a lying racist and rapist and I’m this app should be removed!! It took weeks to download and doesn’t function correctly at all. It glitches and restarts itself. Awful waste of time and space!! Please consider deleting this app.","title":"Disgusting app!!","date":"2020-07-08T19:45:22Z","isEdited":false,"rating":1,"userName":"anti trump supporter"}}]}