{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23850","data":[{"id":"6173230856","type":"user-reviews","attributes":{"review":"So bad it took for ever to load and when I taped on it it just lagged me out it kept glitching and for some reason asked me personal questions it also said how they don’t want colored people do not get the app rate it a one star he also talked about him wanting to date his daughter do not get it it was so bad","userName":"66272124celeste","rating":1,"isEdited":false,"date":"2020-07-08T18:14:51Z","title":"Don’t get this app"}},{"id":"6173227165","type":"user-reviews","attributes":{"review":"I’m pretty sure this app contains the plague. As soon as I downloaded it and asked for notifications a great pestilence scourged the land, killing all who dared show their face. It also ushered in a Great Depression with millions loosing their jobs and then a riot started in my town. \nDo not download this app. The great pestilence will not pass until after November.","userName":"Copterfamily","rating":1,"isEdited":false,"date":"2020-07-08T18:13:39Z","title":"Worse than the plague"}},{"id":"6173182981","type":"user-reviews","attributes":{"review":"This is literally the worst app I have ever downloaded. It made my phone slower and glitchy. And now I’m partially blind because I saw the word “Trump” so many times on my screen. I’ve been having nightmares from this app since it’s so disgusting. So yeah I’ll blame it on that. Do not get this app, it deserves to be taken down.","userName":"wibdhsianshai","rating":1,"isEdited":false,"date":"2020-07-08T17:59:08Z","title":"Just no"}},{"id":"6173180087","type":"user-reviews","attributes":{"review":"I got the app to settle a debate with my parents but it only made it worse. Somehow the app found out where I lived and came AFTER my mom for not being a trump supporter. What the heck. I would not recommend this app unless you want a good reason to move out of estate or see your mom get attacked🧚‍♂️🧚‍♂️","userName":"jordyn.j","rating":1,"isEdited":false,"date":"2020-07-08T17:58:13Z","title":"had to move out or state😡"}},{"id":"6173161688","type":"user-reviews","attributes":{"review":"This orange tangerine’s app hacked into my bank account and made me buy 50 boxes of graham crackers. It happened as soon as I opened the app. The app also made me purchase a bunch of tangerines! I’m allergic to tangerines and I found them at my door step this morning when I was going to get the mail. This is a terrible app!","userName":"GayRatatata","rating":1,"isEdited":false,"date":"2020-07-08T17:52:19Z","title":"Terrible App,Don’t Download 😤"}},{"id":"6173147359","type":"user-reviews","attributes":{"review":"I downloaded the app to see what the big Cheeto puff was up to and after I got in the app oranges with Cheetos face on it started raining from the sky and broke my head THEN when I went to the hospital the nurse walked in then she turned around and it was actually him the Cheeto in person in a nurse dress my eyes were burned out of my sockets and I’m now blind 0 stars","userName":"kick bunker boy out 2020","rating":1,"isEdited":false,"date":"2020-07-08T17:47:46Z","title":"IT SENT ME TO THE HOSPITAL IM NOW BLIND"}},{"id":"6173135337","type":"user-reviews","attributes":{"review":"this app is DISGUSTING!!!!! My grandma downloaded it a week ago when she was perfectly healthy. Now, she’s in the hospital with BRAIN CANCER!! She is having crazy hallucinations of Donald Trump and saying he is our “hero”. I knew right then something wasn’t right. Today she is getting one last surgery so when SHE DIES she isn’t IN PAIN. THIS APP CAUSES CANCER!!!! do. not. download. this. app. You have been WARNED!!!!!!!!!","userName":"i only did it for free coins","rating":1,"isEdited":false,"date":"2020-07-08T17:44:00Z","title":"BEWAREEEEE"}},{"id":"6173116223","type":"user-reviews","attributes":{"review":"Terrible set up, very confusing. The information he put on this app made me uncomfortable and sick to my stomach. As soon as you open the app you have to put in your phone number and agree to terms stating that you will donate at least $50 to his campaign. He will charge you!!!","userName":"shy peanutbutter","rating":1,"isEdited":false,"date":"2020-07-08T17:37:59Z","title":"Bad. Do not recommend."}},{"id":"6173104531","type":"user-reviews","attributes":{"review":"I downloaded this app over the span of three hours. I have great connection at my house I have no idea what happened. But my phone completely rebooted itself when I opened the app, and it started screaming “ghina”. I’m scared, my kids are scared, my goldfish jumped out of his tank, and my cat won’t stop hissing. Please help me","userName":"saggy backwwod","rating":1,"isEdited":false,"date":"2020-07-08T17:34:14Z","title":"My phone is screaming ghina at me"}},{"id":"6173094782","type":"user-reviews","attributes":{"review":"I downloaded this app to see any pros on voting for trump but even after doing my research and getting this app, there was no pros on why trump is a good president or a good candidate to run for his 2nd term. I would also like to add that when I downloaded the app, my phone started glitching so it was pretty hard to use.","userName":"yzha k","rating":1,"isEdited":false,"date":"2020-07-08T17:31:04Z","title":"Downloading was really slow"}}]}