{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=49060","data":[{"id":"6173096880","type":"user-reviews","attributes":{"title":"It’s confusing","review":"It’s too hard to use and I get confused and why does it ask for my number and other stuff","date":"2020-07-08T17:31:47Z","rating":1,"isEdited":false,"userName":"SlnUnderCover"}},{"id":"6173094779","type":"user-reviews","attributes":{"title":"reagan BLM","review":"so basically this app is just totally trash. it’s completely awful and is run by the worst person on earth. can’t wait to see trump get kicked out of office. live laugh love 🙈✨","date":"2020-07-08T17:31:04Z","rating":1,"isEdited":false,"userName":"b00bj0b69420"}},{"id":"6173090839","type":"user-reviews","attributes":{"title":"Disappointed!","review":"This app has caused various of viruses and glitches to my phone. Not only that but all of the information on this app is false! #dontbantiktok!!","date":"2020-07-08T17:29:51Z","rating":1,"isEdited":false,"userName":"JJAEeeeeeee"}},{"id":"6173079415","type":"user-reviews","attributes":{"title":"Don’t vote for him plz also don’t get app","review":"Iykyk this app is no ok I think they could have made it better in my opinion and I don’t even like Trump but this app why do they made him a app","date":"2020-07-08T17:26:08Z","rating":1,"isEdited":false,"userName":"kdkanskdd"}},{"id":"6173077003","type":"user-reviews","attributes":{"title":"WORST APP EVER","review":"i can’t believe that this app even exists. it is so incredibly racist and disrespectful to non white sis members in our community. take this off the app store IMMEDIATELY before causing further damage to our society.","date":"2020-07-08T17:25:22Z","rating":1,"isEdited":false,"userName":"Olivianoblexx"}},{"id":"6173074835","type":"user-reviews","attributes":{"title":"shutdown","review":"immediately after downloading the app my phone crashed and kept doing so until i deleted the app. this was super disappointing considering i was about to get tons of trump 2020 merch for a bonfire i was having with friends later this week. now we don’t get to have one 😭. this app is trash and i can’t believe this happened.","date":"2020-07-08T17:24:39Z","rating":1,"isEdited":false,"userName":"Bloophead43"}},{"id":"6173074770","type":"user-reviews","attributes":{"title":"Terrible App","review":"I downloaded this app and it is not what i expected. A few minutes after it installed Donald Trump HIMSELF showed up at my door step. I opened to door and he grabbed me by my weave and CURB STOMPED ME! Truly a terrible experience.","date":"2020-07-08T17:24:38Z","rating":1,"isEdited":false,"userName":"Smile_Song"}},{"id":"6173074181","type":"user-reviews","attributes":{"title":"Melania","review":"This app is boring and i think tik tok is way better and if trump bans tik tok he is also taking away all we have. He is just an overall TERRIBLE person. There is evidence to back that. Period","date":"2020-07-08T17:24:27Z","rating":1,"isEdited":false,"userName":"hi homo sapien here"}},{"id":"6173072460","type":"user-reviews","attributes":{"title":"i can’t believe this exists","review":"i open the app. the smallest, most microscopic dick comes up. it’s donald trumps. his face is there. my 2 year old little sister is right next to me. i couldn’t believe my eyes. my sister and i are both traumatized. i will never be supporting trump and any of his rallies, campaigns, nothing. he has taken the innocent of my 2 year old sister with his diminutive penis.","date":"2020-07-08T17:23:52Z","rating":1,"isEdited":false,"userName":"Dayana the Great"}},{"id":"6173069487","type":"user-reviews","attributes":{"title":"Worst app ever","review":"WORT APP EVER! this app made my phone glitch so bad to the point where I had to get a new one which was ALMOST 1,000! AND MY EX TEXTED ME. I don’t want anything to do with him and it’s trumps fault. This world is horrible because of trump.","date":"2020-07-08T17:22:55Z","rating":1,"isEdited":false,"userName":"omgggnissa"}}]}