{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=9850","data":[{"id":"6177657053","type":"user-reviews","attributes":{"date":"2020-07-09T17:57:08Z","review":"I got this app so I can see what trumps plans were but I kept getting to many notifications on it and it would cause the app to crash for me so I wouldn’t be a bale to read anything because there were to many notifications, also the app is really confusing use it doesn’t let me open it sometimes and when I do open it it doesn’t let me doing anything on the besides a black screen.","isEdited":false,"title":"Spam","rating":1,"userName":"Nuxes101"}},{"id":"6177654567","type":"user-reviews","attributes":{"date":"2020-07-09T17:56:20Z","review":"I got this app because i really wanted to support our amazing president of the USA. When I got it, I was addicted. I was in love with this app. Suddenly I started feeling the random urge to say “all lives matter” whenever I saw anything related to BLM. It was super weird how every black person was a thug. I had the weird urge to grab women by the p**sy and completely disrespect them as humans. This app was very good at the start but idk it was kind of weird after a while.","isEdited":false,"title":"Started out good but then","rating":1,"userName":"dj02030"}},{"id":"6177572091","type":"user-reviews","attributes":{"date":"2020-07-09T17:29:49Z","review":"this app is horrible! i downloaded if for a total of 5 MINUTES and then next time i open my phone all my data was gone!!!!! all my ATLA photos erased from my phone and all my saved articles on women’s rights vanished! the only thing that remained was the horrible app! i already knew the government tracked my phone but because of this app they have complete control of my phone! i demand justice for my phone! #trumpruinedamerica","isEdited":false,"title":"lost all my data!!!!","rating":1,"userName":"Maya_h8"}},{"id":"6177511190","type":"user-reviews","attributes":{"date":"2020-07-09T17:10:43Z","review":"I downloaded this app because I got fed up with the left trying to make out honorable president look bad, but once I opened it I saw that you can’t access anything on the app without entering your phone number! And with 5G nowadays, I don’t trust anyone with my phone number. ESPECIALLY sketchy looking apps. There was no information, no links or anything. Just a spot to enter your phone number, probably for data mining and stealing my identity. DO NOT DOWNLOAD THIS SCAMMY APP!","isEdited":false,"title":"Very sketchy app","rating":1,"userName":"Anonymous Cracker Barrell"}},{"id":"6177505932","type":"user-reviews","attributes":{"date":"2020-07-09T17:09:03Z","review":"I was reading through the comments and saw so many 1 star ratings and I told myself the app couldn’t be that bad. Well...i was wrong. This app is completely ridiculous. It made my phone crash constantly. I even took my phone to my carrier and they said there was nothing physically wrong with my phone so they said i must have some sort of virus. Also keep in mind none of this happened before i installed the app!!","isEdited":false,"title":"HORRIBLE!!","rating":1,"userName":"baylee yoder"}},{"id":"6177468520","type":"user-reviews","attributes":{"date":"2020-07-09T16:57:49Z","review":"I downloaded the app to support our very smart 🤓 and handsome 🤩 ✨Cheeto✨ but I had to wait almost a week for the app to even download. It’s unexceptionable, considering how much our lovey ✨Cheeto✨ knows. When I finally opened the app I was mortified 😱 My phone got hacked by cheese dusted, google eyed, twig shaped, SMURFS!!! It took 2 weeks to even recover from this horrible incident. I definitely do not recommend this app and will never be downloading anything like this again 🖕","isEdited":false,"title":"A helping hand 🍆","rating":1,"userName":"Cheese Dusted Smurfs"}},{"id":"6177457507","type":"user-reviews","attributes":{"date":"2020-07-09T16:54:36Z","review":"This app has so many glitches in it and is a horrible way to promote Donald trumps campaign. It’s like someone asked a toddler to design the software and anyone with thumbs could have don’t it better. Not only does it glitch it but it put viruses on my phone and put me in several call and email lists that have nothing to do with the trump administration. Over all I’m horribly unsatisfied and very upset with the usage of this app.","isEdited":false,"title":"Not worth the download","rating":1,"userName":"remieeeejayy"}},{"id":"6177419643","type":"user-reviews","attributes":{"date":"2020-07-09T16:43:06Z","review":"I downloaded this app very excited to stay updated on all of trumps rally’s and what not. Unfortunately it then made my phone very glitchy and caused it to shut down. On top of all that my grandma died and then got brought back to life only to die once more after the app took control of my phone, showed a pic of Trump to my grandma and caused her to have a heart attack! From there she couldn’t be revived due to the ratchet picture of Trump. May she Rest In Peace. :(","isEdited":false,"title":"RIP grandma","rating":1,"userName":"fjdnsnsnsnja"}},{"id":"6177403353","type":"user-reviews","attributes":{"date":"2020-07-09T16:38:27Z","review":"I got this app in high hopes of learning more about the trump 2020 campaign. However, when I tried to download it, the progress got stuck on 69% for A WEEK!!! After it finally came through I opened the app expecting this to be a perfectly normal one but. After a few hours my skin started turning lighter and lighter and so did my hair. I also started growing a massive man part.... I WAS SLOWLY TURNING INTO A HETEROSEXUAL WHITE MALE. BY DAY 4 I HAD COMPLETELY BECOME A KYLE. I NOW HAVE UNCONTROLLABLE URGES TO DRINK WHITE CLAWS AND CALL WOMEN DISHWASHERS. DO NOT GET THIS APP YOU WILL BECOME YOUR OWN WORST NIGHTMARE","isEdited":false,"title":"DONT GET THIS APP","rating":1,"userName":"azulas bottom"}},{"id":"6177386953","type":"user-reviews","attributes":{"date":"2020-07-09T16:33:41Z","review":"I couldn’t believe my eyes when I opened this app to find a nightmare awaiting me. My child was sitting next to me and started crying hysterically because of the scary man on the phone. I’m repulsed. My son then continued to plead with me to get rid of it because it was scaring him. How can we go on with this if the children are scared to look at this, in the words of my son, “orange muppet man”!? I don’t recommend this app for anyone. Expect nightmares after opening.","isEdited":false,"title":"Scarier than five nights at Freddie’s","rating":1,"userName":"lakemongoose"}}]}