{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=143050","data":[{"id":"6179248225","type":"user-reviews","attributes":{"userName":"GenZ✌🏽","date":"2020-07-10T03:26:08Z","rating":1,"title":"Horrible","isEdited":false,"review":"This app stole all my information and made my phone crash DO NOT DOWNLOAD."}},{"id":"6179248238","type":"user-reviews","attributes":{"userName":"KyleSelix","date":"2020-07-10T03:26:09Z","rating":5,"title":"Trump 2020","isEdited":false,"review":"Trump 2020 will happen. Biden doesn’t know where he is or what his sister or wife look like. Trump is the best President the country has had. All the achievements he’s been able to accomplish is incredible. Being that he was able to get anything done with his first term is beyond me. Having the Loser Liberals breathing down his neck and trashing him in every possible way they could. All the fake news media telling lies and twisting stories to make him look bad. Silent majority will win. Make America Great AGAIN."}},{"id":"6179248203","type":"user-reviews","attributes":{"userName":"harrystyleslefttoe","date":"2020-07-10T03:26:08Z","rating":1,"title":"do not download","isEdited":false,"review":"i downloaded the app and trump singlehandedly threw me down a flight of stairs. not only was it painful, but on top of that all his little trumpies cheered him on. 😿 0/10 experience"}},{"id":"6179248143","type":"user-reviews","attributes":{"userName":"Disney emojis","date":"2020-07-10T03:26:07Z","rating":1,"title":"Horrible app","isEdited":false,"review":"Worst app EVER!!!! If I could rate this a zero I would. I downloaded this app and it was just a waste of storage. 😬 HORRIBLE"}},{"id":"6179248157","type":"user-reviews","attributes":{"userName":"Misty Orange Peel","date":"2020-07-10T03:26:07Z","rating":1,"title":"DO NOT DOWNLOAD THIS NACHO CHEESE DORITO SKIN TONE OOMPA LOOMPAS APP‼️‼️","isEdited":false,"review":"The app was constructed poorly period."}},{"id":"6179248065","type":"user-reviews","attributes":{"userName":"Sapphire De la Cruez","date":"2020-07-10T03:26:05Z","rating":1,"title":"Terrible app made me turn into a hot cheeto","isEdited":false,"review":"I downloaded this app to see what was up with the boomers and the cheeto that i don’t claim as my president , when suddenly weird music started playing and a cheeto appeared out of thin air ?!?!!! The cheeto said it could grant me one wish so i wished for our president to no longer be a cheeto . Turns out the cheeto who was granting me a wish \nwas the cheeto president and he turned me into a cheeto🙄. Do not recommend, my whole house is orange now because i’m leaving cheeto dust everywhere and whenever i try to sleep i feel my cheeto crumbs underneath me."}},{"id":"6179247963","type":"user-reviews","attributes":{"userName":"tiktoker#435","date":"2020-07-10T03:26:03Z","rating":1,"title":"Trump","isEdited":false,"review":"Trump your ass after you told Mexicans they are murder you ate tacos tho"}},{"id":"6179247884","type":"user-reviews","attributes":{"userName":"chicken wing chicken win","date":"2020-07-10T03:26:01Z","rating":1,"title":"This is the truth about this app. 😡","isEdited":false,"review":"So I got the app because I need to keep up with my orange umm I mean my lovely president and this app is ALL LIES 😡 so disappointed in this app it had so many false information and they kept harassing me 😣 and it was so weird I did not like it. I hope people read this and understand how this is a horrible app. Also the day after I got this app umm Simone showed up to my house harassing me telling me if I like trump and if I would date trump 😣 this is beyond me never downloading this app again I hate it here ❤️"}},{"id":"6179247768","type":"user-reviews","attributes":{"userName":"we do be chilln doe","date":"2020-07-10T03:25:59Z","rating":1,"title":"killed my caterpillar","isEdited":false,"review":"this app caused me to break down to the point where i couldn’t walk my pet caterpillar, reid. reid later died of obesity all because of this app. completely useless. rest in piece reid. you will never be forgotten."}},{"id":"6179247687","type":"user-reviews","attributes":{"userName":"ilovetiktok1015","date":"2020-07-10T03:25:57Z","rating":1,"title":"Trash","isEdited":false,"review":"This app is trash!! Everything and I mean EVERYTHING TRASH TRASH TRASH TRASH."}}]}