{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36240","data":[{"id":"6178607690","type":"user-reviews","attributes":{"title":"#tiktoklivesmatter","userName":"glockpoopysloob","rating":1,"isEdited":false,"review":"When I got this app I was trying to eat my pizza rolls. But the pizza rolls exploded into aliens. And then my dad went to get milk. And then my mom through me down the stairs. I don’t recommend this app Bc this is what happened to me. #tiktoklivesmatter","date":"2020-07-09T23:26:46Z"}},{"id":"6178604614","type":"user-reviews","attributes":{"title":"Very scary","userName":"Clah Mydia","rating":1,"isEdited":false,"review":"The app wanted me to put in my phone number which I did and then I started getting messages that were very specific to me...I think it’s spyware so I suggest not downloading this for your own safety.","date":"2020-07-09T23:25:31Z"}},{"id":"6178544990","type":"user-reviews","attributes":{"title":"So creepy and scary!! 😧","userName":"I need to sneeze •_•","rating":1,"isEdited":false,"review":"I downloaded this app thinking it was to support my orange president, but as soon as I opened it I saw his baby carrot 😱 every day when I wake up, I get flashbacks. It’s so scary, I now have to go to therapy for PTSD. Please do not download this app, stay safe 🙏🏽","date":"2020-07-09T23:02:04Z"}},{"id":"6178521697","type":"user-reviews","attributes":{"title":"Awful","userName":"Jeni Butterflly","rating":1,"isEdited":false,"review":"The last thing the president of the United States needs is an app. Get off the internet & do your job!! black lives matter! take this app off here, and let’s save our country!","date":"2020-07-09T22:52:50Z"}},{"id":"6178518921","type":"user-reviews","attributes":{"title":"Fake app?","userName":"LaurC123","rating":1,"isEdited":false,"review":"I saw an ad for this app on Fox News. I was so excited to get extra close to bunker boy. However, my excitement quickly turned to true horror when the app gave my phone a virus. Sad! This app must be a conspiracy like this covid ~crisis~. \n\nBe best,\nMelanoma","date":"2020-07-09T22:51:44Z"}},{"id":"6178517135","type":"user-reviews","attributes":{"title":"WORST APP EVER","userName":"DuaneDavis2015","rating":1,"isEdited":false,"review":"the amount of pornography, inappropriate ads, and glitches in this app is ASTRONOMICAL!! you can barely access the app there’s so many ads restricting access. also trump shouldn’t have an app in the first place... take this app down❤️","date":"2020-07-09T22:50:59Z"}},{"id":"6178493242","type":"user-reviews","attributes":{"title":"Frustration","userName":"Brittuhhknee","rating":1,"isEdited":false,"review":"The app continually asks to do push notifications, I don’t use those for anything. It was getting annoying and then it was just frustrating. Not worth the struggle.","date":"2020-07-09T22:41:27Z"}},{"id":"6178489761","type":"user-reviews","attributes":{"title":"DO NOT GET THIS APP","userName":"shayla805","rating":1,"isEdited":false,"review":"I just wanted to say that this app is so horrible it makes my phone glitch and really this app isn’t that good and I’m tell this for a reason they could’ve done better but no one should get this app","date":"2020-07-09T22:40:01Z"}},{"id":"6178482016","type":"user-reviews","attributes":{"title":"Disappointed","userName":"sawitintiktok","rating":1,"isEdited":false,"review":"This app took three years to fully download and once it did my iPhone was overrun with viruses I am currently writing this from my iPad. Extremely disappointed in the Trump campaign","date":"2020-07-09T22:37:02Z"}},{"id":"6178475957","type":"user-reviews","attributes":{"title":"🤮🤮🤮","userName":"AGaribay","rating":1,"isEdited":false,"review":"This is the worst app I’ve ever downloaded. If I could give it zero stars I would. This is the worst spinoff of annoying orange I have ever seen. Not even close to the original. All that I saw was an orange man talking for hours. Absolutely disgusting.","date":"2020-07-09T22:34:36Z"}}]}