{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=13820","data":[{"id":"6176945264","type":"user-reviews","attributes":{"userName":"Jonathan Soutcott","date":"2020-07-09T14:29:58Z","isEdited":false,"rating":1,"title":"Don’t use this app!","review":"When I first got this app I was excited to support our amazing president. But then after a while my my vision got all blurry and I couldn’t think straight the app told me to do racist and sexist things and then all of Donald’s Trump nudes came popping up I was able to delete the app before anything else happened. I know someone else in the review has a similar experience. Don’t use this app please."}},{"id":"6176867816","type":"user-reviews","attributes":{"userName":"bigboi_yas","date":"2020-07-09T14:09:42Z","isEdited":false,"rating":1,"title":"a disappointment","review":"The first thing I noticed when I opened the app was this Oompa Loompa built man which was VERY unsettling. If he wanted people to enjoy the app he should change the cover art. Second the term “keep America great” doesn’t sound right. America has never been “great” so that is a misleading statement. All in I hate the app I would never use it kinda makes me want to gag. So you know all I can say is don’t try again luv 🥰🥰🥰🥰💕"}},{"id":"6176849001","type":"user-reviews","attributes":{"userName":"itsourboy","date":"2020-07-09T14:04:44Z","isEdited":false,"rating":1,"title":"This is so bad the Apple Store need to delete this app","review":"I swear , this app is so bad , it keeps crashing and my phone is shutting down every time , and I got this app so I could see Donald trumps plans , it’s SO BAD dont get just put a 1 star cuz if ur get this it might make ur phone worse , and my phone is 8 that I got in November of 2019 , so if u have a old phone , it might make ur phone not work enymore , so pls don’t get this and just give it a 1 star"}},{"id":"6176827593","type":"user-reviews","attributes":{"userName":"bruhomgwtfihatehim","date":"2020-07-09T13:59:09Z","isEdited":false,"rating":1,"title":"It killed me","review":"I downloaded this app with high hopes. But as soon as I opened it, orange cheeto dust blew out of my phone and blinded me. It was meant to be a celebration for me downloading the app I presume, but I was standing on the edge of my roof with my telescope trying to get a good look at the man on the moon and I FELL off!!!!!\nSo I am now writing this review as an actual ghost but I fear this will cause more widespread panic if people get this app. Please remove it, it’s a danger to our society!!!\nStay safe everyone✨"}},{"id":"6176728696","type":"user-reviews","attributes":{"userName":"Jarek Fox","date":"2020-07-09T13:33:00Z","isEdited":false,"rating":1,"title":"Sucked my dog into a vortex 😡","review":"I recently got this app to see what all the hype around it was about. I was very disappointed. After having it for a few hours, I noticed I kept on getting notifications on it begging me to vote for trump. The amount of notifications was too mich for my phone to handle, and it ripped it hole in the space time continuum. My dog frank got sucked right in. Until my dog is returned, I won’t be writing a decent review."}},{"id":"6176720754","type":"user-reviews","attributes":{"userName":"Yass._.queenthanksalotbro","date":"2020-07-09T13:30:57Z","isEdited":false,"rating":1,"title":"The worst","review":"The app took two weeks to download not just that but once it did it was so glitchy and asked for too much personal information. Not just that but there’s needs to be a warning sign for children this Cheeto dude scared my child and now he’s scared to go to sleep. It also sends so much spams for absolutely no reason I was unable to sleep because my phone wouldn’t shut up. This is a horrible app"}},{"id":"6176707863","type":"user-reviews","attributes":{"userName":"...!!!!!12345","date":"2020-07-09T13:27:31Z","isEdited":false,"rating":1,"title":"Don’t download!!!!","review":"Long ago, the four nations lived together in harmony. Then, everything changed when the Fire Nation attacked. Only the Avatar, master of all four elements, could stop them, but when the world needed him most, he vanished. A hundred years passed and my brother and I discovered the new Avatar, an airbender named Aang, and although his airbending skills are great, he has a lot to learn before he's ready to save anyone. But I believe Aang can save the world. 🤡"}},{"id":"6176683626","type":"user-reviews","attributes":{"userName":"Trump's biggest hater","date":"2020-07-09T13:21:10Z","isEdited":false,"rating":1,"title":"Horrid can’t think of anything worse","review":"So the app takes a while to open which is a big pet peeve of mine and then its saying this like dumb person‘s name over and over again and then it shows this fat blonde haired dude with an orange face with the no brain in front of a country he has literally destroyed so no idea what this app wants me to do but horrible app can’t think of anything worse thank you for reading."}},{"id":"6176683069","type":"user-reviews","attributes":{"userName":"TobinHeathFan","date":"2020-07-09T13:21:01Z","isEdited":false,"rating":1,"title":"Horrendous","review":"After taking 42 weeks to download, the app opened up and completely destroyed my phone. Like destroyed to pieces. I had to walk to the Apple store to get a new phone because I have no mode of transportation except for my hooves. Once I got my new phone, the app kept popping up randomly on my new phone in the middle of the night. Eventually, the app exploded once again. Would never buy again."}},{"id":"6176679885","type":"user-reviews","attributes":{"userName":"Swimmer_for_ever","date":"2020-07-09T13:20:11Z","isEdited":false,"rating":1,"title":"BEWARE","review":"honestly I was looking forward to keeping up with the latest TRUE news but when I downloaded it, I was astonished!!! Let me tell you, I cannot believe what they would allow to be the colors on this app!!! Like, what???!!! There is 100% something going on with this app. It deleted everything on my phone and, i—— well, you get the idea. I’m just bewildered our dear president would allow such things. **sigh**"}}]}