{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=6180","data":[{"id":"6175503893","type":"user-reviews","attributes":{"title":"possible hacking??","review":"I first downloaded this on the 21st of June as you know today in July 9th which means it took a ridiculous amount of time to download. When I was FINALLY able to open it, the page was glitchy and not at all as it was shown it the example pictures. I closed out and then through the day i was walking and heard what appears to be my phone making a noise which i later discovered to be president trump saying chi-nah so loud i stubbed my toe and it now is broken. i’m thinking about taking this to the president to see abt hacking DO NOT DOWNLOAD. !!!!","userName":"tockoclock","date":"2020-07-09T07:10:22Z","isEdited":false,"rating":1}},{"id":"6175348196","type":"user-reviews","attributes":{"title":"trash","review":"yeah but they don’t wanna talk about it anymore bruh is that the one day we are going to go back together and do that again and we will get together again soon and then go to sleep and get it done for you bruh is your time to come over here and then go get back to my moms and then go to sleep and go shower then come back and then go to sleep and get back to school and then get to the house and go to the park and go shower then i’ll yeah y’all know what you’re talking about and then go to sleep and get back to school work or whatever you’re doing good you guys are gonna be fine just don’t wanna tell ya anything about how you doin it was so sad that you’re gonna we don’t wanna talk about you anymore because you don’t wanna tell me anything about how much you’re gonna i wanna go to take care of me and my mom is gonna she was really good at it and she’s gonna was the one","userName":"trump_sucks_ugly_asf","date":"2020-07-09T06:09:20Z","isEdited":false,"rating":1}},{"id":"6175318071","type":"user-reviews","attributes":{"title":"HORRIBLE!!!! DONT DOWNLOAD!!","review":"This app took literally 9 days to download and every few minutes I would run out of storage so I had to constantly delete certain thing and it was getting on my nerves!!! As soon as it was done downloading it whipped all of my data out and then it overheated my phone and almost exploded my phone just because of how long it had to download. NEVER IN MY LIFE HAVE I HAD TO DEAL WITH THIS!!! This is the worst experience ever!!!! Then as soon as I got my phone repaired I had to put in ALL MY CONTACTS and REINSTALL EVERYTHING EVEN THIS APP AND IT TOOK A WEEK TO FULLY PROCESS!!! NEVERRRRR INSTALL THIS!!!! DONT DO IT IM WARNING YOU!!","userName":"Laquina Marie","date":"2020-07-09T05:58:23Z","isEdited":false,"rating":1}},{"id":"6175291841","type":"user-reviews","attributes":{"title":"Worst app ever","review":"I downloaded this app and I immediately got eye cancer. It must have been the vibrant orange glow that caused it. My dog was looking over my shoulder and immediately died. It caused me to be an only child and then an orphan. All I have left is my pet duck, but due to my terminal eye cancer I will have to find a new home for my duck. I’ve never been more depressed and I hope that no other person would download it because of all the pain and suffering it has cause me. If only I could give negative stars. Please do not download the app. It will ruin your life like it did mine.","userName":"GeneralOneZie","date":"2020-07-09T05:47:57Z","isEdited":false,"rating":1}},{"id":"6175225520","type":"user-reviews","attributes":{"title":"I’m traumatized","review":"I download this app to support Donald J. Trump✨but to my surprise this app kept making my phone glitch 🤔as soon as I download this app lost of bad stuff happened I was traumatized by this orange head 🟠and harassed by a irrelevant white racist Cheeto the orange head 🟠and the Cheeto looked exactly the same to my surprise they aren’t the same person My gorilla went missing I think it went to the White House and also my mini fridge disappeared keeping this app is a waste of space and I don’t think you should keep this irrelevant app unless you want to be traumatized like I was","userName":"bqos","date":"2020-07-09T05:22:26Z","isEdited":false,"rating":1}},{"id":"6175111894","type":"user-reviews","attributes":{"title":"Trump played me😔","review":"Ofc me being a gen Z kid having to download this app bc all of us LOVE our Cheeto president. I couldn’t wait to have this app and be given all of this lovely info on our loved Cheeto bc if you don’t love him why are you here🙄. But anyways... as I opened the app thinking I was finna be blessed with all this info THE CHEETO JUMPED OUT OF MY SCREEN AND STARTED TO CUT OFF MY TOES. Now ofc I allowed bc who doesn’t want a pedo- I mean president to have your toes. So he cuts off my toes and he just leaves... like not even a thank you so I knew then and there I had to delete the app bc we need someone to be more grateful for what they get.","userName":"BLM beaches","date":"2020-07-09T04:43:04Z","isEdited":false,"rating":1}},{"id":"6174888415","type":"user-reviews","attributes":{"title":"HORRIBLE APP DO NOT GET","review":"Worst app I have ever used! It kept glitching on me, it kept giving me random notifications,  and even after I turned them off. I would expect this from Russia but never our Lord and Savior Donald Trump! All I wanted from this app was to be able to brainwash my liberal snowflake relatives and have them vote for Trump, but apparently that’s not gonna happen. Now I have to figure out another way to brainwash them anyone got any ideas? What else am I supposed to do in quarantine? Just do puzzles and play with my pet velociraptor? I need to be productive someone please help.","userName":"karendestroyer3000","date":"2020-07-09T03:33:13Z","isEdited":false,"rating":1}},{"id":"6174879784","type":"user-reviews","attributes":{"title":"no❤️","review":"so this app has been a bad bad app, no sir. hey do you have any plans today for the girls to do the school day tomorrow morning and i would give you a time for sure if y’all are coming back tomorrow night if you wanna go do y’all need me and i was the way you want to go and i is your way you are coming to the school tomorrow morning i was the night you want me i i is a time for that night we are coming to get you guys are you coming back tomorrow or tomorrow morning i was the night you were coming back tomorrow and then i is a time to get you and all the girls and then go get out of work so we don’t wanna start school and we have a good time to go to sleep with us tomorrow night or night you want me and i was a nice night or something fun and we have to eat it all night so it’s not going good but we are coming to the house to go and do it. and that’s on period sis.","userName":"Christinal😁😁","date":"2020-07-09T03:30:44Z","isEdited":false,"rating":1}},{"id":"6174770924","type":"user-reviews","attributes":{"title":"acab❤️✨🧚‍♀️🍊","review":"i was SO excited to download this app to support MY amazing president but the second i opened it i saw a picture of a huge cheeto? it almost looked like an old man with a bad tan! but we know that can’t actually happen😹😹.....i decided to look into the app but then blue pigs came into my house trying to abduct me! they almost looked like cops! i think the cheeto and his pigs are racist and homophobic! anyways...i told them black lives mattered and they screamed and said all lives mattered😡 then they put me in handcuffs!!! but then they realized i wasn’t black and let me go😔 do not download this!!!!","userName":"Mastermehmet","date":"2020-07-09T02:58:26Z","isEdited":false,"rating":1}},{"id":"6174732279","type":"user-reviews","attributes":{"title":"HORRIBLE APP","review":"I downloaded this app, and I immediately knew something was wrong. My phone heated up the 1000 degrees, and seared the skin off my hand. I had to go to the ER because of that. It gave me 300 notifications per minute, and broke my phone. Once I got everything under control, I opened the app again, and my phone started playing Replay on full volume. Then, since it was linked to my tv, my tv shattered, and I got cut by the glass. Soon enough, black Beatles started playing, and I couldn’t move for 4:53 minutes! I would NOT recommend this app for anyone.","userName":"emily lakamwnwown wneiksjsn","date":"2020-07-09T02:46:43Z","isEdited":false,"rating":1}}]}