{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=7530","data":[{"id":"6176955346","type":"user-reviews","attributes":{"isEdited":false,"title":"Plans","rating":1,"review":"The plans that he has are not even good it will just turn America worst instead of making it great, for him great mean back when slavery was a thing and when they stole native Americans lands which is not ok.... poor people got kicked out of there land for no reason but no one is talking about it. People with color get discriminated every day for the color of there’s skins but at the end of the day we are all humans we have the same blood we all are related some how .... that’s why I’m giving the appp a one star","date":"2020-07-09T14:32:39Z","userName":"dont worry aboht it"}},{"id":"6176946842","type":"user-reviews","attributes":{"isEdited":false,"title":"Eeh","rating":1,"review":"This app does not look professionally created at all. Almost like a child made it.. It is messy, cluttered, and very disorganized to say the least. It is also extremely difficult to navigate with the information and other resources being dispersed sporadically throughout this application. Additionally, this app constantly makes my phone crash! It’s so inconvenient and unnecessary. Also, the information on here seems to be very biased and incomplete. If it’s not 100% accurate, this is not the application for me.","date":"2020-07-09T14:30:22Z","userName":"spottedlola"}},{"id":"6176860521","type":"user-reviews","attributes":{"isEdited":false,"title":"ABSOLUTELY TERRIBLE!!!","rating":1,"review":"THIS APP KILLED MY DOG!!! The precise moment this app finished downloaded, I heard a loud, frightening noise from outside my room. When I went to go check what it was, my oldest dog laid there making strange noises. I went up to her to go see what was wrong, and once I approached, I swear to god she said “the Trump 2020 app did this to me.” and then she immediately passed away. Needless to say, after her funeral I deleted the app off of all my devices to ensure the safety of my other pets. I recommend to EVERYONE considering downloading this app to NOT DO IT!! IT IS NOT WORTH THE LIVES OF YOUR PETS!!!","date":"2020-07-09T14:07:46Z","userName":"Susan Boyle🧚"}},{"id":"6176854990","type":"user-reviews","attributes":{"isEdited":false,"title":"I hate it 🤡","rating":1,"review":"I personally would never recommend this to anybody because it is so bad. When I first got it it continued to crash my phone over and over so I restarted my phone for a while when I went back to the app it crashed my phone again. So I deleted it and when I deleted it I downloaded it back and did the same thing once again . Now if your reading this I really don’t suggest you use this app at all what so ever it will litterally make your phone crash 24/7","date":"2020-07-09T14:06:19Z","userName":"brana vance"}},{"id":"6176811194","type":"user-reviews","attributes":{"isEdited":false,"title":"my dog died after downloading","rating":1,"review":"so i just got a dog right and i knew this dog was so special. he would constantly bark at the screen whenever trump would pop up and lick my hand when i said defund the police. but out of curiosity i really wanted to download this app. when i did i saw there was a rally in new hampshire, very informative by the way. and against my better judgement i got tickets to it. unfortunately, my other pet, a rock, will have already died that same day so i will be grieving and won’t attend the rally. anyways, after getting my tickets my dog cried out in pain and slowly started disintegrating. i couldn’t believe what this app had done. i was sure this app was the root cause of this horrible death in the family, the rally is probably the cause of my pet rock’s death too. unbelievable. do not download!","date":"2020-07-09T13:54:46Z","userName":"sucmeass"}},{"id":"6176792148","type":"user-reviews","attributes":{"isEdited":false,"title":"Captures person data","rating":1,"review":"I was so excited to get this app. But after a few days of using it, I think I noticed it was sending texts and emails to my contacts on my phone. A friend told me he received a text from me saying “do you love maga as much as (my full name) does”. If true, it could ruin my reputation, as it openly tells my friends that I am uneducated, mean, don’t care about people and I support the bankruptcy of this country. While, I know maga is super bad, I still support it, but I prefer to be a bad person quietly.","date":"2020-07-09T13:49:44Z","userName":"DRC6022"}},{"id":"6176761482","type":"user-reviews","attributes":{"isEdited":false,"title":"It’s terrible😡😤","rating":1,"review":"This app is the worst app ever they’re complaining about things I don’t even need to be complained about and Trump is just being over reacted to everything and also the coronavirus this doesn’t need to be an app so shut down your app unlike you shutting down TickTock you rather share this app down as it’s getting many of the ones stars tick-tock is getting at least more stars in this app you should shut down this app this app is terrible it shouldn’t even be on the App Store.","date":"2020-07-09T13:41:37Z","userName":"Gary Najarian"}},{"id":"6176743801","type":"user-reviews","attributes":{"isEdited":false,"title":"Ridic","rating":1,"review":"Here I am, thinking that this would be the easiest app to do some hard hitting teaching but it took a WHOLE WEEK for this app to download. I tried to have my parents help but they both popped a blood vessel so I had to take them to the hospital, but our car battery died. I am now carless, jobless, broke, and even more depressed than before and for what? An app that took way too long to download. I wish I could give this a 0/4 stars, but I’ll just say this: 0/10 would not recommend (even to my worst enemy)","date":"2020-07-09T13:37:01Z","userName":"xIndieSx"}},{"id":"6176715039","type":"user-reviews","attributes":{"isEdited":false,"title":"DO NOT DOWNLOAD","rating":1,"review":"This is the worst app hands down I have ever found. It took up all of the remaining space on my phone and when it was finally downloaded it wiped all of my pictures and information. When I opened it I got an overwhelming sense of white supremacy which was really unsettling. The images on this app are inappropriate and should be flagged as explicit. There are things like Donald Trump waving and pretending that he cares about our country and some of his supporters blindly following him like sheep. I cannot imagine a more heinous sight.","date":"2020-07-09T13:29:27Z","userName":"FDT🤮"}},{"id":"6176649951","type":"user-reviews","attributes":{"isEdited":false,"title":"Disappointing","rating":1,"review":"I had high hopes for this app when I saw that it was made by Mr God Trump our Lord and Savior. However it took almost 3 weeks to download and I had to contact the company several times to find out what the issue was but received no answer. When I was finally able to use the app as soon as I opened it my phone burst into flames and then exploded. I wrote the company a strongly worded email about this incident and they responded by sending me a link which gave my computer a virus. Overall 1 star app.","date":"2020-07-09T13:12:17Z","userName":"bdhauwhwvs"}}]}