{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=128070","data":[{"id":"6177218112","type":"user-reviews","attributes":{"review":"This app is responsible for the death of my pet goldfish😤. It made him extremely suicidal And he drowned himself💦😭😢. He was a virgin and his three kids will miss him very dearly 🥺🐠🐟😹😾. Remember his name SAMMY LONGCOCK! JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JU JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY JUSTICE FOR SAMMY STICE FOR SAMMY JUSTICE FOR SAMMY","date":"2020-07-09T15:45:02Z","userName":"Levi36.io","title":"TERRIBLE","rating":1,"isEdited":false}},{"id":"6177217931","type":"user-reviews","attributes":{"review":"R-🚗r-🚶‍♂️r-👉roll⚽️up⬆️to✌️the😼party🎉in😳my🙋‍♀️crazy🤪pink💗wig💁‍♀️but I☺️cant🙄get through😍the door✨because my🏡booties🎂too😚big🤯1% is 🥰 human 💅 99 is 😅 plastic 😝wait💗a😘second😝lemme🥰fix✨my🤪lips👄these✨h0es🔥are😼jealous💁🏾‍♀️cause🦮their👇🏽men👨‍👩‍👦want😍me👽","date":"2020-07-09T15:44:59Z","userName":"coronacationnnnnn","title":"mwah 💋","rating":1,"isEdited":false}},{"id":"6177217458","type":"user-reviews","attributes":{"review":"He raped me when I was 12 years old.Do I really have to explain myself?","date":"2020-07-09T15:44:51Z","userName":"Yaoi Queen😍","title":"TRUMP","rating":1,"isEdited":false}},{"id":"6177216405","type":"user-reviews","attributes":{"review":"I have downloaded this app to keep up with the latest news and everything and after I downloaded it I couldn’t even take one photo, this app took 46.5MBS! I panicked and then the app whipped ALL MY DATA it saw my photos my Apple ID and my CORN VIDEOS...MY FLIPPING CORN VIDEOS! THIS APP IS A INVASION OF MY PRIVACY DO NOT DOWNLOAD!!!!","date":"2020-07-09T15:44:33Z","userName":"Mr. Man was taken","title":"MY CORN VIDEOS!","rating":1,"isEdited":false}},{"id":"6177216309","type":"user-reviews","attributes":{"review":"I came here to this app because I’m an up the butt rightist believing in all things trump does and says. When I was told to download the app, I did. Only to find out that it’s not a good app.","date":"2020-07-09T15:44:31Z","userName":"Dooooooooooooooooiooiiiioii","title":"Straight booty","rating":1,"isEdited":false}},{"id":"6177215024","type":"user-reviews","attributes":{"review":"ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR. ARREST THE COPS THAT KILLED BREONA TAYLOR.","date":"2020-07-09T15:44:10Z","userName":"Samg5143","title":"ARREST THE COPS THAT KILLED BREONA TAYLOR","rating":1,"isEdited":false}},{"id":"6177214952","type":"user-reviews","attributes":{"review":"Donald J. Trump rape my lil sister","date":"2020-07-09T15:44:08Z","userName":"lil kingston2","title":"Time to tell y’all","rating":1,"isEdited":false}},{"id":"6177214772","type":"user-reviews","attributes":{"review":"Soooo when I open up this app, I was shocked. I didn’t know that our glorious president was such a handsome man. Gorgeous hair that looks like it’s thinning from too much bleach and a sickly tan😍. My desire got the best of me. Honestly, the only thing I worry about is my age🤔. I’m 17.😭. I know that’s a little too old for him. I got this app after I got a ticket for the next rally 👍. Of course I can’t go, but I wanted to show Daddy my support anyways🥺👉🏼👈🏼. After I entered my phone number (my real one of course. I kept hoping he would pick a random number and text it 😬), I got a text about my opportunity to meet him 😃. I was so excited!! So I downloaded this app in hopes it would allow me to have a better chance. It was always my dream to hug him and whisper things in his ear like “Please, I’m only 13” and “White people are truly the only ones who deserve rights” and “the children separated from their parents at the boarder deserve to suffer” 😉😉. I hoped that would be enough to seduce him. But when I got through this app, it turns out it didn’t give me a better chance of meeting him! 😡. I’m so angry that I don’t get to meet that hot Cheeto of an ass. I guess I’ll have to stick to calling him Daddy in my dreams 🥵☹️🥺👉🏼👈🏼🥴","date":"2020-07-09T15:44:05Z","userName":"President Daddy 😉","title":"Honestly... made me want things 😩","rating":1,"isEdited":false}},{"id":"6177214638","type":"user-reviews","attributes":{"review":"I had high hopes for this app since I am an avid trump supporter however I was extremely disappointed! Full of bugs and glitches! I’m surprised the Oval Office couldn’t code a decent app properly let alone lead a country. If 0 stars were an option I would give this app that!","date":"2020-07-09T15:44:03Z","userName":"karen mallower","title":"Karen","rating":1,"isEdited":false}},{"id":"6177213725","type":"user-reviews","attributes":{"review":"I got calls.I got a lot of random call after I downloaded this app.Saying vote for doland trump and then it just ending.I got about 10 calls in 1 hour for random number.If you don’t want random numbers calling you don’t download this app.I don’t care who’s president. I just want my family to be save.May God be with you all.","date":"2020-07-09T15:43:47Z","userName":"Mad wrords in here","title":"I Got Calls","rating":1,"isEdited":false}}]}