{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=15370","data":[{"id":"6177386395","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:33:31Z","title":"trump app killed my pet","userName":"gaybean87","review":"i got this app to be more educated by our wonderful✨ cheeto ✨ and it caused me to go crazy and stop viewing women as people, it also caused me to see poc as nonhuman!! its like this app BRAINWASHED 🧠 me or something. our orange- oops- i mean \"president\" needs to fix this app. when i got this app, in the craziness i ended up running my pet over with a shopping cart and now hes dead. this is all trumps fault and he needs to be held accountable 😡😡"}},{"id":"6177377370","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:30:46Z","title":"It’s actually Democrat propaganda","userName":"jeff stone 45","review":"DO NOT DOWNLOAD THIS APP. Not only is it a scam by the dirty dems to show you anti trump lies. It will also steal your info. When you LOG IN (you can download it so the AppStore lets you leave a review) It will take your passwords, internet history, and credit cards, they will then use this to try to cancel your trump ballot! Give this app a one star rating and copy this review so no one else logs into this app( download but DONOT log in)."}},{"id":"6177340082","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:19:59Z","title":"Gave me nightmares 😠","userName":"Aneiya54321love","review":"I got this dumb app to see what trump be talking bout but after seeing a bunch of pictures of him on this app I got really scared and started to see him peeking out my closet and since it was dark I couldn’t tell if it was my orange dress or just the random dude in the White House so when u finally went to sleep all I saw was orange😠😠😠😖 please take this app down before it causes people trauma because I will sue❤️"}},{"id":"6177308809","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:11:21Z","title":"very bad!","userName":"everynicknameis.takenn","review":"this app is very hard to use and not user friendly. it took forever to log in meaning i haven’t even had a chance to successfully use it. the times it does load in it always crashes and is impossible to use. this app is extremely unhelpful because when i pressed the help button nothing was working or even helping for that matter. i’m upset that it’s not working. it’s a shame i probably won’t have tiktok to view news about trump and other politics because that is where i get most of my information from when im not in school. please do not waste your time purchasing it’ll just waste storage!"}},{"id":"6177301057","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:09:07Z","title":"Homophobic","userName":"lover fun person","review":"Uhm when I logged in and entered my name suddenly its \"Hi F*g\" and \"Send me your location f*g\" like..cant catch a break. Anyway, the app is hella hard to navigate and super confusing. The spinning \"T\" makes me dizzy and could lead to me passing out, this app is dangerous. Not to mention it's labeled as \"news\" when it's so clearly FAKE news. This is PROPAGANDA. I don't know why there's this Oompa Loompa giving me a thumbs up but I don't like it. I love POC, but he's not one of them."}},{"id":"6177275133","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T16:01:40Z","title":"WHY ARE YOU DELETING TIKTOK?!","userName":"Fluffy phoebe","review":"Why are you deleting TikTok?! This is the worst thing that could happen to any average teenagers phone. Literally. When we are bored all day because not being able to see people because the U.S somehow got corona virus hmmm wonder who let that happen..TikTok is the only thing that keeps people happy. Also tell baron we haven’t forgotten about him. Let the guy get TikTok. If you actually keep it. Bye bye."}},{"id":"6177254810","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T15:55:42Z","title":"UNRELIABLE!! SPAM!! POOR FUNCTIONING!!","userName":"Catie_11y","review":"Was happy to get TRUMP 2020 notifications, but this app spammed my text messages and email inboxes. I could not see vital information for my job because my email was just Trump spam emails. Tried to delete app but I still get spammed! The app itself is slow with poor functionality and doesn’t even have a lot of good resources. Very disappointed. 100% would NOT recommend!"}},{"id":"6177220074","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T15:45:36Z","title":"awful","userName":"burndisbeech","review":"it is with SINCERE regret that I have to leave such a bad review on this app, however it is a discredit to our glowing president 🎃. I tried to open the app and it started asking for donations CONSTANTLY. I don’t know about you guys but an entrepreneur asking for money?? Shiiiittt Mr. Trump you sound like you’re in some deep financial doodoo. I can’t support a failing business man, as a president or an entrepreneur. Suffice to say his glowing persona couldn’t keep me in the cult."}},{"id":"6177180075","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T15:34:15Z","title":"Waste of time","userName":"Gndiviibniob","review":"When I got this app I was really really REALLLY looking forward to learning all about our president because I honest to god am looking about being coming racist and homophobic so I needed some guidance on how to portray myself as an ignorant idiot on camera. I wanted some help so I came to this app and not only did it keep crashing but it also tried manipulating me in giving it my information."}},{"id":"6177214208","type":"user-reviews","attributes":{"rating":5,"isEdited":false,"date":"2020-07-09T15:43:56Z","title":"Works GREAT! TRUMP 2020!!!","userName":"sgurleu101015","review":"Unlike the other reviews, I will give an HONEST review. The app downloaded with no issues, is running well, and has not caused my phone to crash like these POTUS haters would like you all to believe. \n\nTrump 2020\n4 MORE YEARS!!"}}]}