{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=77810","data":[{"id":"6173408240","type":"user-reviews","attributes":{"userName":"JamieF47382","review":"Horrible just horrible.","date":"2020-07-08T19:14:47Z","isEdited":false,"rating":1,"title":"Don’t get this app."}},{"id":"6173403289","type":"user-reviews","attributes":{"userName":"CBH~~~","review":"It glitched my phone and it takes too much space. This app is horrible anyways. I can’t have this app on my phone it’s HORRRRIIIIIIIBBBBBBLLLLLLEEEEEEEE DO N O T RECOMMEND BLACK LIVEEESSS MATTTERRRR✨💕","date":"2020-07-08T19:13:04Z","isEdited":false,"rating":1,"title":"The worst app ever"}},{"id":"6173403029","type":"user-reviews","attributes":{"userName":"dhbfbd","review":"The minute I downloaded this app it asked if I wanted to join a go fund me to build a wall. Not cool bro. Not cool.","date":"2020-07-08T19:12:59Z","isEdited":false,"rating":1,"title":"Worst app ever"}},{"id":"6173401528","type":"user-reviews","attributes":{"userName":"r7865","review":"i thought this was gonna be the perfect app to support our all mighty cheeto puff overlord but unexpectedly when i opened the app i turned oranger and lost all my hair do not download bunker boys app unless you plan to look like a bald headed orange bowling ball","date":"2020-07-08T19:12:27Z","isEdited":false,"rating":1,"title":"👁👄👁"}},{"id":"6173384567","type":"user-reviews","attributes":{"userName":"TheBlackninja2400","review":"Everyone knows how bad this app is. I don’t like it, you don’t like it, nobody likes it.","date":"2020-07-08T19:06:16Z","isEdited":false,"rating":1,"title":"SAD!!"}},{"id":"6173383829","type":"user-reviews","attributes":{"userName":"vanessanavarro","review":"first of, the app took hours to download and when it finally downloaded, it glitched to a picture of an orange dude. i hate the color orange😔 i will never be the same. 0/10 recommend😿","date":"2020-07-08T19:06:01Z","isEdited":false,"rating":1,"title":"made me cry"}},{"id":"6173375573","type":"user-reviews","attributes":{"userName":"Cute,awesome,and funny","review":"This is terrible. So negative and every time i see the orange thing I throw up!!!","date":"2020-07-08T19:03:05Z","isEdited":false,"rating":1,"title":"AWFUL"}},{"id":"6173363316","type":"user-reviews","attributes":{"userName":"Brookie555666","review":"by downloading this app my whole house began to turn orange and all of donald trumps minions began to raid all of my food cabinets and took my dog.🤕 my whole world has becan to deteriorate and become a mess please do not get this app for your own safety.","date":"2020-07-08T18:58:53Z","isEdited":false,"rating":1,"title":"horrible app"}},{"id":"6173359883","type":"user-reviews","attributes":{"userName":"smxnxbsmd","review":"The app is literally for the worst president ever. Why would I not give it one star.","date":"2020-07-08T18:57:41Z","isEdited":false,"rating":1,"title":"Trash president"}},{"id":"6173354870","type":"user-reviews","attributes":{"userName":"simpforever1234","review":"The app downloaded after a week of trying to get it to load. The problem is once it loaded there were 80 different versions of the app. It was similar to when you click the same link on internet explorer and it all loads at once. Which backed up and broke my phone. I have to buy a whole new one, problem being stores are closed. I am writing this from my sisters phone. She also downloaded the app and as soon as she did her closet exploded. In the flames were dancing cockroaches that then took over the entire house, the cockroaches let out a loud noise that attracted many angry murder hornets. The murder hornets attempted to kill my goldfish and my sister. Sadly they successfully killed the goldfish. The murder hornets then tried to attack me but I shut my door fast enough to lock them out. However those pesky brats started to get in through the bottom cracks of the door. With nowhere left to go I jumped out of the window. I now have a broken neck, leg, arm, and 5 of my fingers are broken as well. I tried to call 911 on my phone but it was already broken because of the first time I downloaded it. I tried calling to my sister to dial 911 but she was already busy enough Trying to escape the murder hornets herself. After 2 weeks my neighbors found me and called and ambulance, but after realizing how expensive it was they said nvm and told the ambulance not to come. I am still recovering from my injuries and trauma. But please don’t download this app unless you want a broken phone,house, and body. Hater will say it’s fake","date":"2020-07-08T18:55:57Z","isEdited":false,"rating":1,"title":"Worst app ever"}}]}