{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=122360","data":[{"id":"1481678035","type":"user-reviews","attributes":{"rating":2,"review":"This needs work but may a quick fix. You half to to info & event to find official position. Then once your on the page you need to to the menu in the upper right hand corner to find positions & issues. When you back to look at other positions it bounces back to info & events. Wasted clicks and cumbersome. This should easy to find your positions & issues.","userName":"tm4631","date":"2016-11-10T00:39:57Z","title":"Official position and issues","isEdited":false}},{"id":"1440844281","type":"user-reviews","attributes":{"rating":5,"review":"From the views of an app, politics aside:\nBuggy, has some odd quirks, but pretty stable, all things considered. All info is easily attainable, etc. not bad.\n\nNow, the views as a Donald supporter:\nThis app lacks the ability to build the wall, and that's just sad! \nAll the information is easily viewable, and it has a countdown clock to crooked Hillarys defeat. That's the best part, in my opinion. \nIt should talk more about Pence, but oh well.\n\n20/16 not current year enough, but the god emperor wills it, so it must be good. \nBrb, tendies need throwing at the Subaru passing by with Bernie 2016 on it.\n#Trump2016","userName":"Polonium9","date":"2016-08-28T21:30:04Z","title":"Despite its impressive length","isEdited":false}},{"id":"1439759406","type":"user-reviews","attributes":{"rating":4,"review":"Sorry. I have to give it four stars because it doesn't look like it was worked on my a designer. Looks like a developer tried his hand at design and the campaign just ran with it. Also, it doesn't feel smooth like other iOS apps, but rather wonky.","userName":"Zombie JL","date":"2016-08-26T22:52:06Z","title":"Trump is awesome, but this app feels cheap","isEdited":false}},{"id":"1479674222","type":"user-reviews","attributes":{"rating":5,"review":"For those who have written these reviews; you have to understand. Writing a review is you judging the app, not the person who made it. Don't be that person. We're writing reviews based on the app, get it together people. There is no need to start trashing people.","userName":"laurenmoo14","date":"2016-11-06T12:31:10Z","title":"Awesome App","isEdited":false}},{"id":"1453781939","type":"user-reviews","attributes":{"rating":5,"review":"I was happy to finally see this app. Keep making it as easy as possible for people to contribute to the campaign. Everyone who gets this app, we need you to contribute so that we can beat Hillary. How come this app doesn't take Apple Pay? #TrumpTrain","userName":"sonoranstudios","date":"2016-09-22T05:52:21Z","title":"Make America Great","isEdited":false}},{"id":"1477503989","type":"user-reviews","attributes":{"rating":5,"review":"This app works great on my iPhone. I see a few one star reviews for this app. For those one star Hillary followers; I feel your misguided and unspoken pain. Join us! Join us on the Trump train and feel the real change for our country! Come on!","userName":"warrenofdanex","date":"2016-11-02T22:22:30Z","title":"Great app","isEdited":false}},{"id":"1480622400","type":"user-reviews","attributes":{"rating":5,"review":"Can't trust the news...might as well be a part of community that supports similar ideas! I like truth! I don't like lying cheating, slimy politicians who take money any which way they can. I like that this was free. I like knowing about live events. Thank you.","userName":"Happykat29","date":"2016-11-08T02:41:50Z","title":"Might as well!","isEdited":false}},{"id":"1439737795","type":"user-reviews","attributes":{"rating":5,"review":"This app is very useful to find news and information about his campaign. It could use some design/resolution improvements but other than that, functionality is great.","userName":"Alec Jansen","date":"2016-08-26T21:32:47Z","title":"Great way to be updated","isEdited":false}},{"id":"1436393975","type":"user-reviews","attributes":{"rating":5,"review":"Finally! \nA one stop place far all things Trump/Pence. \nI am from /r/The_Donald, and have gotten email + text updates as well as contributed. \nThis makes following the nimble navigator and contributing/ staying up to date so much easier!\nMAGA fellow centipedes!","userName":"Visitor73","date":"2016-08-20T22:47:38Z","title":"First Class.","isEdited":false}},{"id":"1436328456","type":"user-reviews","attributes":{"rating":5,"review":"And I slammed the door in her face and knocked the plate of chicken tendies out of her hand and onto the floor. I just can't do this right now. I thought we were polling. This is so messed up! I wanted Bernie to be the nominee, I wanted a future I could believe in.","userName":"BamaBangs","date":"2016-08-20T19:04:31Z","title":"My mom walked into my room","isEdited":false}}]}