{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=41010","data":[{"id":"6121258181","type":"user-reviews","attributes":{"rating":1,"title":"Glitched and gave me a virus?","date":"2020-06-25T19:11:52Z","isEdited":false,"userName":"archaicGoose","review":"I spent hours trying to get this app to even open and then when it did I immediately found a bunch of apps I’ve never seen before on my phone???"}},{"id":"6118057961","type":"user-reviews","attributes":{"rating":1,"title":"i've been harassed","date":"2020-06-25T00:10:32Z","isEdited":false,"userName":"3 boys daddy","review":"i was all for trump 2020 until i found out this app doesn't give you free cheetos??? i thought he was the cheeto man AND I WANT MY FREE CHEETOS!!! i was very appalled and taken aback, and honestly hurt, i was promised free cheetos and that's been taken away from me 0/10"}},{"id":"6074897027","type":"user-reviews","attributes":{"rating":1,"title":"Weird glitches","date":"2020-06-14T14:12:47Z","isEdited":false,"userName":"Kimjim B","review":"I know he’s the best president since Bill Gates (the kite guy) but this app is just too weird for me. It kept asking me for more and more money to donate. And I already mortgaged my house for trump 2020. What more does orange daddy want from me?"}},{"id":"6072367351","type":"user-reviews","attributes":{"rating":1,"title":"Not american enough","date":"2020-06-13T22:03:33Z","isEdited":false,"userName":"GDolphinz","review":"I expected this app to be as good as two bald eagles making love on a fighter jet equipped with AK-47s while flying over a McDonalds near a Superbowl game, but it turned out to be as much as a disappointment as the american healthcare system"}},{"id":"6068847023","type":"user-reviews","attributes":{"rating":1,"title":"Daddy Anonymos","date":"2020-06-13T01:27:14Z","isEdited":false,"userName":"simping for google","review":"Trump is complete trash. If you support someone who is homophobic, racist, sexist, transphobic, islamphobic, a pedo, and a rapist I don’t even know what’s wrong with you. It’s not about republicans vs Democrats anymore. TRUMP MAKES REPUBLICANS LOOK BAD. He is a horrible person and should’ve NEVER become president. That’s on PERIODT!"}},{"id":"6068395007","type":"user-reviews","attributes":{"rating":1,"title":"Who actually needs this","date":"2020-06-12T22:19:06Z","isEdited":false,"userName":"RachWill21","review":"What’s the point of this app like people are gonna vote for him or they are not. It tells lies about what he believes because he pretends to be for all people but in reality he’s only for white supremacists."}},{"id":"6067791442","type":"user-reviews","attributes":{"rating":1,"title":"Takes your personal information","date":"2020-06-12T18:14:11Z","isEdited":false,"userName":"trumpfannatic2020","review":"Doesn’t work and makes my phone run slow"}},{"id":"6066712919","type":"user-reviews","attributes":{"rating":1,"title":"Disappointed","date":"2020-06-12T12:29:33Z","isEdited":false,"userName":"applesimonvinegar","review":"I downloaded this app to keep up with Donald’s campaign and it began asking me for personal information and credit card info. Trump is my president and always will be but do NOT download this app."}},{"id":"6065007308","type":"user-reviews","attributes":{"rating":1,"title":"🤢🤮","date":"2020-06-12T01:06:33Z","isEdited":false,"userName":"aggrvfhx","review":"I can rate this zero stars if I could the app is very glitchy and it keeps not letting me get in. Do not download this app. Horrible not recommended thank you for reading this through"}},{"id":"6057625947","type":"user-reviews","attributes":{"rating":1,"title":"nope nope nope","date":"2020-06-10T06:19:33Z","isEdited":false,"userName":"torreyegan","review":"if i could give negative stars, i would. not a single human being should support this vile creature. this country is falling to shambles at the hand of this orange bigot. this app is worthless, just like his presidency and existence on this planet. if you have any ounce of sanity, DO NOT DOWNLOAD. DO NOT SUPPORT."}}]}