{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=142300","data":[{"id":"6179324524","type":"user-reviews","attributes":{"userName":"thaliaaaaaaaaaaaa","date":"2020-07-10T03:51:49Z","isEdited":false,"rating":1,"title":"Hate  this app","review":"I give it a 0/10 over all I was not satisfied"}},{"id":"6179323970","type":"user-reviews","attributes":{"userName":"petitgerbil","date":"2020-07-10T03:51:38Z","isEdited":false,"rating":1,"title":"You need to read this!","review":"This app was cool when I downloaded it but then it started to crash. I was all hyped up i even told my friends all about it and everything because ✨trump 2020✨ yk and then i hopped on the app and realized oh wait f*ck donald trump! BLACK LIVES MATTER, JUSTICE FOR BREONNA TAYLOR, RIP GEORGE FLOYD , JUSTICE FOR ELIJAH ETC, AND ALL OTHERS WHO WERE KILLED. How can people still even support this piece of trash after all he has done and approved to. At this point, who even cares about him also ABOLISH ICE . they should be paying for what they have been doing and so should trump. Crazy how were letting a hot cheeto rule our world and government, the racism inside of crazy whites is ASTRONOMICAL isnt it crazy how like this app has 1.2 stars?? 🥰✨no✨🥰  well, have a good day, and NO JUSTICE NO PEACE"}},{"id":"6179323975","type":"user-reviews","attributes":{"userName":"42069davedave","date":"2020-07-10T03:51:38Z","isEdited":false,"rating":1,"title":"Ugh ☹️","review":"The app is SO slow. It took so long to download and then when it FINALLY came up it kept glitching on the log in page and wouldn’t let me log In. Then after COUNTLESS TRIES to get it to work it finally did and it only wanted me to pay to have access for the full app. 0/10 would not recommend. Not even to my worst enemies."}},{"id":"6179323937","type":"user-reviews","attributes":{"userName":"jayda1763","date":"2020-07-10T03:51:37Z","isEdited":false,"rating":1,"title":"Do not download","review":"I tried to download this app two days ago and it just would not let me open it sadly because I want to make America great again"}},{"id":"6179323638","type":"user-reviews","attributes":{"userName":"anonymous1207664","date":"2020-07-10T03:51:31Z","isEdited":false,"rating":1,"title":"DISGUSTING APP😡🤮","review":"This app is 100% NOT worth downloading. It is filled with false information and is very misleading. If you are looking for a reliable source, do NOT come to this app. It is hateful and rude and honestly just offensive to everyone viewing it. Would NOT recommend. This app is trash."}},{"id":"6179323549","type":"user-reviews","attributes":{"userName":"SoobinYouKnow20","date":"2020-07-10T03:51:29Z","isEdited":false,"rating":1,"title":"I will never use this app again","review":"I can’t believe someone took the time out of their lives to make this. It took forever to download, I had no more storage on my phone and none of my family photos and videos from the last few moths are backed up. I had to delete the app because it wasn’t worth losing my family memories over it. Especially since my baby brother is growing and doing so much now. Very disappointing"}},{"id":"6179323319","type":"user-reviews","attributes":{"userName":"slywolf710","date":"2020-07-10T03:51:25Z","isEdited":false,"rating":1,"title":"worst app ever","review":"i downloaded this app and my microwave exploded, from the flames and debris a one foot tall donald trump emerged, he killed my cat and stabbed me in the shin with a piece of metal from the exploded microwave): now my cat is dead and there is a tiny trump loose in my neighborhood👎🏼"}},{"id":"6179322923","type":"user-reviews","attributes":{"userName":"fel0city","date":"2020-07-10T03:51:18Z","isEdited":false,"rating":1,"title":"TRASH","review":"This app is trash. 0/10 do not recommend."}},{"id":"6179323208","type":"user-reviews","attributes":{"userName":"Luigiplumber","date":"2020-07-10T03:51:23Z","isEdited":false,"rating":5,"title":"I II II L","review":"Yeah"}},{"id":"6179322816","type":"user-reviews","attributes":{"userName":"sjsjjeeekkdd","date":"2020-07-10T03:51:16Z","isEdited":false,"rating":1,"title":"Why Deltet tik tok","review":"Tik tok is not getting bann"}}]}