{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31070","data":[{"id":"6174728444","type":"user-reviews","attributes":{"date":"2020-07-09T02:45:32Z","isEdited":false,"userName":"Reilly_1727","review":"its super laggy and doesn’t even do what it says. covered in ads you cannot click out of, and the interface is super confusing. it even forces you to buy an ad eraser!!! like what the heck!!! i spent $1.99 for a broken app and now i cant even get my money back 😡😡. not only that, i’ve been trying to send a text for an hour now, but i can’t!!! please fix this!!! its awful! i might as well use my imessage, which defeats the purpose of this app.","rating":1,"title":"awful 😡😡😡"}},{"id":"6174727258","type":"user-reviews","attributes":{"date":"2020-07-09T02:45:11Z","isEdited":false,"userName":"Bridger Carlson","review":"I opened this app and it immediately made my imaginary friend into an anteater. I will never forgive what this app has done to me and my relationship with Jeffery (my imaginary friend) so sad😣 don’t get this app unless you want your imaginary friends to change into random animals 😫","rating":1,"title":"This. App. Is. A. Fraud."}},{"id":"6174713155","type":"user-reviews","attributes":{"date":"2020-07-09T02:40:56Z","isEdited":false,"userName":"jiminisbae","review":"I downloaded this app because I thought it was gonna change my skin color, but I was left disappointed when I woke up and I was still tan!!! This app gives people false hope and should be ban!! I wanna speak with the manager right this instant!!","rating":1,"title":"I HATE THIS APP"}},{"id":"6174700957","type":"user-reviews","attributes":{"date":"2020-07-09T02:37:16Z","isEdited":false,"userName":"donaldtrumpisaidiot","review":"When I downloaded this app it asked me for my location and I I accidentally pressed yes then the next day there was spray tan,corn wig and a suit setting out side my door and I used the spray tan and now I’m orange I put on the corn wig and suit and now I look like garbage and it’s all the apps fault.😡","rating":1,"title":"I hate Donald trump"}},{"id":"6174700266","type":"user-reviews","attributes":{"date":"2020-07-09T02:37:04Z","isEdited":false,"userName":"Valascy","review":"I downloaded this app to keep an eye out for what Cheeto H***** was up to on his campaign trail, but it immediately started to bog down my phone. It constantly crashes, and I get several notifications. Deleted it not too long after getting it.","rating":1,"title":"Worst App!"}},{"id":"6174683157","type":"user-reviews","attributes":{"date":"2020-07-09T02:31:57Z","isEdited":false,"userName":"My chicken left me","review":"Because of this app my husband and my girlfriend filed for divorce and my chicken decided to live full time with my mom. Now my stuffed dog won’t even sleep in the same bed as me. And my I have a pack of 48 crayons and they all broke in half. My life is in shambles because of this app do not download.","rating":1,"title":"DO NOT DOWNLOAD"}},{"id":"6174674514","type":"user-reviews","attributes":{"date":"2020-07-09T02:29:24Z","isEdited":false,"userName":"BlackLivesMatterForpresident","review":"My phone was working fine before this app, no issues. Now everytime I use Siri she keeps screaming about how nazi’s are very fine people and wants to grab me by the.. well.. Anyways, Terrible, do not recommend.","rating":1,"title":"This app has caused massive damage to my phone"}},{"id":"6174672613","type":"user-reviews","attributes":{"date":"2020-07-09T02:28:49Z","isEdited":false,"userName":"kimmaheu","review":"This app age my dinosaur and then choked on it so it deleted it self off my phone. I then re launched the app and it said my dino chicken nugget has been regurgitated and it’s edible. After that it shut my entire WiFi off and then I proceeded to delete the app and leave this review.","rating":1,"title":"DO NOT RECOMMEND TO ANYONE"}},{"id":"6174652672","type":"user-reviews","attributes":{"date":"2020-07-09T02:23:06Z","isEdited":false,"userName":"Cooler guy 123","review":"Now, everyone may think that trumps a cool dude and all that but in reality, he kicked me out of his roblox server >:( I can’t believe this guy. The app is poorly designed and I cannot click it due to severe nausea after seeing the image of the man who kicked me out of his roblox server.","rating":1,"title":"He kicked me"}},{"id":"6174646881","type":"user-reviews","attributes":{"date":"2020-07-09T02:21:28Z","isEdited":false,"userName":"pickleeater9876522222","review":"As soon as I downloaded it my finger turned into a pickle and Ofc I couldn’t resist myself..I mean come on...a pickle....so long story short this app turned my finger into a pickle which caused me to eat my pickle finger...0/10 would not recommend","rating":1,"title":"0/10 would not recommend"}}]}