{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=41580","data":[{"id":"6173247037","type":"user-reviews","attributes":{"date":"2020-07-08T18:20:12Z","title":"Oh what a horrific app✨😝😝","review":"So my review on this app is that it helped me understand that Donald trump is a bad president and yeah that’s all i gotta say...❤️ I mean we been knew like cmon now...💥 ❄️❄️❄️❄️ also TikTok is a better app so apple y’all should really delete this app and keep TikTok bc I NEED TIKTOK... fanks luv💅🏼xx","userName":"castilian123","isEdited":false,"rating":1}},{"id":"6173246883","type":"user-reviews","attributes":{"date":"2020-07-08T18:20:09Z","title":"Phone freeze","review":"The app made my phone freeze very badly! My phone would freeze every time I tried to open the app then eventually my phone would get really hot","userName":"◻️▶️▶️🔟🔢6️⃣0️⃣9️⃣⏭⏬⏬⏯6️⃣","isEdited":false,"rating":1}},{"id":"6173246151","type":"user-reviews","attributes":{"date":"2020-07-08T18:19:54Z","title":"I hate it","review":"It was an absolutely horrible app I was downloading it to give me a reason to vote for him but I completely change my mind it was horrible I hate it ✨🍊 my teeth are brighter than this app’s future","userName":"aubraja","isEdited":false,"rating":1}},{"id":"6173237817","type":"user-reviews","attributes":{"date":"2020-07-08T18:17:09Z","title":"Trash 😌","review":"All you trump supporters should just back off and leave it to us to make this world better 🥰 he’s not our president and never will be ❤️if you support him I hope you get hit by a bus 🧚🏻","userName":"Marie ☺️💖","isEdited":false,"rating":1}},{"id":"6173232042","type":"user-reviews","attributes":{"date":"2020-07-08T18:15:14Z","title":"Terrible app","review":"I turned on my notifications to keep in touch with this orange 🍊👄🍊 and then about a day later, my phone crashed and kept glitching. I do not recommend this app what so ever 👎🏾","userName":"hehavdvuwjs","isEdited":false,"rating":1}},{"id":"6173231053","type":"user-reviews","attributes":{"date":"2020-07-08T18:14:55Z","title":"Sad","review":"Downloaded the app in order to see if there was good unbiased content. However all I found was headlines with zero reliability and transparency. Also I will be deleting this app off my phone shortly","userName":"amf_99","isEdited":false,"rating":1}},{"id":"6173226299","type":"user-reviews","attributes":{"date":"2020-07-08T18:13:21Z","title":"Terrible app","review":"This is the all around worst app I’ve ever downloaded. Everything you could think of that’s wrong is wrong. I’ve never downloaded a worse app in my life","userName":"Collin Fuller","isEdited":false,"rating":1}},{"id":"6173220056","type":"user-reviews","attributes":{"date":"2020-07-08T18:11:17Z","title":"Oh no","review":"This app messed up my phone and I just got a new phone last week🥺 and the person who made this app ruined the country so what did I expect 🐍 don’t get this app if you’re a baddie✨","userName":">:( :$ ;)","isEdited":false,"rating":1}},{"id":"6173212712","type":"user-reviews","attributes":{"date":"2020-07-08T18:08:52Z","title":"Trump 2020..","review":"I wish I could give this app a better review but it was poorly designed. It took hours to download and once I opened it, it told me to go back to my country. So when I say Trump 2020 I really mean Trump 2020 but on a tombstone✨","userName":"Twitter:GlendaCaballer7","isEdited":false,"rating":1}},{"id":"6173208723","type":"user-reviews","attributes":{"date":"2020-07-08T18:07:32Z","title":"Wack.","review":"This app took 12 days to download and i don’t understand what the problem is. But if you are reading this vote trump out 2020. Do not vote for kanye because it will split the black vote and make trump win. A vote for kanye is a vote for trump. Thank you that is all.","userName":"Zach sent me😍","isEdited":false,"rating":1}}]}