{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=136710","data":[{"id":"6180128917","type":"user-reviews","attributes":{"userName":"sup my names vanessa✨","review":"trump is a ✨p o o p y n u g g e t✨","rating":1,"date":"2020-07-10T08:39:54Z","title":"aha","isEdited":false}},{"id":"6180128648","type":"user-reviews","attributes":{"userName":"🍝SpOiLeD SpAghEtTi🍝","review":"So I download the app just to see if I would get hacked or something and I did. The FBI immediately texted me saying I was too young to vote for trump and I was forced to say that I will vote for trump when I’m older. I went into the app again to see if anything changed and then trump started calling me which I obviously denied, he called me again and it automatically answered I tried to hang up but I couldn’t. Then he said that if I didn’t vote for him when I was older that he would tell everyone to call me a cow, that is body shaming and I do not approve. It then let me hang up and I blocked him. The app then started glitching out my phone and my pictures started getting deleted. All of my sappy got locked, including my phone and message apps. I deleted the app and my apps started unlocking and my pictures came back. The FBI texted me again saying “I’ll let you off with a warning” and then my phone powered off. I turned it back on and deleted the app. Do not download this app. I was very upset about what happened to me and now my parents won’t be voting for trump.","rating":1,"date":"2020-07-10T08:39:47Z","title":"Shameful","isEdited":false}},{"id":"6180128480","type":"user-reviews","attributes":{"userName":"Timmytammy158954","review":"This app causes my phone to glitch every time I open it. It makes my phone hot after awhile of navigating. It also spams me like CRAZY. Do NOT get this app!","rating":1,"date":"2020-07-10T08:39:43Z","title":"CRASHED MY PHONE","isEdited":false}},{"id":"6180128491","type":"user-reviews","attributes":{"userName":"#episodelovera😍🤩","review":"WHEN LOOKING AT THE APP MY PHONE TURNED HOT AND MY HANDS SET ON FIRE. I HAD TO BE RUSHED TO  THE HOSPITAL AND NOW I HAVE THIRD DEGREE BURNS ON MY HANDS. IN CONCLUSION THIS APP IS DANGEROUS AND HORRIBLE PLZ DELETE 🧚🏼‍♀️✨💖🤪🥳","rating":1,"date":"2020-07-10T08:39:43Z","title":"I ALMOST DIED","isEdited":false}},{"id":"6180128187","type":"user-reviews","attributes":{"userName":"lily/5643","review":"I can smell his spray tan through my phone, also he hits on his daughter🤢","rating":1,"date":"2020-07-10T08:39:37Z","title":"tragic","isEdited":false}},{"id":"6180128099","type":"user-reviews","attributes":{"userName":"badreviewet","review":"The app isn’t bad- Trump is. We are not gonna get TikTok banned dood😌 THIS REVIEW ISN’T JUST FOR THIS APP TO GET DELETED- Trump is racist, and makes a lot- and when i say a lot, i mean A LOT of pretty bad decisions. “slOw thE tEsting dOwn plEase“ slow our research of trying to get out of this stupid pandemic? That don’t make sense. (Ik that was a while ago) I LIED- the app DID crash about 20 times while i tried to put my number in. I deleted it bc it rlly didn’t want me to type without it crashing and lagging! Oh, i have a question. WHY DOES TRUMP HATE CHINA AND MEXICO SO FRICKEN MUCH?! What’s so bad about it? Rlly tho. “r*piSts cOme frOm mExicO“ who else wants obama back..? He actually helped and wasn’t fricken RACIST (bc he was black obv) we need more ppl like him- not Biden or Trump. Thank u for reading all of this lol, It’s just my honest opinion!","rating":1,"date":"2020-07-10T08:39:35Z","title":"#savetiktok #notrump2020","isEdited":false}},{"id":"6180127966","type":"user-reviews","attributes":{"userName":"yvng_adrian","review":"kanye west for president😂✊🏾","rating":1,"date":"2020-07-10T08:39:33Z","title":"DIS APP IS ASS!!!","isEdited":false}},{"id":"6180127453","type":"user-reviews","attributes":{"userName":"brittbey 2315","review":"This app started glitching on me as soon as I downloaded it and it doesn’t work and shouldn’t be downloaded since it made my phone slow too as well I would give this a 0 rating if I could to this orange oompaloompa looking app","rating":1,"date":"2020-07-10T08:39:21Z","title":"Glitching and foolery 🍊","isEdited":false}},{"id":"6180126881","type":"user-reviews","attributes":{"userName":"monayamonaya","review":"If u guys r trying to ban TikTok we will ban ur app as well","rating":1,"date":"2020-07-10T08:39:08Z","title":"Save TikTok","isEdited":false}},{"id":"6180126605","type":"user-reviews","attributes":{"userName":"the orange one so terrify","review":"{Man} Once upon a time there was a lovely princess.\n\nBut she had an enchantment upon her of a fearful sort which could only \n\nbe broken by love's first kiss.\n\nShe was locked away in a castle guarded by a terrible fire-breathing \n\ndragon.\n\nMany brave knigts had attempted to free her from this dreadful prison, \n\nbut non prevailed.\n\nShe waited in the dragon's keep in the highest room of the tallest \n\ntower for her true love and true love's first kiss.\n\n{Laughing} \n\nLike that's ever gonna happen.\n\n{Paper Rusting, Toilet Flushes}\n\nWhat a load of - \n\nSomebody once told me the world is gonna roll me\n\nI ain't the sharpest tool in the shed\n\nShe was lookin' kind of dumb with her finger and her thumb\n\nIn the shape of an \"L\" on her forehead\n\nThe years start comin' and they don't stop comin'\n\nFed to the rules and hit the ground runnin'\n\nDidn't make sense not to live for fun\n\nYour brain gets smart but your head gets dumb\n\nSo much to do so much to see\n\nSo what's wrong with takin' the backstreets\n\nYou'll never know if you don't go\n\nYou'll never shine if you don't glow\n\nHey, now You're an all-star\n\nGet your game on, go play\n\nHey, now You're a rock star\n\nGet the show on, get paid\n\nAnd all that glitters is gold\n\nOnly shootin' stars break the mold\n\nIt's a cool place and they say it gets colder\n\nYou're bundled up now but wait till you get older\n\nBut the meteor men beg to differ\n\nJudging by the hole in the satellite picture\n\nThe ice we skate is gettin' pretty thin\n\nThe water's getting warm so you might as well swim\n\nMy world's on fire\n\nHow 'bout yours\n\nThat's the way I like it and I'll never get bored\n\nHey, now, you're an all-star\n\n{Shouting}\n\nGet your game on, go play\n\nHey, now You're a rock star\n\nGet the show on, get paid\n\nAnd all that glitters is gold\n\nOnly shootin' stars break the mold\n\n{Belches}\n\nGo!\n\nGo!\n\n{Record Scratching}\n\nGo. Go.Go.\n\nHey, now, you're an all-star\n\nGet your game on, go play\n\nHey, now You're a rock star\n\nGet the show on, get paid\n\nAnd all that glitters is gold\n\nOnly shootin' stars break the mold","rating":1,"date":"2020-07-10T08:39:03Z","title":"Terrible App","isEdited":false}}]}