{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=88250","data":[{"id":"6176648725","type":"user-reviews","attributes":{"review":"Idk ummm it’s true in a app do u really want it?","isEdited":false,"userName":"cool beans is cool","title":"don’t","date":"2020-07-09T13:11:57Z","rating":1}},{"id":"6176637990","type":"user-reviews","attributes":{"review":"Stole my data, made me a racist","isEdited":false,"userName":"jejeh bwkebbebje","title":"Horrible","date":"2020-07-09T13:09:09Z","rating":1}},{"id":"6176632908","type":"user-reviews","attributes":{"review":"this app is TERRIBLE it took several days to dowload!!!! also i hate trump! soo the answer is DONT GET THIS APP AND RATE A 1 STAR REVIEW","isEdited":false,"userName":"Karen64588","title":"trumps kidney","date":"2020-07-09T13:07:46Z","rating":1}},{"id":"6176592976","type":"user-reviews","attributes":{"review":"I tired this app, I don’t like, it’s just not for me","isEdited":false,"userName":"F@ith#21","title":"Idk","date":"2020-07-09T12:56:59Z","rating":1}},{"id":"6176586561","type":"user-reviews","attributes":{"review":"Unfortunately this app and our president are dysfunctional","isEdited":false,"userName":"no ma'am ❤️","title":"No❤️ ma’am","date":"2020-07-09T12:55:16Z","rating":1}},{"id":"6176551980","type":"user-reviews","attributes":{"review":"This app is horribly done","isEdited":false,"userName":"i_hate_everyone_","title":"Horrible","date":"2020-07-09T12:45:52Z","rating":1}},{"id":"6176530402","type":"user-reviews","attributes":{"review":"Never fear! For where there is a will, there is a way. And I have I way. Donkey? -I guess this is just my act of magnetism. -Oh, come here, you. All right. All right. Don't get all started. No one likes kissass. All right, hop on. Hold on tight. I hadn't have a chance to install seat belts, yet. People of Duloc. We gather here today to bear witness to reunion of our new king... Excuse me. Could you just skip ahead to \"I do's\"? Go on. Go ahead and have some fun, if we need you, I'll whistle. How about that? Shrek, wait, wait a minute. You want to do this right, don't you? -What are you talking about? -It's the line, it's the line you got to wait for. The priest is going to say: \"Speak now or forever hold your peace\". And that's where you say: \"I object\". -I don't have time for this. -Wait, wait. What are you doing? Listen to me! Look, you love this woman, don't you? -Yes. -You want to hold her! -Yes. -Please her! -Yes! Then you got to, got to try a little tender love. -The chicks love that romantic crap. -All right. Cut it out. When does this guy say the line? We got to check it out. And as so by the power of these two... What do you see? -I now pronounce you... -There they go! -...he all ready said it. -Oh, for 'the love of pit'. I object! Shrek? Oh, now what does he want? Hi, everyone. Having a good time, aren't you? I love Duloc, first of all. Very clean. -What are you doing here? -Really, it's rude enough being alive, when no one wants you. But showing up uninvited to a wedding... -Fiona! I need to talk to you. -Oh, now you wanna talk? Well it's a little late for that. So if you'll excuse me. -But you can't marry him! -And why not? Because, because he's just marrying you so he can be king. -Outrageous! Fiona, don't listen to him. -He's not your true love. -What do you know about true love? -Well, I ...I'm in... Oh, this is precious. The Ogre has fallen in love with the princess. Laugh. Shrek. Is this true? Who cares. It's preposterious. Fiona, my love, we gonna kiss away for our happily ever after. Now kiss me! By night one way, by day another. I wanted to show you before. Well. That explains a lot. Oh. It's disgusting. Guards, guards. I order you to get them out of my sight. -Now! Get them! Get them, both! -No! This marriage is minding, and that makes me king. See? See? -Shrek! -No. -Don't just stand there, you dogs. -Get out of my way. No! Shrek! -And as for you my wife. -Fiona! I'll have you locked back in that tower for the rest of your days! I will have order. I will have potential. I will have... All right, nobody move! I got a dragon here and I'm not afraid to use it. I'm a donkey on the edge! Celebrity marriages. They never last, do they? Go ahead Shrek. -Fiona? -Yes, Shrek? I love you. Really? Really, really. I love you too. A time for true love's first kiss... Fiona? Fiona? Are you all right? Yes. But I don't understand. I'm supposed to be beautiful. But you are beautiful. I was hoping this would be a happy ending. God bless us, everyone.","isEdited":false,"userName":"Abor shen","title":"Part 12","date":"2020-07-09T12:39:55Z","rating":1}},{"id":"6176511017","type":"user-reviews","attributes":{"review":"I was shock🤦🏾‍♀️ I was in tears almost💀\n it has a orange refrigerator🤢\nHunny I don’t recommend","isEdited":false,"userName":"BLM 🖤✊🏾","title":"The ghetto the ghetto","date":"2020-07-09T12:34:39Z","rating":1}},{"id":"6176493203","type":"user-reviews","attributes":{"review":"extremely disappointed","isEdited":false,"userName":"Amelia Rasmussen","title":"worst app","date":"2020-07-09T12:29:43Z","rating":1}},{"id":"6176490126","type":"user-reviews","attributes":{"review":"took hours to download and its just a bunch of propaganda. would not recommend","isEdited":false,"userName":"Hop2it05","title":"horrible app","date":"2020-07-09T12:28:54Z","rating":1}}]}