{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28620","data":[{"id":"6173612368","type":"user-reviews","attributes":{"review":"I’m pretty sure since this app had made my phone glitch nonstop for so long that the only reason why there’s a trump 2020 app is to allow the government to stalk us and manipulate us. Worst app ever. If this review box had a 0 star rating I’d use that but I just needed to tell you.","userName":"thomasaquinas1","rating":1,"date":"2020-07-08T20:24:47Z","isEdited":false,"title":"Government stalking😾"}},{"id":"6173610961","type":"user-reviews","attributes":{"review":"This app almost gave me a heart attack since I was dealing with a lot of issues and when I pulled up this application I saw an Orange monster on my phone that scared me half to death. Overall I want to get rid of the monster on my phone.","userName":"Arobotjk","rating":1,"date":"2020-07-08T20:24:16Z","isEdited":false,"title":"If I could, I would give this zero stars."}},{"id":"6173600989","type":"user-reviews","attributes":{"review":"This app freezes every time I open it. On the off chance I get in it glitches and shows very very inappropriate content. I have seen some horrid things and have had nonstop nightmares over it. Please, for the sake of your sanity DO NOT DOWNLOAD THIS APP!! I am appalled at all that I have seen.","userName":"aislinnlb","rating":1,"date":"2020-07-08T20:20:41Z","isEdited":false,"title":"do not download!!!!"}},{"id":"6173600948","type":"user-reviews","attributes":{"review":"It took so long to download and it’s also making my phone glitch a lot and when I try to open this app it just closes me right out of it I don’t know why but this is a really bad app so I wouldn’t recommend getting it","userName":"[][][][][][][][][\\[][]","rating":1,"date":"2020-07-08T20:20:40Z","isEdited":false,"title":"Don’t get this app please"}},{"id":"6173597452","type":"user-reviews","attributes":{"review":"It glitches every time I click enter. It always kicks me out the app. I have to leave the app for 5 mins for me to get back on and only for it to work for a min or two. Also let’s not forget to mention that it’s supporting a racist, homophobic,transphobic,pediphile","userName":"pacotaco420","rating":1,"date":"2020-07-08T20:19:25Z","isEdited":false,"title":"Hate it 🤮"}},{"id":"6173595453","type":"user-reviews","attributes":{"review":"i tried to use it to get rally tickets and it wouldn’t let me get more than 1!!! so frustrating. all my homophobic and racist friends really wanted to go and it was my job to reserve the tickets because i’m the only one who can read. i had to teach all of them how to read (which was difficult because all their parents are cousins). they were finally able to reserve their tickets thank the lord. terrible app. zero stars if possible.","userName":"kymfs","rating":1,"date":"2020-07-08T20:18:45Z","isEdited":false,"title":"discriminatory!! my inbred illiterate friends can’t use!!"}},{"id":"6173592227","type":"user-reviews","attributes":{"review":"I’m using this app on the latest IOS and I have a lot of concerns. My phone started to lag I can’t open some apps. Others randomly open on their own. My phone is turned into a transformer and is trying to eat my family. It’s not worth it I promise. I miss my dad😭","userName":"2537939382627@392","rating":1,"date":"2020-07-08T20:17:36Z","isEdited":false,"title":"DO NOT DOWNLOAD"}},{"id":"6173591713","type":"user-reviews","attributes":{"review":"The app crashes every 15 seconds, and when it’s not doing that, it’s sending swat teams to my house. I just can’t believe they let this through. Trump is now coming to my house to break my legs.","userName":"Donomonkey9","rating":1,"date":"2020-07-08T20:17:25Z","isEdited":false,"title":"Very bad, I don’t know how the developers let this through"}},{"id":"6173587675","type":"user-reviews","attributes":{"review":"This app tracked me and my family without my consent including relatives I didn’t know existed. This app gained information about my loved ones and there by kidnapping one of them.  They were then held for ransom. I had to sacrifice my cat in order for me to see my relative again.","userName":"Nadia Marjan","rating":1,"date":"2020-07-08T20:16:01Z","isEdited":false,"title":"Terrible"}},{"id":"6173583299","type":"user-reviews","attributes":{"review":"The app was way to laggy! When I entered the app it stated trump 2020 I was confused because it should have stated Biden 2020 also the app in general supports trump. I was very sad and disappointed I’m I’m shocked that people support him! He was the same man to that the J in Donald J trump stands for genius! Why would an app like this be a thing","userName":"Tonius1285","rating":1,"date":"2020-07-08T20:14:32Z","isEdited":false,"title":"Disappointed"}}]}