{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33920","data":[{"id":"6176471418","type":"user-reviews","attributes":{"isEdited":false,"title":"Terrible","rating":1,"date":"2020-07-09T12:23:46Z","userName":"Rachel Hood-Irwin","review":"The app made my phone completely glitch out upon opening it and I couldn’t use my phone for days without it messing things up. 💖✨Must be the because of the racist homophobes who made the app. 🧚🦋"}},{"id":"6176466799","type":"user-reviews","attributes":{"isEdited":false,"title":"Never use this app","rating":1,"date":"2020-07-09T12:22:29Z","userName":"beautiful 😌💗","review":"after the download taking 3 and a half hours, i finally opened to see a petition to get Trump 2020. I kept trying to close it out but whenever i did, it opened back up every 2 minutes. DO NOT DOWNLOAD THIS APP!!!!!!!!"}},{"id":"6176463688","type":"user-reviews","attributes":{"isEdited":false,"title":"Worst app","rating":1,"date":"2020-07-09T12:21:37Z","userName":"Hi.,!?'","review":"The app took forever to download! Then when it finally did, it crashed every time I tried to do anything. 10/10 do not recommend. I would give it a zero star if I could!"}},{"id":"6176445069","type":"user-reviews","attributes":{"isEdited":false,"title":"What happened","rating":1,"date":"2020-07-09T12:16:33Z","userName":"We strike back","review":"I meant to press 5 stars, but it was at 1. I keep changing it, but it will remain at 1 star. I have read the reviews and how are they giving the worst reviews. Seams like people just downloaded the app to give a 1 star rating"}},{"id":"6176414836","type":"user-reviews","attributes":{"isEdited":false,"title":"TERRIBLE TERRIBLE 🤢🤢🤮🤮 DO NOT DOWNLOAD!!","rating":1,"date":"2020-07-09T12:08:13Z","userName":"MelanietheWizard1885","review":"This app is super slow and make your device run differently. DO NOT DOWNLOAD!! The only time you should download is to write a review and rate. IT NEEDS TO BE OFF THE APP STORE.  After writing your review and rating this disgusting app DELETE it immediately. Be safe and get this app off the App Store!!"}},{"id":"6176348411","type":"user-reviews","attributes":{"isEdited":false,"title":"Would not recommend","rating":1,"date":"2020-07-09T11:49:42Z","userName":"7sav","review":"The app was very slow. Glitched the entire time and made my phone restart several times just tim use each time. I cannot say enough how bad of an app this is!"}},{"id":"6176330832","type":"user-reviews","attributes":{"isEdited":false,"title":"Delete this","rating":1,"date":"2020-07-09T11:44:42Z","userName":"Your normal weeb","review":"After I downloaded the app I noticed that someone logged into my paypal and all of my money is gone this is a serious problem and apple should remove this app it stole all of my data"}},{"id":"6176313229","type":"user-reviews","attributes":{"isEdited":false,"title":"BUGS OUT YOUR PHONE","rating":1,"date":"2020-07-09T11:39:41Z","userName":"Kai Kimya","review":"Took FOREVER to download, and once it did it started bugging my phone out so hard I couldn’t even do anything on it for weeks. I had to go to professionals for help and get this app removed, absolutely NEVER again."}},{"id":"6176289568","type":"user-reviews","attributes":{"isEdited":false,"title":"Absolutely horrible","rating":1,"date":"2020-07-09T11:32:40Z","userName":"Sbcich","review":"This app represents everything wrong in America. Super glitchy program, drains all of your battery life, constantly asking you for money, hacks your phone and the government listens to all of my conversations now!!!"}},{"id":"6176254753","type":"user-reviews","attributes":{"isEdited":false,"title":"SO BAD","rating":1,"date":"2020-07-09T11:22:09Z","userName":"anonymous54333","review":"right when i got in the app my phone started glitching and i think my phone got hacked. i want other people to know to not get this app from my experience. this app should be taken down immediately."}}]}