{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=14990","data":[{"id":"6172750523","type":"user-reviews","attributes":{"isEdited":false,"userName":"tmsdaliamcg","review":"I had to review and give such a low rating because I can’t believe we have a Cheeto as a president out of all people you chose a crusty dusty Cheeto man, the app it’s self is one of stupidest things I’ve seen in my life, one of the first stupidest things I’ve seen is the orange lookin man that made this app🍊 the app is also just to glitchy, it’s crusty like the people that actually use it on a day to day basis🧚🏽‍♀️ anyways chile y’all want some McDonalds","date":"2020-07-08T15:46:26Z","rating":1,"title":"Dndnmsjs"}},{"id":"6172566075","type":"user-reviews","attributes":{"isEdited":false,"userName":"theonewhodunks","review":"This app requires a cell phone number and email address. This alone is no crime, but with this information they sell your number and email to tells marketers! I have so much spam and junk after signing up for this app. I don’t know if Trump is profiting from this but it’s his name and brand. I didn’t know my information was for sale beware that is app will sell your info.","date":"2020-07-08T14:54:37Z","rating":1,"title":"Sells your information"}},{"id":"6172564946","type":"user-reviews","attributes":{"isEdited":false,"userName":"oofdumbb","review":"❤️❤️So I was like you know what I want to sport a dearly racist Trump what can I do because I was seeing if I can vote so it was starting to flash I tried to get out it didn’t work then a thing popped up and it took my credit card information where I couldn’t do anything with it now so don’t get this app it will definitely hack your phone and also Barack Obama kiss kiss from you dearly heavily black person","date":"2020-07-08T14:54:18Z","rating":1,"title":"Don’t buy it"}},{"id":"6172496754","type":"user-reviews","attributes":{"isEdited":false,"userName":"drew-sent-me","review":"Wow. In short, this app took 4 days to download, and when it finally did, it glitches out so bad I had to get a new phone. But for the past week it’s like there’s been a curse on me...for the past week my phone has been ringing with no answer, I’m finding dead rats on my porch. I have this eery feeling of dread and despair hanging over me all the time. So if you value your life DON’T DOWNLOAD THIS APP!!!!","date":"2020-07-08T14:35:08Z","rating":1,"title":"Please for the love of god don’t download this app"}},{"id":"6172491204","type":"user-reviews","attributes":{"isEdited":false,"userName":"Great app and fun to use","review":"This app is absolutely terrible. It is constantly crashing and always takes forever to load. I want to read about our so very amazing president but the articles make me depressed and embarrassed because I remember that Trump is our president and doesn’t care about the people unless you’re a rich white man. While going on this app my anxiety sparks to the max because our president is a complete joke.","date":"2020-07-08T14:33:35Z","rating":1,"title":"Depression"}},{"id":"6172474424","type":"user-reviews","attributes":{"isEdited":false,"userName":"cheerleader6625","review":"It’s slow, it sends me needless text notifications all the time, and it also belongs to the campaign for the USA’s biggest pedoph- sorry, I mean president. Don’t download this app for news on Donald Trump, instead don’t vote for the racist, xenophobic sexual predator that is sadly the incumbent of office, who has also killed hundreds of thousands of people due to his horrible response to the coronavirus. Get him out of office and get this app off of the App Store.","date":"2020-07-08T14:29:06Z","rating":1,"title":"Terrible app"}},{"id":"6172402067","type":"user-reviews","attributes":{"isEdited":false,"userName":"fatets ()5:","review":"This person thinks he can make a good app when you can’t even do anything good for our country also I’m here from TikTok because some guy told me to leave one star review so his apple be taken off so it doesn’t be in TickTock so here I am also I hate Donald Trump with a passion I will be deleting the app right after I do this for you thank you for your time go die in a hole Donald Trump","date":"2020-07-08T14:09:30Z","rating":1,"title":"Trump is a horrible person deserves to die"}},{"id":"6172346343","type":"user-reviews","attributes":{"isEdited":false,"userName":"jen_mom278","review":"I got this app because I love our president however when I would open this app my phone would immediately shut down. When I would turn my phone back on it my entire screen would just be a picture of Donald trump naked. My 3 year old was on my phone when this once happened now I have to explain why she saw our naked president. Lord help you people. Don’t download this app","date":"2020-07-08T13:54:33Z","rating":1,"title":"Terrible"}},{"id":"6172337585","type":"user-reviews","attributes":{"isEdited":false,"userName":"Jbenson97","review":"Would not recommend this app to a 87 year old Conservative or my 2 month old son who just started opening his eyes fully. This app is terrible was trying to at least give some support but I can’t this app is full of unnecessary ads and I think somethings wrong it’s so glitchy made my head hurt almost had a heart attack! Never again the Cheeto won’t get no more of my support Shame on you!","date":"2020-07-08T13:52:08Z","rating":1,"title":"Blahhh!!!"}},{"id":"6172333641","type":"user-reviews","attributes":{"isEdited":false,"userName":"i like cookies and juice","review":"I could barely be on this app for more than a minute before it completely shuts down. It’s so glitchy that my phone has been extremely slow since downloading it. Not to mention I think it gave my phone a virus!!! I would not recommend this app to anyone even because of all the issue and the vibe it give off is just terrible. In conclusion DONT DOWNLOAD THIS APP!!!","date":"2020-07-08T13:51:02Z","rating":1,"title":"Doesn’t even work"}}]}