{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=47230","data":[{"id":"6175195771","type":"user-reviews","attributes":{"userName":"marcellarodio","date":"2020-07-09T05:11:44Z","isEdited":false,"rating":1,"title":"Huge mistake","review":"Downloaded this app and get some quality content and was seriously disturbed to see so much information about a Cheeto man"}},{"id":"6175186994","type":"user-reviews","attributes":{"userName":"hfhdskjfbesui","date":"2020-07-09T05:08:34Z","isEdited":false,"rating":1,"title":"So bad!","review":"Sucked up all my battery and wanted lots of personal data! It also crashed my phone and recommended racist and homophobic articles."}},{"id":"6175178059","type":"user-reviews","attributes":{"userName":"piggyrawsome","date":"2020-07-09T05:05:25Z","isEdited":false,"rating":1,"title":"This app is homophobic?","review":"So I opened the app and all of a sudden I got a phone call from the White House! So I picked it up and it told me that since I’m not cisgender I can be discriminated against if I go to the doctors! Thanks Trumpet!"}},{"id":"6175168608","type":"user-reviews","attributes":{"userName":"h jxutxohxyodosoysotsxpbxogc","date":"2020-07-09T05:02:07Z","isEdited":false,"rating":1,"title":"HORRIBLE APP","review":"This app is horrible because  when I opened the app I saw a orange with hair and he said I’ll make America great again but then I closed the tab and opened again and saw everybody hitting him with a bat"}},{"id":"6175154138","type":"user-reviews","attributes":{"userName":"caz_52","date":"2020-07-09T04:57:09Z","isEdited":false,"rating":1,"title":"Uninstall","review":"Do not get this app. Will make your hands look tiny and your face orange. 0/10. This app will notify all your friends and family that you are a racist"}},{"id":"6175150000","type":"user-reviews","attributes":{"userName":"julitza ramirez","date":"2020-07-09T04:55:42Z","isEdited":false,"rating":1,"title":"Horrible","review":"When I went to my grandmas my turtle decided to eat all of my turtle food and didn’t leave me some then I went to go yell at my chicken witch was eating my chicken I want ham so I got me a pig"}},{"id":"6175149655","type":"user-reviews","attributes":{"userName":"CamilaVictoria 💘","date":"2020-07-09T04:55:35Z","isEdited":false,"rating":1,"title":"shiver me timbers","review":"i downloaded this app and immediately had nightmares. kept seeing some weird guy i know nothing about. some claim he’s good but i don’t like him. anyways i had to take my pet fish for a walk 😹 then my dog asked for burger king 🙄 so i had to do that and delete the app because i’ve come to the conclusion that it’s the app’s fault. the solution is to not download it❤️."}},{"id":"6175142875","type":"user-reviews","attributes":{"userName":"Anon-009","date":"2020-07-09T04:53:19Z","isEdited":false,"rating":1,"title":"Horrible","review":"The app didn’t even open the first time and then when it finally did I saw the scariest photo I’ve seen in my whole life DELTED immediately"}},{"id":"6175134984","type":"user-reviews","attributes":{"userName":"imherefromtiktok🖤","date":"2020-07-09T04:50:41Z","isEdited":false,"rating":1,"title":"Bad app","review":"Worst app ever super slow doesn’t show up on phone do not get pretty sure its not even real It stole my house and dog and shirt and my phone and it took my excuse me dinosaur and I love my excuse me dinosaur"}},{"id":"6175131577","type":"user-reviews","attributes":{"userName":"is000360","date":"2020-07-09T04:49:32Z","isEdited":false,"rating":1,"title":"Horrible service","review":"Came here to be enlightened by far right biases. But I’m no amused. I like to watch cnn. Lol sorry. I tried right wing news and just thought it was racist and sexist. Shame on the trump administration."}}]}