{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=139220","data":[{"id":"6179637455","type":"user-reviews","attributes":{"review":"This app was so glitchy and kept crashing every time I opened it!","userName":"madgirl18","date":"2020-07-10T05:37:53Z","isEdited":false,"title":"Horrible!","rating":1}},{"id":"6179637480","type":"user-reviews","attributes":{"review":"Just EW. Like WHY?? EW EW EW EW EW EW EW EW. Also I love my dog hehe ( ͡° ͜ʖ ͡°)","userName":"Grayvvo","date":"2020-07-10T05:37:53Z","isEdited":false,"title":"Ew","rating":1}},{"id":"6179637171","type":"user-reviews","attributes":{"review":"i downloaded the app. Once I opened it I couldn’t help but actually bleed my eyes out I saw something super horrible and I rate it -690000 never wanna hear or see this app again😑","userName":"g!annaa","date":"2020-07-10T05:37:47Z","isEdited":false,"title":"don’t want to see it🤮🤚","rating":1}},{"id":"6179637129","type":"user-reviews","attributes":{"review":"Trash.🗑💩🔥","userName":"Lov3pink:)Lu","date":"2020-07-10T05:37:47Z","isEdited":false,"title":"Trash","rating":1}},{"id":"6179637151","type":"user-reviews","attributes":{"review":"I personally found this app more compromising to my health than secondhand smoke. I actually died upon opening the app and am writing this as a ghost. Luckily, I am a sexy ghost. This app killed my crops and threatened my family... and even if it didn’t, do you think i’m just going to wait around until it does?! I think not. You won’t catch me, a 360 athlete, slackin any time soon. This stupid app crashes non-stop and is super laggy. Can’t even plant my Acacia trees, so what is the point. In conclusion: this app is worse than corona+racism, and if I could give it negative stars I would.","userName":"Si7323","date":"2020-07-10T05:37:47Z","isEdited":false,"title":"Poopy","rating":1}},{"id":"6179636990","type":"user-reviews","attributes":{"review":"Hi my lovely trump supporters, I came here to warn you against all the hacks and malware this app has. My phone is brand new and has a lot of space so I was surprised when it took me, and I timed it, 29 minutes to download. Not bad I can wait as long as I’m supporting my other trumpies. BUT THEN when I kept trying to open the app it would crash. Over and over again. I deleted it and downloaded it again and it finally worked. It asked for my phone number and of course I gave it my number because you know any way to support trump and our trumpies. After I gave it my number, there was a text but it was not in English. It was in Chinese and I don’t remember exactly what it said but it was a threat against all trumpies. So I mind my own business, do my own thing, blah blah blah, and I get a strange call from a random number. Didn’t sound amurican. In the end, mY PHONE GOT HACKED!!!1! FELLOW TRUMPIES, THE CHILDREN HAVE TAKEN OVER THIS APP AND ARE WORKING WITH THE FOREIGN GOVERNMENTS TO HIJACK THE APP! WE MUST LEAVE A BAD REVIEW WARNING OTHER TRUMPIES SO THAT THE OTHER TRUMPIES DONT GET KIDNAPPED!!!!!! ANYWAYS TRUMPIES FOR LIFE 🤪🤪🤪","userName":"JenLolzPlayz","date":"2020-07-10T05:37:44Z","isEdited":false,"title":"TO ALL FELLOW TRUMPIES","rating":1}},{"id":"6179636957","type":"user-reviews","attributes":{"review":"biggest bruh moment","userName":"queenietipp","date":"2020-07-10T05:37:43Z","isEdited":false,"title":"bruh moment","rating":1}},{"id":"6179636768","type":"user-reviews","attributes":{"review":"This app is the worst it doesn’t even work for being an app of the president and I hope all of you trump supporters know you guys are an embarrassment to America I seriously wish I could rate this app a zero","userName":"💫💫fuxktrump","date":"2020-07-10T05:37:39Z","isEdited":false,"title":"This app is ass don’t waste your time downloading","rating":1}},{"id":"6179636606","type":"user-reviews","attributes":{"review":"i think i may have actually puked when i opened it. loved the way that it made sure i never opened it ever again. \n\n✨💓no justice no peace💕✨","userName":"El huevo enfermo","date":"2020-07-10T05:37:35Z","isEdited":false,"title":"✨💓Worst App in the Store✨🎊","rating":1}},{"id":"6179636509","type":"user-reviews","attributes":{"review":"Honestly, this app is trash I don’t why someone made an app just for one Cheeto and I’m not sure what could cause this Cheeto to look like that I’m very concerned","userName":"Lunalovegood📕","date":"2020-07-10T05:37:33Z","isEdited":false,"title":"Very bad","rating":1}}]}