{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24930","data":[{"id":"6177378125","type":"user-reviews","attributes":{"isEdited":false,"review":"This app was really bad and my phone kept on crashing and I have an I phone 11 which it doesn’t really crash so I think apple should just take the app down because there are many more proud apple users who used it and disapproved of it Thank you","rating":1,"title":"Just a bad app","date":"2020-07-09T16:31:01Z","userName":"hdmskdnfndnsn"}},{"id":"6177374950","type":"user-reviews","attributes":{"isEdited":false,"review":"Before President Trump came along i didn’t give importance to politics because i thought all politicians are corrupt etc. but i came to realize that if i don’t become politically active and motivated... the racist vermin of the Earth have a higher chance at becoming president. Anyone voting Trump 2020 on this app get your facts straight. smh","rating":1,"title":"Trump 2020 for worst","date":"2020-07-09T16:30:02Z","userName":"stephcurry123"}},{"id":"6177355643","type":"user-reviews","attributes":{"isEdited":false,"review":"This app made my phone slow down a lot and whenever I go in the app it freezes and I know it’s the app because I just got this phone so please fix that I can barely tap my phone now and sometimes when I go on the app it closes on its own.","rating":1,"title":"Slow","date":"2020-07-09T16:24:23Z","userName":"njhfbjjj"}},{"id":"6177343852","type":"user-reviews","attributes":{"isEdited":false,"review":"so i read somewhere that if you download this app, harry styles will knock at your door and marry you. i thought i would try to give donald trump the benefit of the doubt. 5 minutes after i opened the app, i heard knocking at my front door and IT WAS DONALD TRUMP! As I recall, he asked “you lost baby gorl?” absolutely DISGUSTING. i was catfished!! DONT USE THIS TRASH APP, ITS A SCAM!!!","rating":1,"title":"screw trump and his trumplings","date":"2020-07-09T16:21:02Z","userName":"yesenia29142"}},{"id":"6177298633","type":"user-reviews","attributes":{"isEdited":false,"review":"Downloaded the app to see all the hype from our presidents administration. From a marketing standpoint I was very disappointed in the layout and functionality of the app. It’s really sad that his design team didn’t come together to make a better app. Very sad","rating":1,"title":"Kind of disappointed","date":"2020-07-09T16:08:24Z","userName":"sarah bbrown"}},{"id":"6177297213","type":"user-reviews","attributes":{"isEdited":false,"review":"This is the worst app I’ve ever downloaded. It continuously glitched and bugged out, I was just trying to keep up with all the politics but was not able to through this app. If trump is going to have an app he should probably have one that actually works. Ridiculous.","rating":1,"title":"This app is a joke.","date":"2020-07-09T16:07:59Z","userName":"anonymous____________________"}},{"id":"6177279181","type":"user-reviews","attributes":{"isEdited":false,"review":"I went on this app and found a TROOMPA LOOMPA ON THE FRONT PAGE!! I haven’t seen one of those since Charlie and the chocolate factory came out. Maybe this one escaped and changed his identity by getting a Cheeto dust spray tan. And when I went on, all I heard was this hissing sound... I wonder what that could be. Regardless I almost pooped my pants in fear of the Cheeto dust tanned Troompa Loompa snake boi!! Goodbye!","rating":1,"title":"I AM SCARED OF THE TROOMPA LOOMPA","date":"2020-07-09T16:02:50Z","userName":"fearthetroompaloompa"}},{"id":"6177265803","type":"user-reviews","attributes":{"isEdited":false,"review":"This app is the worst thing we’ve seen in United States History. It’s gross, homophobic, racist, a sex predator, and a pedo. we can’t allow our app store to be amount such a monster. we will do what’s best for the community. we will do what’s best for the people. please remove this app. i am extremely offended.","rating":1,"title":"The worst app we’ve ever seen","date":"2020-07-09T15:58:57Z","userName":"Chavez4323"}},{"id":"6177265472","type":"user-reviews","attributes":{"isEdited":false,"review":"This app is absolutely inappropriate, and racist. I passed out just from downloading the app, this app is no normal app! I believe that’s this app should be taken down immediately!!! It’s also one of the glitchiest apps ever, ever since I opened the app my phone has contracted 290 viruses and it doesn’t let me delete the app!!!!","rating":1,"title":"REMOVE THIS APP","date":"2020-07-09T15:58:51Z","userName":"bobysahet"}},{"id":"6177237561","type":"user-reviews","attributes":{"isEdited":false,"review":"Every time that i tried to sign up for an event it would crash my phone. i'd have to restart my phone if i'd even want to THINK about using it. 😡 If the president really wants support for his campaign the least he could do is make it user friendly 🙄","rating":1,"title":"worst built app ever","date":"2020-07-09T15:50:41Z","userName":"HunterTow"}}]}