{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26540","data":[{"id":"6174118980","type":"user-reviews","attributes":{"review":"Trump is a racist, homophobic, and a rapist! I can’t believe I used to support him and I am DISGUSTED with the behavior he has shown. I pray to God that he isn’t our next president for the sake of America! BLACK LIVES MATTER the fact that Trump is putting that up for debate is DISGUSTING! He has been trying to take away LGBTQ+ peoples rights, THEY ARE HUMAN!!! THEY DESERVE HUMAN RIGHTS!!! this is a horrible app that supports a horrible human.","title":"racist","rating":1,"date":"2020-07-08T23:32:19Z","userName":"acabBLMacab","isEdited":false}},{"id":"6174116984","type":"user-reviews","attributes":{"review":"This app is the worst app ever. It has so much false information and should not exist. This app is not providing anything good. This app should not be available in the App Store. Also the person who  is providing this app to all does not deserve the money, credit, or right to have an app like this.","title":"Trump app","rating":1,"date":"2020-07-08T23:31:33Z","userName":"JJ12:","isEdited":false}},{"id":"6174106840","type":"user-reviews","attributes":{"review":"Snapchat know what do you want. To see this crusty musty Orange man he is a disgrace to this world he makes me 🤮 he is a piece of 💩and he should not have been born and it makes me even more mad the he is getting rid of TikTok like what this is the only thing keeping me alive during quarantine","title":"This should be taken off","rating":1,"date":"2020-07-08T23:27:59Z","userName":"lizzyandbunny","isEdited":false}},{"id":"6174099696","type":"user-reviews","attributes":{"review":"I am apart of Gen Z and I would like to say that this app is horrible and attempted brainwash me and my family and does not support my beliefs and is against BLM and I would not recommend this to anyone. And when I opened it I was terrified because I seen an Orange Cheeto that was performing human acts and then my father walked in and it scared him too.","title":"Horrible","rating":1,"date":"2020-07-08T23:25:19Z","userName":"Gen Z 2030","isEdited":false}},{"id":"6174097612","type":"user-reviews","attributes":{"review":"this app is terrible for the human eye when you open the app you are greeted with a monstrosity of human being. the app itself is totally unwanted and absolutely unnecessary to america’s so called president. when i downloaded the app my phone immediately started glitching because of its toxicity of patriotism. i advise everyone to quickly uninstall the app before you phone blows up in your face and for those who support mr. cheeto... honey🥺🥺🥺 rethink your life because i know you’re not okay and it’s okay to not to be okay.","title":"dump trump 123 a smiley with a ;)","rating":1,"date":"2020-07-08T23:24:32Z","userName":"shirvail","isEdited":false}},{"id":"6174083709","type":"user-reviews","attributes":{"review":"I originally downloaded the app thinking I would be able to find where the next Trump rally would be located. Instead when the app finished loading a frightening monster appeared on the screen! I got so scared I had to take my inhaler afterwards! Do not download.","title":"TERRIBLE!! wish i could give it ZERO STARS","rating":1,"date":"2020-07-08T23:19:23Z","userName":"Carter101303101","isEdited":false}},{"id":"6174081035","type":"user-reviews","attributes":{"review":"Not only did this app send a plague to curse my town, it also INSULTED MY DOG. It told my dog that he is not a good boy and that he doesn’t deserve treats. AND the app wrecked my home and murdered my parents. Yeah, now I’m an orphan. As if this isn’t bad ENOUGH, when I tried to delete the app it showed me pictures of a NAKED moldy orange who was convinced he could run a country.","title":"dIsGuStInG","rating":1,"date":"2020-07-08T23:18:42Z","userName":"fucktrumpblm","isEdited":false}},{"id":"6174073504","type":"user-reviews","attributes":{"review":"i cant believe what i saw. this app is making a complete mockery out of our country. they disrespected the holy great cheeto man and my elephant stuffed animal began to levitate as the app gave me a THREAT through my notifications. they said: if you do not send out $100 we will take your pets and your family. I HATE THIS. NEVER DOWNLOAD. IT WILL MESS WITH YOU.","title":"absolutely tragic.","rating":1,"date":"2020-07-08T23:15:50Z","userName":"hsjdhwkfbw","isEdited":false}},{"id":"6174068804","type":"user-reviews","attributes":{"review":"first off, when i opened this app it asked me if i wanted to be the next one that bunker baby put his hands on and it would not let me bypass this step until i said yes. it also said that there is absolutely no reason that this app should even exists and they my PHONE EXPLODED. THIS APP MAKES YOUR PHONE EXPLODE. DO NOT GET.","title":"worst app ever🥳","rating":1,"date":"2020-07-08T23:14:00Z","userName":"mamas2224","isEdited":false}},{"id":"6174046704","type":"user-reviews","attributes":{"review":"i was so excited to find out that the cheeto man had an app!! but when he was reported dead, i saw no memorials for him, nothing to remember him by. i’m so upset and angry that the app and no other RESOURCEFUL and ACCURATE source of news isn’t documenting his passing. would give 0 stars!!","title":"horrible app!! they didn’t memorialize his death","rating":1,"date":"2020-07-08T23:05:48Z","userName":"The pic monkey","isEdited":false}}]}