{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=86300","data":[{"id":"6175962315","type":"user-reviews","attributes":{"title":"HORRIBLE DO NOT GET THIS APP","date":"2020-07-09T09:50:02Z","isEdited":false,"rating":1,"review":"When I downloaded this app it automatically gave my phone TONS of viruses 😤😤❌DONT DOWNLOAD IT","userName":"harry bahlsaq"}},{"id":"6175936656","type":"user-reviews","attributes":{"title":"feral degrading app.","date":"2020-07-09T09:41:42Z","isEdited":false,"rating":1,"review":"⚠️trigger warning⚠️\nI think POTUS doesn’t look too happy. In order to be happy, stream Be Happy by Dixie🧚✨\n🧚‍♀️ 💫 ᏰᏂᏬᏋᎩᏋᏕ 🦐 🍊 \nOnce upon a time there was a lovely princess. But she had an enchantment upon her of a fearful sort, which could only be broken by Love's first kiss. She was locked away in a castle guarded by a terrible fire breathing dragon. Many brave knights had attempted to free her from this dreadful prison, but none prevailed. She waited in the dragon's keep in the highest room of the tallest tower for her true love and true love's first kiss. Like that's ever going to happen. What a loony. Shrek Beware Stay out I think he's in here. All right. Lets get it! Hold on. Do you know what that thing can do to you? Yeah. He'll groan into your bones for his brains. Well actually that would be a giant. Now Ogres, huh, they are much worse. They'll make a soup from your freshly peeled skin. They'll chew your livers, squeeze the jelly from your eyes. Actually, it's quite good on toast. Back, back beast, back! I warned you! Right. This is the part, where you run away. Yeah! And stay out. Wanted. Fairytale creatures. Right, this one is full. Take it away. Give me that. Your fine days are over. -25 pieces of silver for the witch. Next. -Come on. Sit down there! And be quiet! This cage is so small. You wouldn't turn me in. I'll never be stubborn again. I can change. Please, give me another chance. Oh, shut up! Next. What do we got? This little wooden puppet. I'm not a puppet, I'm a real boy. Five shillings for the possessed toy. Take it away. No! Please, don't let them do it! Next. What do you got? Well, I've got a talking donkey! Right. Well that's good for ten schillings, if you can prove it. Oh, go ahead fella. Well? He's just a li..., just a little nervous. He's really quite a chatterbox. You boneheaded donkey! That's it. I have heard enough. Guards! No, no, he talks, he does! I can talk. I love to talk. I've talked to... Get her out of my sight! -No, no, I swear! Hey, I can fly. -He can fly! -He can fly! He can talk! -That's right, fool! Now I'm a flying, talking donkey! You might have seen house fly, maybe even a superfly. But I bet you ain't never seen a donkey fly! Seize him! Get him! This way! Hurry! You there. Ogre. -I. By the order of lord Farquaad. I am authorized to place you both under arrest. And transport you to designated resettlement facility. Oh really? You and what army? Can I say something to you? Listen, you were really, really something, back there. Incredible. Are you talking to... ...me? Yes, I was talking to you. Can I just tell you that you were really great back there with those guards. They thought that was all over there. And then you showed up and BAM. There was tripping on over themselves like babes in the woods. That really made me feel good to see that. Oh, that's great. Really. Man, it's good to be free. Now, why don't you go celebrate your freedom with your own friends? But I... I don't have any friends. And I'm not going out there by myself. Hey wait a minute. I have a great idea... I'll stick with you. You and me in green fighting machine. Together we'll scare the spin if anybody crosses us. Oh, a, that was really scary. Maybe you don't mine me saying. If that don't work, your breath will certainly do the job done, 'cause... you definitively need some tic-tac or something, 'cause your breath stinks! Man you've ??? my note! Just like the time... ...and then I ate some rotten berries. Man I had some strong gases leaking out of my but that day. Why are you following me? I'll tell you why. 'Cause I'm all alone, there is no one here, beside me. My problems have all gone. There's no one to derive me. But you got to have free ... -Stop singing! Well, it's no wonder, you don't have any friends. Wow! Only a true friend would be that truly honest. Listen! Little donkey. Take a look at me! What am I? A... ...really tall? No! I'm an Ogre. You know, grab your torch and pitchforks. Doesn't that bother you? Nope. Really? -Really really. Oh? Man, I like you. What's your name? A..., Shrek. Shrek?! But do you know, what I like about you, Shrek? You've got that kind of: \"I don't care what nobody thinks of me\" thing. I like that, I respect that, Shrek. You're all right. Uh, look at that. Who would wanna live in a place like that? That would be my home. Oh, it is lovely. Just beautiful. You know you're quite a decorator. It's amazing what you did with such a modest budget. I like that boulder. That is a nice boulder. I guess, you don't entertain much, do you?  I like my privacy. You know I do to. That's another thing, we have in common. Like I hate it when you got somebody in your face. You try to give them a hint and they won't leave. And then there's that big occurred silence, you know? Can I stay with you? -What? Can I stay with you, please. Of course! -Really? No. -Please! I don't want to go back there. You don't how is like to be concerned like a freak. Well..., maybe you do. But that's why we have to stick together! You got to let me stay! Please! Please! OK, OK. -But one night only. -Huh, thank you! A, what are you do... No! This is going to be fun. We can stay up late, swap the manly stories. And in the morning... I'm making waffles. Where do I sleep? Outside! Oh, a, I guess that's cool. You know, I don't know you and you don't know me... ... so I guess, outside is best for me. Here I go. Good night. I do like that half door. I'm a donkey all alone outside. Sit by myself outside, I guess. I'm all alone, there's no one here beside me. -I thought, I told you to stay outside.","userName":"guac.pit"}},{"id":"6175923526","type":"user-reviews","attributes":{"title":"😒","date":"2020-07-09T09:37:19Z","isEdited":false,"rating":1,"review":"I have nothing to say","userName":"gxi b zfj C d"}},{"id":"6175908899","type":"user-reviews","attributes":{"title":"eww","date":"2020-07-09T09:32:23Z","isEdited":false,"rating":1,"review":"OMG SOOOOO DISGUSTING I HAAAATE IT , gave me ptsd , depression, back pain , schizophrenia , anxiety , stomach issues, heart issues , coronavirus , ebola , the flu , a COLD , neck pain , just everything 😔","userName":"kh kgcigcg g bjg ifxxi"}},{"id":"6175906209","type":"user-reviews","attributes":{"title":"ITS HORRIBLE","date":"2020-07-09T09:31:28Z","isEdited":false,"rating":1,"review":"this is the most horrible app i’ve ever seen in my life","userName":"Pizzalife123456"}},{"id":"6175897432","type":"user-reviews","attributes":{"title":"disappointed","date":"2020-07-09T09:28:30Z","isEdited":false,"rating":1,"review":"i downloaded this app just for it to send all of my information to the chinese government 🤦‍♀️🤦‍♀️","userName":"Yaaaaaaaaaaaa15"}},{"id":"6175883710","type":"user-reviews","attributes":{"title":"scam","date":"2020-07-09T09:23:52Z","isEdited":false,"rating":1,"review":"totally a scam. their stealing my information while demanding access to motion and fitness, location services, microphone, and camera!! needs to be heard!!!","userName":"Reviewer mam"}},{"id":"6175849483","type":"user-reviews","attributes":{"title":"Terrible 😡😡","date":"2020-07-09T09:12:32Z","isEdited":false,"rating":1,"review":"I wish I could rate 0 stars 😘","userName":"bxby.alyssa13"}},{"id":"6175822767","type":"user-reviews","attributes":{"title":"done","date":"2020-07-09T09:03:42Z","isEdited":false,"rating":1,"review":"took way too long to download. app is way to hard to manage and find what i’m looking for. i hate this app.","userName":"okayyyyyyok69"}},{"id":"6175798137","type":"user-reviews","attributes":{"title":"Uh oh","date":"2020-07-09T08:55:27Z","isEdited":false,"rating":1,"review":"It’s waaaaay to dull, and it hacked my phone, but that’s not important. It’s just not THERE, you know?","userName":"justin52691"}}]}