{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23200","data":[{"id":"6176112850","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Disgusting","review":"This is genuinely the worst functioning app I’ve EVER used!!!! THIS IS AN ABOMINATION!!!! How can you be a billion year but get your app is TRASH!!!!! I am no longer supporting this administration due to their problematic and dysfunctional apps. I couldn’t believe that the app REQUIRED you to pay after using it for 2 days. I am on unemployment right now. I do NOT HAVE THE $1.99 PLUS tax !!!!!","userName":"shakira depina","date":"2020-07-09T10:38:31Z"}},{"id":"6176030139","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Garbage App","review":"Absolute garbage would give it less than one star if I could. This app is the worst DO NOT DOWNLOAD IT. I had my credit card information stolen by this app then I got a virus. When I reached out to them about it the claimed ignorance but we all know that’s fake news. Save yourself the hassle and do not download this app.","userName":"MacCat20","date":"2020-07-09T10:12:02Z"}},{"id":"6176003503","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"It hacked my entire phone!!!","review":"This app is terrible it took 4 while months to download and I had very high expectations on this app but once it downloaded the app jacked everything In my phone my passwords and all my information it also called me terrible names and sent someone to my house STAY AWAY FROM THIS APP!!","userName":"😚⚰️💛😐⚰️","date":"2020-07-09T10:03:28Z"}},{"id":"6175996062","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"HORRIBLE DO NOT DOWNLOAD‼️‼️","review":"This app is a republicans worst nightmare. First off, the application took 3 days to download, draining my battery. Once it finally installed, I open it to find a pop up screen encouraging me to wear a face mask. I just deleted the app then and there because i’m obviously not going to put up with that. What a disappointment.","userName":"Pool5567","date":"2020-07-09T10:01:04Z"}},{"id":"6175927095","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Donald is disgusting","review":"The app took two hours to download and then when I signed in they called me saying that I should be why in that racism is a good thing and when you sign in it asks you if you're white or black and if you're black you get a call saying you should be why Trump needs to be in prison","userName":"renandden","date":"2020-07-09T09:38:33Z"}},{"id":"6175913705","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"IF I COULD GIVE 0 STARS I WOULD","review":"Terrible app. I had to wait 3 days for it to download. Once it finally downloaded to my phone it immediately asked for my social security number and asked what my deepest fear is and now the lights in my house all shut down and now there’s people banging at my door telling me to vote trump or perish. Please HelPjnajsib.&9’kso.","userName":"Heiroglyphic Master","date":"2020-07-09T09:34:01Z"}},{"id":"6175906583","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"horrible!👁👄👁","review":"It took a WHOLE week to download it stole all my data/pictures and all important information, I DO NOT recommend this app AT ALL please DO NOT download it ! you will regret it 0/10 for sure ! everyone else should give this app a 0/10 rating for the horrible quality! thank you . ✨🌚🧚‍♀️","userName":"no one 😘😍✨","date":"2020-07-09T09:31:37Z"}},{"id":"6175890038","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"MEGA SMALL PEEN","review":"The app took 4 days to load!!! When I finally opened it, the entire screen went orange. After the orange faded, all that was left was a picture of nude trump with an underage girl. I’m sorry but that thing was microscopic. Like his peen was like smaller than a shrimp. Also, now I keep getting ads on my phone about how to bleach my face orange!!!!","userName":"asdfghskbfjd","date":"2020-07-09T09:26:01Z"}},{"id":"6175879849","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"NOOOOOOOO","review":"Let me tell you, when I downloaded the app (which took literal hours) it automatically opened up to a horrific sight. I was taken to a page where there was bullying, language and is clearly meant to support racists/homophobics. It was all just so horrible I decided to....pass away once seeing this catastrophic app.","userName":"bobthebuilderhecanbuildit","date":"2020-07-09T09:22:32Z"}},{"id":"6175805799","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Absolutely horrible.","review":"Well to start us off, the app took 4 hours to download. And it took up 30 gigabytes on my phone. Not only that but it hacked my phone and I lost all of my data. My photos, my contacts, my messages are all gone because of this app. 100% do NOT recommend.","userName":"yeah its me! i asked!","date":"2020-07-09T08:58:04Z"}}]}