{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36350","data":[{"id":"6177194298","type":"user-reviews","attributes":{"rating":1,"title":"did not work well :/","userName":"ic4m3fr0mt1kt0k","review":"the app is constantly crashing and kicking me off ! i saw a similar mention in another review but this app does not work, i could not be on it for more than five minutes without it crashing. sadly i will not be able to use this app anymore due to the fact that it does not run well or consistently. do not download this app ! you will be sorely disappointed :(","date":"2020-07-09T15:38:16Z","isEdited":false}},{"id":"6177191516","type":"user-reviews","attributes":{"rating":1,"title":"Bug filled.... terrible app","userName":"Ctlnalicia","review":"I opened this app for the first time and as soon as I did, my phone caught a virus. Extremely terrible campaigning app for someone who plans to run the United States for another four years. Terrible app!","date":"2020-07-09T15:37:28Z","isEdited":false}},{"id":"6177179457","type":"user-reviews","attributes":{"rating":1,"title":"RESULTED IN NIGHT TERRORS!!","userName":"A.Ham☝️","review":"This app is the worst app I’ve ever downloaded. The first thing I saw when I opened the app was annoying orange and I was traumatized, I had sleep paralysis and night terrors for a week after using this app😡 if I could give this app 0 stars I would.","date":"2020-07-09T15:34:05Z","isEdited":false}},{"id":"6177177706","type":"user-reviews","attributes":{"rating":1,"title":"This app belongs in prison for a very long time","userName":"Laurabarns777","review":"I downloaded this app and it immediately wiped all of the data from my phone and began to scream offensive slurs at me through my phone. this app as well as the trump administration as a whole is a blatant hate crime.","date":"2020-07-09T15:33:35Z","isEdited":false}},{"id":"6177169699","type":"user-reviews","attributes":{"rating":1,"title":"Man let me start","userName":"GoldenReaper207","review":"Trump more like dump you show no reason why you should be elected all you do is put commercials that all you do is make joe Biden look bad he says why he is good you don’t I rather have snoop dog as a president then you","date":"2020-07-09T15:31:18Z","isEdited":false}},{"id":"6177163809","type":"user-reviews","attributes":{"rating":1,"title":"App not working - not up to date with events","userName":"FaithGG","review":"I got the app because I thought it would be up to date with events and it is not. Horrible app. The most terrible. Yuge problems on it.","date":"2020-07-09T15:29:37Z","isEdited":false}},{"id":"6177153585","type":"user-reviews","attributes":{"rating":1,"title":"Such a disappointment","userName":"TnT_0222","review":"This app is so poorly designed. It is slow, glitchy, and downright garbáge. I don’t think it should even be on the App Store given how many people have experienced these issues.","date":"2020-07-09T15:26:46Z","isEdited":false}},{"id":"6177151803","type":"user-reviews","attributes":{"rating":1,"title":"Freezes","userName":"joe41503","review":"My phone glitches and starts to freeze every time I open the app I don’t have any other problems with my phone until I open this app","date":"2020-07-09T15:26:17Z","isEdited":false}},{"id":"6177140711","type":"user-reviews","attributes":{"rating":1,"title":"TikTok in America has to stay in America!!! 👁👄👁","userName":"kawwi cuteness","review":"I’m not apart of this “ Gen z z Gen or whatever but, I do know that I still wanna watch TikTok! So I’m giving this a one star review and I’ve been seeing some bad reviews about this about it hacking their data???! So 1 star rating.","date":"2020-07-09T15:23:13Z","isEdited":false}},{"id":"6177139311","type":"user-reviews","attributes":{"rating":1,"title":"awful","userName":"Kikikikikikijuikijgghhfdzzcht","review":"This app constantly uses my location which 1. drains my battery and 2. is so terrifying. What is the reason for this? Also very bad setup for the app. It steals your information, don’t download.","date":"2020-07-09T15:22:49Z","isEdited":false}}]}