{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=4160","data":[{"id":"6174605782","type":"user-reviews","attributes":{"date":"2020-07-09T02:09:48Z","rating":1,"title":"SUCH A BAD APP!","userName":"sydthesciencekid3000","review":"THIS APP STEALS UR ROBLOX ADOPT ME PETS i worked so hard for so long to get the pets i had and then i go look one day AND THERE ALL GONE and my house was gone and everything! and this app also stole my vacuum cleaner so i couldn’t vacuum up my new puppies doo doo! so i picked up the doo doo and chucked it at my neighbors dog and then their dog jumped in the pool and now their having to replace their whole pool! and they also stole my top floor to my house so all my room and everything is gone! and that means my laundry room is gone too! so i can’t take showers in the washer anymore! so i’ve been stinky for the past week or 2! AND THE WORST PART IS THEY STOLE MY FAVORITE TOILET SO NOW IM FORCED TO GO DOO DOO IM MY NEIGHBORS POOL IN SECRET! well that’s it DONT TRUST THIS APP ITLL TAKE ALL OF THE ABOVE FROM U!","isEdited":false}},{"id":"6174567131","type":"user-reviews","attributes":{"date":"2020-07-09T01:58:52Z","rating":1,"title":"No❤️","userName":"yeety yeet yeet skeet yeet 🗿","review":"I've been hiding for so long\nThese feelings, they're not gone\nCould I tell anyone?\nAfraid of what they'll say\nSo I push them away\nI'm acting so strange\nThey're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty with their button-up shirts\nI shouldn't be feeling this\nBut it's too hard to resist\nSoft skin and soft lips\nI should be into this guy\nBut it's just a waste of time\nHe's really not my type\nI know what I like\nNo, this is not a phase\nOr a coming of age\nThis will never change\nThey're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty with their button-up shirts\nThey're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty with their button-up shirts\n'Cause I don't know what to do\nIt's not like I get to choose\nWho I love\nWho I love\nWho I love\nWho I love\nThey're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty with their button-up shirts\nAnd they're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty it hurts","isEdited":false}},{"id":"6174484462","type":"user-reviews","attributes":{"date":"2020-07-09T01:35:27Z","rating":1,"title":"THIS APP! stream monster seulgi&irene","userName":"Roleplayaholic","review":"🚨🚨hello developers! i’ve downloaded this app to help Support our amazing president Trump. however, As soon as i downloaded and opened the app, my husband raN upstairs, took the Kids and bolted for the door! i couldn’t even stop him due to the atrocious speed he was going at. after that, the walls of my house suddenly crumbled in unison, and a Big fat man crop dusted me? I tried to ignore this all and began to enter my phone number. with every number i entered, one of my neighbors would come up and call me a varieTy of names such as “racist” “homopHobe” “mysoginist” and more! i’m sure you’D know a bIt about these terms and just wantEd to notify you on this.","isEdited":false}},{"id":"6174478702","type":"user-reviews","attributes":{"date":"2020-07-09T01:33:51Z","rating":1,"title":"TERRIBLE app! Do not download!","userName":"elizabeth i guess","review":"Here’s a thing that happened to one of my friends. I was there. Basically, we were walking down the sidewalk, talking about something meaningless. I think it had to do with a movie. Then this bus screeches up, stops next to us, and a bunch of people with “Down with Cis” shirts climbed out and started beating him up. I was punched and kicked a bit too, but I managed to avoid brutalization by going for their faces. After figuring out what’s happening, I started attacking them back, getting them off of him. He was quite injured but I called 911 and he made a full recovery at the hospital. I was fine, with only a cut on my arm that they patched","isEdited":false}},{"id":"6174436499","type":"user-reviews","attributes":{"date":"2020-07-09T01:21:09Z","rating":1,"title":"Nope","userName":"I heart color fly!!!🙃","review":"I've been hiding for so long\nThese feelings, they're not gone\nCould I tell anyone?\nAfraid of what they'll say\nSo I push them away\nI'm acting so strange\nThey're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty with their button-up shirts\nI shouldn't be feeling this\nBut it's too hard to resist\nSoft skin and soft lips\nI should be into this guy\nBut it's just a waste of time\nHe's really not my type\nI know what I like\nNo, this is not a phase\nOr a coming of age\nThis will never change\nThey're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty with their button-up shirts\nThey're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty with their button-up shirts\n'Cause I don't know what to do\nIt's not like I get to choose\nWho I love\nWho I love\nWho I love\nWho I love\nThey're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty with their button-up shirts\nAnd they're so pretty it hurts\nI'm not talking 'bout boys\nI'm talking 'bout girls\nThey're so pretty it hurts","isEdited":false}},{"id":"6174426202","type":"user-reviews","attributes":{"date":"2020-07-09T01:18:03Z","rating":1,"title":"Worst App On The AppStore","userName":"SortaTinyTurtle","review":"When I downloaded this app, I wasn’t expecting much. The bar was almost touching the floor, in a visual perspective. However, they did it! They managed to GO BELOW THE BAR. First of all, despite the professional name, the ENTIRE APP is filled to the brim with some Cheeto-man’s baby pictures?? Most of them are him crying or yelling, usually because there is a non-white person nearby. What’s even STRANGER is that although the app makes it clear this is a MAN, all the photos are rather recent... I’m truly baffled that this is on the AppStore. The only reason you should download this app is so you can give it a 1-star review. Thanks, good day to everyone but this Cheeto-baby.","isEdited":false}},{"id":"6174413609","type":"user-reviews","attributes":{"date":"2020-07-09T01:14:14Z","rating":1,"title":"Horrible app","userName":"ainsley_48","review":"I first downloaded this app to see what was going on with my least favorite Cheeto 🦐pp president. It asked me for my location which is very invasive. The second after I accepted location tracking a dinosaur knocked on my door. It was huge and ate my entire family. It’s hands were soooo tiny. That’s when I realized it was Cheeto man. I quickly ran to get my pest repellent and sprayed that mf all over his body. He melted into the ground just like the wicked witch. Not to mention his orange spray tan stained my floors!!! And now my family is dead but I’m happy bc bunker beotch is too🥰. Anyways do not get this app unless you want someone to kill your family. And ALWAYS REMEMBER TO CARRY AROUND PESTICIDES.","isEdited":false}},{"id":"6174408405","type":"user-reviews","attributes":{"date":"2020-07-09T01:12:40Z","rating":1,"title":"WORST APP IT GAVE ME A SEIZURE","userName":"Miawesome!123","review":"do NOT download this app it caused SRVERAL viruses and I got hacked 20 times!!! I showed the app to my mom and she went into cardiac arrest. I developed a severe peanut allergy after using this app for only five minutes. Not only that, but I was cursed and now live with an eternal fear of fridges. How will I ever survive after this??? I have booked several therapy appointments to help me cope. Maybe EMDR would help with this. I also developed severe a severe phobia of oranges called Portokaliphobia. I’m 55 years old and WAS a trump supporter but after this, I’ve realized he’s brought me nothing but despair. I hope this app never curses another human again. TAKE THIS DOWN OR ELSE.... please I’m begging you. My eyes are bleeding too btw","isEdited":false}},{"id":"6174402966","type":"user-reviews","attributes":{"date":"2020-07-09T01:11:02Z","rating":1,"title":"Can I give it zero stars?","userName":"life360caneatmyass","review":"Absolutely TERRIBLE not only was it glitching every time i opened the app, but it also deleted all of my contacts, went through all of my personal info and stole my credit card info, but 5 men in cheeto man outfits burst through my door at 1am and beat up my family and stole everything in our house. I now have 2 broken eyeballs and 7 broken fingers and they popped my boobie implants so now I ain’t got big tiddies anymore. All thanks to the Official Trump 2020 app. This app is the reason why I had to set fire to my house and kill my pet goldfish because that was the price I had to pay in order to delete the app. DO NOT GET THIS APP!!!!!!!!!","isEdited":false}},{"id":"6174359424","type":"user-reviews","attributes":{"date":"2020-07-09T00:57:36Z","rating":1,"title":"IT WILL RUIN YOUR LIFE","userName":"tabbydabby","review":"So this is Molly Mole from Peppa Pig and I heard horrible things about this app and I though “It can’t be that bad.” Boy was I wrong! The moment I pressed that download button, everything went wrong. All of a sudden my shirt changed into a big, orange, “Make America Great Again” Tee. It started shifting from morning to night. The work felt so grey. I didn’t know why everyone was panicking. I didn’t know why my family was crying. I decided to delete the app but I got a Snapchat from a Cheeto in a suit with the caption “The Wall Is Coming”. I gasped, “ This can be for real!” I ran downstairs looking for some water because I was obviously delusional! But all I could find was Diet Coke.","isEdited":false}}]}