{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=13990","data":[{"id":"6179177501","type":"user-reviews","attributes":{"title":"Absolute garbage","userName":"primordialmother","rating":1,"isEdited":false,"review":"Parents beware. I downloaded this comedy app for my kids on their iPad to keep them entertained while we’re stuck at home, and the only thing that happened was an image of a spoiled annoying orange with yellow mold, dementia, and a Klan logo on his suit flashed on the screen. I am disgusted with the immaturity of this organization, and the sheer audacity to show such a disturbing image to children. I hope this app rots in digital limbo, where it belongs.","date":"2020-07-10T03:00:46Z"}},{"id":"6179148805","type":"user-reviews","attributes":{"title":"Ugh so annoying","userName":"NerdKitten234","rating":1,"isEdited":false,"review":"So first off it took 1273 days like depression already got the best of me and I’m crying in bed because of it. It took sooooooooo long to just login!! Like as an American this is no fair! It just made my depresso espresso just way more bitter. Then it just froze my iPad like WHAT? it ain’t supposed to do that hunny. This is soooooooooo annoying!!! Just make it great! It’s not even that good. It was just horrible! Would give a zero if a could. -69/10","date":"2020-07-10T02:49:57Z"}},{"id":"6179118648","type":"user-reviews","attributes":{"title":"Complaints about the Trump 2020","userName":"CakedYT","rating":1,"isEdited":false,"review":"When I got this app I was excited to get news from the presidential/government community  and I was telling everybody to get this app but when it finished downloading I was disgusted \n\nPictures of Cheeto in a suit and tie flooding my notifications and I was forced to delete this app of my phone for disruption purposes I want to throw myself out of my apartment onto the hard concrete\n\nMy family members also do not want to have this app on their phone my friends all downloaded it and they decided to delete for the same purposes. This a disgrace to your graceful quote”make America great again “I have voiced my concerns and cannot deal with it anymore. Thank you \n\n-Christian","date":"2020-07-10T02:38:48Z"}},{"id":"6179103282","type":"user-reviews","attributes":{"title":"Not user friendly","userName":"Judah1028","rating":1,"isEdited":false,"review":"Lots of content bad mouthing others esp liberals and socialist democrats. Hard to find any real content based on logic or science. Found myself stumbling all over the app looking for directions on how to drink a glass of water or walk down a ramp. Def no way to hold a Russian dictator accountable or build trust with American allies. And forget trying to find ANYTHING on how to save American lives from COVID! This app is useless!!! Don’t waste your time!","date":"2020-07-10T02:33:10Z"}},{"id":"6178994299","type":"user-reviews","attributes":{"title":"Nobody approves","userName":"sb took \"no❤️\"","rating":1,"isEdited":false,"review":"So I wanted to show some support to whoever is president cuz tbh nobody claims him and this app took 50 years to download. Literally the slowest app every AND once I put my info in trump tried to call me and asked “are you lost baby gorl” I said Nuh uh I already been found hide n seek is over dude and he continued to fart on the phone then he jumped out the phone started to lick himself like a dog and he later attacked my child and drop kicked her.😔 DONT DOWNLOAD THIS APP!!!!!!","date":"2020-07-10T01:53:14Z"}},{"id":"6178946522","type":"user-reviews","attributes":{"title":"STAY SAFE AND DELETE","userName":"Kevin Buffa","rating":1,"isEdited":false,"review":"Though I know a lot of apps take information, most take from where it’s needed. My phone kept notifying me that the Trump app was copying some of my conversations, because of this I have relapsed on anxiety and paranoia and am now back in therapy for the thought that the government is spying on me and wants to do something. For those who have the same issues please stay off this app for your own good.","date":"2020-07-10T01:35:52Z"}},{"id":"6178928827","type":"user-reviews","attributes":{"title":"Disappointed.","userName":"Amaya Sonubi","rating":1,"isEdited":false,"review":"I downloaded this app to show support for my lovely President, but this app is an absolute disgrace. It’s incredibly slow for me, and there are an extreme amount of bugs that need to be fixed immediately. Not only that, but when I opened the app for the first time, an orange bobble head popped up on my screen, instead of my one true President, Barrack Obama. it’s a shame, a true shame. Our president deserves better.","date":"2020-07-10T01:29:23Z"}},{"id":"6178867702","type":"user-reviews","attributes":{"title":"Zero stars","userName":"1476okok","rating":1,"isEdited":false,"review":"First off it took a week to download which is completely unacceptable when all I wanna do is support my loving president (can I get a yee yee🇺🇸) and secondly everything on it made no sense as if it were in a different language I think it was Russian?! Finally my camera kept turning on and I could swear I could hear trumps voice whispering take it off I am forever traumatized and will be deleting this app","date":"2020-07-10T01:06:56Z"}},{"id":"6178847958","type":"user-reviews","attributes":{"title":"PLEASE READ important info","userName":"hiitstalia","rating":1,"isEdited":false,"review":"awful app🙁  i really wanted to support my amazing president🥰 but when i downloaded the app. it took super long and crashed my phone! MY PHONE wouldn’t turn on for days. when i took it to the iphone store nothing worked. i had to buy a whole new phone because of this app. THE WORST PART IS this same thing happened to my dear friends Susan, Anne, and Jannette. this is one stars. please rate it accordingly.","date":"2020-07-10T00:59:38Z"}},{"id":"6178844849","type":"user-reviews","attributes":{"title":"🤦‍♂️","userName":"LandonMaggard","rating":5,"isEdited":false,"review":"Don’t take the low reviews seriously. It’s a dumb TikTok trend to get the app removed/ because they’re mad that the best president in a long time is going to have four more years. Keep rating high!🇺🇸🇺🇸","date":"2020-07-10T00:58:28Z"}}]}