{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=138930","data":[{"id":"6179673047","type":"user-reviews","attributes":{"review":"Wow was the only thing that came out of my mouth when I got this app. I had got it to be up to date with all the news and I couldn’t believe what the app did to my phone. When I first opened the app I was met with a black screen. A few minutes later my phone just turned off. I was shocked I tried a few more times and it did the same thing. I have been a Trump supporter since day one and was hoping this app would work.","rating":1,"userName":"Comoshashashs purple pig","title":"DO NOT GET DOES NOT WORK","date":"2020-07-10T05:50:25Z","isEdited":false}},{"id":"6179672965","type":"user-reviews","attributes":{"review":"This app took hours to download but I was ok with that for the most part but what really got me was when the app took up 90% of my storage and I had to delete almost everything on my phone. And to put the icing on the cake that app started to make my phone glitch and over heat!! It got so bad that my phone burnt my hand when I picked it up, like it was acid or something.","rating":1,"userName":"🍊's #-1 fan","title":"Don’t waist your time with this app","date":"2020-07-10T05:50:23Z","isEdited":false}},{"id":"6179672650","type":"user-reviews","attributes":{"review":"After getting this app my phone just started yelling hateful things like: “we need a total and complete shutdown of Muslims entering the United States”, “I have black guys counting my money... I hate it!”, “when Mexico sends it’s people their not sending their best... their sending people with lots of problems! Their brining drugs, crime, and rapists”, and “grab her by the pu**y”. Like it was horrible. I can’t believe my phone would just start saying stuff like this. It’s so unprofessional! Like what kind of messed up person would say this? I got rid of it immediately. I don’t recommend anyone get this app. it’s full of hate and racist and sexist propaganda. If I could I would rate it zero stars","rating":1,"userName":"A concerned citizzen","title":"Not worth it","date":"2020-07-10T05:50:16Z","isEdited":false}},{"id":"6179672648","type":"user-reviews","attributes":{"review":"trump 2020","rating":5,"userName":"hkjhtrr","title":"love this app","date":"2020-07-10T05:50:16Z","isEdited":false}},{"id":"6179672435","type":"user-reviews","attributes":{"review":"This app is very disappointing and terrible DO NOT INSTALL IT IT IS TERRYING....... IF U SLEEP THIS WILL BE IN YO NIGHTMARES","rating":1,"userName":"iamweird92","title":"Disappointed","date":"2020-07-10T05:50:12Z","isEdited":false}},{"id":"6179672322","type":"user-reviews","attributes":{"review":"Ok it crashes every 1 second omg jeez oh it crashed","rating":1,"userName":"gabeto312","title":"Just bad so ba","date":"2020-07-10T05:50:10Z","isEdited":false}},{"id":"6179672094","type":"user-reviews","attributes":{"review":"i was so sad with the way this app worked, there is so much false information and i felt like i was becoming brain dead❤️","rating":1,"userName":"avoxado for dinner","title":"no","date":"2020-07-10T05:50:06Z","isEdited":false}},{"id":"6179672104","type":"user-reviews","attributes":{"review":"This is probably my first and LAST time I’m leaving a review on an app. I’m so disappointed on whoever made this app. Because of this app, I found thousands of viruses on my phone and one of those viruses was called “covid” as if things aren’t hard already. They could’ve done a better job and tested the app instead of placing it in the apple store with everyone at risk of getting the covid virus. I am completely disappointed. Try to do better next time.","rating":1,"userName":"jemimathefox","title":"Do not dowload this app! It had a huge impact on my mental health","date":"2020-07-10T05:50:06Z","isEdited":false}},{"id":"6179671967","type":"user-reviews","attributes":{"review":"This app is the worst thing in ze world. It made weird noises that attracted insects into my home. It also killed the raccoon who keeps me company at night. Like what the heck not cool. Do not get this app it is not worth it, and deserves less than a one star.","rating":1,"userName":"*****%%%%#]#]#{%^{*}%{%]hrhfh","title":"Sucky","date":"2020-07-10T05:50:03Z","isEdited":false}},{"id":"6179671951","type":"user-reviews","attributes":{"review":"Hhhhh","rating":1,"userName":"Noivence","title":"Hhhhhhhh","date":"2020-07-10T05:50:03Z","isEdited":false}}]}