{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29690","data":[{"id":"6173172917","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"wow","userName":"rscoj","review":"i downloaded this app trying to find a reason to like our current president (Donald J Trump). well all this app is, is him being cocky and arrogant and thinking he is the best, and in the last 3 years more people have lost there jobs then when Obama served 2 terms as President of the United States!","date":"2020-07-08T17:55:51Z"}},{"id":"6173170570","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"This deserve a 1 star","userName":"genz is the truth1","review":"On behalf of Gen Z,\nTrump is too worried about apps and not his country . It is not good and I feel as this supporting a racist man and someone who supports systemic oppression. This ends now . First he was trying to mess with Twitter now tik tok. Tik tok is the media of my generation so if he ends our app we end his . Apple this app must be gone .","date":"2020-07-08T17:55:07Z"}},{"id":"6173159855","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Terrible","userName":"james Buccham","review":"The app took forever to download and when it finally loaded all the way my screen was black. Confused because I thought all lives matter, I ended up just deleting it. Needs to go through some heavy construction.","date":"2020-07-08T17:51:43Z"}},{"id":"6173143180","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"This app makes me sick!","userName":"Precious gift","review":"After I downloaded it I got tons of viruses and not just in my phone! The second I opened it I immediately got pneumonia and I’m going to die in 30 seconds, with my last dying breath I’d like to say... DONT download this app unless you want to die of pneumonia too","date":"2020-07-08T17:46:27Z"}},{"id":"6173141123","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Dictator","userName":"ihateoranges576","review":"The app was absolutely terrible I opened it and all I saw was an 🍊.  I don’t want to see this kind of service in the future. This app is pointless. When would this app ever be good for me in the future. Can you change it to a apple instead of an orange I hate oranges.","date":"2020-07-08T17:45:48Z"}},{"id":"6173133176","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Horrible app","userName":"beepboopcountrygorl","review":"The fact that people want trump to be our president again when he is a racist, homophobic, RAP*ST, most likely has dementia, doesn’t even help our country when in need, and gets offended by tik toks makes me honk. I’d vote for a piece of garlic bread rather than this fat orange man we sadly call our president.","date":"2020-07-08T17:43:19Z"}},{"id":"6173126886","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"terrible app.","userName":"mackenzie with a b","review":"I downloaded this app to stay informed about our racist, misogynist, pedophilic, no good president but his face when opening the app was uncalled for and it terrified me. Now I can no longer close my eyes without seeing his ugly orange face. I do not recommend downloading this app unless you want nightmares.","date":"2020-07-08T17:41:20Z"}},{"id":"6173122917","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Horrible","userName":"JiminAvila","review":"Just completely terrible. \nWhy would anyone in man kind do this. \nI just want to see something but instead I have to put in all this personal information. I did not put it in, cause who in God’s name knows what’s gonna happen.","date":"2020-07-08T17:40:07Z"}},{"id":"6173105133","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"This app is terrible 😤🤢🤮","userName":"shittygf","review":"My phone is starting to move terribly slow ever since I downloaded it I just wanted to be updated on the news of the countries second favorite Cheeto man (Love u Chester Cheeta) will not recommend to friends it’s a horrible app and shouldn’t have been created 😤","date":"2020-07-08T17:34:26Z"}},{"id":"6173095932","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Terrible","userName":"a.k1013","review":"Our president hasn’t given us a reason to appreciate him for what he does. This app doesn’t give us any more reasons to like him I don’t know how we are supposed to take time to download app just for this guy who has only made America worse","date":"2020-07-08T17:31:28Z"}}]}