{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=34420","data":[{"id":"6177608216","type":"user-reviews","attributes":{"review":"this app took A WEEK to download. although i was extremely infuriated i believe this issue is a perfect model of trumps incompetence/ability to properly do ANYTHING let alone be the PRESIDENT with the many many problems in the world right now. #SETTLEFORBIDEN2020","title":"HORRIBLE","date":"2020-07-09T17:41:26Z","userName":"derpyderpster420","isEdited":false,"rating":1}},{"id":"6177595084","type":"user-reviews","attributes":{"review":"I don’t like him in general he looks like annoying orange his hair looks like pelo de elote , i hope he leaves soon, HELP STRAY KIDS GET A WIN ON MWAVE OR LEE JIN HYUK !!!!!! I don’t like this app it doesn’t let you buy kpop albums way worse than other ones should definitely stick to yesasia and official sites SEVENTEEN 2020.","title":"I love Minghao","date":"2020-07-09T17:37:13Z","userName":"아추 Nice","isEdited":false,"rating":1}},{"id":"6177572806","type":"user-reviews","attributes":{"review":"This app does not have many features that I would like it to have and overall it could be improved vastly to make it more useable and actually functional.","title":"Not very useful","date":"2020-07-09T17:30:03Z","userName":"bigboyfridge","isEdited":false,"rating":1}},{"id":"6177525015","type":"user-reviews","attributes":{"review":"The app is so terrible it kept kicking me out didn’t let me do anything on it. And it kept making my phone glitch 😡 this app is terrible and it shouldn’t be on here please kick this app out. No one likes it and it’s a low quality app. Tiktok stand. Tiktok app Matters DONT BAND TIKTOK!!!!","title":"Bad app","date":"2020-07-09T17:15:02Z","userName":"donald trump dead 2020 😈🥳🙏","isEdited":false,"rating":1}},{"id":"6177521423","type":"user-reviews","attributes":{"review":"I cannot believe this even exists. If I could give negative stars I would. The picture of this Cheeto face moron in my screen will now haunt my dreams. I wish deleting him out of presidency was as easy as deleting this app.","title":"Awful","date":"2020-07-09T17:13:53Z","userName":"bdkdjendosbekbdjdnsnw","isEdited":false,"rating":1}},{"id":"6177519015","type":"user-reviews","attributes":{"review":"I love this Cheeto puff of a Oompa Loompa, I just love the way he says that the coronavirus is just going to go away and that America is the best suited to handle meanwhile more then 3million+ people have the virus in America. Also the site crashes when I use it.","title":"Keeps Crashing","date":"2020-07-09T17:13:08Z","userName":"thisisndhhs","isEdited":false,"rating":1}},{"id":"6177508812","type":"user-reviews","attributes":{"review":"This app kept making my phone crash.  It did not seem to showcase how trump was going to make america better. Leaving me to believe that he is not going to help our beautiful country but hurt it instead.","title":"Jasmine Dragon","date":"2020-07-09T17:09:57Z","userName":"Ghuru Patic","isEdited":false,"rating":1}},{"id":"6177505398","type":"user-reviews","attributes":{"review":"This app has made my phone glitch to the point where I couldn’t even use it when it finished loading, it is terrible and I don’t recommend","title":"Terrible","date":"2020-07-09T17:08:53Z","userName":"Nooooosirrrr","isEdited":false,"rating":1}},{"id":"6177493021","type":"user-reviews","attributes":{"review":"once i opened the app, i  had a miserable experience. The app was extremely glitchy and filled to the max with ads. I do not recommend installing this app. In fact EVERYONE should give a 1 star review. Disgusting how people like apps like this","title":"TERRIBLE","date":"2020-07-09T17:05:09Z","userName":"bdkscjdhvekxh we","isEdited":false,"rating":1}},{"id":"6177485545","type":"user-reviews","attributes":{"review":"This is the worst app right when I loaded into it and I tried to put my phone number in it did not let me and the app is buggy in general I suggest everyone giving it a one star rating","title":"Worst thing ever 🤢🤮🤢🤮","date":"2020-07-09T17:02:51Z","userName":"Tayzer42","isEdited":false,"rating":1}}]}