{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38900","data":[{"id":"6179121346","type":"user-reviews","attributes":{"title":"How","isEdited":false,"date":"2020-07-10T02:39:49Z","rating":1,"review":"Yes, I am mad about tik tok. It is in the constitution that people should have freedom of speech. I am embarrassed my president is trying to take that away because Americans weren’t showing up to his rally because it didn’t follow any Covid 19 safety guidelines","userName":"hannahf:)"}},{"id":"6179115295","type":"user-reviews","attributes":{"title":"Identity theft","isEdited":false,"date":"2020-07-10T02:37:35Z","rating":1,"review":"Man I got this app and immediately had all my bank accounts hacked into. Not to mention the amount of personal information that it releases to unknown parties 🤦🏻‍♂️ horrible app ruined my life and my privacy","userName":"thefacts2020"}},{"id":"6179072002","type":"user-reviews","attributes":{"title":"I lost my family to this app","isEdited":false,"date":"2020-07-10T02:21:44Z","rating":1,"review":"So when I opened this app I saw a backed orange and I instinctively screamed so my husband came in and saw it and died when I started crying my kids saw it and died I barely survived this app and it’s horrors","userName":"Colty Man"}},{"id":"6179057070","type":"user-reviews","attributes":{"title":"Lame app","isEdited":false,"date":"2020-07-10T02:16:16Z","rating":1,"review":"Trump is poo poo stinky I pray he isn’t re-ejected. He stole my first born son and said “this is a donation to my great campaign, he will be raised in the military to carry lemonade to our troops on the front lines, in order to quench their thirsts!!” I haven’t seen my son in 4 years","userName":"realbingofemitrumpsucks"}},{"id":"6179051358","type":"user-reviews","attributes":{"title":"ZERO STARS","isEdited":false,"date":"2020-07-10T02:14:08Z","rating":1,"review":"I was on the Trump Train before I downloaded this app. I loved him. I wanted to make my great county of america, great again, and thought Trump was the answer. Until downloaded this app. Completely ruined my views. I am reconsidering EVERYTHING.","userName":"makaaaaaylllaaaaaaaaaaa"}},{"id":"6179030502","type":"user-reviews","attributes":{"title":"Horrible!","isEdited":false,"date":"2020-07-10T02:06:27Z","rating":1,"review":"This app has so many bugs that it continually made my phone crash! I had to go to the store for help but they made me replace my phone! I will NEVER be downloading it again!","userName":"Neuman23"}},{"id":"6179020292","type":"user-reviews","attributes":{"title":"this app can commit sewer slide","isEdited":false,"date":"2020-07-10T02:02:45Z","rating":1,"review":"i downloaded the app just so find out that the homepage is his own NUDES!!!! DISCOSTANG. an unprofessional president who thinks a harmless kids app is worse then going onto try and support your president but finding a little 🍤 instead. charli damelio 2020","userName":"chari damelio 2020"}},{"id":"6179017454","type":"user-reviews","attributes":{"title":"Horrible","isEdited":false,"date":"2020-07-10T02:01:46Z","rating":1,"review":"I left my phone to charge overnight after downloading this app and 8 hours later it was only at 50% because it drained all my battery","userName":"jjabsbajgehw"}},{"id":"6178985028","type":"user-reviews","attributes":{"title":"This app is 💩","isEdited":false,"date":"2020-07-10T01:49:48Z","rating":1,"review":"I downloaded this app and I opened it to find the ugliest thing I’ve ever seen it was orange had some fake hair on it and was like really old it looked about 100 years old oh wait that was just Donald oops 😬","userName":"yOuR loAcL TiKtOkEr"}},{"id":"6178975417","type":"user-reviews","attributes":{"title":"Make your iPhone great again. Delete this.","isEdited":false,"date":"2020-07-10T01:46:22Z","rating":1,"review":"This is a one star review, because you cannot give zero stars. In this respect, the app closely resembles the Trump presidency, so I guess there is some degree of truth here. This is almost as engaging as a leaking bag of aging turkey gizzards.","userName":"Albeville"}}]}