{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=136210","data":[{"id":"6180389763","type":"user-reviews","attributes":{"userName":"cookiecookieyeahthatsme","title":"Cause death","isEdited":false,"rating":1,"review":"Ok so I downloaded this app for our lovely president ✨DONALD TRUMP✨ and he persuaded my sister to circle the house with gasoline and light it on fire.😩💅🏽 and everybody in the house died from it and this ✨KAREN✨ called the police and said we tried to kill her son which was riding his bike in our house and the cops said they couldn’t do nothing about it they said they have more black ppl to kill and her son cut his fingers off cause ✨DONALD TRUMP✨ told him he should do it cause why not......(I DIDNT GET TO FINISH CAUSE DONALD TRUMP TOLD THE POLICE TO KILL ME)","date":"2020-07-10T10:13:12Z"}},{"id":"6180388889","type":"user-reviews","attributes":{"userName":"mal_77","title":"literal TRASH of an app🤮","isEdited":false,"rating":1,"review":"HORRIBLE. DO NOT DOWNLOAD. This app should not be on the App Store. UGLY. TERRIBLE.","date":"2020-07-10T10:12:54Z"}},{"id":"6180388029","type":"user-reviews","attributes":{"userName":"Trump is a child rapist","title":"WORST APP EVER","isEdited":false,"rating":1,"review":"I downloaded this app and was very unpleased it took up all the storage on my phone and actually made my phone crash. Of course this has never happened with any other app. I actually believe after downloading this app I have been watched through my camera so now I have to get a new phone. I am very infuriated and would definitely NOT recommend this app to anyone!!! and I was very disturbed by the disgusting racist, homophobic, transphobic, sexist, misogynistic, CHILD RAPIST on the screen. I would have rated this app a zero if I could.","date":"2020-07-10T10:12:34Z"}},{"id":"6180387079","type":"user-reviews","attributes":{"userName":"✨ M A N N Y✨","title":"🤢👾I feel very violated","isEdited":false,"rating":1,"review":"As the bery powitical six day old I am I got the app hoping to talk to my fellow rats but instead I got a picture of a big block of goat cheese with Googly eyes and I am on a very strict vegan vegetarian keto no carbs no sugar no water no cheetos no meat no vegetables no homophobic sexist racist bunker babies no sodium no protein diet so to say this offended me would be an understatement. I am going to need to speak to whoever made this app to tell them to put a real icon on the opening screen like Lizzo instead of my 3rd grade bully who’s named Brock and his mom made him sign up for baseball and he’s always bragging  about the fact that he has money but doesn’t know fortnite isn’t a personality trait. Anyways I do not recommend this app to anyone above the age of fetus. 0/10","date":"2020-07-10T10:12:14Z"}},{"id":"6180384424","type":"user-reviews","attributes":{"userName":"kdicudl","title":"I would give 0 if I could","isEdited":false,"rating":1,"review":"This app is absolute trash just like the person in office. Honestly I don’t see why #45 is still here. Anyways Gen z is coming be ready🥱","date":"2020-07-10T10:11:15Z"}},{"id":"6180384077","type":"user-reviews","attributes":{"userName":"emerald0411","title":"Y it do the crash crash to my phone?","isEdited":false,"rating":1,"review":"IT KEEPS CRASHING MH PHONE WHEN I BE WATCHING MY NETFLIX","date":"2020-07-10T10:11:08Z"}},{"id":"6180382694","type":"user-reviews","attributes":{"userName":"bootylilcall3x","title":"Bruh","isEdited":false,"rating":1,"review":"Foreighnut","date":"2020-07-10T10:10:38Z"}},{"id":"6180381891","type":"user-reviews","attributes":{"userName":"_noemi__m","title":"Take this app down now 😾","isEdited":false,"rating":1,"review":"It’s horrible \nIt takes to much storage \nI don’t like it \nTikTok we Stan 😗\nPERIOD !!!","date":"2020-07-10T10:10:22Z"}},{"id":"6180381590","type":"user-reviews","attributes":{"userName":"hannahlibbers","title":"this app has been reading and taking my information","isEdited":false,"rating":1,"review":"Okay not to be paranoid or anything, but recently after downloading this app, I’ve noticed that certain things I’ve talked about have been showing up in ads on my google. This didn’t start happening until after I downloaded the app. I think the Donald Trump administration is listening in on my conversations and working with larger companies to gain financially.","date":"2020-07-10T10:10:15Z"}},{"id":"6180381546","type":"user-reviews","attributes":{"userName":"tik.tok.lover❤️❤️❤️❤️","title":"Lol","isEdited":false,"rating":1,"review":"This app spreads fake news. And trump is just a weird orange thing! So why not get rid of his app if he wants to take away our app also Trump Go wit down and close your mouth!","date":"2020-07-10T10:10:14Z"}}]}