{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22370","data":[{"id":"6177356988","type":"user-reviews","attributes":{"date":"2020-07-09T16:24:45Z","rating":1,"title":"Oh darling... This app was horrible!","review":"The whole entire app was filled with just racist people filling the comment sections and making plans with other white supremacists. They called themselves “White Power” disgusting right? I would not recommend this app to any Trump loving cult or any of the good Republicans. YOU ARE BETTER THAN THIS STUPID APP!!! anyways hey babies i’m from t1k t0k <3333 ALSO BLACK LIVES MATTER!!!!","isEdited":false,"userName":"Kareneigh"}},{"id":"6177299368","type":"user-reviews","attributes":{"date":"2020-07-09T16:08:37Z","rating":1,"title":"THIS APP IS HACKED. Not a Gen. Z troll!","review":"This app has been compromised. On the outside, it seems like a normal app. I downloaded this thinking it was President Trump’s official app that helped supporters get involved/educated. Instead what I found was a circus. This is a front for the leftist agenda. Why would President Trump condone this pro-choice, anti-American, Black Lives Matter loving, CNN and Wash. Post citing propaganda?? Please fix this!","isEdited":false,"userName":"french711"}},{"id":"6177292804","type":"user-reviews","attributes":{"date":"2020-07-09T16:06:44Z","rating":1,"title":"Terrible app","review":"This app is literally pointless to use also to the 5 star people who hate this app if we get it to 1 star it gets taken off the app store so please change your rating from 5 to 1 star thank you and if you must search it up to find the same thing go for it  👌👍  \n\nThanks","isEdited":false,"userName":"breeeeeeeeeeeeanna"}},{"id":"6177276583","type":"user-reviews","attributes":{"date":"2020-07-09T16:02:04Z","rating":1,"title":"Had to get a new phone 👎","review":"I am a huge Donald Trump fan so of course to support the president of America i got this app. But upon opening this app my WHOLE ENTIRE PHONE went BLACK!! And no matter how hard I tried turning it on IT WOULD’T!!! So I went to the Apple store and they told me I had to get a BRAND NEW PHONE. Worst time and money spent. Thanks to this app I’m #settlingforBiden2020","isEdited":false,"userName":"donald's 3 inch"}},{"id":"6177274053","type":"user-reviews","attributes":{"date":"2020-07-09T16:01:21Z","rating":1,"title":"This app is trash","review":"I downloaded it and it took three weeks to download not only that but when it finally downloaded my whole phone froze with his picture on my lock screen had to get a whole new phone not only that but there was an oompa loompa hot cheeto looking monster on my phone","isEdited":false,"userName":"conserned_parent12"}},{"id":"6177269086","type":"user-reviews","attributes":{"date":"2020-07-09T15:59:56Z","rating":1,"title":"Looking for the truth","review":"Unfortunately, this app seems to indicate “truth isn’t truth” as I understand it. It’s also glitchy with a spinning T that made me dizzy... it was like I was being put under a trance like I’d imagine would happen if I were, say, being welcomed into a cult. I freaked out and deleted the app and seek information elsewhere. SAD!","isEdited":false,"userName":"Shunganunga"}},{"id":"6177264394","type":"user-reviews","attributes":{"date":"2020-07-09T15:58:33Z","rating":1,"title":"The app is horrible","review":"I saw a horrible looking orange when I was trying to see our \"stable genius\" president. He is so smart because he predicted that there would be no COVID-19 cases and he was \"totally\" correct. And he is very invested in our health as he is looking into having us inject bleach into our bodies which \"definitely\" won't cause sickness.","isEdited":false,"userName":"Concernded person"}},{"id":"6177258698","type":"user-reviews","attributes":{"date":"2020-07-09T15:56:50Z","rating":1,"title":"DO NOT DOWNLOAD WILL MESS UP PHONE","review":"I’d give this a negative star if I could! I’m so so so upset it’s has completely messed up my phone! You’d think the dicta-I mean president of the USA would make sure the app was secure. But no ! Now my phone thinks it’s a white boomer who has the right to be racist and touch little kids :((( DO NOT DOWNLOAD!!! My phone now calls me the N word and donates to KKKarens :((((","isEdited":false,"userName":"suckmyaijhia"}},{"id":"6177244259","type":"user-reviews","attributes":{"date":"2020-07-09T15:52:37Z","rating":1,"title":"Bad app","review":"This app takes 3 days to download and when I open it it just turns my phone off and sets it on fire. Also now because I opened it all of my personal data has been sent to Russia and they are trying to recruit me into the KGB. I’m pretty sure all this app is is KGB recruitment. Just a really terrible app.","isEdited":false,"userName":"i do not wish to share"}},{"id":"6177238654","type":"user-reviews","attributes":{"date":"2020-07-09T15:51:00Z","rating":1,"title":"Very disappointed","review":"I was excited to download the app, but found it very underwhelming. The app constantly glitches and breaks down. I was hoping that the new software update would fix the many issues in the app, but sadly, nothing changed. 1/5 would not recommend.","isEdited":false,"userName":"Karen Landemeyer"}}]}