{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=49120","data":[{"id":"6172570701","type":"user-reviews","attributes":{"review":"Do not get this app. It kept on glitching and kicking me out of it. It also took a really long time to download and I have really good WiFi where I live","title":"Someone","userName":"Jackaverymussiccc","rating":1,"date":"2020-07-08T14:55:53Z","isEdited":false}},{"id":"6172567499","type":"user-reviews","attributes":{"review":"Full of incorrect information, if I wanted that kind of info and news I’d just look at my racist family’s Facebook pages.","title":"No thanks","userName":"TheAntiCat","rating":1,"date":"2020-07-08T14:55:00Z","isEdited":false}},{"id":"6172562760","type":"user-reviews","attributes":{"review":"Glitches all the time. I can’t even open the app without it crashing. Don’t waste your time with this app","title":"Horrible","userName":"akbsbk","rating":1,"date":"2020-07-08T14:53:42Z","isEdited":false}},{"id":"6172561663","type":"user-reviews","attributes":{"review":"um so basically america is just a country full of frickin clowns and our choices for president are a dude with dementia, a racist homophobic rotten orange pedo facist, and a rapper who thinks slavery was a choice. god is probably lookin down on us and havin a real good laugh at the conservatives right now. like i think we should defund the police and use the extra money to give all the trump supporters hearing aids.","title":"why is this stale cheeto running for president?","userName":"camlu","rating":1,"date":"2020-07-08T14:53:24Z","isEdited":false}},{"id":"6172520139","type":"user-reviews","attributes":{"review":"This app is terrible whoever came up with this needs to stop apps like these are the reason nobody takes politics serious anymore!!","title":"Ugh","userName":"bootybootyjuice","rating":1,"date":"2020-07-08T14:41:44Z","isEdited":false}},{"id":"6172519035","type":"user-reviews","attributes":{"review":"This is the worst app ever and if you download it you’re probably going to get a virus on your device so I recommend not to download it please and thank you!","title":"Virus","userName":"Baddienumber1","rating":1,"date":"2020-07-08T14:41:24Z","isEdited":false}},{"id":"6172505775","type":"user-reviews","attributes":{"review":"I downloaded this app in order to find a reason to vote for Mr. Trump. But all I received was a glitching screen and no way to get out of it except waiting for my phone to die. DO NOT DOWNLOAD.","title":"Absolutely Disgraceful","userName":"MuffinFeelsStrange","rating":1,"date":"2020-07-08T14:37:40Z","isEdited":false}},{"id":"6172500850","type":"user-reviews","attributes":{"review":"I opened the app and a dusty orange Cheeto popped up on my home page. I threw me phone across the room and yelled SHIVER ME TIMBERS! Next thing I know Barron Trump swoops I’m to save me from that nightmare. Also I went deaf afterwards so...wouldn’t recommend","title":"Terrible 🧚‍♀️✨","userName":"lilguttie","rating":1,"date":"2020-07-08T14:36:15Z","isEdited":false}},{"id":"6172490299","type":"user-reviews","attributes":{"review":"I wanted to see what this app is about but it kept glitching to an ORANGE blurred face! And when I tried to exit the app, it wouldn’t let me! 10/10 would NOT recommend","title":"Not pleased :(","userName":"spongeboob yall!","rating":1,"date":"2020-07-08T14:33:20Z","isEdited":false}},{"id":"6172483289","type":"user-reviews","attributes":{"review":"one time i saw trump on the street and said hi. he didn’t like how my family looked so he body slammed my grandmother and took my brothers and sisters and placed them in a shopping card and rolled the cart onto the highway. he put me behind his car and ran over me. he proceeded to spit on my 103 year old grandfather all because we weren’t caucasian. i am disgusted and horrified with his behavior.","title":"horrified","userName":"hi 😃✨","rating":1,"date":"2020-07-08T14:31:25Z","isEdited":false}}]}