{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=14810","data":[{"id":"6177155764","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:27:22Z","title":"Waste of time and space","rating":1,"review":"It took up all the data on my phone which resulted in me having to delete beloved pictures of my family and pets. I also had to delete apps I’d rather spend time on just so that it could download. Once I got rid of the app and redownloded all my other apps I’d lost all progress and had to start all over again. Definitely not worth it. Vote Biden.","userName":"just vote for biden"}},{"id":"6177122963","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:18:19Z","title":"KILLED MY GARDEN","rating":1,"review":"I just got this app. I opened it while walking my sunflower and it went straight from yellow to orange!! I was appalled. I go home to try and wash my sunflower to get it back to it’s natural born color but then I find out the rest of my garden was orange too! The apples, the lemons, even the kale!! All of this happened since I got the app! Don’t get this app it might turn your garden orange as well. If I could give this app zero stars, I would.","userName":"heykittygorl"}},{"id":"6177119285","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:17:18Z","title":"Bye bye;)","rating":1,"review":"I was expecting for this app to be well put and set up properly since it is from president trump but this app worked terribly, I was not able to do anything on it and my phone was about to crash right after downloading it. This is not how an app is supposed to work, it was glitching and completely ruining everything on my phone. I can’t believe this app is working this bad.","userName":"Hope you go ✨"}},{"id":"6176975696","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T14:38:05Z","title":"Just horrible","rating":1,"review":"I downloaded this app to be able to get a better look into who trump as a 2020 candidate was. This app is horrible, when you go into it crashes and makes your phone really really slow. Do not download it!! If you need to get information just look online this app is not going to help you it’s just going to crash and mess up your phone.","userName":"Nnunsunfn"}},{"id":"6176928242","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T14:25:28Z","title":"🍊🧚‍♀️","rating":1,"review":"Sooooo, I got the app and like a lot of people said, it took days to download. Then, if that wasn’t bad enough, it threatened to send my father back to Mexico! After that it threw racial slurs at me and my father and told me to STAY IN THE KITCHEN WHERE I BELONG!!! I was VERY ANGRY!! I couldn’t believe it!!! I was just trying to take down... I meeeaannn, support our wonderful (horrible) ✨orange✨ with ✨no dick✨ for a President. I DON’T RECOMMEND THIS APP! IT’S VERY RACIST, SEXIST, AND MANY MORE HORRIBLE THINGS 🤢. Anyway, that’s all I have 😌. Goodbye 👋","userName":"hotpottea"}},{"id":"6176902433","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T14:18:46Z","title":"Disgusting","rating":1,"review":"This disgusts me. All I wanted was to use this app to be informed but the only thing I got was ads, unwanted info, and the things I read were rly messed up and not appropriate for a news app. I hope this app gets taken down because it is so bad. I now am even more against anything to do with trump than ever, and he is a seriously disgusting human being and never should have been elected president.","userName":"cbkig"}},{"id":"6176900457","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T14:18:14Z","title":"Doesn’t work!","rating":1,"review":"I opened the app and entered my phone number. It asked for my credit card information and I thought it was for donations to our wonderful president Mr. Donald Trump so of course I put it in, but after I entered my credit card number along with the rest of the blanks that asked for other bank account information, the app closed out and wouldn’t let me open it again!","userName":"Hope Jank."}},{"id":"6176819473","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:56:59Z","title":"I think I’m going to be sick","rating":1,"review":"This app is cursed.  As soon as I opened it I was met with a picture of a demonized goat bleeding out of its empty eye sockets.  The most horrific noise of what sounded like explosive diarrhea was in the background while the picture just spun slowly on my screen.  For hours.  I couldn’t stop it.  I couldn’t lock my phone or close the app.  Ever since I got this app I’ve had bad luck.  I’m scared to leave my home.","userName":"tacobellbigbox"}},{"id":"6176784231","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:47:40Z","title":"⚠️DO NOT DOWNLOAD⚠️","rating":1,"review":"Once it finally downloaded (after 5 days) It sent me an email saying I had to vote for trump. I emailed them back saying no I don’t but they weren’t having it. So after deleting the app the next day it was back on my phone! I kept deleting but it kept showing up! I don’t know how to get it off my phone! It also used ALL my gigabytes so I don’t have any gigabytes left. Please do NOT download!!!!!","userName":"sjhsxhsjskdbdjs"}},{"id":"6176759763","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T13:41:10Z","title":"Why did I do this to myself?","rating":1,"review":"I wanted to see what it was about, but this app ruined my life. I’m now having to attend life long therapy as I’ve now seen so many photos of an overgrown Cheeto baby it’s scarred my frontal lobe. I have permanent depression as it’s blocked receptors in my brain and I’m not able to receive serotonin. I didn’t think that was possible by just looking at a picture of one individual but, here we are.","userName":"JoryChan"}}]}