{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=89030","data":[{"id":"6174618273","type":"user-reviews","attributes":{"review":"we like the cars, the cars that go boom. we're tigra, and bunny and we like the boom. we like the cars, the cars that go boom. we're tigra, and bunny and we like the boom","rating":1,"userName":"ca$h_moneyyy","isEdited":false,"title":"tiktokluvr69","date":"2020-07-09T02:13:19Z"}},{"id":"6174605990","type":"user-reviews","attributes":{"review":"Once upon a time there was a lovely princess. But she had an enchantment upon her of a fearful sort, which could only be broken by Love's first kiss. She was locked away in a castle guarded by a terrible fire breathing dragon. Many brave knights had attempted to free her from this dreadful prison, but none prevailed. She waited in the dragon's keep in the highest room of the tallest tower for her true love and true love's first kiss. Like that's ever going to happen. What a loony. Shrek Beware Stay out I think he's in here. All right. Lets get it! Hold on. Do you know what that thing can do to you? Yeah. He'll groan into your bones for his brains. Well actually that would be a giant. Now Ogres, huh, they are much worse. They'll make a soup from your freshly peeled skin. They'll chew your livers, squeeze the jelly from your eyes. Actually, it's quite good on toast. Back, back beast, back! I warned you! Right. This is the part, where you run away. Yeah! And stay out. Wanted. Fairytale creatures. Right, this one is full. Take it away. Give me that. Your fine days are over. -25 pieces of silver for the witch. Next. -Come on. Sit down there! And be quiet! This cage is so small. You wouldn't turn me in. I'll never be stubborn again. I can change. Please, give me another chance. Oh, shut up! Next. What do we got? This little wooden puppet. I'm not a puppet, I'm a real boy. Five shillings for the possessed toy. Take it away. No! Please, don't let them do it! Next. What do you got? Well, I've got a talking donkey! Right. Well that's good for ten schillings, if you can prove it. Oh, go ahead fella. Well? He's just a li..., just a little nervous. He's really quite a chatterbox. You boneheaded donkey! That's it. I have heard enough. Guards! No, no, he talks, he does! I can talk. I love to talk. I've talked to... Get her out of my sight! -No, no, I swear! Hey, I can fly. -He can fly! -He can fly! He can talk! -That's right, fool! Now I'm a flying, talking donkey! You might have seen house fly, maybe even a superfly. But I bet you ain't never seen a donkey fly! Seize him! Get him! This way! Hurry! You there. Ogre. -I. By the order of lord Farquaad. I am authorized to place you both under arrest. And transport you to designated resettlement facility. Oh really? You and what army? Can I say something to you? Listen, you were really, really something, back there. Incredible. Are you talking to... ...me? Yes, I was talking to you. Can I just tell you that you were really great back there with those guards. They thought that was all over there. And then you showed up and BAM. Ther","rating":1,"userName":"kyriestrees","isEdited":false,"title":"No❤️","date":"2020-07-09T02:09:52Z"}},{"id":"6174603371","type":"user-reviews","attributes":{"review":"I now have to go to therapy 16 times a week 🥰","rating":1,"userName":"MariamKhann","isEdited":false,"title":"No❤️","date":"2020-07-09T02:09:06Z"}},{"id":"6174601271","type":"user-reviews","attributes":{"review":"Just like the current pres.","rating":1,"userName":"butterflyhabits","isEdited":false,"title":"Trash","date":"2020-07-09T02:08:32Z"}},{"id":"6174583955","type":"user-reviews","attributes":{"review":"He shot my dog","rating":1,"userName":"suarezalex49","isEdited":false,"title":"Just awful","date":"2020-07-09T02:03:39Z"}},{"id":"6174581378","type":"user-reviews","attributes":{"review":"Don’t use this app it’s the worst app to use","rating":1,"userName":"tik tok tehe","isEdited":false,"title":"Worst app","date":"2020-07-09T02:02:55Z"}},{"id":"6174558617","type":"user-reviews","attributes":{"review":"yeah overall 0/10, did not make me feel great again (as promised). maybe try a different app for therapy guys? <3","rating":1,"userName":"littlerat1","isEdited":false,"title":"zero bars","date":"2020-07-09T01:56:23Z"}},{"id":"6174542060","type":"user-reviews","attributes":{"review":"i saw a orange person ! we need to deport all orange people from this COUNTRY","rating":1,"userName":"hakahsms","isEdited":false,"title":"AWFUL APP","date":"2020-07-09T01:51:38Z"}},{"id":"6174535084","type":"user-reviews","attributes":{"review":"This man looks like a milk jug along with his lil pig n a blanket weenie is disgusting 💕💕 horrible app horrible person","rating":1,"userName":"peruanita2004","isEdited":false,"title":"Donny boy","date":"2020-07-09T01:49:36Z"}},{"id":"6174529871","type":"user-reviews","attributes":{"review":"distasteful, tone deaf, racist, hopefully never to be seen again 🧚🏼‍♂️✨","rating":1,"userName":"powerfulgen","isEdited":false,"title":"Cancelled","date":"2020-07-09T01:48:07Z"}}]}