{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=139880","data":[{"id":"6179565100","type":"user-reviews","attributes":{"userName":"we will rise 😌","title":"DO NOT DOWNLOAD","isEdited":false,"rating":1,"review":"GIRL when i told you i just wanted to make america great i DID. then THIS APP completely DESTROYED my phone. it literally made my entire phone shut down but not before my house EXPLODED 💥. it was horrendous. my whole family went down with it. luckily i was able to save the dog. thank god. this app gets a solid NO from me 🧚✨💞🥰","date":"2020-07-10T05:12:51Z"}},{"id":"6179565018","type":"user-reviews","attributes":{"userName":"727383902","title":"😂🔪❤️","isEdited":false,"rating":1,"review":"no orange man bad","date":"2020-07-10T05:12:49Z"}},{"id":"6179564577","type":"user-reviews","attributes":{"userName":"Cheesy Hamilton","title":"the app doesn’t like the bee movie😡😡😡","isEdited":false,"rating":1,"review":"According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don't care what humans think is impossible. Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let's shake it up a little. Barry! Breakfast is ready! Coming! Hang on a second. Hello? Barry? Adam? Can you believe this is happening? I can't. I'll pick you up. Looking sharp. Use the stairs. Your father paid good money for those. Sorry. I'm excited. Here's the graduate. We're very proud of you, son. A perfect report card, all B's. Very proud. Ma! I got a thing going here. You got lint on your fuzz. Ow! That's me! Wave to us! We'll be in row 118,000. Bye! Barry I told you, stop flying in the house! Hey Adam. Hey Barry. Is that fuzz gel? A little. Special day graduation. Never thought I'd make it. Three days grade school, three days high school. Those were awkward. Three days college. Glad I took a day and hitchhiked around the hive. You did come back different. Hi Barry. Artie growing a mustache? Looks good. Hear about Frankie? Yeah. You going to the funeral? No, I'm not going. Everybody knows sting someone you die. Don't waste it on a squirrel. Such a hothead. I guess he could have just gotten out of the way. I love this incorporating an amusement park into our day. That's why we don't need vacations. Boy, quite a bit of pomp... under the circumstances. Well, Adam, today we are men. We are! Be men. Amen! Hallelujah! Students, faculty, distinguished bees, please welcome Dean Buzzwell. Welcome New Hive City graduating class of...9:15. That concludes our ceremonies. And begins your career at Honex Industries! Will we pick our job today? I heard it's just orientation. Heads up! Here we go. Keep your hands and antennas inside the tram at all times. Wonder what it'll be like? A little scary. Welcome to Honex a division of Honesco and a part of the Hexagon Group. This is it! Wow. We know that you as a bee have worked your whole life to get to the point where you can work for your whole life. Honey begins when our valiant Pollen Jocks bring the nectar to the hive. Our top-secret formula is automatically color-corrected scent-adjusted and bubble-contoured into this soothing sweet syrup with its distinctive golden glow you know as...Honey! That girl was hot. She's my cousin! She is? Yes, we're all cousins. Right. You're right. At Honex we constantly strive to improve every aspect of bee existence. These bees are stress-testing a new helmet technology. What do you think he makes? Not enough. Here we have our latest advancement, the Krelman. What does that do? Catches that little strand of honey that hangs after you pour it. Saves us millions. Can anyone work on the Krelman? Of course. Most bee jobs are small ones. But bees know that every small job if it's done well means a lot. But choose carefully because you'll stay in the job you pick for the rest of your life. The same job the rest of your life? I didn't know that. What's the difference? You'll be happy to know that bees as a species haven't had one day off in 27 million years. So you'll just work us to death? We'll sure try. Wow! That blew my mind! What's the difference? How can you say that? One job forever? That's an insane choice to have to make. I'm relieved. Now we only have to make one decision in life. But Adam, how could they never have told us that? Why would you question anything? We're bees. We're the most perfectly functioning society on Earth. You ever think maybe things work a little too well here? Like what? Give me one example. I don't know. But you know what I'm talking about. Please clear the gate. Royal Nectar Force on approach. Wait a second. Check it out. Hey, those are Pollen Jocks! Wow. I've never seen them this close. They know what it's like outside the hive. Yeah, but some don't come back. Hey, Jocks! Hi, Jocks! You did great! You're monsters! You're sky freaks! I love it! I love it! I wonder where they were. I don't know. Their day's not planned. Outside the hive, flying who knows where, doing who knows what. You can't just decide to be a Pollen Jock. You have to be bred for that. Right. Look. That's more pollen than you and I will see in a lifetime. It's just a status symbol. Bees make too much of it.  Perhaps. Unless you're wearing it and the ladies see you wearing it. Those ladies? Aren't they our cousins too? Distant. Distant. Look at these two. Couple of Hive Harrys. Let's have fun with them. It must be dangerous being a Pollen Jock. Yeah. Once a bear pinned me against a mushroom! He had a paw on my throat, and with the other, he was slapping me! Oh my! I never thought I'd knock him out. What were you doing during this? Trying to alert the authorities. I can autograph that. A little gusty out there today wasn't it comrades? Yeah. Gusty. We're hitting a sunflower patch six miles from here tomorrow. Six miles huh? Barry! A puddle jump for us, but maybe you're not up for it. Maybe I am. You are not! We're going 0900 at JGate. What do you think, buzzyboy? Are you bee enough? It all depends on what 0900 means. Hey, Honex! You decide what you're interested in? Well there's a lot of choices. But you only get one. Do you ever get bored doing the same job every day? Son let me tell you about stirring. You grab that stick, and you just move it around and you stir it around. You get yourself into a rhythm. It's a beautiful thing. You know Dad the more I think about it maybe the honey field just isn't right for me. You were thinking of what making balloon animals? That's a bad job for a guy with a stinger. Janet, your son's not sure he wants to go into honey! Barry you are so funny sometimes. I'm not trying to be funny. You're not funny! You're going into honey. Our son the stirrer! You're gonna be a stirrer? No ones listening to me! (that’s all I have room for, thanks for listening)  ;)","date":"2020-07-10T05:12:40Z"}},{"id":"6179564601","type":"user-reviews","attributes":{"userName":"jacqueline H👍","title":"YEOO","isEdited":false,"rating":1,"review":"I downloaded this app and it was so...BAD. Extremely..it froze when I opened it and I couldn’t leave the app. Once I  FINNALY left the app I immediately deleted it because my phone almost caught a VIRUS 🦠. I 100% DO NOT RECOMMEND!!!","date":"2020-07-10T05:12:40Z"}},{"id":"6179564459","type":"user-reviews","attributes":{"userName":"marcap1","title":"JELLY BEANS UP MY *booty* (violent app)","isEdited":false,"rating":1,"review":"I went to the store downtown and it was called ‘69&Family’. I was really excited but on the way I came across a Trump supporter and was like “wahhhhh????” They told me to get this app and I trusted them. I told my grandma about it and she had a heart attack. I told her to eat a Cheeto and stop being dramatic.... she died. She was so shocked that I put faith into my Presi Donald Duck that she dropped dead. Her final words were:\n“i🥵climed🧭out🥫of👋my🔒head🤯and⛸watched⏰myself👈implode💥a👅thought💭without ❌a⚠️body💤 oughta🎤be🐝the🏎 shot🔫” I felt the raw emotion of sadness when she said that because it truly had a purpose. Anwayyyyyy....\nI continued on my walk to “69&Family” and stumbled upon a homeless chicken nugget. I was like “ ‘Ello luv!! Pip Pip Cheerio!!!” It proceeded round attack me. I screamed for Trump, I EVEN OPENED THE APP BECAUSE I THOUGH HE WOULD HEAR ME THROUGH IT‼️The app not only let me down... it caused me to turn into a chicken nuggy because when I was attacked, it bit me. But it’s okay. Even though I’m built like a burnt chicken nugget, I still love myself.❤️ This app is a lie and took away my life. DO YOU WANT IT TO TAKE YOUR LIFE TOO?! THEN DONT DOWNLOAD IT!!!! IF U ALREADY HAVE IT, WRITE A REVIEW TELLING THEM OF HOW I SO KINDLY WARNED YOU AND GIVE THEM ONE STAR‼️‼️‼️‼️\n\nThank you for listening. This truly means a lot to me. This app has ruined my entire life and I will forever be a chicken nugget. If you download it then you will be supporting grandmas having heart attacks and chicken nuggets ATTACKING people. Goodbye my luv....","date":"2020-07-10T05:12:37Z"}},{"id":"6179564376","type":"user-reviews","attributes":{"userName":"reality-235","title":"DO NOT DOWNLOAD","isEdited":false,"rating":1,"review":"As a trump supporter I am truly disappointed by how terrible this app is.","date":"2020-07-10T05:12:36Z"}},{"id":"6179564289","type":"user-reviews","attributes":{"userName":"Msdowny","title":"Worst president ever","isEdited":false,"rating":1,"review":"Terrible app. The worst app you’ve ever seen. I’m telling you, this app should be fired!","date":"2020-07-10T05:12:34Z"}},{"id":"6179564233","type":"user-reviews","attributes":{"userName":"You still here dude?","title":"Crocodile Alligator","isEdited":false,"rating":1,"review":"I was told this app had crocodiles and alligators. I’m completely let down that I see an orange on this app. Terrible app. I will take my “inTeRiOr CrOcoDilE AlLigAtor, I drIVe a cHevrOLet MOviE tHeAtrE” elsewhere.","date":"2020-07-10T05:12:33Z"}},{"id":"6179564228","type":"user-reviews","attributes":{"userName":"nos101","title":"ITS A DISEASE","isEdited":false,"rating":1,"review":"IT WAS TERRIBLE I THREW UP RIGHT WHEN I DOWNLOADED IT. I HAVE BEEN SICK FOR SO LONG I CANT EVEN EAT ANYMORE MY FAMILY AND FRIENDS ARE DOING THEIR BEST TO SUPPORT ME BUT ITS GETTING OUT OF HAND MY SISTER RECENTLY GOT THE DISEASE TOO. DO NOT DOWNLOAD!!THIS APP WILL RUIN YOUR LIFE!! STAY SAFE!!","date":"2020-07-10T05:12:33Z"}},{"id":"6179564231","type":"user-reviews","attributes":{"userName":"benjamin dover the third","title":"TERRIBLE APP DO NOT DOWNLOAD","isEdited":false,"rating":1,"review":"as a trump supporter i cannot believe the amount of foolishness this app put me through it was just straight hogwash terrible app made my grandma have a stroke","date":"2020-07-10T05:12:33Z"}}]}