{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=19770","data":[{"id":"6174961129","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:55:16Z","userName":"anna weyenberg","title":"Ew","rating":1,"review":"This app had to be one of the worst apps I’ve ever used. I told my grandma she should download it because she loves Trump, however when she opened the app, her account was already set up and named “Old Bag Who Can’t Hear.” Maybe this was a coincidence, but I cannot in good faith ever download or recommend this app to anyone ever again. I will no longer be voting for trump in the 2020 election. SETTLE FOR BIDEN 2020 🇺🇸"}},{"id":"6174952526","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:52:37Z","userName":"Maxy Paxy","title":"SLOW POOR QUALITY","rating":1,"review":"This app takes up too much storage while simultaneously being horribly slow and inefficient. You can’t access simple things like events or speeches. Maybe that’s a good thing because the information given in this app is totally false. I don’t even know how it got put in the news category. TERRIBLE APP"}},{"id":"6174947646","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:51:06Z","userName":"ADowning","title":"Worst App I Have Ever Used","rating":1,"review":"I cannot believe that in 2020 developers are still making apps as glitchy as this. I hardly ever leave reviews but I had to take time out of my day to give some feedback and hopefully the developers will listen. Freezes up, crashes out of nowhere and is unresponsive. What a freaking joke!! Awful app!"}},{"id":"6174943517","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:49:47Z","userName":"jiijjjhg","title":"App stole My Baby","rating":1,"review":"I went to make some chicken nuggets for my baby and I came back and he was gone and the I heard crying from the other room and he was crawling around in there, like how did he get in there the app obviously stole my baby and put it into the other room, I am simply disgusted and furious and wish I could give it an even worse raiting."}},{"id":"6174932014","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:46:14Z","userName":"EMILY😘 MAGA🤮🤮🤮","title":"WORST APP!","rating":1,"review":"I bought this app while under the influence of several hard drugs. Apparently my refrigerator melted in the pool so I couldn’t figure out exactly what the time was. If I find lightbulbs under the moss in my scooter, I’ll certainly find a way to erase all of Beethoven’s music from all music platforms and the internet so that the Russians can exhibit their piano skills."}},{"id":"6174926763","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:44:37Z","userName":"cheetos worst nightmare","title":"no❤️","rating":1,"review":"This app is a waste of space just like the current president🥰. There is no solution other than to delete this app entirely as it is completely useless and dysfunctional. Constant glitches, so many bugs that needs fixing. Honestly the worst app to exist. Messed up my phone. Messed up my eyes. All I see is orange. Everything is orange. Now I’m blind."}},{"id":"6174924704","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:44:01Z","userName":"mearesr17","title":"WORST APP EVER","rating":1,"review":"I downloaded this app to keep up with our president, but was incredibly disappointed with the quality and performance. It constantly glitches and forces my phone to restart. I also have to wait FOREVER for anything to load!!!! This app, I believe, is an accurate representation of Trump’s presidency: unintelligent and half-a$$ed. IT JUST ISN’T GOOD. Make iPhone Great Again™️ by DELETING THIS STUPID APP."}},{"id":"6174896822","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:35:42Z","userName":"emma2005829","title":"Garbage.","rating":1,"review":"Please do not get this app for your phone. I got it because I am a conservative and wanted to keep up with news. Turns out that a virus got on to my phone from this app. I wish I had social distanced more, I thought I was being safe, but apparently no amount of caution is enough. It might just be because I’m a dumb conservative but oh well.\n\nBest wishes \n     -Alt TikTok"}},{"id":"6174845788","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:20:47Z","userName":"syannnnaaaaa","title":"terrible app","rating":1,"review":"when i downloaded this app my fish stopped walking. This is just outrageous, how is the chicken supposed to cross the road if it aint got no legs, absolute bafoonery, would not recommend. Just like how i also wouldn’t recommend injecting yourself with cleaning supplies. I’ve tried it, and lets just say if the pizza dont pop then the panda can never swim."}},{"id":"6174839909","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T03:19:01Z","userName":"Trumpster4Life","title":"HORRIBLE APP!","rating":1,"review":"This app is absolute TRASH. I downloaded it for its supposed efficiency at keeping me updated on all of MY PRESIDENT’S upcoming events and campaigns, and now my phone is BROKEN😡 i can’t hold a charge, the app keeps spamming my phone with notifications and I can’t turn them off, and it has given me nothing but dirty viruses and RUINED MY CELL PHONE. 0/10 will never download again. TERRIBLE!"}}]}