{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=139470","data":[{"id":"6179608270","type":"user-reviews","attributes":{"review":"the app took multiple hours to download and once i opened the app it would periodically log me out every 10 minutes or so. Trump needs to put as much pride in this app as he does in his tweets!","date":"2020-07-10T05:27:41Z","userName":"DON'T DOWNLOAD 20202929","title":"Horrible App by Our President","rating":1,"isEdited":false}},{"id":"6179608135","type":"user-reviews","attributes":{"review":"THIS APP STOLE MY POPEYES BISCUIT!! Oh my god this App Store everything for me I’m so so so so so so so so so so sad and it’s like why why took my pet goldfish away from me like I love you webbed feet I love you I love you and that one more you’ll be had for you was not enough to like why why why I am so so so so distraught I am suing I am going to call my nonexistent attorney and you will be put behind bars!!","date":"2020-07-10T05:27:38Z","userName":"ushsjejajajaksjjsjsjss","title":"THEIFAREAD","rating":1,"isEdited":false}},{"id":"6179608125","type":"user-reviews","attributes":{"review":"DO NOT DOWNLOAD .....IT HACKED MY IPHONE AIRPODS AND IT MESSED UP SYNCING FOR MY APPLE WATCH ...... DONALD TRUMP IS A WHITE SUPREMACY......... GO STREAM FDT , THE BIGGER PICTURE . ANONYMOUS 2020🥴🥴🥴🥴🥴🥴🥴🥴🥴🥴. He tried to take down tiktok so ima take his app down. PERIODT","date":"2020-07-10T05:27:37Z","userName":"Cynthia Clackes-Hopkins II","title":"Do NOT DOWNLOAD","rating":1,"isEdited":false}},{"id":"6179607866","type":"user-reviews","attributes":{"review":"After downloading this app and logging in, I now keep getting spam and tele-marketing calls from random phone numbers that are from Beijing, Novosibirsk, and Nanjing. ITS SO ANNOYING!! Didn’t realize my info was going to be sold for lousy telemarketing!!!!! They also keep sending me text messages, might have to block them somehow or get a new phone #. The calls are ridiculous, they come every hour followed by a text message!!\nDon’t waste your time, someone probably hacked the system!! \n\n0 out of 5 stars if I could! \n\nI have my write to my own privacy","date":"2020-07-10T05:27:32Z","userName":"Kesia Patlan","title":"SPAM CALLS AFTER SIGNING UP!!!","rating":1,"isEdited":false}},{"id":"6179607426","type":"user-reviews","attributes":{"review":"I downloaded this app, because I’m the biggest trump supporter 🙈. It’s truly not worth anyone’s time, it’s takes forever to download, but it’s very quick to remove ✨. When I opened the app it physically hurt my soul, and no one should have to go through that 😔. Looking at what the hot Cheeto has to offer is truly damaging to the eyes, and brainwashes civilizations. So please spare yourself while you have a chance. ✨🤪","date":"2020-07-10T05:27:23Z","userName":"chicken_strips77","title":"WORST APP EVER","rating":1,"isEdited":false}},{"id":"6179607446","type":"user-reviews","attributes":{"review":"I tried to download this app exactly 69 days ago at 4:20 and it just downloaded. I want to be informed on what our president is doing for us, but it asked to be able to track my location and I thought nothing of it, our president wouldn’t put the straight white peoples of America into harms! But I noticed that someone was following me the very next day! I am frightened that MY president would hurt me! \n\nYeah, that’s all true. But actually he is a maniacal jerk! He took away trans people’s health care, wants to make it so LGBTQ+ people can’t adopt, when they can get children a home! I’m afraid for what the USA is going to see if he wins again.","date":"2020-07-10T05:27:23Z","userName":"Misiletoe","title":"Critical information","rating":1,"isEdited":false}},{"id":"6179607261","type":"user-reviews","attributes":{"review":"honestly i just don’t like him, 25 rape allegations and human trafficking ? please sir, STEP DOWNNN","date":"2020-07-10T05:27:19Z","userName":"hughehughe","title":"ASS","rating":1,"isEdited":false}},{"id":"6179607049","type":"user-reviews","attributes":{"review":"Andrew Yang 2020","date":"2020-07-10T05:27:15Z","userName":"SKIBunyard","title":"Trash","rating":1,"isEdited":false}},{"id":"6179606955","type":"user-reviews","attributes":{"review":"Before downloading this app I was a nice, open-minded person. Now I can’t stop yelling racial slurs! I hope Brad Parscale (website guy) can create a patch that fixes it. Thank you!","date":"2020-07-10T05:27:12Z","userName":"Holden Lotadix","title":"App Made Me Racist","rating":1,"isEdited":false}},{"id":"6179606894","type":"user-reviews","attributes":{"review":"The app took for ever to load and even shuts down for no reason! So many adds and bugs it’s ridiculous! The home page button doesn’t even work in the app! Not to mention all the personal information it ask for?? It needs permission for your camera, microphone, location, etc. never downloading again!","date":"2020-07-10T05:27:10Z","userName":".......$$","title":"Slow, bugs, and personal information???","rating":1,"isEdited":false}}]}