{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24380","data":[{"id":"6178710647","type":"user-reviews","attributes":{"title":"VIRUS HAS BEEN FOUND","rating":1,"userName":"tehe1601","date":"2020-07-10T00:06:47Z","isEdited":false,"review":"I love our president so i got this app to show my support. But there was a few problems it took a very long time to download and then when i finally got the app to download it sent me creepy messages like “re elect trump” i got so scared so i powered off my phone and will never grt this app again"}},{"id":"6178679825","type":"user-reviews","attributes":{"title":"TRASH","rating":1,"userName":"gangstastarlord","date":"2020-07-09T23:54:52Z","isEdited":false,"review":"this is absolute trash. It do be giving gen z a platform to share and get information our and that is so scary we can’t let them have that power. We also cannot let gen z be happy or have fun so let’s get rid of this app because that is just absolutely disgusting🧚‍♀️🧚🏾🧚🏽‍♂️👩‍🦯🧑‍🦯👨‍🦯"}},{"id":"6178649909","type":"user-reviews","attributes":{"title":"BAD APP!","rating":1,"userName":"nduekksoso","date":"2020-07-09T23:43:11Z","isEdited":false,"review":"This app is horrible it took five days to download and it was so bad when I used it it could even work and I had perfect Internet and it didn’t say anything and it was all black and my Internet was broken because of this app so guys don’t land don’t download this app this is such a bad app😖😖😖😖😖😖😖😖😖😖😖😖😩😤"}},{"id":"6178645965","type":"user-reviews","attributes":{"title":"WORST APP EVER","rating":1,"userName":"Lulu1010101010","date":"2020-07-09T23:41:40Z","isEdited":false,"review":"first of all trump is banning tik tok just cause he’s scared of what gen-z can pull on him. we are legit destroying him because in my opinion he is an evil, racist, sexist child predator. second of all, america is not “great”. it’s gone WAY DOWN since trump became president for clout. idc if all u trump supporters say “it’s a hard job being a president” THATS NO EXCUSE. HE IS A VILE HUMAN BEING. NOT JUST AN AWFUL PRESIDENT. and that’s on period."}},{"id":"6178645364","type":"user-reviews","attributes":{"title":"Get this off the app store","rating":1,"userName":"nvhkvghj","date":"2020-07-09T23:41:25Z","isEdited":false,"review":"I was trying to download it and it kept crashing my phone, i have a samsung core prime so i didnt know how it can crash such a good phone, the app doesn't even work because I open it and every single time i see the face of our excuse of a president"}},{"id":"6178628781","type":"user-reviews","attributes":{"title":"One Of The Worst","rating":1,"userName":"Re'Ana","date":"2020-07-09T23:35:01Z","isEdited":false,"review":"Let’s just say, this app never deserved to be on the Apple App Store in the first place. The demographics of the app are terrible, there are bugs left and right. Seeing as though it is supposed to be “Great” I was let down. Let’s make the “app store great again”🤣, and take this disgrace, i mean the Trump app, down."}},{"id":"6178604886","type":"user-reviews","attributes":{"title":"Would Give this APP zero stars if possible.","rating":1,"userName":"MRS>HAL","date":"2020-07-09T23:25:38Z","isEdited":false,"review":"I was so excited to see this app!  Yay TRUMP 2020!!!!!  But I think it actually broke my phone.  It took like 5 hours to download and then I noticed that all of my photos were gone!!!  Super disappointed.  I would not recommend installing or using this app."}},{"id":"6178585270","type":"user-reviews","attributes":{"title":"Delete before i go ceazy","rating":1,"userName":"Baconhairlord","date":"2020-07-09T23:17:49Z","isEdited":false,"review":"Sorry guys, but i went on this app for 1 second, and i SEE NASTY STUFF, im only 2 years old and to me it didn’t ask if i was i higher age so i press”yes”, if their is any trump supporters please stop, if u guys stop, the future of the united states could have a bright future to look forward to"}},{"id":"6178465872","type":"user-reviews","attributes":{"title":"Glitchy and false information","rating":1,"userName":"notbrooke","date":"2020-07-09T22:30:39Z","isEdited":false,"review":"This app rarely works—the pages take up to 10 minutes to load and I’m not about to wait around for that. Also, the majority of the news on here is false and comes from unreliable sources or NO sources at all"}},{"id":"6178464590","type":"user-reviews","attributes":{"title":"This app doesn’t work AT ALL!!!!!","rating":1,"userName":"tightbu$$y","date":"2020-07-09T22:30:06Z","isEdited":false,"review":"First off, when I downloaded the app, IT TOOK 4 DAYS TO DOWNLOAD!!! Then, I tried to use the application and every time it would TURN OFF MY PHONE????? I wanted to support our amazing president and all that he is doing for us but this app is the worst thing i’ve ever seen. PLEASE remove off of the app store! p.s. Trump 2020!🇺🇸"}}]}