{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42310","data":[{"id":"6172837216","type":"user-reviews","attributes":{"rating":1,"title":"Screw the Cheeto and this app","date":"2020-07-08T16:11:17Z","userName":"player.133567","isEdited":false,"review":"This is the worst app ever made when you first download it the ugly roasted Cheeto pops up and shoots a laser through your phone which killed my mom sister and cousin now I’m in an orphanage because of that stupid Cheeto I hate him and his orange face. Speaking of BLM ACAB bye😘"}},{"id":"6172826929","type":"user-reviews","attributes":{"rating":1,"title":"Never download","date":"2020-07-08T16:08:19Z","userName":"aducey","isEdited":false,"review":"This app is terrible in every way, the app would always kick me off and when take FOREVER to download. The whole set up is bad and very hard to navigate."}},{"id":"6172816885","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE DIRECTIONS!!!","date":"2020-07-08T16:05:26Z","userName":"Alamendo","isEdited":false,"review":"I tried to use this app to see if I could attend the Trump Rally in Tulsa. The app crashed a bunch of times, the system would glitch, and it never told me directly where i could go to reserve a seat at the rally. Horrible app, DO NOT DOWNLOAD"}},{"id":"6172813490","type":"user-reviews","attributes":{"rating":1,"title":"Waste of time","date":"2020-07-08T16:04:30Z","userName":"Spfia Limnsna","isEdited":false,"review":"This app is useless. I came here to find reasons to why trump should be president again but I found none. I expected it but why should there be app that helps no one."}},{"id":"6172808116","type":"user-reviews","attributes":{"rating":1,"title":"So many “bugs”! Terrible!","date":"2020-07-08T16:02:57Z","userName":"YourBoiRated","isEdited":false,"review":"I downloaded this app and it crashed my phone! And I have no other apps downloaded 😭 fix this now! Maybe deleting it will?"}},{"id":"6172800736","type":"user-reviews","attributes":{"rating":1,"title":"Bunker boy","date":"2020-07-08T16:00:50Z","userName":"@haileyjohansson","isEdited":false,"review":"looked at this app to see how racist bigots support him. still don’t know why. I guess they are as corrupt as he is. To any gen z folk reading this, start forming your own opinions rather than listening to mommy and daddy<3 tik tok will not be taken away by lil bunker boy🥰"}},{"id":"6172794785","type":"user-reviews","attributes":{"rating":1,"title":"Horrible","date":"2020-07-08T15:59:06Z","userName":"dalinermrll","isEdited":false,"review":"I seen this on tik tok, he wants to delete an app that brings together so many people and he is being extremely petty just because no one went to his little rally"}},{"id":"6172770403","type":"user-reviews","attributes":{"rating":1,"title":"Bad app","date":"2020-07-08T15:52:10Z","userName":"thelorax29","isEdited":false,"review":"When I saw this app I thought it was pretty good to download it then I realize it’s it belongs to the president Donald Trump who is really really rude races in homophobic. So now as I smart person like a don’t use apps that supports people like him."}},{"id":"6172751649","type":"user-reviews","attributes":{"rating":1,"title":"Review","date":"2020-07-08T15:46:45Z","userName":"Donal Trumpppp","isEdited":false,"review":"This app is really slow it takes a long time to setup .Tried to look forReason to  have a little hope in are president could not find one ."}},{"id":"6172741616","type":"user-reviews","attributes":{"rating":1,"title":"worst app ever!!","date":"2020-07-08T15:43:53Z","userName":"Nayeli lololol","isEdited":false,"review":"i downloaded this app to show my love for my big fat orange president but this app is just awful😿😿 it took at least 4 hour to download and i have pretty good wifi if i say so myself 😼then when i tried to open the app it was so glitchy and it kept freezing my phone. i’m just so devastated, i just wanted trump to know how much i love him and his tiny 🍤. anyways don’t download this app it’s bad!!🙈😎"}}]}