{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29150","data":[{"id":"6173443103","type":"user-reviews","attributes":{"title":"True story","review":"This app doesn’t deserve a single star once it downloaded my phones started acting up  does topic of trump turn her on i thought I was the man for her does this count as cheating it makes me jealous and I don’t know what to do I wish that lord could help me in a situation like this","date":"2020-07-08T19:26:31Z","rating":1,"isEdited":false,"userName":"starberry♥︎"}},{"id":"6173437781","type":"user-reviews","attributes":{"title":"Horrible app!","review":"First of all, as soon as I opened this app I was shown an orange man standing in front of an outdated american flag. I am deeply offended that America’s black and yellow manny flag was not featured. Then this app started glitching HORRIBLY, and I couldn’t use it even if I wanted to. This app needs a serious update 😡\n\nYou ban us, we ban you. - gen z 🧚🏻‍♀️✨💕","date":"2020-07-08T19:24:43Z","rating":1,"isEdited":false,"userName":"arden.reese"}},{"id":"6173436165","type":"user-reviews","attributes":{"title":"ÏmPęæçhëd","review":"I can’t get the covfefe out of my phone plz send help. I keep getting notifications about quid pro quo help. I was sent down into my basement for the app and am now communing with demons and monsters. They tried to do an exorcism on my phone but to no avail, I’m forever stuck with this app on my phone","date":"2020-07-08T19:24:10Z","rating":1,"isEdited":false,"userName":"Trumps Spray Tan"}},{"id":"6173430060","type":"user-reviews","attributes":{"title":"Complete disaster!!!","review":"The app takes so long to download, and after it’s downloaded it crashes all the time. I’ve gotten so many scam calls after downloading. My friend even had her credit card info stolen!!! Nothing but garbage content on the app!","date":"2020-07-08T19:22:13Z","rating":1,"isEdited":false,"userName":"Directioner4ever&always"}},{"id":"6173411324","type":"user-reviews","attributes":{"title":"WORST APP!","review":"THIS APP IS SO SLOW! it would load forever! And I made sure to turn on and off my WiFi, still didn’t work. And plus right when I downloaded the app it made my phone act up. Like my phone was being slow. I think something is wrong with this app, DONT GET IT.","date":"2020-07-08T19:15:50Z","rating":1,"isEdited":false,"userName":"fjeiwonjfos"}},{"id":"6173389169","type":"user-reviews","attributes":{"title":"worst app in history!!!","review":"This app is not the type of app that should be on here it’s literally took a month just to download! Even after it download the screen was just orange, please explain how this app is even in the App Store?!?! Take this off the App Store immediately!","date":"2020-07-08T19:07:56Z","rating":1,"isEdited":false,"userName":"Annie Bortion"}},{"id":"6173376254","type":"user-reviews","attributes":{"title":"it is a cult","review":"this app is TERRIBLE. when you download the app it makes you join a racist, sexist, and homophobic CULT. if you refuse to join you become the cults sacrifice. definitely a 1/5 for me. VERY BAD EXPERIENCE. good news was i did in fact get away and am now having to live under a new name so they don’t sacrifice me.","date":"2020-07-08T19:03:20Z","rating":1,"isEdited":false,"userName":"17459202"}},{"id":"6173346909","type":"user-reviews","attributes":{"title":"THIS APP IS A SCAM!!","review":"this app was HORRIBLE. Ads kept popping up. And when I would try to exit out the apps it would take me to some weird sketchy websites talking about pizzagate????? Idk but i ended up having to get a new phone because it set a virus in my phone. This app is a scam to get your personal info!","date":"2020-07-08T18:53:07Z","rating":1,"isEdited":false,"userName":"mnisbydktlmfao"}},{"id":"6173343731","type":"user-reviews","attributes":{"title":"HeCk iTs NOt WoRKiNg","review":"I’ve been trying all day and it hasn’t downloaded. Their community isn’t LGBTQ+ community friendly and it’s not nice. Also they don’t support BLM and that’s also pretty mean of them. 0/10 Karen’s are telling that’s they can’t wear mask cause the have “asthma” and their totally faking. Not a gammer mover here","date":"2020-07-08T18:52:01Z","rating":1,"isEdited":false,"userName":"donald J trump on instagram"}},{"id":"6173338092","type":"user-reviews","attributes":{"title":"The worst app.","review":"This app took forever to download causing me to get extremely mad. Once the app was downloaded it was extremely slow and laggy.  I expected something much better 😤 I 100% do not recommend. If anything you should download Roblox.","date":"2020-07-08T18:50:02Z","rating":1,"isEdited":false,"userName":"Rose Albizo"}}]}