{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=73250","data":[{"id":"6178122801","type":"user-reviews","attributes":{"rating":1,"title":"💕✨Gen z will win✨💕","userName":"Gen z✨💕","review":"Honestly a bad app I didn’t even open it and I threw up at the sight of it","date":"2020-07-09T20:24:27Z","isEdited":false}},{"id":"6178118228","type":"user-reviews","attributes":{"rating":1,"title":"Yikes","userName":"idkifthisisallowedm","review":"Not apart of this gen z app takedown thing but like what is this app. It is as incoherent as his twitter, would give 0 if I could.","date":"2020-07-09T20:22:54Z","isEdited":false}},{"id":"6178114310","type":"user-reviews","attributes":{"rating":1,"title":"gross","userName":"emma amme mema emam","review":"this app is TERRIBLE. theres nothing good about it. it should literally be taken down😡😡😡","date":"2020-07-09T20:21:34Z","isEdited":false}},{"id":"6178112295","type":"user-reviews","attributes":{"rating":1,"title":"bad, very stupid, dumb, and I lost IQ","userName":"deprission_chck","review":"I opened up the app and what I saw was HORRIBLE a orange man with a tuxedo and with a bad poster was saying make America great again AND THEN HE GRABBED MY CAT AND YANKED IT INTO THE SCREEN DO NOT DOWNLOAD THIS APP rip cardimon","date":"2020-07-09T20:20:57Z","isEdited":false}},{"id":"6178111750","type":"user-reviews","attributes":{"rating":1,"title":"Gen Z","userName":"cactiisme","review":"You try to take away our app we take away yours. Learn not to play with us Trump.","date":"2020-07-09T20:20:46Z","isEdited":false}},{"id":"6178109465","type":"user-reviews","attributes":{"rating":1,"title":"Trump is a soggy Cheeto","userName":"ThaJemm (","review":"Mans only got into college cause of his dads money and is not qualified.  Ruin him, as he has done to so many","date":"2020-07-09T20:20:00Z","isEdited":false}},{"id":"6178109472","type":"user-reviews","attributes":{"rating":1,"title":"Scam","userName":"DOG_CHEESE","review":"This app stole my credit card info. What else is there to say.","date":"2020-07-09T20:20:00Z","isEdited":false}},{"id":"6178108830","type":"user-reviews","attributes":{"rating":1,"title":"TERRIBLE APP","userName":"Julianafls","review":"This app crashed my phone numerous times and it contains dissatisfying and inaccurate content. Very displeased with this app.","date":"2020-07-09T20:19:47Z","isEdited":false}},{"id":"6178099865","type":"user-reviews","attributes":{"rating":1,"title":"Awful","userName":"SteevieJay","review":"Worst app I’ve ever downloaded in my life, I expected more form our President. Sheesh.","date":"2020-07-09T20:16:50Z","isEdited":false}},{"id":"6178089495","type":"user-reviews","attributes":{"rating":1,"title":"Terrible service","userName":"Tatianalovesunicorns","review":"The app keeps lagging with hate because he wants to ban something that he can’t control. Dude calm down if you cannot control yourself as an adult while a bunch of us kids play around trying to save our future from what we believe won’t be good for when we grow up we have the right to protest against it because it’s the only way our voices can and will be heard because most of us aren’t old enough to vote, but that doesn’t mean we are all irresponsible. We have views of the world and we know what politics and etc look like as we view them from screens or from real life experiences if you cannot bring trust to everyone and promise to make things better for all races. Make America great again is basically saying take it back to its old ways America has never been great; America needs lots of improvements for all races, ethnicities, and sexualities. America in the past was only what people who would say was great back then when they had control over others skin colors. White is not the supreme race as it isn’t a race it’s a mutation of skin color when humans moved farther away from the equator and bred lighter and lighter human beings. No matter the color of our skin we are all the same species we all have the same things under our skin. We all have blood, muscles, bones, and organs; it’s just that you guys stereotype people base on skin color. No not all whites are the same, not all blacks are the same, not all Latinx are the same, not all Asians are the same, everybody is somebody but don’t just judge them based on their looks base your judgements about how much you know about that exact person and not people who look similar to them.","date":"2020-07-09T20:13:24Z","isEdited":false}}]}