{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=18260","data":[{"id":"6088448185","type":"user-reviews","attributes":{"review":"They used the absolute worst pictures of my favorite president; it’s terrible. I can’t imagine President Donald J. Trump would ever sign off on the use of this app when they are publicly promoting pictures where he does not look as regal as he is. This app must be a joke or not affiliated with my president, and I won’t stand for this slander. I bet this is some cheap joke by a bunch of snowflake liberals. NO THANK YOU😡","userName":"lhpeace","rating":1,"date":"2020-06-17T19:02:55Z","isEdited":false,"title":"I’m so angry"}},{"id":"6084409468","type":"user-reviews","attributes":{"review":"I was as devout a believer in his holiness as could be. This app was so confusing and kept asking me for my money! Why would our gorgeous Donald ask for my credit card information and social security number? I then received many unknown charges to my card from this app, and for random dating sites for elderly people and for marriage counseling.","userName":"MK OKAYY","rating":1,"date":"2020-06-16T20:35:42Z","isEdited":false,"title":"Disappointed"}},{"id":"6065572010","type":"user-reviews","attributes":{"review":"I was watching my favorite news broadcasting network and I got excited to see this app. Come to find out I need a credit card to even get started. I have never been so appalled in my life!! I would like to speak to your manager and make a formal complaint!\nThis is America and downloading this is impeding my rights as a tax paying citizen!!! All this is is FALSE NEWS.","userName":"BOOTLICKER999","rating":1,"date":"2020-06-12T05:01:59Z","isEdited":false,"title":"Disgusting"}},{"id":"6065269463","type":"user-reviews","attributes":{"review":"If you have a thing for feet pics, then by all means this is the app for you! I’m just not that kinda of person. When I got this app I thought I would be able to discover how Trump got his beautiful neon, I mean glowing skin complexion but I was highly disappointed when all I saw where pictures upon pictures of feet.","userName":"jed dio","rating":1,"date":"2020-06-12T02:52:08Z","isEdited":false,"title":"Too many pictures of feet"}},{"id":"6064055364","type":"user-reviews","attributes":{"review":"I downloaded this app because I got an email from daddy trump and papa pence themselves saying this app was the only way to access exclusive merch and “personal videos”... I was disappointed by the app in that it was a direct link to their overpriced onlyfans account :( how do you expect the hardworking middle class to see the artwork that is trump, when it’s $10 a picture? :(:(:(","userName":"user109275","rating":1,"date":"2020-06-11T18:40:44Z","isEdited":false,"title":":(:(:("}},{"id":"6057645009","type":"user-reviews","attributes":{"review":"First of all... this app did not ask me for my consent then it judged me for my skin color and disabilities. Just great. Life is already hard enough now I have 101 push notifications about some dusty lookin Cheeto guy that wants me to come into his “bunker” with him. Nah man! This has been an unfortunate experience. I am taking a fist full of tums, locking all my doors, and trying to get some sleep. Sheezz.","userName":"lil'barnes","rating":1,"date":"2020-06-10T06:26:51Z","isEdited":false,"title":"This gave me heart burn"}},{"id":"6055695793","type":"user-reviews","attributes":{"review":"I just wanted to open my phone and see some good news, but the only news this app provides is trump-related. i don’t really like trump, and his face was the first thing i saw when i opened this app. now he haunts me and my posterity. i went to punch a wall yesterday but trump’s ghost grabbed my hand and pulled it away. donald trump eats pants. this app is riddled with fake news and propaganda.","userName":"Tinkerbellemily","rating":1,"date":"2020-06-09T17:47:10Z","isEdited":false,"title":"Bad quality app"}},{"id":"6179216016","type":"user-reviews","attributes":{"review":"I was offended to say to least. This app only promotes America, when all countries matter. I also saw that you can send a birthday card to trump and he for one didn’t send a thank you letter but all birthdays matter so it feels ignorant. Although he is very good and knows all the things,  I did not see that in this app.","userName":"72839572737","rating":1,"date":"2020-07-10T03:14:46Z","isEdited":false,"title":"Why to not download this app"}},{"id":"6179179497","type":"user-reviews","attributes":{"review":"As soon as I opened this app I got my leg chopped off. This was one of the worst apps ever made because I feel harassed, threatened, traumatized, etc. You might think I’m overreacting but as soon as I opened this app the government officials found out my name my parents’ names my brother’s name and they just killed them all. Please Apple, take this one down. A lot of lives are in danger!","userName":"gggfeewwwwww","rating":1,"date":"2020-07-10T03:01:30Z","isEdited":false,"title":"WORST APP EVER"}},{"id":"6179176879","type":"user-reviews","attributes":{"review":"This app crashed my phone more then the iOS 14 beta did don’t recommend and to my other trump supporters I know your doing this out of the kindness of your heart for trump like I did but it will ruin your phone and I know it’s because of this app cause I JUST DID GOT A NEW PHONE (AN IPHONE 11)plz I’m begging you it is not helping trump it’s really crashing your phone love, Brittany","userName":"wegcë","rating":1,"date":"2020-07-10T03:00:32Z","isEdited":false,"title":"Nope not worth it"}}]}