{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31200","data":[{"id":"6173680584","type":"user-reviews","attributes":{"review":"This app took a very long time to download. Three days to be exact.  When i opened it it kept crashing and glitching my phone out. my phone even electrocuted me !! the electrocution caused my eyebrows to burn off. Very dangerous would not recommend.","title":"Horrible","rating":1,"userName":"Tiff 🤠🧍‍♀️","date":"2020-07-08T20:49:09Z","isEdited":false}},{"id":"6173675064","type":"user-reviews","attributes":{"review":"I’ve never been so disappointed in an app. This app caused me to start chanting “All lives matter” and call the cops on innocent people of color. This app made me start going by Karen and yelling at Target employees that asked me to wear a mask. 0/10 would not recommend.","title":"Worst app of all time","rating":1,"userName":"withloveMags","date":"2020-07-08T20:47:06Z","isEdited":false}},{"id":"6173670767","type":"user-reviews","attributes":{"review":"i had to buy a completely new phone after downloading this! i just wanted to educate myself since i will be able to vote this year and i wanted to do some reasearch. from the minute i downloaded this app my phone became slow and glitching DO NOT DOWNLOAD THIS APP","title":"IT BROKE MY PHONE","rating":1,"userName":"Mace Joy","date":"2020-07-08T20:45:35Z","isEdited":false}},{"id":"6173653220","type":"user-reviews","attributes":{"review":"This app is horrible it’s so glitchy and everything and don’t get me started on the content because all I say is some big fat orange orangutan 🦧 looking man all over this app and it makes my stomach hurt and all he does is spew hate","title":"The worst app I’ve ever downloaded","rating":1,"userName":"KAUSHHSNAU","date":"2020-07-08T20:39:22Z","isEdited":false}},{"id":"6173636567","type":"user-reviews","attributes":{"review":"So first of all to start with this app crashes way too much and interferes with my other apps like instagram!!!!! I also heard people hack your stuff so don’t download save yourself!!! It also caused me to have nightmares this app curses you! I swear I’m not lying, I just contacted a priest to bless me this app IS DEVILS WORK!!!","title":"TERRIBLE DONT DOWNLOAD THIS APP IS CURSED","rating":1,"userName":"suds_28","date":"2020-07-08T20:33:24Z","isEdited":false}},{"id":"6173622257","type":"user-reviews","attributes":{"review":"i opened this app and immediately my phone started glitching in unbelievable ways and once i FINALLY got it working after weeks of trying the app was totally horrific and i will NEVER be downloading this again. wow, despicable .","title":"Never Again","rating":1,"userName":"BringObamaBack2020","date":"2020-07-08T20:28:20Z","isEdited":false}},{"id":"6173615501","type":"user-reviews","attributes":{"review":"This app wasn’t what I was expecting I was expecting more from a person with power but I’ve been better apps that can scam a kid than this such a tragedy knowing THIS is what we get from trump but at the same time no because we all know that roten Cheeto is ✨trash✨","title":"Review","rating":1,"userName":"aria.aaaaa","date":"2020-07-08T20:25:54Z","isEdited":false}},{"id":"6173607913","type":"user-reviews","attributes":{"review":"When i was downloading this app it took a week to download and random pictures of a hum orange 🍊 kept appearing on my screen and my phone kept lagging and it wouldn’t work right and then the human orange 🍊 was in my snapshat ~anyways give this app a one star","title":"rate this app a one star","rating":1,"userName":"Trumps a ra_ ist","date":"2020-07-08T20:23:11Z","isEdited":false}},{"id":"6173604469","type":"user-reviews","attributes":{"review":"This is the worst app I’ve ever used!!! I HATE IT! It’s sooooooo slow and always crashes I’d expect better from our PRESIDENT but it seems he doesn’t care about my inconvenience if I could put zero stars I WOULD and I’ll be deleting this application IMMEDIATELY it’s absolutely AWFUL","title":"Terrible","rating":1,"userName":"scribblescrabbleeggsandcrabble","date":"2020-07-08T20:21:56Z","isEdited":false}},{"id":"6173602374","type":"user-reviews","attributes":{"review":"It took many hours to download and I open the app and I can’t even put gas in it I try and use the steering wheel and the gas pedal won’t turn I try fixing it with tape and all the sudden the water has bacteria In it will be deleting .","title":"Worst app ever","rating":1,"userName":"Dylcnnn","date":"2020-07-08T20:21:11Z","isEdited":false}}]}