{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=136040","data":[{"id":"6180559928","type":"user-reviews","attributes":{"review":"First the app wouldn’t open, and then when it did it crashed my entire phone! You would think a the President of the USA would be able to find better app creators.... maybe the administration should stop pissing off Gen Z and listen to them instead.","title":"Ruined my phone!","userName":"GenY iswithu ✊","date":"2020-07-10T11:00:47Z","isEdited":false,"rating":1}},{"id":"6180558188","type":"user-reviews","attributes":{"review":"I downloaded this app to see trumps plans for America!! But then i got a notification on my screen saying he was a secret spy and needed to talk to me in private!!!! so he hit me up with “yo i found somthin CRAZY out.” And i was like “OMG what?!” and he like “trump eats kids!! he ate my brother today!” Wow so rude 1 star","title":"Trump eats kids!!!","userName":"Meo meow","date":"2020-07-10T11:00:24Z","isEdited":false,"rating":1}},{"id":"6180557134","type":"user-reviews","attributes":{"review":"i hate this app it rlly sucked i thought it was war zone but i was wrong i couldn’t even build worst app ever never get it again","title":"CHICK FIL A","userName":"Sub2 Beawai","date":"2020-07-10T11:00:11Z","isEdited":false,"rating":1}},{"id":"6180555671","type":"user-reviews","attributes":{"review":"I got this app the see what all the hype was about and honestly it’s so annoying to be on. I looked at all the news and the important events and I didn’t see any mention of the world being made great again! I didn’t see anything about flying cars, hoverboards, invisible phones, nothing! They could have at LEAST talked about the possibility, instead they were talking about the most stupid things. This app is the absolute worst thing ai have ever come in contact with. Also what’s up with them needing my number? Now people have to get notifications even if they don’t want them, absolute anarchy. I will be asking for compensation for wasting my time.","title":"Not what was promised","userName":"sad bo1","date":"2020-07-10T10:59:51Z","isEdited":false,"rating":1}},{"id":"6180555235","type":"user-reviews","attributes":{"review":"This app is so confusing. It has no direction on how to use it. Knowing they won’t fix this issue, I’m leaving this review. I will never come back to this app. This app is just as good as the current president and it’s the worst!! Forget you Donald Trump. Anyone with a brain 2020","title":"Needs work.","userName":"sillyme1112","date":"2020-07-10T10:59:44Z","isEdited":false,"rating":1}},{"id":"6180554454","type":"user-reviews","attributes":{"review":"I didn’t believe it but I thought our beloved president the trump kin would be better than this it took me forever to download shame","title":"Why?","userName":"Turtel 142","date":"2020-07-10T10:59:34Z","isEdited":false,"rating":1}},{"id":"6180552309","type":"user-reviews","attributes":{"review":"This app is so bad! It’s the worst app ever! And I know apps! There is no one who knows apps better than I do! It’s a fake app!🧚‍♀️","title":"BigLY nasty fake app","userName":"tilunyc","date":"2020-07-10T10:59:05Z","isEdited":false,"rating":1}},{"id":"6180552004","type":"user-reviews","attributes":{"review":"As the political 10 year old I am I conclude that trump should go in the trash with all the other moldy oranges. LIKE BRUH YOU NEED TO BE MADE INTO ORANGE JUICE! AND THE ONE WITH PULP CAUSE NOBODY LIKES THAT KIND.","title":"GEN Z!!!!","userName":";-; :)","date":"2020-07-10T10:59:00Z","isEdited":false,"rating":1}},{"id":"6180551613","type":"user-reviews","attributes":{"review":"The app keeps freezing and making me have to restart my phone!! I don’t know if it needs to be bug fixed or to be reformulated but definitely an unstable app 😭","title":"Keeps crashing my phone","userName":"brookep2000","date":"2020-07-10T10:58:55Z","isEdited":false,"rating":1}},{"id":"6180551442","type":"user-reviews","attributes":{"review":"I gave this app a second try but it still wouldn’t work. It kept crashing whenever i’d open it. I think I might have a virus now.","title":"Horrible App.","userName":"smaIIjimin","date":"2020-07-10T10:58:52Z","isEdited":false,"rating":1}}]}