{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=58550","data":[{"id":"6174415089","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:14:41Z","rating":1,"review":"I saw a big red tomato with a spray tan but may I remind you it was in a trash can! That is what I saw when I first opened up the app😳🤮 I deleted the app because it was so disgusting!","userName":"fluffypillowcase","title":"AHHHH HORRIBLE APP"}},{"id":"6174413376","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:14:09Z","rating":1,"review":"my eyes lost vision the moment I opened the app. I’m not kidding. trump, I want severance for my lost vision because of your blinding “hair” and your grotesque orange failed tan. I expect my money by Friday.","userName":"heyyoulilpissbaby","title":"🤮🤮"}},{"id":"6174406065","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:11:56Z","rating":1,"review":"The quality of literally everything reminds me of when my dog died like no I love KFC don’t get me wrong but the grossness of these chickens","userName":"skfnsjcndm","title":"Horrible"}},{"id":"6174404448","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:11:28Z","rating":1,"review":"Will make make you catch the corona virus. My grandmother who happens to be 63 yrs old has had this app for 3 weeks and caught corona from this awful man!!!","userName":"sam sprks","title":"Absolutely TERRIBLE !!!"}},{"id":"6174403962","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:11:19Z","rating":1,"review":"I downloaded the app only to see that there was no Bev included. I can’t have a app with no bev. It’s dry and barely goes down the throat. That is all","userName":"Bdhfdjehen","title":"No bev"}},{"id":"6174400333","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:10:15Z","rating":1,"review":"This app is so bad, it asked me for my number now Cheeto man won’t stop texting me asking me for money. I hate this app and the Cheeto man for always asking for money","userName":"_rodbot_","title":"Cheeto man"}},{"id":"6174399281","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:09:56Z","rating":1,"review":"I opened the app, and all I see is trump flipping me off. The app didn’t work properly, and it just started showing horrible racist,sexist,and homophobic quotes by him. PLEASE TAKE IT DOWN!!!🤬🤬🤬","userName":"KKisCRAYCRAYforMERGEPLANES","title":"HORRIBLE"}},{"id":"6174398348","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:09:39Z","rating":1,"review":"I seen disgusting content on this app no worries good as near as tick-tock the disgusting contact on this app a naked Chito getting a spray tan but also getting burnt in a tanning bed and also ruining Tik Tok by getting it band worst app ever","userName":"Pchuck00","title":"Worst app ever"}},{"id":"6174396285","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:09:03Z","rating":1,"review":"as soon as i opened the app randy jackson from american idol facetimed me. i was in shock. he told me i had the most beautiful juicy voice he had ever heard. he then proceeded to ask me to star in a new broadway show. i was mortified. i said “randy, that is everything i’m working against”. do not consider getting this app. it’s a disgrace.","userName":"kenna brown","title":"it’s a no"}},{"id":"6174390428","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T01:07:16Z","rating":1,"review":"This is by far the worst App it stole my money basically if you download this app it scams u and tracks u and take ur card info and buy random stuff","userName":"ittz_jayden","title":"THIS IS THE WORST"}}]}