{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=2240","data":[{"id":"6175568477","type":"user-reviews","attributes":{"review":"i downloaded this amazing app in hopes of supporting my amazing, non homophobic, non racist, non misogynistic, and antipedophelia president. sadly, i ignored all the 1 star ratings and warnings saying that this app steals all your information and gave DEATH THREATS!! that is insane and unacceptable! but i had to learn this the hard way. it took 72 hours to download this app and once i opened it it said “you’re next xoxo covergirl” and i was BAFFLED with it not making any sense whatsoever. but today two undercover ninjas broke into my house and tripped my 88 year old grandfather and mocked him then they tied us up and spit on us hoping  we would get the corona virus! they then left us with a note from where ever they’re from and it said “vote trump 2020, or else <3” it was beyond ridiculous if i could give it one star i would.","title":"worst app ever","userName":"Beladancer671","date":"2020-07-09T07:34:50Z","isEdited":false,"rating":1}},{"id":"6175567840","type":"user-reviews","attributes":{"review":"i canNOT BELIEVE I EVEN CONSIDERED DOWNLOADING THIS HORRENDOUS PIECE OF DATA. as i was on my way to the main page, i came across a message asking if i would let it push notifications on me. FIRST OF ALL, who told you you could push a female with no regard to your own safety? do you think you can just ask me and i’ll say yes? do i look THAT flimsy for you to think i will not kick you in the throat? SECOND OF ALL, how DARE you send me notifications? i expected anyone else to be a cheater. but TRUMP? ARE YOU SERIOUS? i thought you were a red-necked, racist, sexist, loyal predator but AS IT COMES TO MY ATTENTION, apparently you’re only a red-necked, racist, sexist, empty-headed, disgusting predator. ugh. -9/5 stars for hitting on me when he has a WIFE. don’t waste your time. oh and vote for the other guy. at least it’ll be someone with a fifthteenth of a piece of mind. k bye ✨✨","title":"HORRIBLE","userName":"Isabella matinata","date":"2020-07-09T07:34:36Z","isEdited":false,"rating":1}},{"id":"6175421046","type":"user-reviews","attributes":{"review":"I downloaded this app for fun because I love president trump but weird things started happening. First I asked Siri to give my directions to McDonalds, trumps favorite restaurant, and it was Trump’s voice giving me directions!! Then the next day I came home and I heard a knock on the door. It was trump! He found my address using his app. He then came into my house and stole all my liquor and screamed pro life and ran away into the sunset. That was weird but I ignored it because getting a visit from the big man himself was an honor. The last straw though was when a bunch of trump supporters showed up to my house and stole my dogs because “dogs are a leftist tool to frame trump” I miss my dogs, if you’re reading this please be on the look out for an ugly half Doberman half chihuahua running around!","title":"I think it’s watching me","userName":"Aidan Sophmore","date":"2020-07-09T06:37:45Z","isEdited":false,"rating":1}},{"id":"6175239531","type":"user-reviews","attributes":{"review":"I never thought an app could be so awful. However, I was completely wrong. This app is awful. Not even awful it’s downright despicable and deserves nothing. Once I got on the app it crashed my phone. And it happened EVERY SINGLE TIME I CLICKED ON IT. and even when I reset my phone it kept on crashing my phone. My phone is now extremely slow moving and basically ruined because of this app. Even worse I have heard from other people that this app was the worst thing they ever downloaded. And I will never download this app ever again because it has damaged my phone. it’s quality is as good as trumps entire campaign. That is awful. Not even awful, it’s evil and horrific. Apple pls don’t let this app be in others hands bc it will damage their phone.","title":"The worst app I’ve ever used...","userName":"Startnighttime411","date":"2020-07-09T05:27:34Z","isEdited":false,"rating":1}},{"id":"6175024873","type":"user-reviews","attributes":{"review":"So I wanted to download this app because I thought it would be a good app as soon as I clicked on it Donald trump stared saying the n word and saying how he wish he could marry his daughter and hows he’s trying to hide because he is a racist and rapist to his daughter and other under age girls I thought this orange was a good president but no I was always wrong to the people that say trump 2020 are just as crazy then him and to all y’all trump supporters this is what you and him look like 🗑you really are a bad president orange I just can’t believe you would be racist and a rapist and talk about his daughter they way he does I hope the simpons are right and he dies - shakiya \nFor are loving orange president and I have a question for the trump supporters why would you vote for a orange really like are you dumb 😘😂😌","title":"Worst app ever made in history 🤮","userName":"Neishya","date":"2020-07-09T04:15:33Z","isEdited":false,"rating":1}},{"id":"6174927530","type":"user-reviews","attributes":{"review":"I cannot explain how disappointed I am about this app. As soon as I downloaded it to my phone, I had trouble getting out of the Apple store and even noticed my home screen was glitching. When I clicked on the app, it immediately kicked me out. After trying multiple times I tried to click on other apps, but the same thing happened. It took me TEN HOURS until my apps worked again and that was because I forced my phone to restart and then deleted the Trump app. I know it sounds weird but this app caused my phone to glitch and if I didn’t delete it sooner, it could have done some PERMANENT damage to my phone itself. My friend told me that her pictures started deleting suddenly MINUTES after downloading this app. This APP IS A SCAM!!! PLEASE DO NOT BUY THIS!!! THIS APP IS RUN BY HACKERS!!!!","title":"DO NOT GET THIS APP!!!","userName":"😡😡😡 judger😡😡😡","date":"2020-07-09T03:44:50Z","isEdited":false,"rating":1}},{"id":"6174864334","type":"user-reviews","attributes":{"review":"Since I am a fellow Trump supporter, getting this app seemed like the obvious next step in getting more involved with my president and country. I was very excited for all the potential good I was going to be doing for Trumps re-election campaign when I was greeted with most horrific photo I’ve ever seen. When I opened the app this photo appeared that sent such a jolt of shock down my spine. I don’t think I’ve ever been so offended in my life! The photo was SO offensive I cannot bear to even describe it to you. Of course there were other things wrong with app too, like it sending so many notifications, and alerts. The app glitched numerous times and I just couldn’t take it anymore. This app is absolutely horrendous and didn’t even come close to my standards when it comes to our WONDERFUL president!!!","title":"Awful!","userName":"Grace Page","date":"2020-07-09T03:26:14Z","isEdited":false,"rating":1}},{"id":"6174859551","type":"user-reviews","attributes":{"review":"I was just scrolling ⏫⏬through the AppStore and saw this wonderful app for my fav Cheeto president 😆😜 but when I downloaded it this orange man with a shrimp🍤 in his hand took my mum away for not wearing trump merch!! I saw some pigs in a uniform use their weapons on her and she didn’t make it 😤✌🏻🙄😵 please don’t download the app it will take away ur mUm! And after that the orange Cheeto man popped up on my screen and said I look rlly cute and hot and sexy and I told it I was only 8 🙈and he said it doesn’t matter I’m a rich White man with a lot of power 👯‍♀️🤣 so he flashed him shrimp 🍤 at me!!! I have never been more horrified in my life, now I’m in a mental hospital because every time I think abt it I start crying and trying to take my eyeballs out with a spoon 🥄 😭 anyways please don’t get it or you’ll have the same experience!!!!!!","title":"CHEETO KILLED MY MUM","userName":"cute 9 year old","date":"2020-07-09T03:24:49Z","isEdited":false,"rating":1}},{"id":"6174769432","type":"user-reviews","attributes":{"review":"White shirt now red, my bloody nose\nSleepin', you're on your tippy toes\nCreepin' around like no one knows\nThink you're so criminal\nBruises on both my knees for you\nDon't say thank you or please\nI do what I want when I'm wanting to\nMy soul? So cynical\nSo you're a tough guy\nLike it really rough guy\nJust can't get enough guy\nChest always so puffed guy\nI'm that bad type\nMake your mama sad type\nMake your girlfriend mad tight\nMight seduce your dad type\nI'm the bad guy, duh\nI'm the bad guy\nI like it when you take control\nEven if you know that you don't\nOwn me, I'll let you play the role\nI'll be your animal\nMy mommy likes to sing along with me\nBut she won't sing this song\nIf she reads all the lyrics\nShe'll pity the men I know\nSo you're a tough guy\nLike it really rough guy\nJust can't get enough guy\nChest always so puffed guy\nI'm that bad type\nMake your mama sad type\nMake your girlfriend mad tight\nMight seduce your dad type\nI'm the bad guy, duh\nI'm the bad guy, duh\nI'm only good at being bad, bad\nI like when you get mad\nI guess I'm pretty glad that you're alone\nYou said she's scared of me?\nI mean, I don't see what she sees\nBut maybe it's 'cause I'm wearing your cologne\nI'm a bad guy\nI'm, I'm a bad guy\nBad guy, bad guy\nI'm a bad","title":"EW hehe","userName":"avixbxwonxanoxiva b al","date":"2020-07-09T02:57:59Z","isEdited":false,"rating":1}},{"id":"6174495999","type":"user-reviews","attributes":{"review":"I absolutely love trump and support him all the way but jesus christ was this app bad. The very first thing you see when opening the app is a horrific picture of our beautiful president. Honestly someone should fire the man who designed this app. THERE ARE THOUSANDS MORE PICTURES OF OUR BEAUTIFUL PRESIDENT THAT COULVE BEEN USED but they chose the one where he looks like a god danm cheeto. WE CANNOT GIVE THE LIBERALS THE SATISFACTION. Aside from this when i tried imputing my phone number, the danm thing didn’t even work. I was on this app trying to put my phone number like a head less turkey. Absolutely absurd! The man behind the coding should be fired as well. Honestly my fellow brothers and sisters , you guys are better off using the trump website for campaign updates. don’t use this scummy app designed by absolutely disgusting people. \n\nBest,\nKaren Cummingbell","title":"ABDOLUTELY HORRIFIC APP!","userName":"Karen Cummingbell","date":"2020-07-09T01:38:39Z","isEdited":false,"rating":1}}]}