{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=14060","data":[{"id":"6176298797","type":"user-reviews","attributes":{"title":"Michelle obama","review":"Okay now i had HIGH hopes for this app. i love my big orange president with all my heart❤️🥰🥵. But when i downloaded it it said that trump picked ME out of all people to when something for free. but i had to donate to his foundation. i didn’t think about because um... how could you not he hasn’t done anything wrong of course. then my friend started bragging about winning the SAME thing!!!! what is this bs. i don’t know who to trust anymore.","date":"2020-07-09T11:35:25Z","rating":1,"isEdited":false,"userName":"steph❌🤣"}},{"id":"6176291818","type":"user-reviews","attributes":{"title":"DO NOT GET THIS APP!!!","review":"i most definitely do NOT approve of this app. \nthis app took 69 weeks to download, after it downloaded, anytime i tried to open the app it started playing pumped up kicks and my phone would shut off. eventually the app did open, but the only thing that was on my screen was a video of adam lanza playing dance dance revolution. what does this mean about our president?! i think mr. trump is a ADAM LANZA ENTHUSIAST!!! we must put an end to this madness.","date":"2020-07-09T11:33:20Z","rating":1,"isEdited":false,"userName":"dylan klebold enthusiast"}},{"id":"6176153483","type":"user-reviews","attributes":{"title":"Don’t get this app it’s horrible","review":"It took an hour to download and once I got it the app said that it was going to kill Mario and Luigi *sobs* and then I went to warn my family and my mom said she was g-g-g-going to k-k-kill h-h-haryyy styles *waAaaaaaaaaa* so I went to the White House and trump took hostage of me and he took my phone and killed Billie eyelash reeeeweeeeeeeeeeeeee so don’t get this app(I’m escaping while typing this) he didn’t see me oh no he see’s me ahhhhh haha I made it home!!!!!! VICTORY!! IS!! OUR’S!!!! SAvE your self!!","date":"2020-07-09T10:51:14Z","rating":1,"isEdited":false,"userName":"madison lovess titkok"}},{"id":"6176112002","type":"user-reviews","attributes":{"title":"gen z for the win tehehe","review":"let me give you some advice before downloading this app, this app is designed horribly and it even hacked my phone. After A WEEK of trying to download it on my phone it finally downloaded; however, when it did a big *WARNING* sign with skull and bones popped up and said “beware we are watching you, you have to vote for trump or we will blackmail you.” I don’t know about you, but that’s fishy...","date":"2020-07-09T10:38:15Z","rating":1,"isEdited":false,"userName":"GEN Z WILL DOMINATE"}},{"id":"6175814309","type":"user-reviews","attributes":{"title":"Too Much Talk, Not Enough Work","review":"I tried using the app and it went fine at first, but then it just stopped working... I tried to fix the issue but it seems the app decided to go golf instead of fixing itself. It would be one thing if the app was trying to fix itself but time after time, it just continuously shuts down. The app can’t handle too many tasks at once.","date":"2020-07-09T09:00:55Z","rating":1,"isEdited":false,"userName":"Golf Challenger"}},{"id":"6175814047","type":"user-reviews","attributes":{"title":"ARE YOU KIDDING?","review":"this app is very disappointing. I spent my VALUABLE time on this app and EVERYTHING is wrong! it took DAYS to download 😤😤 once it finally downloaded it kept crashing!??!??!!! then once it stopped crashing (for a minute or so) it told me my phone number wasn’t valid!?? i’ve had the same exact phone number for 283+ years so i think i would know what my number is. please fix this app, and please fix donald trump.","date":"2020-07-09T09:00:50Z","rating":1,"isEdited":false,"userName":"Liz••"}},{"id":"6175754598","type":"user-reviews","attributes":{"title":"WORST APP EVER","review":"If I could give this a zero I would. I literally waited forever just for it to download and when it finally downloaded I opened the app and.... I threw up EVERYWHERE because trumps face just makes me instantly puke and I am so sad that I just can’t go through the app without having to see his hideous face. Anyways if u want to live a happy and healthy life... DONT download this app because you will get sick and maybe even die :)","date":"2020-07-09T08:40:23Z","rating":1,"isEdited":false,"userName":"mel.ihatetrump"}},{"id":"6175735016","type":"user-reviews","attributes":{"title":"Don’t get this app","review":"I wouldn’t get this app if I were u. Getting this app will cause soooooooooo many problems. 1. You’re phone will start to glitch 2. Phone might crack from the human Cheeto some of y’all call a             “Great President” 3. This app took ten weeks to download. That was just a few problems, but trust me when I say u DON’T want to download this app. I would tell u the rest of the problems, but I don’t want to traumatize u.","date":"2020-07-09T08:33:44Z","rating":1,"isEdited":false,"userName":"Believe me on the review"}},{"id":"6175669776","type":"user-reviews","attributes":{"title":"Ruined my life!!!!","review":"When I got this app, I immediately started feeling like I was going insane! I constantly was throwing up, I was tripping on my foot with every step I took, and I even broke every bone in my body!!! This app is pure evil and nobody should have to go through what I went through. :(( all the negative things I was experiencing cut through me and killed me. Don’t download this app if you don’t want to die. I’m warning you!!!","date":"2020-07-09T08:11:31Z","rating":1,"isEdited":false,"userName":"šmälłhåńds"}},{"id":"6175640986","type":"user-reviews","attributes":{"title":"Tiktok Lives","review":"Honestly the fact that this app makes you put in your phone number to even use it is disgusting! The picture of the orange looking man hold his fist in the air kind like a natzi sign is even worse I thought this app was like a game but turns out it’s just a scary nightmare! The app was dumb slow and I really don’t appreciate it crashing every 5seconds maybe you should just remove the whole app","date":"2020-07-09T08:01:23Z","rating":1,"isEdited":false,"userName":"dgavva"}}]}