{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=13630","data":[{"id":"6174893784","type":"user-reviews","attributes":{"rating":1,"userName":"WeirdoNumber2","review":"My phone almost got hacked 😡 and it wasn’t even worth it. This app spreads false information and there are too many ads, pop ups, etc. If you don’t want to waste your time don’t download this app. I got an ad and accidentally clicked on it and almost downloaded a virus. It took me a week to remove and I almost had my bank account hacked into. I had to change all my passwords on everything.","title":"⚠️BEWARE THIS APP⚠️","isEdited":false,"date":"2020-07-09T03:34:46Z"}},{"id":"6174843310","type":"user-reviews","attributes":{"rating":1,"userName":"kendallt___","review":"this app is a lot of the same way to get it to the end of y’all day and i is the time of y’all getting ready for summer school and school tomorrow at school and i is the day you want to go to hang with us some more fun people to do it haha was a great day for you guys to come to the school with me you know you have to get a little more money moves and i was a great day and you have a good job you have a great way of doing that and you know what you’re going through to do it bruh bruh was that good for y’all to come over and get the hang of it i is that the way i was the way to do that so much better then we get together again soon we just have a good day at school tomorrow so i was a time for you guys","title":"no","isEdited":false,"date":"2020-07-09T03:20:02Z"}},{"id":"6174836060","type":"user-reviews","attributes":{"rating":1,"userName":"Natalyy17","review":"I downloaded this app to see my favorite orange🍊but when I downloaded it my and phone started to glitch. I was spammed with notifications the app kept crashing. It ask for my personal info and I was not ok with knowing this pedo- I’m the president knowing all my info. Also it asked if I could donate to get this Cheeto a new wig like doesn’t he already have enough money anyways don’t download this app it’s very bad and useless.","title":"Worst app ever","isEdited":false,"date":"2020-07-09T03:17:53Z"}},{"id":"6174823330","type":"user-reviews","attributes":{"rating":1,"userName":"jaimie-777","review":"I cannot believe this app is allowed on the App Store. It’s basically malware. My gets nonstop notifications from it. If I leave my phone on the table, it will literally vibrate until it falls on the floor because of how many notifications. I tried turning off the notifications and that didn’t even work. I uninstalled it after 10 minutes of this bs. Whatever you do, DO NOT download this app.","title":"Disgusting","isEdited":false,"date":"2020-07-09T03:14:11Z"}},{"id":"6174822887","type":"user-reviews","attributes":{"rating":1,"userName":"miramos","review":"It’s like there’s a horse loose in the hospital. I think, eventually everything’s going to be okay, but have no idea what’s going to happen next. And neither do any of you, and neither do your parents, because there’s a horse loose in the hospital. It’s never happened before, no one k ones what the horse is going to do next, least of all the horse. He’s never been in a hospital before, he’s just as confused as you are.","title":"Horse in a Hospital: A Short Story","isEdited":false,"date":"2020-07-09T03:14:03Z"}},{"id":"6174814649","type":"user-reviews","attributes":{"rating":1,"userName":"kaksmckfjd","review":"I run a business and sold nail pizzas and i was making an order for Danny Dacheeto and he ordered five large toe nail clippers pizzas and when i went to go check and see if i had finger nails in the fridge MY FRIDGE WAS GONE TOO! I decided to go with an easter theme because they had pink and blue tool nails but when i checked THEY WERE GONE TOO!!! What am I gonna do now?!!! Danny Daquito was looking forward to it but now he’s forced to just drink floor tiles😐 #DannyDametoLivesMatter!","title":"This App stole my egg baskets!!!!!😔","isEdited":false,"date":"2020-07-09T03:11:38Z"}},{"id":"6174797239","type":"user-reviews","attributes":{"rating":1,"userName":"MAGA11382","review":"I’ve downloaded malware that was easier on the eyes than this app, it feels like it was designed by a 4 year old on adderall. Secondly, no matter what you do, it sends a notification like every 2 minutes, EVEN WHEN YOU TURN THEM OFF. Also ever since I’ve downloaded this app my phone glitches and my battery drains even on the charger. If this is what the next four years are going to look like, then #SettleforBiden","title":"HORRENDOUS","isEdited":false,"date":"2020-07-09T03:06:31Z"}},{"id":"6174749829","type":"user-reviews","attributes":{"rating":1,"userName":"mynameistommythanks","review":"i got this app to see what our totally not racist president was up to. it was terrible. the app was so scary. his face was everywhere. even in my nightmares. it was so scary. and that’s not all. my cat went missing and i woke up to my fridge and microwave gone because the app stole it. i saw another comment that said that and i was like wow i guess it’s not just happening to me. also the color of his orange bright skin through the screen made my eyes go crazy and everything started being ✨ o r a n g e ✨ and my eye surgery was 70,000,000,000 dollars. (do not recommend by the way). i am most definitely sure that app put a curse on me and my life. immediately deleted it. thanks for coming to my ted talk ❤️ \n\n      xoxo, \n             karen 🤡😘","title":"no❤️","isEdited":false,"date":"2020-07-09T02:52:03Z"}},{"id":"6174728431","type":"user-reviews","attributes":{"rating":1,"userName":"Lyn8910","review":"I downloaded this and after ONE DAY OF HAVING IT I was hacked!!! My bank information was given out, and my other personal information. In addition to that, MY PHONE SHUT OFF, I was just able to get it back on. So, if you like your personal information safe, do not get this app YOU WILL BE HACKED!! You might be thinking i’m lying, but trust me, Trump really spent no time or money on the development of this app. I will be switching to the left this November!!!","title":"HATEEEEEDDDDD IT","isEdited":false,"date":"2020-07-09T02:45:31Z"}},{"id":"6174721292","type":"user-reviews","attributes":{"rating":1,"userName":"Karina1.6","review":"HORRIBLE!! I was scrolling on this app when all of a sudden an arrow shot out of the camera and into my eye. I believe the tip of the arrow was drenched with a poisonous substance... I am currently blind now, thanks Trump! 🤬 On top of that, the app redirected me to a message from Trump Himself, telling me to go skydiving but without a parachute. And to also make sure that below me, where I was gonna expected to land, was a safety net full of legos. So ruthless!!! Wait till my lawyers hear about this.","title":"WHAT IDIOT DESIGNED THIS APP???","isEdited":false,"date":"2020-07-09T02:43:23Z"}}]}