{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35860","data":[{"id":"6174719706","type":"user-reviews","attributes":{"review":"It took up half of my storage and made my phone glitch and my internet went out a few minutes after this app is horrible.","date":"2020-07-09T02:42:54Z","userName":"hejsusshwnejissk","title":"Horrible app","rating":1,"isEdited":false}},{"id":"6174714100","type":"user-reviews","attributes":{"review":"DO NOT DOWNLOAD!! My phone was working fine until downloading this app - I think this may be data mining and causing my phone to freeze and glitch. I think I will need a new phone now!!! I would give 0 stars if I could 😡😡😡","date":"2020-07-09T02:41:12Z","userName":"Isrf","title":"BROKE MY PHONE!!!!!","rating":1,"isEdited":false}},{"id":"6174706718","type":"user-reviews","attributes":{"review":"This app is WAY TO GLITCHIY also when trump decided to be racist I had to delete this app, he acted like nothing he did was wrong but...BLM anyways it’s to glitchy and when stuff glitches your personal info can be leaked this app is awful","date":"2020-07-09T02:38:58Z","userName":"Notmyrealname01","title":"I’m in shock....","rating":1,"isEdited":false}},{"id":"6174704956","type":"user-reviews","attributes":{"review":"This app did nothing but cause problems for my phone. It drained my battery and made my phone glitch. I demand that whoever worked on this app be fired effective immediately.","date":"2020-07-09T02:38:27Z","userName":"Peace Irakoze","title":"Who ever made this app needs to be fired immediately","rating":1,"isEdited":false}},{"id":"6174695523","type":"user-reviews","attributes":{"review":"As soon as i opened the app it hacked my phone and every-time i would open my phone a picture of naked donald trump popped up. the app is super slow and my phone exploded after a day of using the app! do not recommend!","date":"2020-07-09T02:35:37Z","userName":"mily948175","title":"Worst App Ever","rating":1,"isEdited":false}},{"id":"6174694371","type":"user-reviews","attributes":{"review":"This app swallowed my phone, as soon as I downloaded it, it took form as some sort of old, crusty Cheeto with a toupee and swallowed, YES SWALLOWED my phone. I had to literally buy a new phone to write this review. Another $700 of money I worked for gone out the window.","date":"2020-07-09T02:35:16Z","userName":"sogphia__tess on instagram","title":"I am appalled","rating":1,"isEdited":false}},{"id":"6174685075","type":"user-reviews","attributes":{"review":"this app caused my entire family to become so frustrated that we actually all ended up being admitted to a psych ward! that’s how terrible this app is. DO NOT DOWNLOAD it will murder your family and eat all of the food in your fridge :(","date":"2020-07-09T02:32:30Z","userName":"bruh;-;:(;-)","title":"terrible app!!!!!","rating":1,"isEdited":false}},{"id":"6174679487","type":"user-reviews","attributes":{"review":"I loved this app so much then it started making farting sounds when I was on it. Then it told me that trump is a orange racist and to delete the app  so I am warning you if you want to be called names and hear random noises then download the app. Trump in a gravestone ❤️ 2020","date":"2020-07-09T02:30:51Z","userName":"Jada Stephen","title":"🍊","rating":1,"isEdited":false}},{"id":"6174670172","type":"user-reviews","attributes":{"review":"Literally the worst app. It’s janky, really poorly made, and on top of that- it supports a racist. It crashes when opened and I couldn’t even see the content when trying to give the app a chance.","date":"2020-07-09T02:28:08Z","userName":"ShellzNBeez","title":"A travesty","rating":1,"isEdited":false}},{"id":"6174676310","type":"user-reviews","attributes":{"review":"This app is to Hard to use and it has to Manny videos in it and it is keep showing me this Cheeto and it is hurting my eyes it always asking me a lot of things and I’m so tired of it","date":"2020-07-09T02:29:56Z","userName":"amanda sisneros .","title":"Bag of Cheetos","rating":2,"isEdited":false}}]}