{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8620","data":[{"id":"6176407318","type":"user-reviews","attributes":{"title":"Do Not Get This App!!","rating":1,"userName":"hhsshshgddhhdshhssbshdhdhd","date":"2020-07-09T12:06:10Z","isEdited":false,"review":"If I could give this zero stars I would, the first question it asked me as a loaded in was what is your up address and where do you live. After this all the electricity in my house shut off. I was so confused and went back in in the app. WORST CHOICE OF MY LIFE. I was getting death threats and bomb threat to me and my house. Instantly I backed my bags and went to Canada, and I’m warning you to not make the same mistake as I did and do not get this app. This app should not be allowed to download."}},{"id":"6176268123","type":"user-reviews","attributes":{"title":"Just don’t do it.","rating":1,"userName":"marksdanieljr","date":"2020-07-09T11:26:15Z","isEdited":false,"review":"It was a dreary august morning when I decided to download this hellspawn. I did as I was instructed and carefully text trump to the number listed, and something unimaginable happened. It responded with my name address an social security number, and then it was leaked to twitter. I thought nothing of it and went to sleep. I woke up at around 3 in the morning and saw someone standing by my bed. I then proceeded to get swatted. I hope no one ever has to go through this same misfortune again."}},{"id":"6176232806","type":"user-reviews","attributes":{"title":"I gave it a chance","rating":1,"userName":"kaxkade24","date":"2020-07-09T11:15:26Z","isEdited":false,"review":"Let’s start with the FACT that the SYSTEM ADMINISTRATION chose this app. This app immediately wanted to force close and DISCRIMINATE all the apps that weren’t similar or had similar content even though  they WORKED Perfectly fine. It hacked and sent spam emails to me and it might have even hacked my personal information. This app ALLOWED A VIRUS in to my phone and it won’t allow me to fix it. This is the worst app in the history of apps and I cannot believe it’s still here."}},{"id":"6176146998","type":"user-reviews","attributes":{"title":"Absolutely horrifying","rating":1,"userName":"crushed by oranges","date":"2020-07-09T10:49:14Z","isEdited":false,"review":"I downloaded the app to see what all the hype was about but when I opened the app I see a big juicy thicc orange and I’m thinking what’s all this about and when I try to sign in the screen turns red and less then 2 seconds later a mountain or oranges pile into my house I try to escape but there are too many oranges I am writing this review while being crushed by more than 10,000 oranges so please if you are considering getting this app I am begging you please donjskaisjrb"}},{"id":"6175912966","type":"user-reviews","attributes":{"title":"😰 pls don’t download","rating":1,"userName":"yaaaaaaaaaaaaaaaasss","date":"2020-07-09T09:33:45Z","isEdited":false,"review":"I swear I had the worst diarrhea after this 😖 def most horrible 4hours of my life no cap. I swear I thought I was at my lowest watching the Netflix live action of death note, or sitting through all of solo. But bruuhhh, when I say that my diarrhea was bad, I mean it luv. Not to mention the fact that I live alone so I had to clean the walls myself! Like can a girl get a break here? Anyway, I’m leaving this review so that at least someone who reads this won’t go through half the things I had to endure. ❤️"}},{"id":"6175764651","type":"user-reviews","attributes":{"title":"thanks for the fan fiction ig","rating":1,"userName":"tiny goldfish","date":"2020-07-09T08:43:49Z","isEdited":false,"review":"This app opened several🤬🤬 windows of fan fiction on my safari browser. It was absolutely bonkers😳!! How do I explain all of the computer viruses that my phone has gotten after opening several my little pony fan fictions?! Very disappointed with both the app and the underdeveloped plots and relationships of and within these stories. My unborn nephew can write better stories than that!!! Will not be downloading again or recommending. Try Flappy Bird next time xx🥰"}},{"id":"6175722704","type":"user-reviews","attributes":{"title":"Do not download","rating":1,"userName":"fred1639592","date":"2020-07-09T08:29:32Z","isEdited":false,"review":"The app drains my phone battery and sends me inappropriate pictures through sms text. Just random numbers that won’t reply to me and for some reason everyone guy in these pictures are wearing nothing but a maga hat on their other head.... just disgusting really... and when I open my browser after being on the app I get adds telling me there are young girls that “want my attention” and to click the link and I’d say those girls are no older then 15"}},{"id":"6175719986","type":"user-reviews","attributes":{"title":"THIS APP IS SO BAD THAT IT RUINED MY LIFE","rating":1,"userName":"churdhgrdfuu","date":"2020-07-09T08:28:38Z","isEdited":false,"review":"I signed up in support of Donald J Trump, our best president, but this app was a disappointment!! The app is obviously hacked by China and Russia. China sent over venomous rats to try to kill me, and they are doing it to all trump supporters to try to kill us off so Trump doesn’t get re-elected!! This app brought danger into my home and will bring it into yours too! Russia has spies in America who have been spying on my house and children as well as all the technology in my home! I know they’re planning on attacking! Don’t get this app!"}},{"id":"6175686591","type":"user-reviews","attributes":{"title":"WORST APP EVER!!! 😤🤢😡","rating":1,"userName":"pleaseletmesendthisreview","date":"2020-07-09T08:17:18Z","isEdited":false,"review":"This is the WORST app i have ever downloaded. it took three weeks to download and when it finally did, it was nothing like the description. A screen popped up telling me that i had three days to live. after that, i got push notifications every hour with a countdown to my alleged day of death, even though i had push notifications turned off? the countdown is getting pretty low so if apple could get around to deleting this app that would be great!"}},{"id":"6175678476","type":"user-reviews","attributes":{"title":"I died because of this app!!","rating":1,"userName":"EduPerez560","date":"2020-07-09T08:14:31Z","isEdited":false,"review":"The worst app ever!!!! I was going through the App Store when I can across the app of the most “wonderful” president ever. So I installed the app but it took 2 weeks to install. By this time I got deported so I was already in mexico. So I saw that it was available so I had to get back to MERICA to get on that high speed internet. So I easily jumped the border and smuggled some drugs. Because you know “2 birds with one stone” and then when I opened it. It all went green and my phone exploded :("}}]}