{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=73220","data":[{"id":"6178321255","type":"user-reviews","attributes":{"rating":1,"review":"This app is very offense , i do not support this at all!!!! The app makes our nation look horrible. THIS APP NEEDS TONE TAKEN DOWN NOW!!","isEdited":false,"title":"Disgutsing app!!😡","date":"2020-07-09T21:34:54Z","userName":"CynZaz"}},{"id":"6178281523","type":"user-reviews","attributes":{"rating":1,"review":"This app is a joke. A developer nightmare. I don’t know who made it, but they should quit programming.","isEdited":false,"title":"Bad","date":"2020-07-09T21:20:19Z","userName":"Jesssimar"}},{"id":"6178276272","type":"user-reviews","attributes":{"rating":1,"review":"Trump shutting down TikTok? Ok that’s bad he is racist? Ok he is sexist? Ok he don’t believe in climate change? Oh it’s on, spam 1 star NOW!!!","isEdited":false,"title":"Do Not Use This","date":"2020-07-09T21:18:24Z","userName":"Guytwins"}},{"id":"6178275395","type":"user-reviews","attributes":{"rating":1,"review":"This app is horrible I’m very disappointed","isEdited":false,"title":"Horrible","date":"2020-07-09T21:18:04Z","userName":"Cat022707"}},{"id":"6178269706","type":"user-reviews","attributes":{"rating":1,"review":"If you are going to try and get tik tok down, you messed with the wrong generation🧚‍♂️🧚‍♂️🧚‍♂️","isEdited":false,"title":"Worst app","date":"2020-07-09T21:15:58Z","userName":"henry12396"}},{"id":"6178265169","type":"user-reviews","attributes":{"rating":1,"review":"this app is awful! nothing works! anytime i would open this app around my bunny is would start to go crazy i do not recommend this horrible app!","isEdited":false,"title":"awful","date":"2020-07-09T21:14:17Z","userName":"mike who chesse hairy"}},{"id":"6178251877","type":"user-reviews","attributes":{"rating":1,"review":"This app is trash just like its owner and creators. You cannot support dump without being a raging racist full of hate for humanity.","isEdited":false,"title":"T R A S H 🗑","date":"2020-07-09T21:09:28Z","userName":"818meets703"}},{"id":"6178244348","type":"user-reviews","attributes":{"rating":1,"review":"this app is seriously the WORST ever!! it is so useless, crappy, and stupid! i feel bad fo the tech team that went out of their way to make this piece of trash that you call and app. i was seriously looking forward to looking at whatever this is even useful for, i was so excited for it to take up space on my phone for absolutely no reason but was disappointed. the app is really dumb like why did anyone even make this? i mean at least the person or people who made it got paid but that is all. this app also looks really ugly, like seriously who is that overly tan guy i keep seeing everywhere and why does he want to know my personal info??i am NOT going to give him any money, does he like little children or something because he really won't stop asking what my social security number is! how ANNOYING, you should change the apps mascot into something more appealing, like a cute puppy! okay but can anyone tell me what this app is ever actually for? is it like to read the news about that president guy or whatever? he is kinda lame and reallyyyy repetitive. he never answers my questions about the app or if he knows when we can go back to school in august. i'm seriously wondering who made this HORRIBLE app, i really think it should be taken down or something, it might be unsafe for kids! it's rated for 17+ and seriously that's really sketchy, it's just some dumb political app that has ABSOLUTELY no use what so ever. why not just take it off the app store so no one else is tricked into downloading this GROSS app. i am seriously sick every time i even open up the app (granted i've only opened it once and that was for like three seconds because i opened it after if finished loading) but anyways, the app creators should rethink the whole look because the app itself is UGLY and a hugeeee scam just to track us down wherever we go. the government is always spying on us this is just their new form of tech they're trying out. i think our government should leave us alone and stop watching everything we are doing at all times, it's getting really annoying because i feel so unsafe! maybe the app should be reused for something more fun, like a new Temple Run game or something, that game was always really fun as a kid. so if you are thinking about downloading this app, just don't do it!! unless you are gen z and only downloading it to leave a bad review or something but that would be a crazy idea, no one would ever be dumb enough to try and do that. this was a serious review on myHATRED for this dumb, stupid, trashy app!","isEdited":false,"title":"HORRIBLE","date":"2020-07-09T21:06:44Z","userName":"Vonnie8623"}},{"id":"6178225627","type":"user-reviews","attributes":{"rating":1,"review":"this app is horrible and it spams 24/7 very annoying and very inconvenient. this app is not needed for anyone (we will avenge tiktok)","isEdited":false,"title":"THE WORST APP EVER","date":"2020-07-09T21:00:00Z","userName":"avenge tiktok"}},{"id":"6178224041","type":"user-reviews","attributes":{"rating":1,"review":"This app could be better, decided to delete it.","isEdited":false,"title":"App review","date":"2020-07-09T20:59:27Z","userName":"haaylee92"}}]}