{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=87890","data":[{"id":"6173582761","type":"user-reviews","attributes":{"title":"Get rid of the orange man!","rating":1,"date":"2020-07-08T20:14:22Z","isEdited":false,"userName":"heyzhsuhahsh174773","review":"Why is there an orange man on the app? He looks like a clown! Orange and all. He scares me. Definition of global clowning."}},{"id":"6173563268","type":"user-reviews","attributes":{"title":"yeah ❤️","rating":1,"date":"2020-07-08T20:07:38Z","isEdited":false,"userName":"emma chirac","review":"There are no words needed to explain how terrible this app is. I hate it! ✨😼✨"}},{"id":"6173561352","type":"user-reviews","attributes":{"title":"My Review","rating":1,"date":"2020-07-08T20:06:58Z","isEdited":false,"userName":"chickenbutt6040","review":"This app is so terrible first it glitched my phone and now it has a virus DO NOT DOWNLOAD I REPEAT DO NOT DOWNLOAD worst mistake.....🍊"}},{"id":"6173544188","type":"user-reviews","attributes":{"title":"dreadful","rating":1,"date":"2020-07-08T20:01:11Z","isEdited":false,"userName":"jdog013301","review":"the worst app i've ever downloaded. makes me cry even thinking about it. -10/10 would not recommend bunker boy's app"}},{"id":"6173534895","type":"user-reviews","attributes":{"title":"Eww","rating":1,"date":"2020-07-08T19:58:03Z","isEdited":false,"userName":"bracccceeeeettt","review":"Worst app ever if I could give below a 0 I would"}},{"id":"6173523557","type":"user-reviews","attributes":{"title":"Unbelievable","rating":1,"date":"2020-07-08T19:54:07Z","isEdited":false,"userName":"Dxddyblesiv","review":"I’m absolutely shocked at how bad this app is. 1. It took to long for this app to load. I SIMPLY WONT DEAL WITH THIS NONSENSE. \n ONE STAR"}},{"id":"6173505778","type":"user-reviews","attributes":{"title":"This app is run by a rapist","rating":1,"date":"2020-07-08T19:48:01Z","isEdited":false,"userName":"ewww'","review":"So because the trumpets are gonna report this I’m going to be brutally honest. Everyone who supports trump is supporting a child rapist on top of a racist sexist man child who can not even form a proper sentence without contradicting himself or his cabin. I would like everyone who supports him to re-evaluate and look and see that you are on the side of the abuser as well as a man who has made an extreme amount of inappropriate comments to women and POCs. YOU are apart of the problem, you are supporting a white supremacist which basically means you are a white supremacist and no I’m not taking anything out of “context” because even with context it is still disgusting and horrible. Supporting him is supporting systematic racism and abuse in this country and under trumps administration he has broken the peace treaty between indigenous tribes and the put children in cages and many have died due to both of those injustices. On top of all that trump is homophobic and just recently passed a law that puts restrictions on same sex couples adopting so trump pretty much feels better with kids in the system than with a living same sex couple. Last but definitely not least trump supporters your only argument is that liberals and Democrats are just children who have zero stable points in their defense but in all actuality that’s trump supporters their only argument is trump 2020 if you have actually valid points I would live to hear them but I haven’t heard any truly well formulated arguments to why I should support trump so please educate me on why we should let a man who encourages systematic racism and sex abuse as well as homophobia to be in office for another 4 years. Thank you for reading why your president (because i will never see him as my president) is a pompous douche bag."}},{"id":"6173489943","type":"user-reviews","attributes":{"title":"Terrible","rating":1,"date":"2020-07-08T19:42:37Z","isEdited":false,"userName":"Nghbghgfdfrgfrvf d vf vfrgtrt","review":"I was excited to support our orange Cheeto racist president ✨🧚🏼‍♀️but was dissapointed when the app was HORRIBLE 😡"}},{"id":"6173481957","type":"user-reviews","attributes":{"title":"Terrible app","rating":1,"date":"2020-07-08T19:39:50Z","isEdited":false,"userName":"Ilovemyboo","review":"Roses are red\nViolets are blue\nI used to love Cheetos \nUntil I saw you 🥰✨🧚‍♀️🌈\nIf you vote for trump you need help ❤️"}},{"id":"6173477752","type":"user-reviews","attributes":{"title":"Horrible","rating":1,"date":"2020-07-08T19:38:23Z","isEdited":false,"userName":"12348682819495929","review":"This App is so glitchy"}}]}