{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26300","data":[{"id":"6178009779","type":"user-reviews","attributes":{"userName":"uhdeetee","title":"NOT a postmates for hot cheetos!!","isEdited":false,"rating":1,"review":"I saw the image on the app and I thought I had finally found a home delivery service for cheetos. As an avid cheeto eater, I was elated to see my dreams come to fruition...BUT this app is NOT for food! Apparently it’s for the cheeto in office... horrible confusion. 0/10 wouldn’t recommend. Deleted right away. Going back to postmates.","date":"2020-07-09T19:47:13Z"}},{"id":"6177994319","type":"user-reviews","attributes":{"userName":".Su_Su.","title":"I got viruses and hacked","isEdited":false,"rating":1,"review":"When I opened up this app it took me str8 to a XX website. I didn’t know if it was the app so I double checked and when I opened it back up there was a free $1000 ad, I thought I was getting money but instead I got 35 viruses!!! Why did this app creator do this to my phone 💢","date":"2020-07-09T19:42:11Z"}},{"id":"6177986276","type":"user-reviews","attributes":{"userName":"FAIRIEZ ✨🧚✨","title":"HORRIBLE 🧚✨","isEdited":false,"rating":1,"review":"As soon as I got on this app my whole entire phone just restarted. I had to download all of my other apps. And it took me hours to do that. I lost everything in my notes and they were very important. I can’t believe this. This app is despicable and disgusting.","date":"2020-07-09T19:39:31Z"}},{"id":"6177978855","type":"user-reviews","attributes":{"userName":"addyisdumb101","title":"💔yeehaw💔","isEdited":false,"rating":1,"review":"When I was downloading this app, I expected some good news from Trump. As soon as I opened up the app, my phone crashed. I opened it up again, got a bit more farther, and my phone crashed AGAIN. I am very disappointed. This app is useless, please get it taken down.","date":"2020-07-09T19:37:08Z"}},{"id":"6177914721","type":"user-reviews","attributes":{"userName":"trump can choke","title":"Horrible","isEdited":false,"rating":1,"review":"This app is for ignorant children, I can smell the white people with sunglasses and American flags on their cars who watch Fox News and think they’re not racist just cause their friend is black they breathe and think they’re the best... narcissistic. grow up. Black lives matter. Health care is a human right. No human is illegal on stolen land. Separation of church and state.","date":"2020-07-09T19:16:13Z"}},{"id":"6177883641","type":"user-reviews","attributes":{"userName":"ValGisselle","title":"Just a buggy App","isEdited":false,"rating":1,"review":"I really wanted to use this app to keep up to date with the campaign. It constantly crashes on me and when I am able to get on it, it drains my battery faster than any other app ever has. I would not recommend.","date":"2020-07-09T19:06:01Z"}},{"id":"6177879006","type":"user-reviews","attributes":{"userName":"sam nickins","title":"Trash","isEdited":false,"rating":1,"review":"Barely even works wanted to see Donald trumps plans but no text even popped up. I closed the app and waited the next day to see if it worked. When I opened it up the app just crashed. I tried again and still didn’t even work. This is trash","date":"2020-07-09T19:04:32Z"}},{"id":"6177875813","type":"user-reviews","attributes":{"userName":"MEOW Gang Member","title":"DONT GET THIS APP","isEdited":false,"rating":1,"review":"Ok I got this app because I actually wanted to see what this kid who thinks he’s a president is doing to our society. But I can’t even open the app before it crashes on my phone. I try to sign but it crashes and makes my phone all glitchy. Please don’t get this app it’s horrible.","date":"2020-07-09T19:03:31Z"}},{"id":"6177865277","type":"user-reviews","attributes":{"userName":"Redwings74","title":"Take down tiktok we take down ur apps too","isEdited":false,"rating":1,"review":"Ok so I did first do this for tiktok but when I downloaded it nothing worked like the app glitched and literally everything was whacked . Also if y’all wanna take down  tiktok we ain’t going without a fight 😤 gen z didn’t come all this way for nothing","date":"2020-07-09T19:00:16Z"}},{"id":"6177864812","type":"user-reviews","attributes":{"userName":"Peeps_123","title":"Worst app ever","isEdited":false,"rating":1,"review":"Seriously every little notification was just annoying it seemed like I was getting one every five minutes. I mean come on we know the Cheeto can’t be doing that much. Plus if we needed to know what was happening we have the news","date":"2020-07-09T19:00:07Z"}}]}