{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=81750","data":[{"id":"6172486437","type":"user-reviews","attributes":{"rating":1,"review":"This app had me disappointed\n\nThat’s all😘","userName":"arayofsunshijww","date":"2020-07-08T14:32:17Z","title":"This is not it!","isEdited":false}},{"id":"6172482552","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app to stay updated with our president’s re-election campaign, but I soon realized that was a HUGE MISTAKE. Firstly, the app took roughly around 2.5 hours to download. This was a RIDICULOUSLY long wait when compared to other apps I’ve downloaded in the past that at max took 5 minutes to finish downloading. Finally, once the download was completed, I attempted to put in my information so that I would begin to receive campaign info/updates, however, once my information was registered, I received an INVASION OF PRIVACY. Somehow this app managed to hack all of my social media accounts and my other apps. My Instagram, Twitter, Snapchat, and Tik Tok accounts were all taken over, and you can tell that someone had been looking through my personal information. Then soon after, my other apps started to glitch. Whenever I would tap on an app, the screen would go black and it would kick me out. I was unable to call, text, FaceTime, or email anyone for 3 days, ALL OF MY COMMUNICATION WAS SHUT OFF. This was because just like my other apps, I would tap on them and they would immediately kick me out. Someone was looking through my text messages, my emails, my caller history, and STRIPPED ME OF MY CONSTITUTIONAL RIGHT to privacy! I feel violated, betrayed, confused, and overall hurt that this happened. I’ve only just now gained access to my apps and still am unsure as to who is watching me. If you download this app, take caution, and know that you might have just made a tremendous mistake. I advise against going anywhere near this app for your SAFETY!","userName":"Keightlynn Baskin","date":"2020-07-08T14:31:14Z","title":"DO NOT GET THIS APP","isEdited":false}},{"id":"6172461944","type":"user-reviews","attributes":{"rating":1,"review":"I’m tired of this problematic presidency. I’m done with America’s stupidity, ignorance, and racism. Anyone who follows Trump is blind and dumb. WAKE UP PEOPLE","userName":"ampkayakr","date":"2020-07-08T14:25:44Z","title":"0 Stars for Stupid Orange Man","isEdited":false}},{"id":"6172440389","type":"user-reviews","attributes":{"rating":1,"review":"Bayeeees sometimes I don’t wanna be happy don’t hold It against me","userName":"✨🥑⚡️","date":"2020-07-08T14:19:55Z","title":"Do not get this app","isEdited":false}},{"id":"6172436502","type":"user-reviews","attributes":{"rating":1,"review":"All I was doing was I was looking on Tik Tok and than and orange 🍊 Cheeto would be there instead 😩","userName":"pandao-o","date":"2020-07-08T14:18:50Z","title":"Terrible😩","isEdited":false}},{"id":"6172435799","type":"user-reviews","attributes":{"rating":1,"review":"This president has nothing good to offer this country. He fails to protect the people and there rights.","userName":"AR0328","date":"2020-07-08T14:18:39Z","title":"GenZ","isEdited":false}},{"id":"6172386451","type":"user-reviews","attributes":{"rating":1,"review":"Delete please , and please take Donald with you","userName":"mexicancrossboarder","date":"2020-07-08T14:05:23Z","title":"Most racial discriminating app","isEdited":false}},{"id":"6172374260","type":"user-reviews","attributes":{"rating":1,"review":"I have never felt more ashamed to have an app more than this one. It felt like I had disrespected my own phone for having that on my home screen. And they have the audacity to ask for my phone number when they have no right to. I’m sorry but this is an absolute disgrace like the president trump. And yes I know I lowercased his name and tittle due to the simple fact that he deserves no respect for attacking everyone who isn’t the white, straight, male. He can’t run a country properly to begin with how do you think the US got so screwed when corona came? Because he can’t do anything but divide a country and try to control the narrative of the story to make it seem like there was no other way. When he could’ve saved thousands of lives if he didn’t believe it was just Chinese propaganda. But no this orange thinks he has the right to say that all because he wants a reason to attack China. He also can’t take a joke. We reserve tickets to his rally and we forget we all have plans. I’m sorry I had to take my pet whale on a walk for the entire week. But no he over reacts and blames us for everything, talk about snow flake much. Also he apparently has the right to insult everyone and not get backlash but just praise like were brainless idiots. Like trump supporters. Come on guys do you really need to wear trump 2020 on a shirt, hat, pants, flag, and basically every surface known to humanity. My point is that this is the most stupid and useless app I’ve ever seen. If I could rank it less than one star I would.","userName":"Anonymous 50733","date":"2020-07-08T14:02:09Z","title":"Disgusting","isEdited":false}},{"id":"6172364757","type":"user-reviews","attributes":{"rating":1,"review":"I hate it don’t wanna see this app again","userName":"RaeKyMadMil","date":"2020-07-08T13:59:34Z","title":"Hate it","isEdited":false}},{"id":"6172362374","type":"user-reviews","attributes":{"rating":1,"review":"This app does not make america great.","userName":"anna5687","date":"2020-07-08T13:58:55Z","title":"disappointed","isEdited":false}}]}