{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=32080","data":[{"id":"6177054813","type":"user-reviews","attributes":{"date":"2020-07-09T14:59:30Z","rating":1,"review":"it’s no question of relatability that right after i downloaded this app, i started getting these horrible headaches and fogs of memory. upon being admitted into the emergency room, i was diagnosed with a rare form of necrotic bacteria that the doctors believe came from the app itself. i’m now writing this from my deathbed, and my nurse is checking my spelling and grammar since i have forgotten basic mathematics. if you value your life, don’t download this app.","title":"this app gave me necrotic brain bacteria.","userName":"donald trump did this","isEdited":false}},{"id":"6177036530","type":"user-reviews","attributes":{"date":"2020-07-09T14:54:31Z","rating":1,"review":"I got this app in hopes of supporting our favorite orange sexist but it took DAYS to download and then it crashed every time I opened it!! Once I finally got it open it was just one screen with a homophobe on it!!! So offensive! My entire phone is slow now and I CAN’T DELETE THE APP!!! DO NOT DOWNLOAD IT IS SO BAD!!!!","title":"HORRIBLE","userName":"Katelyn Frey","isEdited":false}},{"id":"6177009220","type":"user-reviews","attributes":{"date":"2020-07-09T14:47:09Z","rating":1,"review":"I had actually looked into the app and have never been filled with so much disgust and disappointment. The future of America was in the hands of this man and im completely astonished. No wonder the United States is losing TO THEIR OWN PEOPLE. 0/10 would not recommend.","title":"DO NOT GET THIS APP","userName":"marskees","isEdited":false}},{"id":"6177007985","type":"user-reviews","attributes":{"date":"2020-07-09T14:46:49Z","rating":1,"review":"When I downloaded the app my microwave exploded and then when the notifications from the app came through, they slowly began cracking my phone's screen bc of the horrible, disgusting things they said. -0/10 don't recommend✨","title":"WORST APP EVER CREATED","userName":"yuhhh get into it☺️","isEdited":false}},{"id":"6177005919","type":"user-reviews","attributes":{"date":"2020-07-09T14:46:16Z","rating":1,"review":"I downloaded this app because I’m a HUGE trump #KAG2020 am I right? Anyways it was TERRIBLE full of lies, full of spam and I kept getting notifications about joining the Russia spy organization and then I kept telling me to go back to my country like excuse I’m an American","title":"Complete disgusting","userName":"yali.x3","isEdited":false}},{"id":"6177000797","type":"user-reviews","attributes":{"date":"2020-07-09T14:44:54Z","rating":1,"review":"this app threatened my family and i. when i opened it up i was threatened by a man who had his fist up to put in my phone number “or else” i feel very unsafe and it is my constitutional right to not put my phone number anywhere. 😖😭😡","title":"AWFUL DO NOT DOWNLOAD😳🤯😡","userName":"🅱️ap","isEdited":false}},{"id":"6176986918","type":"user-reviews","attributes":{"date":"2020-07-09T14:41:07Z","rating":1,"review":"INAPPROPRIATE CONTENT!\n\nI can see why this app is rated for ages 17+. After opening this app for the first time, I was greeted to a horrific nude image of a possible foreign creature. I was absolutely disgusted at the horrendous pornographic content this app needlessly displayed. Apple, this app must IMMEDIATELY be removed from the App Store!","title":"User BEWARE! Mature content","userName":"213AMM","isEdited":false}},{"id":"6176970040","type":"user-reviews","attributes":{"date":"2020-07-09T14:36:32Z","rating":1,"review":"I thought the app was informational but it was basically just sending out mindless propaganda to people who can’t think for themselves, def made me less of a Trump supporter to realize he only has fans from doing mindless bs like this.","title":"Was not a fan :(","userName":"Asya_redhawks","isEdited":false}},{"id":"6176957183","type":"user-reviews","attributes":{"date":"2020-07-09T14:33:08Z","rating":1,"review":"After the app finally downloaded every time you open it or move this horrible app it makes my phone crash! I am currently just wondering who runs this app? Oh wait....\nhorrible app🥰🧚🏼","title":"Broke my phone","userName":"trumpshmump","isEdited":false}},{"id":"6176943482","type":"user-reviews","attributes":{"date":"2020-07-09T14:29:29Z","rating":1,"review":"The man behind this app is a horrible person! Racist and a rapist yet you want him to lead our country? He sexualizes women and children as young as five years old. If you support Trump you are just as bad as him! This app is spam and is a waste of storage. Don’t get.","title":"Awful","userName":"SsssssssssssppaMm","isEdited":false}}]}