{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=78270","data":[{"id":"6176367042","type":"user-reviews","attributes":{"userName":"keichenholz","title":"terrible app","date":"2020-07-09T11:54:59Z","rating":1,"isEdited":false,"review":"this app took 3 hours to download and once i finally got it going, it glitched my phone and kept quitting. will not be using it moving forward."}},{"id":"6176355819","type":"user-reviews","attributes":{"userName":"Claire194","title":"Pyramid scheme 😤","date":"2020-07-09T11:51:48Z","rating":1,"isEdited":false,"review":"This app is the worst!!!!  I can’t believe I fell for this pyramid scheme now all my money is gone"}},{"id":"6176345442","type":"user-reviews","attributes":{"userName":"JJIDslsl","title":"worse app ever!","date":"2020-07-09T11:48:53Z","rating":1,"isEdited":false,"review":"this app has to be on one of the worse apps ever! it took 17 days to download and i have good wifi. always trump is terrible and stealing our info if you download it🥺😔🙃"}},{"id":"6176321060","type":"user-reviews","attributes":{"userName":"megan🧚‍♀️","title":"a direct attack on my life","date":"2020-07-09T11:41:57Z","rating":1,"isEdited":false,"review":"This app took multiple weeks to download and as soon as I opened it my phone caught on fire. I happened to have a bag of rice nearby so my phone survived and I was able to enjoy the app. I had only been scrolling through the app for a few seconds when a secret service agent broke down my door, punched me in the face, and called me ugly. He then proceeded to steal my dog and kidnap my whole family. He told me the only way I could get them back was by voting trump 2020 which is problematic because I am in fact too young to vote and thought the app would be a good way to support without voting. The age rating for the app is 17+ so me (along with many other young supporters) are now without families and unsure of how to get them back when all we wanted to do was support trump despite being too young to vote. When attempting to contact the white house in order to find a solution I revived a letter that said “you are useless and will lose your right to oxygen if you don’t vote trump 2020.” I was never aware that oxygen was controlled by the government but it seems an awful lot like a death threat to me. I have heard people discuss going to the extreme of getting a fake ID so they are able to vote and save themselves and their family but I’m sure the president would not want this as it would cause huge voter fraud. I ask that the government to release my family and the families of many other young supporters who downloaded this app. As for those considering installing this app: don’t do it. It is a threat to you and your family."}},{"id":"6176323332","type":"user-reviews","attributes":{"userName":"Maddogmagnusson","title":"5 stars","date":"2020-07-09T11:42:34Z","rating":5,"isEdited":false,"review":"5 stars all the way"}},{"id":"6176294129","type":"user-reviews","attributes":{"userName":"Yizzxyx","title":"Do NOT Download","date":"2020-07-09T11:34:03Z","rating":1,"isEdited":false,"review":"This app is just terrible. It promotes illegal and unjust things that  could poison the mind of  people.🤢"}},{"id":"6176253626","type":"user-reviews","attributes":{"userName":"gummy w0rm","title":"Horrible app do not get!!!!","date":"2020-07-09T11:21:48Z","rating":1,"isEdited":false,"review":"Realized this app is for a pig like no offense but why make a app about a farm animal idk kinda confused :/"}},{"id":"6176245532","type":"user-reviews","attributes":{"userName":"by:chriscruz","title":"It takes forever to Download","date":"2020-07-09T11:19:23Z","rating":1,"isEdited":false,"review":"It took decades to download bruh"}},{"id":"6176232435","type":"user-reviews","attributes":{"userName":"ohdarei","title":"Horrific","date":"2020-07-09T11:15:19Z","rating":1,"isEdited":false,"review":"Oh god i can’t believe this app is legal. the quality is terrible."}},{"id":"6176230739","type":"user-reviews","attributes":{"userName":"Imgreatthx","title":"Horrendous","date":"2020-07-09T11:14:49Z","rating":1,"isEdited":false,"review":"Took ages to download. Didn’t even endorse good politics. 0/5 if I could."}}]}