{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22100","data":[{"id":"6174586760","type":"user-reviews","attributes":{"review":"I sorry to say that this app it the WoRsT aPP you deserve nothiN you fungus’s lookin peace of my foot fungus rat thing I am sorry to say that I HATE you 😗✌🏽and that you are a racist sexist pesticide you should let Barron out of his cage that you put him , wait my sister just let me know that a butterfinger made this app!¡, and the app makes me mad just looking at the cover, drink infected pee Trump","title":"Hi miss orange dish soap","isEdited":false,"userName":"hello_eheh","date":"2020-07-09T02:04:27Z","rating":1}},{"id":"6174557301","type":"user-reviews","attributes":{"review":"this app is a DANGER, hunny. i got this app and when i opened it, i saw this orange blob on my screen and it scared me so bad that i jumped, fell, and got a concussion. I’m in the hospital now, and the nurses REFUSE to look at the source of my issue because they claim it’s too ugly to look at and they don’t want to end up in the same situation as me. this app is dangerous!! please avoid it at ALL costs","title":"DONT DOWNLOAD THIS APP","isEdited":false,"userName":"Lily Brennan","date":"2020-07-09T01:56:00Z","rating":1}},{"id":"6174554444","type":"user-reviews","attributes":{"review":"I opened it to see a nude picture of cinnamon hitler, and I soon realized that the app itself was deleting data off of my phone. Before I understood what was happening, my entire camera roll filled with pictures of Kermit the frog had been erased. DO NOT under any circumstances get this app.","title":"Literally the worst app I’ve ever seen in my life","isEdited":false,"userName":"sir this is a wendys","date":"2020-07-09T01:55:13Z","rating":1}},{"id":"6174552954","type":"user-reviews","attributes":{"review":"One day I was walking my goldfish then I came upon this app then I pressed it and I swore I saw a disfigured Cheeto puff I didn’t think nothing of it but then I saw other pictures HE MADE MY GOLDFISH DROWN he made me hide in my microwave this app will make you unable to see and unable to hear this app will TRAUMATIZE you YOU WILL REGRET DOWNLOADING IT.  It will make your dog want to become a cat it’s horrible.","title":"HORRIBLE APP DONT DOWNLOAD","isEdited":false,"userName":"JustCallMeMaya","date":"2020-07-09T01:54:46Z","rating":1}},{"id":"6174553236","type":"user-reviews","attributes":{"review":"By far my favorite app ever love getting real news unlike that fake news bs I recommend this app to everyone for our amazing president trump 2020!!!!!!!!!!!","title":"Best app ever maga trump 2020","isEdited":false,"userName":"christain's ipod","date":"2020-07-09T01:54:51Z","rating":5}},{"id":"6174551203","type":"user-reviews","attributes":{"review":"I can’t believe I even let this parasitic app onto my phone. I bet it will mess with ALL my apps and search engines making them think I would like to see pro Trump and conservative things all across the internet. However, needed to download to review and that was worth it, as the app needs to be deleted IMMEDIATELY.","title":"Terrible","isEdited":false,"userName":"Mary2288","date":"2020-07-09T01:54:14Z","rating":1}},{"id":"6174511085","type":"user-reviews","attributes":{"review":"I open the app to see that a Cheeto man is president and I got blinded from the cheeto dust, and it was smelly to. And not only that but this Cheeto wants to banned the only entertainment in my life which is TikTok, and Charli and Cheeto man will throw hands. But still he a butthole. So he’ll give depression to like everyone and still be president, tsk tsk tsk, and people still want this Cheeto to run this state. Shm.","title":"Don’t get the app 🤮","isEdited":false,"userName":"Noelani.N","date":"2020-07-09T01:42:53Z","rating":1}},{"id":"6174507662","type":"user-reviews","attributes":{"review":"First of all... this app makes your brain and your pp incredibly small😳 I now have a uterus. In addition to this, every time I open the app, the ringing in my left ear gets a little louder, and so do my cries for help. I have never known pain greater than the pain of owning this app. I wish I was never born. Please think before downloading.","title":"Worst app ever","isEdited":false,"userName":"Obamids","date":"2020-07-09T01:41:55Z","rating":1}},{"id":"6174477114","type":"user-reviews","attributes":{"review":"would give zero stars if possible. when i first opened the app i was bombarded with awful pictures of a giant cheeto 🤮. i’m EXTREMELY lactose intolerant and even the thought of cheese put me on the toilet for days. my cat started screaming at the top of her lungs about ACAB and i raised her to be a good loving white supremacist.  absolutely awful app don’t download.","title":"Absolutely awful","isEdited":false,"userName":"banjowamjo","date":"2020-07-09T01:33:24Z","rating":1}},{"id":"6174465073","type":"user-reviews","attributes":{"review":"It’s bad enough that we have a shriveled orange with yellow mold on the top as president, but now the thing has an app?? Absolutely not. The graphics are terrible, his face is actually visible, yuck. And the news isn’t even informative, it doesn’t showcase the racial injustice of America and doesn’t show how racist, homophobic, and sexist Trump is. This app needs to go. Like now.","title":"No thanks","isEdited":false,"userName":"bdogq1","date":"2020-07-09T01:29:51Z","rating":1}}]}