{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8040","data":[{"id":"6176743521","type":"user-reviews","attributes":{"review":"This app is the devils spawn but even Satan doesn’t want this man in hell. Donald J Trump is a rapist and a misogynistic arsehole! He kidnapped my family and slapped my sister with a taco for not downloading this app !! I downloaded it to help my sisters case but the I found out he was stealing all my information to buy adult toys!!!!🤢🤮 he then ran away with his Oompa Loompa followers and they danced through a graveyard! The disrespect is real! I can’t imagine what else he’s done to people who didn’t download the app!! Whoever supports this Cheeto as president should be ashamed!!!","title":"Worst app ever!!!!!","userName":"I-AM-DEVIANT","date":"2020-07-09T13:36:56Z","isEdited":false,"rating":1}},{"id":"6176732087","type":"user-reviews","attributes":{"review":"downloaded this app and after twelve hours of waiting, I finally thought I got to open it. Only, the app wouldn’t open. I would tap and tap, only for my home screen to remain the same. I thought it was broken and tried to delete and re-download, but the app wouldn’t delete off my phone. Minutes laters there was a knock on my door where Trump, dripping wet with butter, stood with a rabid look in his eyes. Terrified, I darted towards my closet. he’s still out there, pounding at the closet doors. \n\nsomeone help","title":"Help","userName":"JMazes02","date":"2020-07-09T13:33:55Z","isEdited":false,"rating":1}},{"id":"6176718423","type":"user-reviews","attributes":{"review":"Hours after getting this app I went to Starbucks and on my way back 6 FBI limos were following me home.  I finally got home and got out of my car but the limo dudes did too! In the limos there were flying fish that said FBI open up! Open up or I will let the sharks loose!!   Then at my back door there was a unicorn and she said delete this app and they will all go away so that’s what I did right after!  The night this all happened was the scariest night of my life!!!","title":"Don’t ever get this app","userName":"I_know_him_2014","date":"2020-07-09T13:30:20Z","isEdited":false,"rating":1}},{"id":"6176682735","type":"user-reviews","attributes":{"review":"It took hours to download, and then once I opened it up, it threatened my rights as a woman repeatedly. I’m talking banner notifications, pop ups, etc. all stating things like “Women don’t deserve rights like men do,” and “We are gonna revoke the 19th amendment.” On top of all that, this app floods all my other apps with adds for Trump 2020! It automatically signs your email and phone up for every spam organization, and it will sell your credit card info within seconds of you entering your CVV.","title":"This app is horrific!","userName":"Littlebitbignoise","date":"2020-07-09T13:20:55Z","isEdited":false,"rating":1}},{"id":"6176571962","type":"user-reviews","attributes":{"review":"So I downloaded the app to see what was going on and right when I downloaded it asked me for my phone number. Now I knew there was gonna be problems right away. Then once I gave them my phone number they then messaged me many times asking for my kidney. When I said that I wouldn’t give them my kidney, this man that looked like a hot Cheeto showed up to my door.\nThen immediately to win the argument I said\nno❤️ and I closed the door 😌. But then they rushed in and stole my kidney. What do I do now?","title":"He stole my kidney 💅🧚🏻‍♂️❤️💋","userName":"Avatar Aang The 3rd","date":"2020-07-09T12:51:17Z","isEdited":false,"rating":1}},{"id":"6176554790","type":"user-reviews","attributes":{"review":"I would give it ZERO STARS. Of course I want to support my totally non racist, homophobic, misogynistic president but this app is NOT IT. I know “real women vote for trump” but this app makes me want to turn into a man and vote for BIDEN. I even tho I totally LOVE trump I really don’t appreciate seeing his face every where. Sorry big man, that spray tan is not it. Also WAY too many notifications, it makes me want to turn democratic. The graphics are WAY too graphic and I’m conservative and I don’t know how to work a phone so everything is ALL TOO HARD TO MANEUVER AROUND.","title":"Ugh","userName":"snakdatsmilesbak","date":"2020-07-09T12:46:37Z","isEdited":false,"rating":1}},{"id":"6176473772","type":"user-reviews","attributes":{"review":"as soon as i downloaded this app, which took multiple days to do, my phone FROZE. i wasted my money to pay for repairs because this app installed a VIRUS into my phone. it stole all my information which led to my identity being stolen a few days later. i’ve gone through hell and back for an entire week just because i downloaded this GARBAGE app. so if you’re thinking about downloading this app for whatever reason DONT DOWNLOAD IT unless you want your identity stolen.","title":"This App Makes America Worse","userName":"marina catalano","date":"2020-07-09T12:24:25Z","isEdited":false,"rating":1}},{"id":"6176463402","type":"user-reviews","attributes":{"review":"The app looked like it downloaded, but kept crashing for a good five months and when I was finally able to get the app working after about 100 redownload the same say I let it have access to my cookies I started getting spam mail, a lot related to trump. I’m so upset because I believe they’ve hacked my passwords as well I’ve been locked out of all other platforms and they’re have been sudden random charges to my card. This app has ruined my life.","title":"Ruining My Life","userName":"person in","date":"2020-07-09T12:21:32Z","isEdited":false,"rating":1}},{"id":"6176446203","type":"user-reviews","attributes":{"review":"I got this app with high hopes of learning what my racist 🥰 president is doing to help America. It all started when I put in my phone number. Next thing u know I can’t call or text anyone and a window pops up saying to donate to the trump campaign in order to fix the virus on my phone. So I decide to donate one dollar and so I put my card number in, not even a minute later I get a notification from my online banking app saying I have a negative balance and have gone into overdraft. I am outraged","title":"BANK ACCOUNT WIPED","userName":"I'm not a hatet","date":"2020-07-09T12:16:50Z","isEdited":false,"rating":1}},{"id":"6176390528","type":"user-reviews","attributes":{"review":"This application DOESN’t WORK, I downloaded to see how I could support my favorite orange president 🥰 but as soon as I opened the app, my phone froze and I wasn’t able to get it back to normal for about 30 minutes. It froze on the home screen and I wasn’t able to force restart my iPhone which made me miss an important phone call I had to convert a snowflake liberal to vote for our lord and savior, Donny Trimp! Now they’ll be voting for sleepy biden or even worse, that rapper :( Please fix :(((","title":"Save your time, don’t bother","userName":"Datboiiab","date":"2020-07-09T12:01:31Z","isEdited":false,"rating":1}}]}