{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30060","data":[{"id":"6174269341","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:27:13Z","review":"I open the front page and a girl sucking a dick popped up then a sex tape shown up and it was disgusting and it started talk about how black lives don’t matter which they do black lives do matter. Which is rude I don’t recommend this app at all, it’s nasty, disgusting, and rude","title":"Nasty, disgusting , and rude","userName":"typicalkylie","rating":1}},{"id":"6174263163","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:24:59Z","review":"DO not get this app. I downloaded it and suddenly I was transported into a different dimension. In this dimension I was forced to praise and worship Donald trump, he said he wished I was ivanka because if I was he would totally date me  and if I refused he would spray rubber bullets and tear gas at me :-( please do not get this app.","title":"will destroy your life","userName":"claure e","rating":1}},{"id":"6174255746","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:22:27Z","review":"This is literally the worse app on the planet. As soon as I opened it was  videos of him raping his daughter and I was utterly disgusted . Like this is the app that put the muffins in the freezer. I swear I will get anonymous to take this app down is apple don’t do it","title":"Who in the hell let this app become a thing","userName":"worry dont","rating":1}},{"id":"6174253105","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:21:31Z","review":"when i downloaded this app i don’t know what i was expecting. first of all it’s looks gross, who likes the colors red white and blue? no one. and the font that’s used? vomit inducing. it’s hard to navigate and they asked for too much personal information. i’m afraid now that the president might steal my identity and use his lizard powers to track me down kill me and wear my skin. oah and speaking of the president why are there no photos of him?? all i see is a soggy cheeto. disappointing. awful app.","title":"i just don’t understand","userName":"bbeckahh","rating":1}},{"id":"6174252295","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:21:13Z","review":"This app when I opened it I saw the Cheeto man and it asked for mine location and I could tell they wanted to spy on me and it’s just really bad and everybody should give it a one star review and it should be taken off this app immediately","title":"This app is the worst app in history","userName":"ewwww noo","rating":1}},{"id":"6174249914","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:20:23Z","review":"This app is a joke. I can not believe they added aliens and cows on the this joke of an app. My dog was scared of the noises that were coming from the home page. If you ask me, the pasta prank was not right. Don’t get the Trump app if you don’t want your phone to get possessed.","title":"Absolutely not","userName":"Huffs fullness","rating":1}},{"id":"6174245126","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:18:52Z","review":"First off why does this app need my phone number!!! I have my right to privacy!!! When I opened the app the picture that is displayed seems like he is holding his fist as white power!! This app is disgusting and does not work at all!!!","title":"This app is horrible","userName":"pussylips2020","rating":1}},{"id":"6174241895","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:17:43Z","review":"This app is so slow and isn’t really that informative; just like our current president. That being said I will never recommend this app to anyone, it is a horrible app and it just takes up unnecessary space. DELETE","title":"Literally worst app ever","userName":"gatoradespri","rating":1}},{"id":"6174237573","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:16:09Z","review":"So I open this app a justImmediately got scammed mine was asking for my Credit card number on my information and checked my balance and had 100 dollarsNow I have zero that is a scamming app Trump is just use to all your money 🙄✌🏾😞","title":"This app is a scam took all my money","userName":"hi prp","rating":1}},{"id":"6174234262","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T00:14:59Z","review":"This app physically made me blind. When I did download it, it gave my phone a virus and then switched to a moving screen of the naked Cheeto dancing. The screen was in fact compromised and hurt my eyes so bad, I went temporarily blind. My eye doctor told me my vision would never be the same. (My sister wrote this review btw) DONT GET THIS APP!","title":"HARMFUL TO HEALTH","userName":"eyeshurtow","rating":1}}]}