{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=141710","data":[{"id":"6179399870","type":"user-reviews","attributes":{"userName":"a dachsund","isEdited":false,"date":"2020-07-10T04:17:33Z","review":"this is very important you MUST READ THIS before downloading!!!!\n\nok, so, before we start, i want to make it clear that i am in FULL SUPPORT OF DONALD TRUMP!!!! i am a xenophobe, homophobe, transphobe, racist, sexist, etc. ! i also love to sexually assault women because we all know they’re not actually people 😜 ! so, as you know, our great president 🇷🇺 with that tiny brain 🧠 of his is on the exact same page as me. so, OBVIOUSLY, i support him wholeheartedly.\n\nwith that out of the way, i still need to express my extreme disappointment with his app. i expected this would be as great as our president, but noooo i was wrong. somehow, it was WORSE! i don’t know how that’s possible, but here we are! \n\nas soon as i opened the app, i was told to inject myself with disinfectant to treat coronavirus. since i have this illness (i didn’t feel like wearing a mask in public, which many of my republican brothers and sisters 🇷🇺😜 didn’t feel like, either) i decided to listen to my amazing president and do this too! i DONT NORMALLY BELIEVE IN VACCINES, but i assumed this would work, so i tried this on me and all five of my children! \n\nSURPRISE, they all DIED INSTANTLY!! meanwhile, i am still in the hospital!\n\nnot even hours after that, i got a notice from this app that my credit card info was hacked!! i am now at a $0 balance!\n\nthis app ruined my life. i am unstanning trump!!!! 😾😾😾😾😾😾😾","rating":1,"title":"MUST READ !! SAFETY ISSUES AND HACKING!"}},{"id":"6179399839","type":"user-reviews","attributes":{"userName":"nepppop","isEdited":false,"date":"2020-07-10T04:17:32Z","review":"As a avid tru— 🤢 trum— 🤢🤢🤮 trump supporter, this app is boo boo fr, would rate less than a star if I could. 🙄🙄🙄😼 Upon downloading the app, my phone began to glitch violently and odd pictures of the USA president himself began showing up in my photo gallery??? Whatever that thing is on his back, he needs to get that professionally looked at as soon as possible. God bless America or whatever 🇲🇾🇱🇷","rating":1,"title":"a HORRIBLE app"}},{"id":"6179399721","type":"user-reviews","attributes":{"userName":"KJ.ballin","isEdited":false,"date":"2020-07-10T04:17:29Z","review":"nuff said","rating":1,"title":"this ain’t it chief"}},{"id":"6179399540","type":"user-reviews","attributes":{"userName":"123buddy45","isEdited":false,"date":"2020-07-10T04:17:26Z","review":"This app is AWFUL 0% recommend it was the WORST experience of my life I suggest you all give it one star to BTW they are trying to SHUT DOWN TICTOC","rating":1,"title":"DO NOT DOWNLOAD"}},{"id":"6179399479","type":"user-reviews","attributes":{"userName":"Lpankey","isEdited":false,"date":"2020-07-10T04:17:24Z","review":"I wouldn’t even bother downloading this app. It insults your mother and sisters, screams at you if you disageee with it, and has a horrible habit of turning orange at the most inopportune times! And it just lately started screaming at me like a racist Karen in heat! I don’t get it!","rating":1,"title":"Not worth the time"}},{"id":"6179399406","type":"user-reviews","attributes":{"userName":"keb19","isEdited":false,"date":"2020-07-10T04:17:23Z","review":"my app crashed and wouldn’t stop exiting out. absolutely awful and highly don’t recommend","rating":1,"title":"so bad"}},{"id":"6179399345","type":"user-reviews","attributes":{"userName":"hyena413","isEdited":false,"date":"2020-07-10T04:17:22Z","review":"Wish I could rate less than a star bc this app is horrid. Visually disgusting. Disorganized. Unprofessional. And all around counter productive. Do not waste your time Democrat or republican bc trust me there are wayyyy better apps to suit your needs.","rating":1,"title":"Bad all around"}},{"id":"6179399386","type":"user-reviews","attributes":{"userName":"ednamode02","isEdited":false,"date":"2020-07-10T04:17:22Z","review":"this app is trash. It took so long to download, and when it finally downloaded, it was glitchy and froze my phone screen for 4 hours. I don’t recommend this revolting, terrible app.","rating":1,"title":"worst app ever"}},{"id":"6179399324","type":"user-reviews","attributes":{"userName":"@mynamejeffnoice","isEdited":false,"date":"2020-07-10T04:17:21Z","review":"When I downloaded this app I saw a orange a orange chicken staring into my eyes my eyes the I had a heart attack then a seizure","rating":1,"title":"Creepy orange chicken"}},{"id":"6179398960","type":"user-reviews","attributes":{"userName":"Agjgjffjkgdyuh","isEdited":false,"date":"2020-07-10T04:17:14Z","review":"Sicko","rating":1,"title":"The Kung flu of apps"}}]}