{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=16730","data":[{"id":"6178080132","type":"user-reviews","attributes":{"rating":1,"title":"Terrible App","userName":"KBOSS26","isEdited":false,"review":"when I first began to use this app I felt threatened because I felt that the color of my skin was ridiculed and made me feel less than because of everything this app supports and represents. I also felt that because I am a woman the app treated me unfairly and I was also informed that if this bozo wins this election there will be some sort of war and I don’t need that toxicity in my life😁","date":"2020-07-09T20:10:19Z"}},{"id":"6178051512","type":"user-reviews","attributes":{"rating":1,"title":"glitchy and almost bricked my phone","userName":"G. Aysecs","isEdited":false,"review":"for some reason when i downloaded it it would NOT let me leave a blank white screen. i couldn’t do anything and had to wait for my phone to run out of battery before i could do anything. what seemed to happen hasn’t happened to anyone else but DO NOT DOWNLOAD under ANY circumstances it WILL break your phone. TRUMP 2020","date":"2020-07-09T20:00:55Z"}},{"id":"6178045951","type":"user-reviews","attributes":{"rating":1,"title":"Difficult UI","userName":"bad app, disappointed","isEdited":false,"review":"This is just such a poorly designed app, it’s very disappointing and I expect more from the President. It took forever to load (not a WiFi issue because everything else worked at the time I tried to use it) and it was hard to navigate. Adding this app to the long list of reasons I will not be voting Trump come November. Simply revolting","date":"2020-07-09T19:59:07Z"}},{"id":"6178044049","type":"user-reviews","attributes":{"rating":1,"title":"No justice no peace","userName":"read mE !?!?","isEdited":false,"review":"Even though our president should be worrying about other things in the country he’s worrying about a app and a bunch of  generation Z messing up his witlle campaignAnd even though I’d love to see the wonderful content inside this app I just feel like I feel like walking my mouse.I would like to see one more thing I thinkI I wonderful awesome creator of this app is a rapist racist homophobic trans phobic","date":"2020-07-09T19:58:29Z"}},{"id":"6178027040","type":"user-reviews","attributes":{"rating":1,"title":"Waste of time","userName":"@turmexusa","isEdited":false,"review":"It’s unfortunate to say that all the money put into the campaign that the quality of this app is quite terrible. It’s very hard to navigate, it’s very cluttered. The app constantly shuts down on me and overall made me very frustrated to use. It was just a waste of time for me to even try to get this app to work. If I could give it no stars I would.","date":"2020-07-09T19:52:55Z"}},{"id":"6178006845","type":"user-reviews","attributes":{"rating":1,"title":"ZERO STARS Completely BAD app","userName":"🐺🐸","isEdited":false,"review":"Wow...!? I cannot believe how glitchy and bad this app is.    After just 1 minute of browsing thru the app the whole thing FREEZES and crashes and makes my phone lose 20% battery in just one MINUTE! Mr Tump? Fix your app..!!?   How am I supposed to vote if the app is not working ... Mr trum PLAESE Because I have CHILDREN TAKE DOWN THE BARE BOOTY NAKED PICTURES on the APP ?????? Why are they on this? I will NOT allow my children to see your BARE BOOTY NAKED ORANGE BOOTY !!!!!!!!!!!!!😡😡😡👿","date":"2020-07-09T19:46:14Z"}},{"id":"6177966745","type":"user-reviews","attributes":{"rating":1,"title":"disgusting ✨","userName":"concerned gen z","isEdited":false,"review":"i seriously got this app to see what things our president has to offer for possible next term but when i opened the app it started playing and incredibly high pitched noise that made my dog literally attack me until i passed out. like what kind of mind controlling man does something like this. this app is a danger to all and needs to be taken down. ALSO DO NOT VOTE FOR HIM AND KANYE OR YOURE A DISGRACE TO THE SAFETY AND WELL BEING OF EVERYONE. vote blue 💙 🥰","date":"2020-07-09T19:33:10Z"}},{"id":"6177950335","type":"user-reviews","attributes":{"rating":1,"title":"Terrible","userName":"Root Pi","isEdited":false,"review":"My phone stopped working completely. Once I opened the app it froze and I tried to close it but it wouldn’t let me. I also tried to lock my phone and it was frozen on the app. I had to take it to the apple to get it completely wiped. I lost pictures that I had with my deceased grandfather and I will never get to see them again.","date":"2020-07-09T19:27:52Z"}},{"id":"6177886998","type":"user-reviews","attributes":{"rating":1,"title":"Not just political bias","userName":"NotARussianSpy","isEdited":false,"review":"I genuinely made an account and wanted to see what trump thinks. I personally don’t agree with a lot of things he does and I’m far from supporting him, actually I hate him but hate is a strong word. The app crashed twice and I just gave up. I wasn’t going to get mad over an app made by trump so imma leave a bad review not just for the bad policies by trump but also a bad app by trump.","date":"2020-07-09T19:07:08Z"}},{"id":"6177878234","type":"user-reviews","attributes":{"rating":1,"title":"horrible.","userName":"Why nickname why","isEdited":false,"review":"The app was so glitchy, the information was absolutely useless and didn’t do the job I was so ready to support trump but I’ll continue searching for a better app. It kept taking me in an out. I tried to redownload on my phone but it didn’t work. Extremely disappointed it slowed my phone down, shouldn’t be allowed for download.","date":"2020-07-09T19:04:17Z"}}]}