{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=15210","data":[{"id":"6173949193","type":"user-reviews","attributes":{"date":"2020-07-08T22:29:00Z","review":"my experience with this app was horrific and disrespectful on so many levels!  i opened the app and it was slow ashell and i was confused to how there were no pictures of Kanye anywhere. i find this extremely biased and overall insensitive to my beliefs. also i don’t see how being sponsored by Cheetos is relevant to the presidency, it’s offensive. i suggest just deleting the app and put a end to this nonsense! -a fellow Kanye supporter","userName":"kanbae😝","title":"Kanye for presi","isEdited":false,"rating":1}},{"id":"6173907792","type":"user-reviews","attributes":{"date":"2020-07-08T22:13:47Z","review":"At first, when I found out that there had been another app released by a racist old white man, I was ecstatic. However, something about getting text alerts by someone who is keeping his son hostage really turned me off. Along with this, the app design is awful and the red, white, and blue color scheme is not aesthetically pleasing. If an app is to represent my country, do it better please","userName":"Elizabethnightingale","title":"Not sure what I was expecting...","isEdited":false,"rating":1}},{"id":"6173900864","type":"user-reviews","attributes":{"date":"2020-07-08T22:11:14Z","review":"this app is totally misguiding and ineffective. I would not recommend downloading this app! it’s full of fake news and pictures of dirty towels in it. Right when I downloaded it, my cat died and my dog threw up Cheetos. I knew it was a sign to delete the app, but it wasn’t enough! I think this app needs to be downloaded off the face of the internet because of how it’s still haunting my dogs existence. literally anything > trump","userName":"tru mel","title":"no ♥️","isEdited":false,"rating":1}},{"id":"6173874867","type":"user-reviews","attributes":{"date":"2020-07-08T22:01:46Z","review":"my swag is never ending and just like jesus performing the five fish and two bread miracle i too will drip neverending swag to the people of nazarath. i will be crucified for my own swag as the romans simply could not handle the ice on my wrist. i am the swag lord and i am drowning i caused noahs ark with how hard my drip is. i drip so hard that it turns water into wine, i am the second coming of jesus christ and my swag will drip upon the tongues of future christians as my biblical reign will forever last. i am swag jesus christ. and when the time comes at the sound of the angels trumpeting, as the horsemen trail across the sky and as the earth opens up beneath us, i will be the one to descend from the heavens and take the truly swaggy into heaven. i am the swag lord. amen.","userName":"ScxttHxying on Wattpad","title":"i am... the swag lord","isEdited":false,"rating":1}},{"id":"6173848420","type":"user-reviews","attributes":{"date":"2020-07-08T21:51:49Z","review":"If you’re looking for the worst app you can possibly find on this App Store... well go ahead and download this app!!:))) If you’re looking to support a disgraceful and an embarrassment to our country (to say the least), then go ahead and download this app! I’m just saying, if I know you personally and I catch you with this on your phone, we will be having a very long in depth discussion on your political views;))","userName":"Leeza mf Borst","title":"Worst app!!","isEdited":false,"rating":1}},{"id":"6173831271","type":"user-reviews","attributes":{"date":"2020-07-08T21:45:13Z","review":"I absolutely love all of Donald’s policies and his ideas. I was hoping this app would give me the undoctored news that other news platforms don’t. Fake news. But when I downloaded the app it took so long that my phone froze and literally CAUGHT FIRE. I suffered 3 degree burns and I am unable to work due to my inability to use me hands properly. Do not get this app if you want to use your hands","userName":"Froggygoesplop","title":"Honest review from a trump supporter","isEdited":false,"rating":1}},{"id":"6173800125","type":"user-reviews","attributes":{"date":"2020-07-08T21:33:09Z","review":"i hate this app with a burning passion. it literally possessed me for 3 days straight. not only did it take like a day to download, it seriously possessed me. as soon as it downloaded i was so excited to use it to support the orange god trump. but as soon i opened an image appeared that was traumatizing that i couldn’t stop staring at. i felt weird after the image finally went away. the app never even loaded because it’s so slow so i just forgot about it. for the next three days i had no idea what i was doing and woke up in a mental hospital. turns out that the image of our orange god possessed to go murder democrats for 3 days. this app made me mentally insane and i’m giving it 1 star.","userName":"severouspotter","title":"made me mentally ill","isEdited":false,"rating":1}},{"id":"6173790104","type":"user-reviews","attributes":{"date":"2020-07-08T21:29:23Z","review":"So I attempted to download this app and after taking almost 4 full days to download, it began to crash immediately after opening...ad walls began to consistently pop up and it began to corrupt other apps on my phone as well...my phone then began to get hot and CAUGHT ON FIRE...I tried to put it in rice, I also attempted to turn it on and off but it was burnt to a crisp...I then had to go and buy an entirely new phone! Therefore DO NOT DOWNLOAD THIS APP!!!!","userName":"doirep","title":"TERRIBLE DO NOT DOWNLOAD","isEdited":false,"rating":1}},{"id":"6173768067","type":"user-reviews","attributes":{"date":"2020-07-08T21:21:09Z","review":"I tried opening it but then i started getting weird messages, i ignored it and went to sleep. At 3am someone knocked on my door and when i opened it , there was just an orange on the floor. When i tried grabbing it, spiders started crawling out of it and on to me . In fear i threw the orange and shook off the spiders. After that i had trouble sleeping, around 6am I finally got to fall asleep but had the worst nightmare ever, trump getting re elected.","userName":"mangoo juicce","title":"It glitched","isEdited":false,"rating":1}},{"id":"6173756175","type":"user-reviews","attributes":{"date":"2020-07-08T21:16:45Z","review":"This app is the worst one I’ve ever downloaded. Nothing loads correctly and I’m constantly supposed to update it. I hate this app and I hope that nobody else downloads it because you WILL regret it. I hate everything trump stands for and seeing his face makes me throw up uncontrollably so I can’t even get on the app. Please save yourself some time and don’t download this unless you want to give it one star ⭐️","userName":"phatpussy69","title":"Poopy App","isEdited":false,"rating":1}}]}