{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=39360","data":[{"id":"6173760611","type":"user-reviews","attributes":{"review":"This App is horrible, you’ll never believe how bad it is. It also has this Horrible name, Trump is such a overrated name. It’s so gross and should be banned from the U.S. You think you can stop Gen Z, you thought wrong. WE WILL NOT LET YOU RUIN US GOV","rating":1,"userName":"uddhjd","title":"Black Lives Matter","date":"2020-07-08T21:18:26Z","isEdited":false}},{"id":"6173750642","type":"user-reviews","attributes":{"review":"downloaded this app and the layout is terrible and actually burns my eyes to look at. none of the information on the app is correct. everything has to do with trump??? so i feel like it’s all biases idk maybe just me. this app is so bad i wish i could give it -5 stars 🙄 i showed my mom this app and she died from disappointment two seconds later. don’t download this app seriously.","rating":1,"userName":"whitepower42069","title":"what is this???","date":"2020-07-08T21:14:47Z","isEdited":false}},{"id":"6173757060","type":"user-reviews","attributes":{"review":"There’s false information, this app glitches all of the time","rating":5,"userName":"queen_kat74","title":"DONT EVER GET THIS APP","date":"2020-07-08T21:17:05Z","isEdited":false}},{"id":"6173749130","type":"user-reviews","attributes":{"review":"I would love to download this app but it took weeks for it to download and plus I got HACKED I got all of my personal information hacked in to and I’m not very happy about that. I would love to support him but I can’t anymore!","rating":1,"userName":"🏐⚽️⚽️🩹🩹👈🩸","title":"Trash","date":"2020-07-08T21:14:15Z","isEdited":false}},{"id":"6173748513","type":"user-reviews","attributes":{"review":"Why are we letting a man that rapes children and is trafficking children be our president he’s racist! He literally acts like a monarch from great britain from the 1700’s this is outrageous the app doesn’t have anything helpful about it this is wack!","rating":1,"userName":"Tanbear2001","title":"This app is trash","date":"2020-07-08T21:14:01Z","isEdited":false}},{"id":"6173746523","type":"user-reviews","attributes":{"review":"As soon as I opened the app, my phone was hacked and so was every social media I have. My credit card was hacked and now I’m bankrupt and living in a cardboard box and having to write this review at my local Verizon store.","rating":1,"userName":"IDONTHAVEA********NICKNAME","title":"AWFUL!!","date":"2020-07-08T21:13:17Z","isEdited":false}},{"id":"6173743947","type":"user-reviews","attributes":{"review":"I have never experienced this it took like a week to download and when I download it my phone started to act up and told me that I had catch a virus or something this app should be banned seriously 😒","rating":1,"userName":"yh1233333333333222222","title":"WORST APP EVER","date":"2020-07-08T21:12:21Z","isEdited":false}},{"id":"6173738383","type":"user-reviews","attributes":{"review":"I can’t describe how awful this app is. This app does not represent how great trump is at all. Trump recently passed away and needs to be reminded for what he has done in light. I am a HUGE trump supporter and this is highly disappointing towards how this app portrays Trump and Trump supporters. IF YOU ARE A SUPPORTER OF TRUMP, RATE THIS APP A 1 STAR! TRUMP IS BETTER THAN THIS!!","rating":1,"userName":"Jesus_Christ123","title":"HORRIBLE","date":"2020-07-08T21:10:18Z","isEdited":false}},{"id":"6173725290","type":"user-reviews","attributes":{"review":"I tried downloading it to see how the other half lives and it downloaded but it keeps crashing every time I open it?????","rating":1,"userName":"ethan uhhh","title":"didn’t even work????","date":"2020-07-08T21:05:27Z","isEdited":false}},{"id":"6173719398","type":"user-reviews","attributes":{"review":"this app is a DISGRACE! Never have I downloaded such a horrible app. If I could give a 0 star review I would. Took over one week to download. When I did download it, it gave me insults and such. Hate this app. 0/10. I do NOT recommend.","rating":1,"userName":"kare bear0283","title":"0/10","date":"2020-07-08T21:03:18Z","isEdited":false}}]}