{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=93360","data":[{"id":"6174804972","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"liv13550","review":"it literally gave my phone a virus!!!! the second i opened it","date":"2020-07-09T03:08:49Z","title":"don’t get this app!"}},{"id":"6174801370","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Pumpin girl","review":"I’m very sad since my once I downloaded this app my dog went inside my toaster and then sang a song about butter. I got a phone call right after from a donkey telling me that my boyfriend just tripped over a trump poster and did a quadruple flip off a cliff. Very sad. I ordered a triple flip not a quadruple. Also it was supposed to be Jessica who did the flips so very disappointing. We all hate Jessica. Horrible customer support. They accidentally pressed the build a wall button instead of the refund order and then threw me over it. I found my cousin da cow. She’s doing very well but then got corona from a trump supporter cussing her off. Poor Sabrina, she was a very good cow. Penguins are interesting creatures. My dinosaur ate my sister in her wedding while I was roller skating next to a do not roller skate here sign. I went to jail and found a man name peter. We broke out of prison. I cried at the movies after watching brave. Very sad. We are the winx we are the winx we are the winx come join the club we are the winx. Barbie life in the dream house??? Pop off trivago! Van Gogh really we singing panini while riding a horse to Canada. At least he’s free. What’s a dog? I want a goat can you buy me a goat but not the pig cuz he can fly like my doctor who vomited on my brand new Rolling Stones t-shirt. The audacity! How rude! Ikr omg ahhhh. Bahahaha ding dong your wrong! My toe is falling off is that normal? Yessirrr. Thank you for your time. Jk go find a rock, dig under the rock, and pull a Patrick Star by now living under that rock forever. Ba bye boo! BRATZ :) :( ;) ;( 🌚🧚🏼‍♀️✨🍓💃🐄\nMy phone was a paid actor.\nTHE END","date":"2020-07-09T03:07:45Z","title":"Very disappointing and a boyfriend killer"}},{"id":"6174797987","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"jj the potato","review":"This app is very unhelpful my pet snake died because I showed it to her screw DONALD DUMP","date":"2020-07-09T03:06:45Z","title":"Not helpful"}},{"id":"6174786997","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"chjdjehxisjs","review":"i opened the app with my kids ben dover, dill doe, and fonda cox and an add for pornhub popped up🤬 my kids do not need to be introduced to that!! they are just kids😪 cmon donald. do better.","date":"2020-07-09T03:03:24Z","title":"inappropriate!!"}},{"id":"6174774363","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"NETFLIX AND POODLE POOP","review":"IT GLITCHED MY MICROWAVE TO THE MAX LEVEL OF PUPPIES AND I HAD TO BURN ALL OF THEM IN MY BASEMENT AND THEN I HAD TO BURN MY BASEMENT AND THEN THE GLITCH MADE ME A MOM AND I HAD TO BECOME A PUPPY BUT THEN THE DAD SHOWED UP WITH THE MILK SO I GOT AN ABORTION AND HE BURNED HIMSELF IN THE BASEMENT BUT WE DIDNT HAVE A BASEMENT SO HE BURNED HIMSELF IN A NONEXISTENT PLACE SO I HAD TO MAKE MY NONEXISTANT KIDS EXIST AGAIN BUT THEN THE GLITCH PUT ME IN A TOXIC FAMILY AND THEN I HAD TO GET \nEVERYONE THERAPY","date":"2020-07-09T02:59:31Z","title":"THE WORST"}},{"id":"6174770094","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"rachael9910","review":"This app is very gross once I opened it it showed a orange 🍊 🤮","date":"2020-07-09T02:58:11Z","title":"Worst app there 🤮"}},{"id":"6174754927","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"valerieeeannnn","review":"Racist, misogynistic, white supremacist, oh but enough about the cheeto puff in office, the app was super glitchy.","date":"2020-07-09T02:53:35Z","title":"TRASH APP JUST LIKE OUR TRASH PRESIDENT"}},{"id":"6174738307","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"diamond mahan","review":"supper un organized and so many bugs","date":"2020-07-09T02:48:32Z","title":"bad quality"}},{"id":"6174738301","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Nahomi1313","review":"This app is the worst thing ever. 🤢🤢🤢","date":"2020-07-09T02:48:32Z","title":"horrible."}},{"id":"6174695965","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Rolando07","review":"It’s just terrible","date":"2020-07-09T02:35:45Z","title":"It’s terrible"}}]}