{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=128150","data":[{"id":"6177154096","type":"user-reviews","attributes":{"review":"Honestly the worst app I have ever used. No good content, poor interface, poop would work better than this🤦🏻‍♀️","rating":1,"date":"2020-07-09T15:26:53Z","title":"Awful app","isEdited":false,"userName":"Kkkkkkkkkkkkkkkabc"}},{"id":"6177153938","type":"user-reviews","attributes":{"review":"yuck.","rating":1,"date":"2020-07-09T15:26:51Z","title":"yucky","isEdited":false,"userName":"heather.19"}},{"id":"6177152673","type":"user-reviews","attributes":{"review":"many problems wrong with the app\n#1 took a WEEK to download a WEEK\n#2 idk why but for some reason a cheeto was all over the app which made me hungry which means that this app is encouraging obesity. doesn’t suprise me because mr.peach president is obese too so i get it.\n#3 also i was told if i downloaded ur bunker boy would go back in the bunker and he didn’t so now i’m sad. my sadness is only due to this app so know that if you get it you too will become sad.","rating":1,"date":"2020-07-09T15:26:31Z","title":"✨c h e e t o - m a n✨","isEdited":false,"userName":"bunker boy 👁👄👁"}},{"id":"6177151952","type":"user-reviews","attributes":{"review":"THE APP TRIED TO HIT ME!!!!! i opened it and my entire phone screen slapped me in the face! willy wonka showed up at my house! \nas u being my friend i will warn about my human being in the telescope. but what i really need to talk to u about is the flying sausage incident i don’t think i talked to u about this but u really should know that i am secretly a flying sausage not only am i a flying sausage but i am THE flying sausage that took the walking cheeseburgers pickles. i need ur help to escape the police men because the only reason i stole his pickles was because i was going through this thing where all i wanted to do was eat PICKLES and my mom wouldn’t buy any. i had no money so i didn’t know what else to do. i walked over to the cheeseurger and took his pickles. apparently thats against the law but i still did it. i already ate the pickles so i can’t return them. i asked bobbyjo to put me in a box and send me to north carolina so i am now in new england i need u to go on a secret mission and go buy me a private jet u see i can not fly anymore so i need someone to send me a private JET NOT A AIRPLANE i already have 2,345 airplanes please do not send me an airplane.please and thank you i hope u can complete my mission.","rating":1,"date":"2020-07-09T15:26:19Z","title":"AHHHH","isEdited":false,"userName":"Jajdjxhsjsiskdnsnsjakajaj"}},{"id":"6177151671","type":"user-reviews","attributes":{"review":"Ok, so I’m not apart of the         ✨gen z✨ thing but this is an abomination. I downloaded it thinking it would be a great app. I was completely wrong. It took a week to download. That’s 7 days if you didn’t know. Then it took 24 hours to open. Why so long? After it finally opened its starting playing “say so”. You know that song, if not look it up. It was absolutely poop. I wish this app what better. Thanks your your time. ✨bye bye✨","rating":1,"date":"2020-07-09T15:26:15Z","title":"An Abomination","isEdited":false,"userName":"not gen z trash"}},{"id":"6177150758","type":"user-reviews","attributes":{"review":"Wake up in the mornin' feelin' like P Diddy (hey, what up girl?)\nGrab my glasses, I'm out the door, I'm gonna hit this city (let's go)\nBefore I leave, brush my teeth with a bottle of Jack\n'Cause when I leave for the night, I ain't comin' back\nI'm talkin' pedicure on our toes, toes\nTryin' on all our clothes, clothes\nBoys blowin' up our phones, phones\nDrop-toppin', playin' our favorite CDs\nPullin' up to the parties\nTryna get a little bit tipsy\nDon't stop, make it pop\nDJ, blow my speakers up\nTonight, I'ma fight\n'Til we see the sunlight\nTick-tock on the clock\nBut the party don't stop, no\nOh, whoa, whoa-oh\nOh, whoa, whoa-oh\nDon't stop, make it pop\nDJ, blow my speakers up\nTonight, I'ma fight\n'Til we see the sunlight\nTick-tock on the clock\nBut the party don't stop, no\nOh, whoa, whoa-oh\nOh, whoa, whoa-oh\nAin't got a care in the world, but got plenty of beer\nAin't got no money in my pocket, but I'm already here\nAnd now the dudes are linin' up 'cause they hear we got swagger\nBut we kick 'em to the curb unless they look like Mick Jagger\nI'm talkin' 'bout everybody gettin' crunk, crunk\nBoys try to touch my junk, junk\nGonna smack him if he gettin' too drunk, drunk\nNow, now, we go until they kick us out, out\nOr the police shut us down, down\nPolice shut us down, down\nPo-po shut us down\nDon't stop, make it pop\nDJ, blow my speakers up\nTonight, I'ma fight\n'Til we see the sunlight\nTick-tock on the clock\nBut the party don't stop, no\nOh, whoa, whoa-oh\nOh, whoa, whoa-oh\nDon't stop, make it pop\nDJ, blow my speakers up\nTonight, I'ma fight\n'Til we see the sunlight\nTick-tock on the clock\nBut the party don't stop, no\nOh, whoa, whoa-oh\nOh, whoa, whoa-oh\nDJ, you build me up\nYou break me down\nMy heart, it pounds\nYeah, you got me\nWith my hands up\nYou got me now\nYou got that sound\nYeah, you got me\nDJ, you build me up\nYou break me down\nMy heart, it pounds\nYeah, you got me\nWith my hands up\nPut your hands up\nPut your hands up\nNow, the party don't start 'til I walk in\nDon't stop, make it pop\nDJ, blow my speakers up\nTonight, I'ma fight\n'Til we see the sunlight\nTick-tock on the clock\nBut the party don't stop, no\nOh, whoa, whoa-oh\nOh, whoa, whoa-oh\nDon't stop, make it pop\nDJ, blow my speakers up\nTonight, I'ma fight\n'Til we see the sunlight\nTick-tock on the clock\nBut the party don't stop, no\nOh, whoa, whoa-oh\nOh, whoa, whoa-oh","rating":1,"date":"2020-07-09T15:26:00Z","title":"this app gave me gonorrhea","isEdited":false,"userName":"jfdjsowhw"}},{"id":"6177150719","type":"user-reviews","attributes":{"review":"i’m a young teenager and let’s just say i had an accident involving conceiving a child. i’m so noticeably young that i get looks from people because i look too young to be a parent. i eventually learned to love my mistake and be a proud teenage mother so i was no longer ashamed and i went into public. i went on a golf outing with my new date since my ex broke up with me bc i’m pregnant and we saw donald there! we were stunned and since i was pregnant he decided it would be a good idea to hit me like a piñata. i didn’t lose the baby but she is now no longer able to live the childhood needed. he also decided to spit on me and call me “a waste of oxygen and sperm” then he asked my boyfriend for my phone number since i’m under the age. and to believe people support this guy...","rating":1,"date":"2020-07-09T15:25:59Z","title":"this man is horrible!","isEdited":false,"userName":"trump hater 😭✨🧚🏿‍♂️"}},{"id":"6177149935","type":"user-reviews","attributes":{"review":"He’s a homophobic, racist piece of orange zest AND he wants to get rid of an app that cosplayers (such as myself) strive off of?! I refuse to support an app that supports him! Lin-Manuel Miranda 2020!!!","rating":1,"date":"2020-07-09T15:25:47Z","title":"Dafuq","isEdited":false,"userName":"P.O.'d Cosplayer"}},{"id":"6177149704","type":"user-reviews","attributes":{"review":"idk ok","rating":1,"date":"2020-07-09T15:25:43Z","title":"❤️tiktok❤️","isEdited":false,"userName":"gen z 🤯"}},{"id":"6177149307","type":"user-reviews","attributes":{"review":"this app is absolutely terrible. it took 4 days to download and once it did it gave my phone a ghost virus!! now im writing this from my computer because my phone has been broken at the apple store for a week. It also kept charging my credit card for donations I never authorized. Please don’t get this it’s a scam and it will take your money and cost you more by f-ing up your phone.","rating":1,"date":"2020-07-09T15:25:36Z","title":"AWFUL","isEdited":false,"userName":"cm:628,82!*"}}]}