{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37040","data":[{"id":"6177243171","type":"user-reviews","attributes":{"date":"2020-07-09T15:52:19Z","isEdited":false,"title":"This App...","review":"I wish I could rate 0 stars! This app is terrible! After downloading it, my email, instagram, and twitter were hacked! On these accounts, “someone” posted crude things! I want this app deleted from the app store now. 🤬","userName":"rate life360 1 star everyday","rating":1}},{"id":"6177234323","type":"user-reviews","attributes":{"date":"2020-07-09T15:49:43Z","isEdited":false,"title":"would NOT recommend","review":"This app runs terribly on my phone. It always looks crooked, similar to how Donald stands due to his dementia. It might be intentional but it is annoying. The information is full of FAKE NEWS, and lies that come out of Donald’s mouth.","userName":"Anna B. Ortion","rating":1}},{"id":"6177205317","type":"user-reviews","attributes":{"date":"2020-07-09T15:41:22Z","isEdited":false,"title":"Crash","review":"This app keeps crashing, couldn’t even put my phone number in. If I could give it a zero rating I would. Thumbs down, the app is terrible, it really is","userName":"No tell ing","rating":1}},{"id":"6177188611","type":"user-reviews","attributes":{"date":"2020-07-09T15:36:37Z","isEdited":false,"title":"This is terrible","review":"I got the app while I was drinking my morning apple juice and when all of a sudden the app started acting weird and glitching and made me spill my apple juice and I had to delete the app for it’s constant disrespect of my apple juice","userName":"Kroger Apple juice","rating":1}},{"id":"6177185579","type":"user-reviews","attributes":{"date":"2020-07-09T15:35:46Z","isEdited":false,"title":"Terrible experience","review":"Nothing makes sense here. Lots of false information and hate speech. No intuition. Hard to find anything relevant. Looks like it’s run by someone completely out of touch with technology.","userName":"rellen_kay","rating":1}},{"id":"6177181547","type":"user-reviews","attributes":{"date":"2020-07-09T15:34:40Z","isEdited":false,"title":"Soooo scaryyy!!!!","review":"I opened the app to see that he wanted my location so he can “do one of his numbers on me!” I also saw a oompa lumpa staring at me with his Brady eyes! Don’t recommend if u are a sicko made sis, but go ahead trump supporters if u wanna download this monstrosity.\n\nLove, sit down and listen!😘","userName":"tressa9051","rating":1}},{"id":"6177131277","type":"user-reviews","attributes":{"date":"2020-07-09T15:20:37Z","isEdited":false,"title":"Horrible","review":"this app took two days to download and then when it did it hacked all of my data and reset my phone so that all apps were gone except this one.","userName":"cookie monster 5678901234","rating":1}},{"id":"6177124168","type":"user-reviews","attributes":{"date":"2020-07-09T15:18:38Z","isEdited":false,"title":"Terrible","review":"This is the absolute worst app I have ever used. My phone would immediately crash the moment I open it and I would have to restart my phone. Do not download this app.","userName":"chunkeymonkie","rating":1}},{"id":"6177076235","type":"user-reviews","attributes":{"date":"2020-07-09T15:05:23Z","isEdited":false,"title":"Don’t recommend this appp","review":"When I first downloaded this app I felt like I was gunna get druzzy this app is not ok don’t recommend this app at all and then I felt like somthing was touching me and then my phone I saw trump I quickly deleted this app","userName":"josh orlove","rating":1}},{"id":"6177062001","type":"user-reviews","attributes":{"date":"2020-07-09T15:01:27Z","isEdited":false,"title":"Terrible App, Terrible","review":"This app is awful. It kept crashing half of the times I used it. It signed me up for a text subscription that I didn’t want and spammed my phone with text messages. Garbage app.","userName":"Bbbb rrrrr iiiii ttttt","rating":1}}]}