{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=80590","data":[{"id":"6175677837","type":"user-reviews","attributes":{"review":"this app is disgusting, it’s racist and full of hatred!!! i wish i could give it ZERO stars , this app is so bad ! complete scam !!","title":"ABSOLUTELY HORRIFIC","isEdited":false,"userName":"Dont waist my time","date":"2020-07-09T08:14:17Z","rating":1}},{"id":"6175676972","type":"user-reviews","attributes":{"review":"you guys may know that I’m an open minded person. well, being open minded I decided to download the app to see what all this hype was about. well, that’s the part where everything went downhill. you see, when I first opened the app I started to hear a weird noise coming from my attic. and you might be wondering, how does that have anything to do with this app? Well, turns out there was a large group of sexually active iguanas in the attic all decked out in MAGA gear. I mean, why of all animals would you choose an iguana?! and to add to that, my cat started speaking a foreign language which sounded kind of like Russian but who knows? I was then called by an unknown number which I assumed was part of this whole app dilemma, and the caller stated that if I didn’t vote for trump that a group of uncircumcised snails would bite off little holes in my underwear which is really weird because I never specified that I had a urinating issue (I pee whenever I see Turkish food). And that’s not even all!! The snails did leave eventually but they left behind little pieces of paper with letters on them which I assumed to be part of a puzzle of sorts. I spent DAYS trying to figure out all the words you could make with these letters. How odd! I couldn’t figure any words out! Then I remembered something!! The snails left a hint underneath my toothbrush that said “there are no words, we just simply enjoy wasting your time -trump administration.” HOW DID I NOT NOTICE THE CONNECTION?! I mean, I came with low expectations at the start but now that I think about it, maybe I should have expected less from a man who sexualises minors and makes racist comments more often than a white mom visits her local Facebook page about different flavors of abdominal pain. Silly me 😔🤣🤣😹😹. Oh yeah, I give this app a single star because it won’t allow me to make it lower (which I would if possible).","title":"who in the helllll put the trump 2020 app in the App Store?","isEdited":false,"userName":"kendall dibble","date":"2020-07-09T08:14:00Z","rating":1}},{"id":"6175617971","type":"user-reviews","attributes":{"review":"trump is a racist homophobic cheeto and having him as president will further spread his inhumane ideas leaving america TO DESTRUCTION!!! “lETs MaKe amErIcA gReAT AgaIn”","title":"worst app ever","isEdited":false,"userName":"lilysyayo","date":"2020-07-09T07:52:57Z","rating":1}},{"id":"6175598977","type":"user-reviews","attributes":{"review":"it made my phone blow up and it also caused my dog to have extreme seizures :/","title":"HORRIBLE","isEdited":false,"userName":"barron is sexy","date":"2020-07-09T07:46:05Z","rating":1}},{"id":"6175451712","type":"user-reviews","attributes":{"review":"This app is the worst thing ever they should not be ever created","title":"Worst","isEdited":false,"userName":"aaaffffyy","date":"2020-07-09T06:49:36Z","rating":1}},{"id":"6175316622","type":"user-reviews","attributes":{"review":"the worst app to exist some orange guy popped up and I got scared. deleted right away","title":"worst app","isEdited":false,"userName":"hxhdjdkdkdkdkdk","date":"2020-07-09T05:57:47Z","rating":1}},{"id":"6175238060","type":"user-reviews","attributes":{"review":"I climbed out of my head\nAnd watched myself implode\nA thought without a body\nOught to be the shot to take a load off\nMy brain is poisoned\nAnd I'm searching for the antidote\nBut every time I find it\nMy defenses scream \"oh, no you don't! \"\nWoah","title":"UH OH STINKYYY","isEdited":false,"userName":"levicalll","date":"2020-07-09T05:27:02Z","rating":1}},{"id":"6175201034","type":"user-reviews","attributes":{"review":"Was murdered here. Would not recommend","title":"Terrible app","isEdited":false,"userName":"gilbert189462","date":"2020-07-09T05:13:37Z","rating":1}},{"id":"6175198855","type":"user-reviews","attributes":{"review":"When I opened this app, I instantly got chlamydia!!","title":"I feel attacked 🤬🤬","isEdited":false,"userName":"erixsaurus","date":"2020-07-09T05:12:51Z","rating":1}},{"id":"6175188657","type":"user-reviews","attributes":{"review":"Horrible app it said it wasn’t all your cats and loves peaches. This is just racist and rapist things","title":"Cats","isEdited":false,"userName":"12344455667788899","date":"2020-07-09T05:09:10Z","rating":1}}]}