{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=4740","data":[{"id":"6177760164","type":"user-reviews","attributes":{"date":"2020-07-09T18:28:46Z","rating":1,"userName":"😤🙄💢","review":"I downloaded the app and it took a month to finally load! I waited all day, every day without eating or sleeping. In fact I did not move at all. Because of this app I couldn't do anything so I was slowly dying. But maybe I was dying Because trump is just so hideous it would make anyone want to kill themselves. I'm not sure but as soon as the app loaded I regreted even downloading it because I realized I hate him. And I hope someone assassinates him because he's a homophobic, racist, sexist, xenophobic child. Anyone who supports him are also racist, homophobic, sexist, and xenophobic too! Hope thanos snaps y'all out of existence :)","isEdited":false,"title":"Shut up, Karens"}},{"id":"6177554265","type":"user-reviews","attributes":{"date":"2020-07-09T17:24:09Z","rating":1,"userName":"White Lives Matter ✊🏻","review":"I am not from tiktok. I was an avid Donald J. Trump supporter before downloading this app. The first thing I noticed was how unprofessional the wording of this app is. It is constantly throwing dirt on Joe Biden and not showcasing Trump’s own ideals ! It shows nothing about what I voted for. This app, its lack of punctuation, and unprofessionalism have made me stop supporting my president. I will not be voting in the election for the first time since I gained my right!! What a disgrace!! The notifications are also spam. It bothers me a lot because I am ridiculed by my family whenever a notification comes up because they are all supporters of Sleepy Joe Biden. Get this app off of the App Store!","isEdited":false,"title":"A DISGRACE!!!!"}},{"id":"6177513795","type":"user-reviews","attributes":{"date":"2020-07-09T17:11:31Z","rating":1,"userName":"sjgfsc","review":"i downloaded this app to see what our great cheeto had to say about how he runs this incredible country. and right after i opened it i got explosive diarrhea. and then my vision went blurry and all i could see was a giant orange with a toupee riding Barney and chasing me chanting \"grab them by the pus**\"... hallucination but make it ✨the scariest thing i have ever seen✨. i personally wouldn't recommend downloading this app unless you want the same horrific encounters that i experienced. \n\nedit: after i posted this review, the cheeto himself came into my house and built a wall so i couldnt immigrate to the grocery to feed my family. DONT DOWNLOAD THIS APP","isEdited":false,"title":"yikes"}},{"id":"6177478690","type":"user-reviews","attributes":{"date":"2020-07-09T17:00:48Z","rating":1,"userName":"notmypresidentbitxh","review":"this app is absolutely TERRIFYING i opened it up just to see a fat fugly cheeto staring down to myself. it’s the most laggy thing i have ever seen in history and it doesn’t furfill a purpose. if this app were a car it would probably explode as soon as you turned it on, that’s how bad it is. this app reminds me of the worst moments of my life. because of this app i have gotten scared, spilled coffee on my favorite shirt, and gotten MONEY STOLEN. that’s right, this app took money without my consent. i hope that this APP BURNS IN HELL and gets absolutely taken down. i hope that the whole trump administration could also be taken down.","isEdited":false,"title":"no just no"}},{"id":"6177446627","type":"user-reviews","attributes":{"date":"2020-07-09T16:51:17Z","rating":1,"userName":"Tyrfdbsnsnsnns","review":"listen up. i opened up this app expecting some sort of way to vote this ugly orange outa the white house , but this cheeto popped up and scared me to death , mans need some new SPRAY TAN. imagine being sexually attracted to your own DAUGHTER. absolutely disgusting . this trumpet man really screwed it up , he says a bunch of dumb stuff and thinks he’s getting away with it . we are growing and getting smarter everyday troompa . watch out . the only people who actually want your cheeto looking head ahh for president are 80 year old grandparents who just want money from your nasty lookin face . i deleted this app and it should be terminated by anyone with HALF A BRAIN . thanks babes❤️ f off !","isEdited":false,"title":"NASTY TROOMPA LOOMPA"}},{"id":"6177371096","type":"user-reviews","attributes":{"date":"2020-07-09T16:28:54Z","rating":1,"userName":"Ross Ludena","review":"I have been supporting Mr. Trump since he announced he was running in 2015, and I stand by everything he does. When I heard a bunch of kids were running over to this app from Tick Tock, I came to try to fight against their reviews.... now, I’m sorry Mr. Trump, but I have to side with the kids this time, because I will ALWAYS speak what I believe. I had to try the app before I could rate it, and now I wish I hadn’t, or I wouldn’t be leaving such a bad review on this page. The app barely works, and didn’t even fill my whole screen (I have an iPhone)! Anyway, Mr. Trump, I would like to support your app, but please fix it so I can!!!","isEdited":false,"title":"I LIKE TRUMP BUT NOT HIS APP"}},{"id":"6177365329","type":"user-reviews","attributes":{"date":"2020-07-09T16:27:14Z","rating":1,"userName":"ajmur65","review":"having this app still on the AppStore is an embarrassment to the entire apple company. the photo of the old rapist that appeared after i downloaded it shook me to my core. it felt like he was imagining six different ways to harass me. i immediately projectile vomited all over my house. it than proceeded to steal all of my credit card information and flash me with nude photos of the vile man that i have previously mentioned. i tried to delete the app and after i did it re-downloaded itself and started adding the nude photos to my camera roll. please take this app down. i’m crying and shaking rn. i feel so unsafe.","isEdited":false,"title":"flaming garbage"}},{"id":"6177331022","type":"user-reviews","attributes":{"date":"2020-07-09T16:17:25Z","rating":1,"userName":"OutofNicknamesugh","review":"first off, all the other reviews are right- this app literally takes forever to download! Personally, it took mine a few days, but if your phone is older it may take WEEKS. When I opened the app I was appalled by the design, the user interface is extremely hard to use. Additionally, it asked me for my phone number which I find a completely in appropriate. After using this app for a few minutes, I realized it is CONSTANTLY trying to get your number. \nThe app seemed very suspicious and I have a feeling it has stolen some of my personal data as well.\n\nDo not get this app.","isEdited":false,"title":"do not download"}},{"id":"6177327414","type":"user-reviews","attributes":{"date":"2020-07-09T16:16:25Z","rating":1,"userName":"jack egnoff","review":"I had such low expectations for this app from the beginning and let me tell you, y'all placed the bar lower than I ever thought it could go. As soon as I opened it there was a HORRIFYING picture on the loading screen. It looked like some rotting demented orange with mold on the top turned into person. I was surprised, but as soon as I got past that my phone screen went black and didn't come back on for an hour. I had full battery and it just turned off I think that loading picture broke my phone. Getting this app is a horrible idea, just like messing with the majority of gen z ;).","isEdited":false,"title":"THIS APP KILLED MY PHONE"}},{"id":"6177219094","type":"user-reviews","attributes":{"date":"2020-07-09T15:45:19Z","rating":1,"userName":"Enochian_TimeLady-B122","review":"Downloading this app was like trying to update Windows in 2007, which is to say it took two full months. When I finally opened it, the first thing I saw was Donnie’s face, staring at me. When I went to close the app, it wouldn’t close and the cheeto’s voice came out from all the speakers on my house, screaming ‘Trump 2020’ at all hours of the night. My neighbors have tried to burn down my house six times in the past hour and the forest spirits came and broke both of my legs. \n\n🧚✨I would hate for this app to kill anyone else.✨🧚\n\nOh god someone’s in my house. Help help help hel","isEdited":false,"title":"I am not okay and this app has put my life in danger"}}]}