{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=96460","data":[{"id":"6172542595","type":"user-reviews","attributes":{"userName":"tik tok is great and perfect","isEdited":false,"title":"Terrible","rating":1,"review":"I got the app then I threw up cuz I saw trumps face","date":"2020-07-08T14:48:02Z"}},{"id":"6172542135","type":"user-reviews","attributes":{"userName":"xanaxpopper2020","isEdited":false,"title":"TikTok","rating":1,"review":"Threatening to take down tik tok, 0/10 \nAnd I hate the color orange 🧡","date":"2020-07-08T14:47:55Z"}},{"id":"6172522375","type":"user-reviews","attributes":{"userName":"jkfkdndejehdvsy","isEdited":false,"title":"this app is dumb took too long to download and i already don’t like donald trump","rating":1,"review":"this app is terrible","date":"2020-07-08T14:42:22Z"}},{"id":"6172518836","type":"user-reviews","attributes":{"userName":"Thomeamj","isEdited":false,"title":"Terrible","rating":1,"review":"You want to ban a app we will ban yours","date":"2020-07-08T14:41:21Z"}},{"id":"6172500008","type":"user-reviews","attributes":{"userName":"watermelonlemonaid","isEdited":false,"title":"ur going down hunni","rating":1,"review":"if you take down our app we take down urs.","date":"2020-07-08T14:36:01Z"}},{"id":"6172484636","type":"user-reviews","attributes":{"userName":"Mamsmajdjaxlsl","isEdited":false,"title":"THIS APP IS TERRIBLE","rating":1,"review":"According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don't care what humans think is impossible. Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let's shake it up a little. Barry! Breakfast is ready! Ooming! Hang on a second. Hello? - Barry? - Adam? - Oan you believe this is happening? - I can't. I'll pick you up. Looking sharp. Use the stairs. Your father paid good money for those. Sorry. I'm excited. Here's the graduate. We're very proud of you, son. A perfect report card, all B's. Very proud. Ma! I got a thing going here. - You got lint on your fuzz. - Ow! That's me! - Wave to us! We'll be in row 118,000. - Bye! Barry, I told you, stop flying in the house! - Hey, Adam. - Hey, Barry. - Is that fuzz gel? - A little. Special day, graduation. Never thought I'd make it. Three days grade school, three days high school. Those were awkward. Three days college. I'm glad I took a day and hitchhiked around the hive. You did come back different. - Hi, Barry. - Artie, growing a mustache? Looks good. - Hear about Frankie? - Yeah. - You going to the funeral? - No, I'm not going. Everybody knows, sting someone, you die. Don't waste it on a squirrel. Such a hothead. I guess he could have just gotten out of the way. I love this incorporating an amusement park into our day. That's why we don't need vacations. Boy, quite a bit of pomp... under the circumstances. - Well, Adam, today we are men. - We are! - Bee-men. - Amen! Hallelujah! Students, faculty, distinguished bees, please welcome Dean Buzzwell. Welcome, New Hive Oity graduating class of... ...9:15. That concludes our ceremonies. And begins your career at Honex Industries! Will we pick ourjob today? I heard it's just orientation. Heads up! Here we go. Keep your hands and antennas inside the tram at all times. - Wonder what it'll be like? - A little scary. Welcome to Honex, a division of Honesco and a part of the Hexagon Group. This is it! Wow. Wow. We know that you, as a bee, have worked your whole life to get to the point where you can work for your whole life. Honey begins when our valiant Pollen Jocks bring the nectar to the hive. Our top-secret formula is automatically color-corrected, scent-adjusted and bubble-contoured into this soothing sweet syrup with its distinctive golden glow you know as... Honey! - That girl was hot. - She's my cousin!","date":"2020-07-08T14:31:47Z"}},{"id":"6172444081","type":"user-reviews","attributes":{"userName":"cghbvvcf","isEdited":false,"title":"Nasty","rating":1,"review":"I opened the app to see trumps nudes and my 2yr spas next to me luckily she thought it was a orange tic-tac but DO NOT DOWNLOAD DISGUSTING!!!!","date":"2020-07-08T14:20:55Z"}},{"id":"6172435545","type":"user-reviews","attributes":{"userName":"bdjd CD shdjjdjdnfd","isEdited":false,"title":"Trumps trash","rating":1,"review":"Why you trying to band tic tok first it’s fornite now tic tic","date":"2020-07-08T14:18:35Z"}},{"id":"6172367112","type":"user-reviews","attributes":{"userName":"nick35346362625","isEdited":false,"title":"this app is horrible!","rating":1,"review":"president, please fix your app, it glitches so much and is practically unusable.","date":"2020-07-08T14:00:14Z"}},{"id":"6172311411","type":"user-reviews","attributes":{"userName":"🌭hotdoggirl🌭","isEdited":false,"title":"disgusting","rating":1,"review":"This app is really glitchy, trump is the worst president","date":"2020-07-08T13:44:55Z"}}]}