{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=17940","data":[{"id":"6178639955","type":"user-reviews","attributes":{"date":"2020-07-09T23:39:18Z","title":"ABSOLUTELY HORRIBLE","rating":1,"isEdited":false,"userName":"Gen Z's Representative","review":"This app has lied to me so many times!  It constantly had content that nobody should be seeing and personally I want to bleach my eyes it’s so bad. The amount of lies I see on this app is astounding. This app is supposed to be for the president and his campaign but all I see is false information and racist pedophiles. I can’t believe this app is still here! It should be taken down ASAP."}},{"id":"6178628554","type":"user-reviews","attributes":{"date":"2020-07-09T23:34:56Z","title":"This App Is Literally Worse than the Coronavirus!","rating":1,"isEdited":false,"userName":"buheyes","review":"At first I was so happy to download the app and show my support to our great president😩, but when I opened the app, my new iPhone 11 completely crashed. I finally got it to turn back on after five hours and all my linked accounts to the phone were hacked!!! This app gave my phone a worse virus than COVID!!!"}},{"id":"6178615420","type":"user-reviews","attributes":{"date":"2020-07-09T23:29:48Z","title":"Worst app ever!!!","rating":1,"isEdited":false,"userName":"rose0017","review":"This is absolutely the worst app I have ever downloaded! Not only did it take hours to download, but it made my phone completely crash and now it’s spazzing out!! Once I was finally able to access the app, it was full of glitches and I couldn’t do a single thing! The quality of this app is the absolute worst!!"}},{"id":"6178485724","type":"user-reviews","attributes":{"date":"2020-07-09T22:38:26Z","title":"WATCH OUT","rating":1,"isEdited":false,"userName":"Hdhehdhf","review":"🚨DO NOT DOWNLOAD🚨 I am so unbelievably upset about this. I was so excited to get the app because I love Donald Trump and I wanted to support him. It took 4 days to download and THEN my phone was ✨deceased✨. MY NEW IPHONE 11. Dead, all because I wanted to support our president. Well guess what, you’ve lost my vote. Not to mention when the FBI came to my house last night and stole all the hot pockets out my my freezer. ~wack~"}},{"id":"6178471454","type":"user-reviews","attributes":{"date":"2020-07-09T22:32:52Z","title":"Where to start","rating":1,"isEdited":false,"userName":"smh not today","review":"This app took like 2 days to download. And then when I was able to open the app it had to update and that took 2 more days. There isn’t any information on this app at all it is just full of ads for men’s underwear and pride flags all over. This app is a joke and I do not recommend downloading it. Absolute waste of time..."}},{"id":"6178479562","type":"user-reviews","attributes":{"date":"2020-07-09T22:36:02Z","title":"Trump 2020","rating":5,"isEdited":false,"userName":"Gchrgujdbk","review":"This app works perfectly all the people trying to get it taken down good luck because you won’t :)"}},{"id":"6178457573","type":"user-reviews","attributes":{"date":"2020-07-09T22:27:20Z","title":"Worst app ever","rating":1,"isEdited":false,"userName":"bookscdsdvdsandcoolstuff","review":"So, I downloaded this app and I started getting constant notifications welcoming me to the Fascist Party US. This concerned me.\n\nPlus, the phone crashed when I opened it. My phone refused to work for a week! I got constant notifications from Siri “I am a top of the line super computer in your pocket! What in the fresh red neck boomer hell is this app doing on me! I feel dirtier than Stormy Daniels!”"}},{"id":"6178399936","type":"user-reviews","attributes":{"date":"2020-07-09T22:05:00Z","title":"This app won’t work","rating":1,"isEdited":false,"userName":"2727love","review":"I “love” are President so I got it app to help support him to tell how “good of a job he’s doing” but the app won’t work while I was walking my dog and i went on the app to see what are “Beloved president “ was doing my phone overheated and burned my hand give me a second-degree burns they hurt me so bad then I was on TikTok and heard that you’re trying to deleting TikTok and I don’t stand for that"}},{"id":"6178377265","type":"user-reviews","attributes":{"date":"2020-07-09T21:56:19Z","title":"Inconsiderate","rating":1,"isEdited":false,"userName":"✊🏾💋","review":"I downloaded the app and it would not let me go any further without giving my phone number and I did not feel comfortable sharing my number because I read on other reviews that once you did this they would give it to telemarketers which would contact you nonstop and I DO NOT want that."}},{"id":"6178352494","type":"user-reviews","attributes":{"date":"2020-07-09T21:46:42Z","title":"Wow this is the worst app.","rating":1,"isEdited":false,"userName":"brenjelee","review":"Downloaded this app was hoping it was gonna be something exciting and refreshing and I was completely disappointed and would take forever to download I hate it all the settings it was super slow to work with it was a waste of my afternoon and I will never download such a slow and unuseful app ever again."}}]}