{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21940","data":[{"id":"6178065016","type":"user-reviews","attributes":{"rating":1,"review":"The app glitched my phone and made it shut down. Every time I open an app on my phone, it just exits the app. My phone keeps messing up know and I truly think that this app might give people viruses. I have to write this review from my ipad.  Don’t download if you don’t want your phone to be destroyed.","userName":"Macklaeigh 💕🇺🇸","date":"2020-07-09T20:05:20Z","title":"Broke my phone","isEdited":false}},{"id":"6178037235","type":"user-reviews","attributes":{"rating":1,"review":"I just downloaded the app and every time I try to open the it, my phone freezes. I’ve had this problem for the past few weeks and was hoping that it would get fixed automatically but it hasn’t. Very disappointing, I DO NOT RECOMMEND!","userName":"trummmmpppp forrr prezz","date":"2020-07-09T19:56:14Z","title":"Crashing","isEdited":false}},{"id":"6178026485","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app to see trumps plans for the rest of 2020 and it took 2 hours to download and then was extremely laggy.  Also the app’s only purpose was to sell maga merchandise and promote his rally’s, it didn’t tell me anything about what his political ideas were on how to help 2020 be great again. Very disappointed","userName":"Mag Mag 8","date":"2020-07-09T19:52:43Z","title":"Worst app ever","isEdited":false}},{"id":"6178005806","type":"user-reviews","attributes":{"rating":1,"review":"This app made me verify my identity by providing my phone number and showing a picture of myself in my “uniform?” The example pictures where wearing a white hood.... I dont own one of those... I wore a white hoodie and it reported that there was an error in verifying my identity and then redirected me to Fox News? Am I doing something wrong or?","userName":"adocjsoxbeoecnz xejx","date":"2020-07-09T19:45:54Z","title":"Horrible App","isEdited":false}},{"id":"6177993051","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app with my standards set very high. Trump has so much money and he couldnt even make an effective app that his supporters could use. Everything crashes, pages dont work, overall BAD. i am incredibly disappointed. apple dont waste your space keeping this on the app store. sincerely, gen z","userName":"tiktokwillnotdie","date":"2020-07-09T19:41:44Z","title":"Horrible app","isEdited":false}},{"id":"6177988959","type":"user-reviews","attributes":{"rating":1,"review":"I tried getting on the app and every time I would attempt it it would kick me straight off. I’m not sure what the problem is but when it finally let me on it it was super buggy and you can’t even click on it. Overall just horrible app and design","userName":"Super brains","date":"2020-07-09T19:40:24Z","title":"Very bad app","isEdited":false}},{"id":"6177968257","type":"user-reviews","attributes":{"rating":1,"review":"My fellow Americans, due to the overwhelming amount of Black squares teenage girls are posting on Instagram, the supreme court has decided end racism completely. We did not think you would go to such extreme measures but you have very much proved your point. The Military will be told to stand down just please stop. Thank you","userName":"bigchiggabruh360noscopechigga","date":"2020-07-09T19:33:41Z","title":"We did it boys, racism is no more","isEdited":false}},{"id":"6177949777","type":"user-reviews","attributes":{"rating":1,"review":"This app killed my battery gas faster than i’ve ever seen. I actually wanted to use this app and it didn’t work at all. Everytime I opened it it would close me out and when it didn’t my battery ran out so fast. Do not ever download this app it’s awful.","userName":"Kaylee_319","date":"2020-07-09T19:27:42Z","title":"Ran out my battery and wouldnt work.","isEdited":false}},{"id":"6177936705","type":"user-reviews","attributes":{"rating":1,"review":"Hi, i got this app hoping that it would be amazing and for useful but instead there were many glitches in the app I kept on seeing random people who I hated with a passion, like I don’t know how the app was able to figure out the person who I hated with a passion and put their picture anyways it just wasn’t good.","userName":"bdjdjkdkajdh","date":"2020-07-09T19:23:26Z","title":"app","isEdited":false}},{"id":"6177904047","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app in hopes to read up on the upcoming candidates for the presidential election. This app is probably one of the worst ones I came across with. Not only does it take long to load, but it kicks me out of the app and I constantly have to refresh it. Not worth it.","userName":"snasolo","date":"2020-07-09T19:12:42Z","title":"Poor Quality","isEdited":false}}]}