{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=44500","data":[{"id":"6173242148","type":"user-reviews","attributes":{"rating":1,"review":"Need I say more! Clearly this is the worst app I’ve ever comes across. This app is just riddled with pictures of a Cheeto and wants to steal my information to sell to evil corporations! 🙃","userName":"DKMuratore","date":"2020-07-08T18:18:37Z","title":"If I could give 0 stars I would!","isEdited":false}},{"id":"6173239494","type":"user-reviews","attributes":{"rating":1,"review":"I definitely do not recommend downloading this app. It broke my phone and almost killed my fish. I had to buy a new fish and a new phone. This app is beyond terrible.","userName":"ghjjvvvjjn","date":"2020-07-08T18:17:44Z","title":"terrible app","isEdited":false}},{"id":"6173200982","type":"user-reviews","attributes":{"rating":1,"review":"This app made my phone run very slow and some apps would even glitch and close on their own. Do Not waste your time on this app or supporting this burnt sweet potato of a president.","userName":"mykela.h","date":"2020-07-08T18:04:55Z","title":"Would Not Reccomend","isEdited":false}},{"id":"6173195991","type":"user-reviews","attributes":{"rating":1,"review":"Trump is not a good president and shouldn’t have even been given the opportunity to run in the first place. He is taking away minorities limited freedom and has committed several war crimes. Trump is not my president","userName":"isachoco","date":"2020-07-08T18:03:17Z","title":"Communist.","isEdited":false}},{"id":"6173185435","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app and it was a waste of my time. I opened it and was disgusted a monster sitting right in front of my face. I WAS TERRIFIED I SAY, TERRIFIED. I wasted 15 seconds of my day to downloas this app. I could of asked my mom for McDonalds im those 15 seconds but NO. WASTE OF TIME APP 😡","userName":"The TØP fan","date":"2020-07-08T17:59:55Z","title":"Worst app ever 😡","isEdited":false}},{"id":"6173180358","type":"user-reviews","attributes":{"rating":1,"review":"I just downloaded this app I don’t even see the point in it does nothing for this community plus trump is trying to take the one thing we use the most TikTok so it’s time to fight back","userName":"Elijah also not a nic name","date":"2020-07-08T17:58:18Z","title":"THIS APP IS COMPLETE TRASH","isEdited":false}},{"id":"6173175848","type":"user-reviews","attributes":{"rating":1,"review":"trump appeared personally to thank me for downloading his app but then he saw I was black. His response was to hobble over to my grangran and tear gas her. She is now dead from from being killed by dying of gas. Very bad and not good.","userName":"Bored Californian","date":"2020-07-08T17:56:50Z","title":"Killed my grandma","isEdited":false}},{"id":"6173161089","type":"user-reviews","attributes":{"rating":1,"review":"This app may be worse for America than Trump, and that says a lot. Want an app that will break your phone? This is it. Never elect trump again and don’t download this app","userName":"dumpster_trumpster6968","date":"2020-07-08T17:52:07Z","title":"Absolutely god awful","isEdited":false}},{"id":"6173140448","type":"user-reviews","attributes":{"rating":1,"review":"This app is so bad I was looking for a way to vote again after everything we’ve heard but the app just doesn’t give and reasons. I will not be voting for him this year. 😒","userName":"Heather D'amelio","date":"2020-07-08T17:45:35Z","title":"Worst app","isEdited":false}},{"id":"6173137184","type":"user-reviews","attributes":{"rating":1,"review":"Bad app bad man smh !!! He stamped on my rats when I asked for an autograph!!! Such a shame because they were rare rats 🥺. Anyways he didn’t even pay for my new ones. He got in his car and threw water on me then left","userName":"#jsds","date":"2020-07-08T17:44:35Z","title":"Bad","isEdited":false}}]}