{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30670","data":[{"id":"6173569611","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Stop normalized Asian racism","date":"2020-07-08T20:09:47Z","userName":"SillyDillyAcacia","review":"I opened up this app expecting to see our beloved president but instead I see this tragic excuse of a human being.. where is Kim Namjoon??? My president is a loving non supporter and if given the funds WILL improve our economy, let’s stop trying to erase our president and give Kim Namjoon the respect he deserves"}},{"id":"6173564308","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Too Many Bugs and Glitches 😡","date":"2020-07-08T20:08:00Z","userName":"Raymond 🇲🇽","review":"This app is borderline unusable and has far too many glitches for it to even be operating properly. This app makes me feel like a little kid stuck in a cage who’s been separated from their parents."}},{"id":"6173559617","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Terrible","date":"2020-07-08T20:06:23Z","userName":"trump is a b","review":"I downloaded this app in hopes that it would tell me where the toilets were around the country. Unfortunately these toilets are unkept, dirty, nasty, and full of racist. Not to mention these toilets are ran by a whiny bunker baby. Absolutely horrible, I recommend staying away from this app at all cost."}},{"id":"6173553808","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Worst app ever","date":"2020-07-08T20:04:26Z","userName":"Kennidi B","review":"This app took away all my apps to where I had to download them all back my phone got a virus to where I had to get a new one this app should be deleted off of all platforms so this does not happen to anyone else do not download"}},{"id":"6173547250","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This app is terrible 😥","date":"2020-07-08T20:02:13Z","userName":"zahzah699","review":"This app is just complete inadequate, and if you were going to download this app don’t! Because I honestly think that It is just another way for the government to take your information. Thats all I have to say."}},{"id":"6173540282","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Terrible","date":"2020-07-08T19:59:53Z","userName":"ageorama","review":"This app is absolutely horrendous. It makes feel violent and I almost drowned my fish on purpose due to the anger it stirred inside of me. IF YOU DOWNLOAD THIS APP YOU WILL GO INSANE AND YOUR BRAIN WILL START TO MELT INTO A PUDDLE OF LAVA THUS BURNING YOUR BODY AND CAUSING YOU TO MELT INTO LAVA. False information, government will hack your phone and send an evil bird to kill your pets. Worms will jut out of the ground and eat your house. DO NOT DOWNLOAD THIS IS A WARNING"}},{"id":"6173536529","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"The worst app ever","date":"2020-07-08T19:58:36Z","userName":"lovinggg of this app","review":"I can’t believe I even downloaded this🤬 it is the most horrible app ever ! My phone started glitching and breaking down when I tried to use it. Don’t download this app plz! It takes a lot of your storage and is not worth it!"}},{"id":"6173531817","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Will never recover","date":"2020-07-08T19:57:00Z","userName":"barbs_go_left","review":"This app put me in therapy!!! I was driving and while the app was downloading my car lost control and I got severe whiplash! If I wouldn’t have downloaded this app I wouldn’t need a therapist to help me deal with the PTSD that it brought upon me! Don’t download this app it will traumatise you!!!"}},{"id":"6173529379","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"daddy trump","date":"2020-07-08T19:56:10Z","userName":"Jamey003","review":"I downloaded this because apparently it’s #2 in news. But it kept glitching to an orange blob that was spewing lies and propaganda. And on top of that it turned my phone into an electronic spider and tried to eat my brain. Don’t download this unless you want your brain to turn to mush."}},{"id":"6173524382","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Awful ✨🤮✨","date":"2020-07-08T19:54:27Z","userName":"Cookie pot lollol","review":"I downloaded this app to see if I could educate myself about my president. Instead when I opened the app it started paying the terrible elevator music that made me terribly sick for two weeks!!! And after that my dog started turning orange!! This app is trash!!!"}}]}