{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=124330","data":[{"id":"6174451494","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Horrible","userName":"Quokka111111","review":"Just terrible","date":"2020-07-09T01:25:44Z"}},{"id":"6174450851","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Stan hwasa 🦧","userName":"nomorcheetos","review":"욕을 하도 먹어 체했어 하도\n서러워도 어쩌겠어 I do\n모두들 미워하느라 애썼네\n날 무너뜨리면\n밥이 되나\n외로워서 어떡해\n미움마저 삼켰어\n화낼 힘도 없어\n여유도 없고\n뭐 그리 아니꼬와\n가던 길 그냥 가\n왜들 그래 서럽게\n마리아 마리아\n널 위한 말이야\n빛나는 밤이야\n널 괴롭히지마\n오 마리아 널 위한 말이야\n뭐 하러 아등바등해\n이미 아름다운데\n(yeah) Oh na ah ah\n(yeah) 널 위한 말이야\n(yeah) Oh na ah ah\n(yeah) 아름다워 마리아\nNo frame no fake\n지끈 지끈거려\n하늘은 하늘색 사는 게 다 뻔해\n내가 갈 길은 내가 바꾸지 뭐\n위기는 기회로 다 바꾸지 뭐\n굳이 우는 꼴이 보고 싶다면\n옜다 눈물\n외로워서 어떡해\n미움마저 삼켰어\n화낼 힘도 없어\n이유도 없고\n마음을 더럽히지마\n타락하기엔 아직 일러\n마리아 마리아\n널 위한 말이야\n빛나는 밤이야\n널 괴롭히지마\n오 마리아 널 위한 말이야\n뭐 하러 아등바등해\n이미 아름다운데\n(yeah) Oh na ah ah\n(yeah) 널 위한 말이야\n(yeah) Oh na ah ah\n(yeah) 아름다워 마리\n마리아 마리아\n널 위한 말이야\n빛나는 밤이야\n널 괴롭히지마\n오 마리아 널 위한 말이야\n뭐 하러 아등바등해\n이미 아름다운데\n(yeah) Oh na ah ah\n(yeah) 널 위한 말이야\n(yeah) 널 위한 말이야\n(yeah) 아름다워 마리아","date":"2020-07-09T01:25:32Z"}},{"id":"6174441995","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Sad. Tragic. No no no no no no no no bueno. 😞","userName":"Cupcake Catz","review":"Sad. Tragic. No no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no  no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no  no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no  no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no  no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no bueno. 😒😞😔😟😕🙁😫☹️😩😣😣😖😞😟😟😫🙁🙁😕😣😩😟😒😔🙁😣😫😫","date":"2020-07-09T01:22:49Z"}},{"id":"6174435858","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"we hurt bunker bois feelings 🥺💔","userName":"JudyJudybobudyBananafanafofudy","review":"왜들 그리 다운돼있어?\n뭐가 문제야 say something\n분위기가 겁나 싸해\n요새는 이런 게 유행인가\n왜들 그리 재미없어?\n아 그건 나도 마찬가지\nTell me what I got to do\n급한 대로 블루투스 켜\n아무 노래나 일단 틀어\n아무거나 신나는 걸로\n아무렇게나 춤춰\n아무렇지 않아 보이게\n아무 생각 하기 싫어\n아무개로 살래 잠시\nI’m sick and tired of my everyday\nKeep it up 한 곡 더\n\n아무 노래나 일단 틀어\n아무렴 어때 It’s so boring\n아무래도 refresh가\n시급한 듯해 쌓여가 스트레스가\n배꼽 빠질 만큼만 폭소하고 싶은 날이야\nWhat up my dawgs 어디야 너희\n올 때 병맥주랑 까까 몇 개 사 와 huh\n\n클럽은 구미가 잘 안 당겨\n우리 집 거실로 빨랑 모여\n외부인은 요령껏 차단 시켜\n밤새 수다 떨 시간도 모자라\n누군 힘들어 죽겠고 누군 축제\n괜히 싱숭생숭 I want my youth back\n좀 전까지 왁자지껄\n하다 한 명 두 명씩 자릴 떠\n\n왜들 그리 다운돼있어?\n뭐가 문제야 say something\n분위기가 겁나 싸해\n요새는 이런 게 유행인가\n왜들 그리 재미없어?\n아 그건 나도 마찬가지\nTell me what I got to do\n급한 대로 블루투스 켜\n\n아무 노래나 일단 틀어\n아무거나 신나는 걸로\n아무렇게나 춤춰\n아무렇지 않아 보이게\n아무 생각 하기 싫어\n아무개로 살래 잠시\nI’m sick and tired of my everyday\nKeep it up 한 곡 더\n\n떠나질 못할 바엔\n창밖은 쳐다도 안 봐\n회까닥해서 추태를 부려도\nNo worries at all\n이미지 왜 챙겨 그래 봤자 우리끼린데\n\nOhh 늦기 전에 막판 스퍼트\n20대가 얼마 안 남았어\n편한 옷으로 갈아입어\nYou look nice\nGet’em high\n얼핏 보면 그냥 코미디\n이렇게 무해한 파티 처음이지?\n만감이 교차하는 새벽 2시경\n술잔과 감정이 소용돌이쳐\n\n왜들 그리 다운돼있어?\n뭐가 문제야 say something\n분위기가 겁나 싸해\n요새는 이런 게 유행인가\n왜들 그리 재미없어?\n아 그건 나도 마찬가지\nTell me what I got to do\n급한 대로 블루투스 켜\n\n아무 노래나 일단 틀어\n아무거나 신나는 걸로\n아무렇게나 춤춰\n아무렇지 않아 보이게\n아무 생각 하기 싫어\n아무개로 살래 잠시\nI’m sick and tired of my everyday\nKeep it up 한 곡 더\n아무 노래나 일단\n\n아무 노래 아무 노래 아무 노래나 틀어봐\n아무 노래 아무 노래 아무 노래나 틀어봐\n아무 노래 아무 노래 아무 노래나 틀어봐\n아무 노래 아무 노래 아무 노래나 KOZ","date":"2020-07-09T01:20:57Z"}},{"id":"6174432373","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Ew","userName":"i_saisss","review":"Disgusting :(","date":"2020-07-09T01:19:54Z"}},{"id":"6174431463","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Garbage","userName":"tiktok4president","review":"Garage","date":"2020-07-09T01:19:39Z"}},{"id":"6174429287","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"No❌🤮🤮","userName":"lil fixlo","review":"Just don’t","date":"2020-07-09T01:18:59Z"}},{"id":"6174428539","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"TIKTOK LIVES MATTER ✊✊🏻✊🏼✊🏽✊🏾✊🏿","userName":"A TIKTOK LIFE","review":"TIKTOK LIVES MATTER ✊✊🏻✊🏼✊🏽✊🏾✊🏿","date":"2020-07-09T01:18:45Z"}},{"id":"6174419055","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"💫💫💫","userName":"Issssssssssssssssssssssssssssy","review":"⚡️⚡️⚡️⚡️💫💫💫⚡️✨⭐️✨⚡️💫⭐️🌸✨🌥⚡️💫Donald trump should sit on a throne💫💫🌥⚡️🌸🧚‍♀️🧚‍♀️🧚‍♂️💫⭐️🧚‍♀️✨⚡️🌸🧚‍♀️🌸🌸a̘̫͈̭͌͛͌̇̇̍n͉̠̙͉̗̺̋̋̔ͧ̊ e̮̟͈̣̖̰̩̹͈̾ͨ̑͑l͕͖͉̭̰ͬ̍ͤ͆̊ͨe̮̟͈̣̖̰̩̹͈̾ͨ̑͑c͔ͣͦ́́͂ͅt̘̟̼̉̈́͐͋͌̊r̼̯̤̈ͭ̃ͨ̆i̞̟̫̺ͭ̒ͭͣc͔ͣͦ́́͂ͅ t̘̟̼̉̈́͐͋͌̊h͚̖̜̍̃͐r̼̯̤̈ͭ̃ͨ̆o͎̜̓̇ͫ̉͊ͨ͊n͉̠̙͉̗̺̋̋̔ͧ̊e̮̟͈̣̖̰̩̹͈̾ͨ̑͑ ✨💫✨🌟⭐️✨💫🌟🌟🤍🖤🤍😚😚😚😚","date":"2020-07-09T01:15:53Z"}},{"id":"6174418880","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"👁👄👁","userName":"Conchita de Fresa","review":"La burla es la máscara de la cobardía ...","date":"2020-07-09T01:15:50Z"}}]}