{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36880","data":[{"id":"6065818354","type":"user-reviews","attributes":{"rating":1,"title":"The bunker boy scared me","review":"I I open the app only to see dictator trump and his bag of Cheetos sitting in his bunker tweeting away at his phone instead of taking care of his country he looks at me like I’m his daughter maybe I’ll be his next victim this app did not do it for me","userName":"Thecheetosupoorter","date":"2020-06-12T06:52:53Z","isEdited":false}},{"id":"6065740769","type":"user-reviews","attributes":{"rating":1,"title":"Terrible app","review":"Was hoping for some amazing insight into why people are still falling all over themselves for this Cheeto, but this app is #fakenews at its finest. Don’t waste your time. Highly discourage you wasting your time on this app or this man for pres come November.","userName":"AK_Reignbow","date":"2020-06-12T06:18:28Z","isEdited":false}},{"id":"6063180579","type":"user-reviews","attributes":{"rating":1,"title":"Terrible Quality","review":"This app has so many bugs and issues! Terrible quality in the app. You would think with all the money Trump has he could afford a decent app.","userName":"hdiaosoejaysjenao","date":"2020-06-11T14:06:17Z","isEdited":false}},{"id":"6055473317","type":"user-reviews","attributes":{"rating":1,"title":"Black lives matter","review":"I did not like how the disclosure it makes you sign in the beginning asks for your compliance to help fight to make the white race the superior race. Something about that just doesn’t sit right.","userName":"wowsarawoa","date":"2020-06-09T16:35:34Z","isEdited":false}},{"id":"6050389068","type":"user-reviews","attributes":{"rating":1,"title":"MUST READ THIS","review":"Very very scary my eyes were blinded by trump small dick then a chetto monster appeared and ate my cereal. Then asking for my number I don’t wanna be RAPED by TRUMP HIMSELF. Barbecue sauce on my tittes holy 10 inch black dildo don’t wanna download this app ever again almost died from this app. I fear that the is more scarier then the la Larona her self.","userName":"iphone has the qaulity","date":"2020-06-08T11:18:03Z","isEdited":false}},{"id":"6179128564","type":"user-reviews","attributes":{"rating":1,"title":"Go away already and let the people be free","review":"All Donald Trump supporters are fascist fake slaves of society that will soon be on knees at the hands of the gods that they so disowned you keep wearing your mask keep your mouth covered up so nobody hears the putrid info that spews from your mouth.","userName":"frodo'","date":"2020-07-10T02:42:33Z","isEdited":false}},{"id":"5890621425","type":"user-reviews","attributes":{"rating":5,"title":"Great app","review":"Well designed app, I think he will win in November.","userName":"vinc3nt9","date":"2020-05-01T23:27:51Z","isEdited":false}},{"id":"6179206274","type":"user-reviews","attributes":{"rating":5,"title":"Fake 1 Star","review":"Just stop he is the president respect him you liberal snowflakes","userName":"DAVIDMOONJR","date":"2020-07-10T03:11:17Z","isEdited":false}},{"id":"6178999941","type":"user-reviews","attributes":{"rating":1,"title":"This App gave me an STD","review":"Just wanted to let you know if you download this app you will get an STD... Your family will get an STD... They will become zombies and attack black people... They will call the police on you for no reason... Know the symptoms","userName":"date-night-canceled","date":"2020-07-10T01:55:19Z","isEdited":false}},{"id":"6179113631","type":"user-reviews","attributes":{"rating":5,"title":"Me and Donald got it on it was massive thx for the d😘","review":"I absolutely love his pp it was huge and joe Biden can’t compete","userName":"мαии","date":"2020-07-10T02:36:58Z","isEdited":false}}]}