{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33910","data":[{"id":"6176662931","type":"user-reviews","attributes":{"isEdited":false,"userName":"adisan07","date":"2020-07-09T13:15:40Z","title":"TERRIBLE DONT DOWNLOAD  i wish i could give it 0 stars","review":"i was on the app for a little bit and my phone started glitching out so i restarted my phone and it was still bad, apparently they took ALL my info. i had to get a new phone because of this app PLEASE PLEASE DO NOT DOWNLOAD","rating":1}},{"id":"6176631997","type":"user-reviews","attributes":{"isEdited":false,"userName":"123456789raerae","date":"2020-07-09T13:07:31Z","title":"This app is terrible","review":"The app crashes every time I open it no to mention how this app is for a person who is homophobic, transphobic, racist, sexist, islamophobic , and dislikes people of color, and more. This app works terribly and takes forever to load and I HIGHLY DO NOT RECOMMEND","rating":1}},{"id":"6176631259","type":"user-reviews","attributes":{"isEdited":false,"userName":"Chloe2857483910","date":"2020-07-09T13:07:19Z","title":"The worst thing is human history","review":"The app made my phone short circuit!! I had to get a whole new one!! And besides that it took a week to download! This app NEEDS to be deleted, it also showed me some innapropiate stuff, soo it needs to be goneee!","rating":1}},{"id":"6176602384","type":"user-reviews","attributes":{"isEdited":false,"userName":"idkman🤷🏽‍♀️","date":"2020-07-09T12:59:36Z","title":"I’m sick","review":"Immediately after downloading this app my stomach began to feel funny and when I went to eat I couldn’t even stomach the food. I knew some apps caused viruses but I just didn’t know I’d catch it instead of my phone 😔","rating":1}},{"id":"6176573128","type":"user-reviews","attributes":{"isEdited":false,"userName":"origins212","date":"2020-07-09T12:51:37Z","title":"2020","review":"Kayne would not like this it has also ended up wiping my mothers mobile phone data which is very upsetting i would very much appreciate it if someone could do something about this","rating":1}},{"id":"6176569532","type":"user-reviews","attributes":{"isEdited":false,"userName":"hdbrvbsnsbdbdjdb","date":"2020-07-09T12:50:41Z","title":"Terrible","review":"Took 3 weeks to download and then on top of that doesn’t even open at first and then when it did every thing bugged out and took me to three different apps horrible don’t download 🤦‍♂️","rating":1}},{"id":"6176559688","type":"user-reviews","attributes":{"isEdited":false,"userName":"catgirl chipotle😸","date":"2020-07-09T12:47:59Z","title":"terrible misconduct","review":"app took almost 6 HOURS to download and when it finished i opened the app only to have it comment on my appearance from the pictures in my camera roll. completely inappropriate!","rating":1}},{"id":"6176514609","type":"user-reviews","attributes":{"isEdited":false,"userName":"blm2022","date":"2020-07-09T12:35:39Z","title":"Ohhhhhhhhhhhhhhhhh ghhooooooooon","review":"When I downloaded the app my phone started to freeze so I heated it up in the oven then when I open it after 2hours a bunch of children jumped out and started chasing me when I got out they set my house on fire, worst app ever","rating":1}},{"id":"6176473850","type":"user-reviews","attributes":{"isEdited":false,"userName":"AmandaAnnO","date":"2020-07-09T12:24:26Z","title":"What in the Alabama Betty Crocker Bull Is this","review":"I am disappointed in the quality of this app.  Making you give your phone number and email before you Maga the heck out of it, is disappointing.  I just came here to trump and I got on some racist text thread.  Booo","rating":1}},{"id":"6176473307","type":"user-reviews","attributes":{"isEdited":false,"userName":"ButtholeSpankme","date":"2020-07-09T12:24:17Z","title":"Orange Clown","review":"App is very easy to download and open but definitely far too difficult for his supporters to figure out. They probably should have sent coloring books with crayons for his shrinking legion of cretins. One star! And I’d leave zero if I could.","rating":1}}]}