{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=50420","data":[{"id":"6174509143","type":"user-reviews","attributes":{"review":"This app no work does not work it bad bad bad why does this app exist no good app this app shouldn’t be an app Trump app more like dump app cuz it’s bad bad app no app just so bad I hate this app app bad bad app app bad bad bad Trump 2020 more like biggest dump in 2020","date":"2020-07-09T01:42:21Z","userName":"cocosox","title":"Bad app","rating":1,"isEdited":false}},{"id":"6174489022","type":"user-reviews","attributes":{"review":"The app is messing up my phone! Its quality is exceptionally low. It should be deleted from the App Store ASAP to save other users.","date":"2020-07-09T01:36:45Z","userName":"djdhejdjdbbsnsj","title":"Very Glitchy!!","rating":1,"isEdited":false}},{"id":"6174485276","type":"user-reviews","attributes":{"review":"Make Apps Great Again! This is the worst app on here! The only good part about having it was that I was no longer attacked by racists when I showed them I had the app.","date":"2020-07-09T01:35:42Z","userName":"javnsjjejfp","title":"MAGA!!","rating":1,"isEdited":false}},{"id":"6174477923","type":"user-reviews","attributes":{"review":"I opened the app to see an orange staring back at me! The app took over my entire phone and attempted to spray tan me through my phone camera! My phone is traumatized and so am I!","date":"2020-07-09T01:33:37Z","userName":"Unicorn Butthole 527292","title":"Disgusting!","rating":1,"isEdited":false}},{"id":"6174466956","type":"user-reviews","attributes":{"review":"Please help!!! This app has kidnapped my mom😔 it all started when I accidentally clicked on one of the Cheetos porn ads... please give this app one star and help me bring back my mom😓","date":"2020-07-09T01:30:25Z","userName":"copsabovethelaw2020😌✨","title":"Noods","rating":1,"isEdited":false}},{"id":"6174466641","type":"user-reviews","attributes":{"review":"Trump I racist and no one should like him he is a evil person and when I see him I just see a giant Cheeto. Like how do people follow in this ugly Cheeto’s foot steps. Trump should go bye bye and leave America alone!","date":"2020-07-09T01:30:20Z","userName":"stitchbear","title":"This is a bad app","rating":1,"isEdited":false}},{"id":"6174465311","type":"user-reviews","attributes":{"review":"I have been having terrible sleep paralysis of a giant Cheeto running at me and screaming ever since I downloaded this app. PLS do not get this app it is cursed and will haunt you!!!!!","date":"2020-07-09T01:29:56Z","userName":"scared and tired","title":"Worst experience of my life","rating":1,"isEdited":false}},{"id":"6174464171","type":"user-reviews","attributes":{"review":"I opened the app to see a naked Cheeto I did not asked for this after I saw this photo I went mentally insane and had to put my dinosaur in the hospital and then go walk my fish🥴😒","date":"2020-07-09T01:29:34Z","userName":"🤭😋🥵😌","title":"Disgusting😒","rating":1,"isEdited":false}},{"id":"6174462526","type":"user-reviews","attributes":{"review":"I will start by saying this. I’m a conservative and was a Donald Trump support until 18 years ago when I stopped. The narcissist totalitarian mentality this orange man has is absolutely disturbing.","date":"2020-07-09T01:29:04Z","userName":"gorilla grip banana lover","title":"Worst app I’ve ever used.","rating":1,"isEdited":false}},{"id":"6174453804","type":"user-reviews","attributes":{"review":"I opened up the app and was greeted by mr. Trumps croissant tip and it was a very unpleasant sight! After seeing that I had to bleach my eyes from that horrific image! The burning from the bleach is better than seeing that thing 😞😓😪","date":"2020-07-09T01:26:25Z","userName":"dixie normus 43","title":"MY EYES😣😣","rating":1,"isEdited":false}}]}