{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=80440","data":[{"id":"6177938139","type":"user-reviews","attributes":{"review":"i can’t believe what i saw opening this app. DO NOT DOWNLOAD","userName":"lizmbrax","rating":1,"date":"2020-07-09T19:23:53Z","isEdited":false,"title":"worst app i’ve ever downloaded"}},{"id":"6177934891","type":"user-reviews","attributes":{"review":"worst app on the app store. Must be removed immediately !","userName":"Somethings can't be happy😋","rating":1,"date":"2020-07-09T19:22:51Z","isEdited":false,"title":"disgusting😎"}},{"id":"6177931878","type":"user-reviews","attributes":{"review":"everything about this is terrible. my phones is reacting bad to it. GUESS it’s a sign!!","userName":"Galaxy_Stars22","rating":1,"date":"2020-07-09T19:21:51Z","isEdited":false,"title":"DISGUSTANG"}},{"id":"6177922437","type":"user-reviews","attributes":{"review":"So I downloaded the app and it’s just so trash like trump","userName":"asw1/","rating":1,"date":"2020-07-09T19:18:46Z","isEdited":false,"title":"Bad app just like trump"}},{"id":"6177916691","type":"user-reviews","attributes":{"review":"this app is ✨awful✨ i went out to walk my hamster and when i came back it was ruining my phone. all i wanted to do was support a 🍊 but it ending up ruining my phone😔","userName":"Sofie miller 117","rating":1,"date":"2020-07-09T19:16:53Z","isEdited":false,"title":"🥰tiktok🥰"}},{"id":"6177910883","type":"user-reviews","attributes":{"review":"This app is terrible. First of all when you download it it says you must enter the name of your grandmother and the year she was born. Unacceptable. The app also theretend to steel my McDonalds T-shirt if I ever deleted the app. It constantly showed me pictures of a hot Cheeto attempting and failing to lift a three pound weight. When I try to call customer services it connects me to Chuck E Cheese In which they MAKE you order a pizza with your credit card information. After numerous try’s deleting this app it took me to this hacker website in which they asked me a series of abnormal questions. For example the website asked me “Are you voting for the hot Cheeto this election?” Etc. When I gave up on deleting the app I decided to just throw my phone away. As I took my phone to the trash can 34 oompa lumpas started viciously attacking me. Repeating the words, “support the orange” once I was able to get away I ran inside and called the White House to complain about their terrible app. I found a very disturbing message claiming I would need to “send my phone number for further assistance.” I find it complete and utterly disrespectful that the president is attempting to cheat on his non-speaking, speech-stealing wife with a random stranger. Now not only has this app changed my view on the election, but the president definitely lost my vote. I will never download this again And I would NEVER recommend this app to anyone. I believe they are hackers. I am completely disgusted by this app and the president. Terrible service and horrible experience. overall, terrible app. I strongly do not recommend.","userName":"Piper078","rating":1,"date":"2020-07-09T19:14:56Z","isEdited":false,"title":"DO NOT DOWNLOAD"}},{"id":"6177909292","type":"user-reviews","attributes":{"review":"this man is literally everything bad that a person can be. #settleforbiden2020","userName":"Mom 4 Life ❤️","rating":1,"date":"2020-07-09T19:14:24Z","isEdited":false,"title":"DUMP TRUMP"}},{"id":"6177904063","type":"user-reviews","attributes":{"review":"I wanted to support the beautiful 🍊but I could bring myself to download the app! Becauseee....\nBecause....\nBECAUSE THE 🍊IS TOO HOLY!!!✨✨✨✨✨✨✨✨✨✨✨✨✨✨","userName":"Deshawnaye Dinnis","rating":1,"date":"2020-07-09T19:12:43Z","isEdited":false,"title":"CAN I GET A HOOYAA?! ✨✨"}},{"id":"6177897940","type":"user-reviews","attributes":{"review":"THIS APP BLEW UP MY PHONE AND I AM NOW HAVING TO USE MY LAPTOP! EVER SINCE I GOT THIS APP MY BATTERY DIES EVERY 5 MINUTES AND I FOR ONE THINK THIS IS RIDICULOUS. IT TOOK UP 30 GB OF MY STORAGE AND MY PHONE DOESN’T EVEN WORK ANYMORE!!!\nOH AND TO MAKE MATTERS WORSE A WHOLE BUNCH OF ORANGES FLEW THROUGH MY WINDOW AND LEFT ME WITH A CONCUSSION THEN A WEEK LATER I GOT A BUNCH OF PHONE CALLS SAYING THAT DONALD WAS GOING TO COME AND TAKE MY FAMILY AWAY FROM ME !!","userName":"save tiktok nowwwwwwww","rating":1,"date":"2020-07-09T19:10:43Z","isEdited":false,"title":"NEEDS TO BE DELETED NOW ASAP (NO ROCKY)"}},{"id":"6177891285","type":"user-reviews","attributes":{"review":"Ummm yeah this is an app I did not think I would download just to ya know, get it taken down, but ya know.","userName":"blhht","rating":1,"date":"2020-07-09T19:08:30Z","isEdited":false,"title":"Tiktok🧚‍♂️✨"}}]}