{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8770","data":[{"id":"6176688702","type":"user-reviews","attributes":{"date":"2020-07-09T13:22:29Z","isEdited":false,"title":"Terrible App😫!","review":"If possible i would give this app a 0 star rating😡. It took nearly two weeks to download🙄. Once when it finally did download it created a virus and hacked my phone causing it to delete all my contacts, and hacked into my social media accounts causing them to glitch up and somehow change my password🙅🏾‍♀️. I’ve been crying for the past weeks because I’ve basically lost everything🥺. It wouldn’t even let me vote for Trump💔.","userName":"lovelytina10102","rating":1}},{"id":"6176668723","type":"user-reviews","attributes":{"date":"2020-07-09T13:17:11Z","isEdited":false,"title":"Trump app terrible","review":"If I could give zero stars I would. There’s no reason this app should take five hours to download and then when I try to use the app it won’t even open up it always crashes then ever since I downloaded the app my phone started to glitch and then all the TVs in my house also started to glitch they will turn on and off without me even pressing any buttons and this is all weird this is the worst app I have ever downloaded","userName":"Dwatson4086863","rating":1}},{"id":"6176632072","type":"user-reviews","attributes":{"date":"2020-07-09T13:07:33Z","isEdited":false,"title":"Terrible app wish I could give no stars!!!","review":"This app didn’t even download properly and when i went to register nothing happened. This is a joke I actually used the website, just kidding again I vote in person just not for the person this app is for. So basically if you read this then you either also hate the pers- I mean app and agree or you don’t support the local racist, homophobic, pedo of a president we have who happens to be the annoying orange.","userName":"NaomiW04","rating":1}},{"id":"6176522101","type":"user-reviews","attributes":{"date":"2020-07-09T12:37:41Z","isEdited":false,"title":"Horrible.","review":"Took about 48 hours to download and then once it did, the first thing that it asked me was if I wanted to be sent notifications. I was very offended by this, and it suggests that if I have this app they have the power to run my Notification Center. It is inconsiderate, because there are other apps on my phone that want to send notifications too. All Notifications matter. So I will be deleting this monstrosity off of my phone as soon as humanly possible. Yeah❤️.","userName":"holden maboobs","rating":1}},{"id":"6176498986","type":"user-reviews","attributes":{"date":"2020-07-09T12:31:19Z","isEdited":false,"title":"WARNING: DO NOT DOWNLOAD","review":"I downloaded this app and it immediately started making my phone freeze up every two seconds. My phone was running smoothly before this app. I’ve had to restart my phone multiple times yet it doesn’t resolve the issue. For some reason I now have missing pictures and notes in my phone after downloading this app and I’m worried they may have hacked into my phone and starting deleting my content. DO NOT DOWNLOAD THIS APP IF YOU VALUE YOUR PHONE!!!!!!! ZERO STARS!!!!!!","userName":"SoilToTheSun","rating":1}},{"id":"6176477385","type":"user-reviews","attributes":{"date":"2020-07-09T12:25:26Z","isEdited":false,"title":"DO NOT DOWNLOAD","review":"This app is horrible it took many days to download. Once it finally downloaded there were so many pop up adds and when I accidentally clicked one it took me to a strange website and now my phone is full with viruses and my Apple ID and other passwords have been stolen. Not to mention my phone was barely functioning because of all the viruses so I had to buy a whole new phone. DO NOT BUY. It is a terrible app and I wish I could give it 0 stars.","userName":"jpjpjhd","rating":1}},{"id":"6176366346","type":"user-reviews","attributes":{"date":"2020-07-09T11:54:47Z","isEdited":false,"title":"Do NOT download: he’s hoovering our data","review":"That’s right, I said it, he’s taking our information on our phones through the app. I was wondering why my other apps weren’t working as well, and I realized it was because this app was working and taking all the energy to take my information. If this app can’t convince you to go off the grid, I don’t know what will. It’s a secret little virus, and I want to tell you guys that before you make the same mistake I did. Do NOT DOWNLOAD!!!!!!","userName":"O.M.G.!","rating":1}},{"id":"6176354373","type":"user-reviews","attributes":{"date":"2020-07-09T11:51:23Z","isEdited":false,"title":"Not even worth one star.","review":"It simply just does not work whatsoever. Opened it ONCE and all my phones data has been swiped off. Can’t even open this app anymore without my phone completely crashing. This is absolute and UTTER garbage to say the very very least. Absolutely do not download this unless you have stuff you have that’s not valuable to you. Overall very sus, huge waste of time, space, and literally not worth anything. 0 out of 10, this ain’t it.","userName":"tiredkaren","rating":1}},{"id":"6176334736","type":"user-reviews","attributes":{"date":"2020-07-09T11:45:48Z","isEdited":false,"title":"Save yourself a headache!","review":"It glitches so much that at one point it made my phone crash. This has never happened until I opened this app and am regretting even hearing about it. It also promotes hate and ignorance and then asks me for money? Why does he want my money? The moment I logged on it was just shoving it in my face asking for money when I had already clearly stated that I didn’t want to give. Overall I wish I could give it 0 stars for the headache it caused me.","userName":"itwasntme1312","rating":1}},{"id":"6176220619","type":"user-reviews","attributes":{"date":"2020-07-09T11:11:40Z","isEdited":false,"title":"DO NOT DOWNLOAD 😤 It will mess up your phone","review":"I downloaded this app to support my president but the moment I do my phone starts to glitch out. My screen turned black and I couldn’t get my phone to work FOR AN HOUR. I did a diagnosis on my phone to see what the issue was and there was a trojan virus on my phone. I have NEVER in my life had an issue with downloading apps but this app messed up my phone completely. I have to now go reset my phone for it to ever work again.","userName":"ortizaa00","rating":1}}]}