{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=98750","data":[{"id":"6176985339","type":"user-reviews","attributes":{"date":"2020-07-09T14:40:41Z","isEdited":false,"userName":"gravykasten","review":"i want obama back","rating":1,"title":"Goodbye"}},{"id":"6176949029","type":"user-reviews","attributes":{"date":"2020-07-09T14:30:57Z","isEdited":false,"userName":"itis a good app","review":"I hate trump and he ugly and don’t delete TikTok","rating":1,"title":"TikTok"}},{"id":"6176940692","type":"user-reviews","attributes":{"date":"2020-07-09T14:28:45Z","isEdited":false,"userName":"dont get this game pls","review":"One star... thank you","rating":1,"title":"Gen Z"}},{"id":"6176922922","type":"user-reviews","attributes":{"date":"2020-07-09T14:24:06Z","isEdited":false,"userName":"im,o","review":"This is a terrible app.","rating":1,"title":"Terrible app"}},{"id":"6176896399","type":"user-reviews","attributes":{"date":"2020-07-09T14:17:12Z","isEdited":false,"userName":"themann867","review":"Very bad","rating":1,"title":"Thanks I hate it"}},{"id":"6176884174","type":"user-reviews","attributes":{"date":"2020-07-09T14:13:56Z","isEdited":false,"userName":"JNominator","review":"oh my GOSH. so i totally downloaded this app for a RAD time. i  L O V E  donald and consistently have fantasies about him—to the point where my libtard family and my nonexistent friends bash me!! so rude. so unaccepting. so LIBERAL. typical for the FAKE NEWS PARTY. anyhoo, i came to this app for free images of trump—the most beautiful man alive—but when i downloaded it, TRAGEDY STRUCK. i was expecting revealing photos of my PREZ and fancy photos and great photos and fun photos to daydream about—maybe even some VIDEOS TOOOOO. but i opened this g0dforsaken app and the first thing i see is my phone slowly turning green!! the app released DEMONS—HIGH. SCHOOL. DEMONS.—INTO MY PHONE!! I screamed so loud that even my LIBTARD FAMILY was concerned. When seeing I downloaded the app, released demons into my phone which then ran through the interweb into THEIR PHONES—which was the ONLY good thing that came out of this. Stupid LIBERALS got what they DESERVED. So when they saw this, THEY KICKED ME OUT OF THE HOUSE. I’ve been homeless for three weeks now, without a phone, without a family, without friends, without access to water or food, and it is tough to live like this. I’m only able to write this review because I’m using some unconscious strangers phone!! My phone is completely broken because of this STUPID APP. It clearly is not an app for US TRUMP FANS, THE ONES IN THE RIGHT, LOVE THIS CULT SO MUCH PRAISE TRUMP LIKE WE PRAISE GOD. It is an app made by the LIBERALS to DISGRACE our PRESIDENTS WONDERFUL and UNTARNISHED name. Because of this LIBERAL app, I am homeless, starving, alone, haunted by demons, and sleeping next to my unconscious friend. Anyhoo, tax the poor and get rid of funding for the homeless!! I’m sure that’ll help out my situation.","rating":1,"title":"demons 😱"}},{"id":"6176865902","type":"user-reviews","attributes":{"date":"2020-07-09T14:09:11Z","isEdited":false,"userName":"AJ Pascual","review":"i don’t like this app. no one likes this app. this app should go. thank you","rating":1,"title":"tiktok"}},{"id":"6176865802","type":"user-reviews","attributes":{"date":"2020-07-09T14:09:10Z","isEdited":false,"userName":"Bubba suarus","review":"how can an app be so bad , well then again a cheeto made it","rating":1,"title":"all i can say is ✨ew ✨"}},{"id":"6176832862","type":"user-reviews","attributes":{"date":"2020-07-09T14:00:30Z","isEdited":false,"userName":"KayKayCat717","review":"this app is ✨bad✨ idk it’s just like scary and gross and there’s nothing to do?","rating":1,"title":"app is awful"}},{"id":"6176752220","type":"user-reviews","attributes":{"date":"2020-07-09T13:39:11Z","isEdited":false,"userName":"truthful is good","review":"My rat was allergic to oranges and after it saw trump...😭😭😭😤","rating":1,"title":"Trump killed my rat 😔"}}]}