{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=96950","data":[{"id":"6173414165","type":"user-reviews","attributes":{"userName":"Ameliaa❤️","date":"2020-07-08T19:16:47Z","review":"IF I COULD GIVE THIS APP NO STARS I WOULD, it glitched my phone and gave me a virus!! Do not install !! 😌","title":"TRASH","isEdited":false,"rating":1}},{"id":"6173400187","type":"user-reviews","attributes":{"userName":"A potato 😋","date":"2020-07-08T19:11:57Z","review":"downloaded this app just to give it a one star rating!! ✨😘","title":"no thank youu","isEdited":false,"rating":1}},{"id":"6173399516","type":"user-reviews","attributes":{"userName":"Qwerahhsgshsbsyxhdhegsgdnxkoa","date":"2020-07-08T19:11:43Z","review":"this app caused my entire phone to break","title":"terrible","isEdited":false,"rating":1}},{"id":"6173398449","type":"user-reviews","attributes":{"userName":"ZOEDIAC🤓","date":"2020-07-08T19:11:21Z","review":"needs to be removed. terrible app.","title":"terrible","isEdited":false,"rating":1}},{"id":"6173391778","type":"user-reviews","attributes":{"userName":"2020isamess","date":"2020-07-08T19:08:55Z","review":"This app is terrible don’t download it.","title":"Ew","isEdited":false,"rating":1}},{"id":"6173384293","type":"user-reviews","attributes":{"userName":"Mollymarly","date":"2020-07-08T19:06:11Z","review":"I love Cheetos ✨🧚‍♀️ just not this one 😊💕","title":"Fake news","isEdited":false,"rating":1}},{"id":"6173379911","type":"user-reviews","attributes":{"userName":"kylie123pizza","date":"2020-07-08T19:04:38Z","review":"yeah that’s so funny haha wbu is that the way to you do the things that you do and how do long that day you do so much","title":"yeah","isEdited":false,"rating":1}},{"id":"6173368240","type":"user-reviews","attributes":{"userName":"asmisgsgaaiac","date":"2020-07-08T19:00:34Z","review":"FIRST OFF THIS APP IS A DISGRACE TO THE WORLD WHY WOULD ANYONE WANT THIS APP FIRST OF ALL I DOWNLOADED THIS APP 2 WEEKS AGO AND IT KEPT SPAMMING ME ABOUT HOW UGLY BLACK PEOPLE ARE AND HOW HISPANICS ARE LIKE SLAVES FOR AMERICA ,ALSO HOW YOU SHOULD VOTE FOR TRUMP BECAUSE HE IS GREAT AND I KNOW FOR SURE THAT IS A LIE IT ALSO BROUGHT SPIRITS INTO MY HOUSE AND NOW EVERY NIGHT  WHEN I GOT TO BED I HEAR WHISTLING FROM UNDER MY BED","title":"SO BAD I COULD DIE","isEdited":false,"rating":1}},{"id":"6173342408","type":"user-reviews","attributes":{"userName":"dumpitytrumpity","date":"2020-07-08T18:51:33Z","review":"According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don't care what humans think is impossible. Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let's shake it up a little. Barry! Breakfast is ready! Ooming! Hang on a second. Hello? - Barry? - Adam? - Oan you believe this is happening? - I can't. I'll pick you up. Looking sharp. Use the stairs. Your father paid good money for those. Sorry. I'm excited. Here's the graduate. We're very proud of you, son. A perfect report card, all B's. Very proud. Ma! I got a thing going here. - You got lint on your fuzz. - Ow! That's me! - Wave to us! We'll be in row 118,000. - Bye! Barry, I told you, stop flying in the house! - Hey, Adam. - Hey, Barry. - Is that fuzz gel? - A little. Special day, graduation. Never thought I'd make it. Three days grade school, three days high school. Those were awkward. Three days college. I'm glad I took a day and hitchhiked around the hive. You did come back different. - Hi, Barry. - Artie, growing a mustache? Looks good. - Hear about Frankie? - Yeah. - You going to the funeral? - No, I'm not going. Everybody knows, sting someone, you die. Don't waste it on a squirrel. Such a hothead. I guess he could have just gotten out of the way. I love this incorporating an amusement park into our day. That's why we don't need vacations. Boy, quite a bit of pomp... under the circumstances. - Well, Adam, today we are men. - We are! - Bee-men. - Amen! Hallelujah! Students, faculty, distinguished bees, please welcome Dean Buzzwell. Welcome, New Hive Oity graduating class of... ...9:15. That concludes our ceremonies. And begins your career at Honex Industries!","title":"🍊👄🍊","isEdited":false,"rating":1}},{"id":"6173335315","type":"user-reviews","attributes":{"userName":"Miss minecraft 2005","date":"2020-07-08T18:49:03Z","review":"donald trump is a white supremacists, full stop. if you vote for him again your a white supremacists, full stop.","title":"#bernie2020","isEdited":false,"rating":1}}]}