{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30740","data":[{"id":"6172854787","type":"user-reviews","attributes":{"date":"2020-07-08T16:16:32Z","title":"Terrible app!! Do NOT download!!","isEdited":false,"rating":1,"review":"My phone started glitching for no apparent reason as soon as the app was downloaded. Logging into the app is impossible and feels pretty sketchy. First my phone glitches then the app asks for my information?!? Seems like conspiracy to me...don’t trust this app!!","userName":"Awesome teeth"}},{"id":"6172852183","type":"user-reviews","attributes":{"date":"2020-07-08T16:15:45Z","title":"DONT GET THIS APP","isEdited":false,"rating":1,"review":"This is worst app I seen of my entire life everything about this app is messed up and writing this stop you from getting it in telling you don’t get it it’s all bad all the information bad everything bad don’t get it worse app ever created","userName":"aamanimarie952"}},{"id":"6172849706","type":"user-reviews","attributes":{"date":"2020-07-08T16:15:00Z","title":"The worst thing in the world","isEdited":false,"rating":1,"review":"I was on it and then I deleted it and then I kept on getting notifications saying that you better get on it right now. I was getting threats so I will not try this app out if you do please after give it a bad review.","userName":"dboydylan"}},{"id":"6172847308","type":"user-reviews","attributes":{"date":"2020-07-08T16:14:16Z","title":"Not good, very bad.","isEdited":false,"rating":1,"review":"I’m writing this review because the facts and the evidence show that this app is not very good. I have multiple sources saying that this app is bad. And I should know, I’m an expert at apps. I’m better at apps than anybody can imagine. This needs to be taken down immediately.","userName":"he cannot get a kiss kiss"}},{"id":"6172843316","type":"user-reviews","attributes":{"date":"2020-07-08T16:13:06Z","title":"My phone broke bc of this app","isEdited":false,"rating":1,"review":"I downloaded this app bc I was torn in who to vote for. Immediately after downloading I got a virus on my phone causing it to crash. I brought it to an Apple store but it could not be fixed. I just lost a brand new 1100 dollar phone bc of this app.","userName":"Gameight"}},{"id":"6172841002","type":"user-reviews","attributes":{"date":"2020-07-08T16:12:24Z","title":"WARNING","isEdited":false,"rating":1,"review":"DO NOT DOWNLOAD THIS APP. I downloaded the app and as I went to open it I instantly turned into a Cheeto...yes, a Cheeto. Now when people look at me all they see is a “snack” when I am AN ENTIRE FRICKIN MEAL. This app has changed my entire identity for the worse and I cannot just sit back and let it destroy more peoples lives.","userName":"JeffKra"}},{"id":"6172832333","type":"user-reviews","attributes":{"date":"2020-07-08T16:09:51Z","title":"worst app ever","isEdited":false,"rating":1,"review":"i got this app to maybe find a way to like our president but it takes SOOO long to download & it makes my phone glitch. nobody wants an app that does that so i just deleted it. i do not recommend this app, it is terrible. rather not like my president anyways lol","userName":"sillycooch123"}},{"id":"6172807169","type":"user-reviews","attributes":{"date":"2020-07-08T16:02:41Z","title":"Horrible App","isEdited":false,"rating":1,"review":"This app took ages to download and also runs very slow. Also, before logging in I had a lot of problems bc it kept kicking me out of the app. It took me forever to even log in. This app is just trash. Do not recommend!!","userName":"BrigitteAg"}},{"id":"6172778915","type":"user-reviews","attributes":{"date":"2020-07-08T15:54:34Z","title":"my life is now ruined 😭✨🧚","isEdited":false,"rating":1,"review":"i downloaded this app a couple days ago. ever since then my phone has been glitching out and my phone has been getting hacked. i think it ruined me downloading this app. why would i ever think it’s okay to download a TRUMP app. gross 😤🤢","userName":"fr0ggy80"}},{"id":"6172774078","type":"user-reviews","attributes":{"date":"2020-07-08T15:53:11Z","title":"Terrible.","isEdited":false,"rating":1,"review":"There is some weird orange man on the cover as soon as the app loads which it took almost an hour to do so and wouldn’t allow me to exit it until it had fully loaded. Sadly I would never have put this app on the App Store entirely.","userName":"manny is angry"}}]}