{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=34220","data":[{"id":"6173234979","type":"user-reviews","attributes":{"review":"This app is Not help fill it just reasons you vote for trump witch I looked up and half are not even true and it talks about how he is a better president that Obama and he is doing soo much better I think not don’t even bother downloading it","title":"Don’t download","date":"2020-07-08T18:16:13Z","isEdited":false,"rating":1,"userName":"big_eze_0505"}},{"id":"6173212476","type":"user-reviews","attributes":{"review":"while i was downloading the app, i started to have a stroke from all the misleading and horrible information being passed to me. all i wanted to do was learn about the orange president. but while doing so, i read that was a white supremist, misogynistic, fascist, and a absolutely horrible president! i couldn’t believe my eyes! while reading information, i had a stroke. this stroke caused me to go to the hospital and i now have to take meds for this! thanks a lot donald.","title":"made me have a stroke!","date":"2020-07-08T18:08:48Z","isEdited":false,"rating":1,"userName":"leave tiktok alone."}},{"id":"6173145468","type":"user-reviews","attributes":{"review":"To start off this app took so much time to download. I have a lot of storage on my phone and fast WiFi. This app was hard to navigate too. I didn’t understand any of the directions in the app. This app deserves a 1 star. DO NOT GET.","title":"Terrible App.","date":"2020-07-08T17:47:11Z","isEdited":false,"rating":1,"userName":"Starlight Bear"}},{"id":"6173136581","type":"user-reviews","attributes":{"review":"It made my phone glitch several times, it also shows false information, lastly it shows inappropriate information for my young mind. Now I can’t get those thoughts out of my mind 😭I’m literally crying because it’s very disgusting.","title":"DO NOT GET THIS APP I REPEAT DO NOT GET THIS APP !","date":"2020-07-08T17:44:24Z","isEdited":false,"rating":1,"userName":"idontknowamickname"}},{"id":"6173136350","type":"user-reviews","attributes":{"review":"I downloaded this app to see why we would re-elect our president, but \nIt took forever to download and took up a lot of space on my phone. I don’t understand the meanings of this app and it should not be on the App Store at all","title":"no❤️","date":"2020-07-08T17:44:20Z","isEdited":false,"rating":1,"userName":"mazz🙈🤩"}},{"id":"6173093700","type":"user-reviews","attributes":{"review":"I downloaded this app and apparently, it is a extremely racist and horrible platform that I don’t agree with. I expected way better than this type of content. This is a horrible app.","title":"I dislike this app 100%.","date":"2020-07-08T17:30:43Z","isEdited":false,"rating":1,"userName":"kakegurui fan ;)"}},{"id":"6173089152","type":"user-reviews","attributes":{"review":"Why does this app want so much from me? It started asking for my vote and my allegiance. My soul. It even tried to reach through the phone and grab me. What evil is this? This is a very scary app. Worse that than Momo stuff that was around a while ago.","title":"A Nightmare!","date":"2020-07-08T17:29:18Z","isEdited":false,"rating":1,"userName":"AndroBeauty"}},{"id":"6173072116","type":"user-reviews","attributes":{"review":"Who want this guy as a president he’s racist and doesn’t support the blm movement Obama would try his best to make a stand with his people and trump had a swat team tear gas a peaceful protest just to take a picture with a bible and all u Trump supporters need to really think about “your president”.\nDo better","title":"Cheeto 🔸🟠🔸","date":"2020-07-08T17:23:45Z","isEdited":false,"rating":1,"userName":"lil_short_boi_1017"}},{"id":"6173063902","type":"user-reviews","attributes":{"review":"this app is such an eyesore. i could not last a minute looking at such an orange man. the graphics are so bad i suggest replacing that very ugly, underdeveloped, and bad quality orange bot with maybe Bernie Sanders, or Barack Obama. please fix the graphics. it is also confusing and does not work.","title":"it gave me a seizure","date":"2020-07-08T17:21:06Z","isEdited":false,"rating":1,"userName":"america is built off racism"}},{"id":"6173060548","type":"user-reviews","attributes":{"review":"This app is terrible!! I thought this would give information on trumps ideologies and what he wants to do with his position but none of that! And my phone started slowing down a day after I bought it","title":"Worst app I’ve ever bought","date":"2020-07-08T17:20:02Z","isEdited":false,"rating":1,"userName":"bella 😻"}}]}