{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35650","data":[{"id":"6177895039","type":"user-reviews","attributes":{"date":"2020-07-09T19:09:45Z","isEdited":false,"review":"The app was glitching and kept taking me out of the app every time I tried to open it!! It was making me so mad and I just wanted to see what he had planned and can’t because the app won’t let me!!","title":"Glitching!!","rating":1,"userName":"tater.Anonymous"}},{"id":"6177892690","type":"user-reviews","attributes":{"date":"2020-07-09T19:08:59Z","isEdited":false,"review":"This app is absolute garbage✨ you want your phone to crash? 👁 Go ahead☺️ download it🤗 want to see an orange 🍊? Go ahead mate? Want to support racism homophobia and a pedo as well as a terrible person overall go ahead mate!🤮 id rather not this app needs to be GONE!","title":"Garbage","rating":1,"userName":"PRETTYGURLSHATETRUMP"}},{"id":"6177884229","type":"user-reviews","attributes":{"date":"2020-07-09T19:06:12Z","isEdited":false,"review":"okay so i downloaded the app and at first it was awful as expected. but then it got worst it was telling all these lies about  the rapist that’s in the white house saying he wasn’t a racist and that he was pro lbgqt when he clearly isn’t!! yeah it’s just full of lies and i’m honestly disgusted by the whole thing! they also promised that things will get better and it lied! i’m just keep watching the simpsons and hoping it’s right!!","title":"trump 2020 on a tombstone","rating":1,"userName":"cowua"}},{"id":"6177873203","type":"user-reviews","attributes":{"date":"2020-07-09T19:02:43Z","isEdited":false,"review":"The app was super buggy and had nazi products available on it. Would not recommend for others. It kept glitching out every time I logged on saying I was a radical left antifa terrorist.","title":"Buggy app","rating":1,"userName":"mmmxmvi"}},{"id":"6177857625","type":"user-reviews","attributes":{"date":"2020-07-09T18:57:52Z","isEdited":false,"review":"The app lags out every 30 seconds, and sends constant notifications for about the same amount of time. Very disappointed, I’m just gonna re install the Obama one.","title":"Buggy","rating":1,"userName":"lldodkd"}},{"id":"6177839755","type":"user-reviews","attributes":{"date":"2020-07-09T18:52:32Z","isEdited":false,"review":"downloaded the app to see what trumps plans were if he was elected and what he was doing during the election although it spammed me with notifications and asked me a lot of questions and I did not like it","title":"Spam","rating":1,"userName":"jfsjcgchgstsgjvjcj"}},{"id":"6177805651","type":"user-reviews","attributes":{"date":"2020-07-09T18:42:30Z","isEdited":false,"review":"There’s many problems: \n1. This app is completely biased and there’s no facts here. So this shouldn’t be in the news category. \n2. The app is very hard to navigate and has a many pop ups\n3. It’s all biased and the facts that they represent are not truly facts\n4. Has its own Hate Speech against other politicians and makes allegations with no evidence\n\nThese are the reasons I will be deleting this app and never touching it again.","title":"How is this...News?","rating":1,"userName":"tumbleweed.exe"}},{"id":"6177804489","type":"user-reviews","attributes":{"date":"2020-07-09T18:42:09Z","isEdited":false,"review":"Very glitchy and poorly designed app. I would not recommend to anyone. Do not download if you don’t want to be gravely disappointed by the horrible interface!","title":"Not the Move","rating":1,"userName":"PorcupineHedge123"}},{"id":"6177800094","type":"user-reviews","attributes":{"date":"2020-07-09T18:40:50Z","isEdited":false,"review":"Took forever to download and then when I opened it the application just kept crashing over and over and saying it can’t open","title":"Horrible app","rating":1,"userName":"LeonThomas128433"}},{"id":"6177786684","type":"user-reviews","attributes":{"date":"2020-07-09T18:36:47Z","isEdited":false,"review":"this big fat cheeto thinks that he xould make an app and we would all like it? no hoeny❤️. i am so scared because i have seen things i did not want to...i saw the cheetos mAns pp. it was indeed a cheeto, like himself. i do not recommend this app please rate it 1 star❤️😻.","title":"this app is trash","rating":1,"userName":"cheeto mans wife- melania"}}]}