{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22840","data":[{"id":"6175110801","type":"user-reviews","attributes":{"review":"This app killed my mother, my father,  and my pet turtle and so then when I went to their funerals to my surprise I found the app there as well so not only does this app have an insatiable hunger for murder it also has the audacity to rap 6ix9ine at my mother’s, father’s, and turtle’s funerals whilst maintaining an ominous glare at me pls don’t get this app in respect for mr. pinky. 🐢😪fly high angel","userName":"casandra delrio","title":"This app is the wooooorst","rating":1,"date":"2020-07-09T04:42:42Z","isEdited":false}},{"id":"6175093250","type":"user-reviews","attributes":{"review":"I downloaded this app with high expectations but as soon as I logged in it was showing images of uncooked eggs. I exited out thinking it was a glitch but now about every 5 mins (even after I deleted the app and restarted my phone) an image of an uncooked egg pops up on the right corner of my screen. Thanks a lot.","userName":"Skaggnetti","title":"DO NOT USE THIS APP","rating":1,"date":"2020-07-09T04:37:00Z","isEdited":false}},{"id":"6175090555","type":"user-reviews","attributes":{"review":"i downloaded this app with the hopes of cheeto bunker boy telling me jokes when i prompt him. instead what I got was a shameful pile of garbage. this app made my cat throw up which caused me to have to buy a new rug. my shoes were running after me on my way to delete this terrible awful horrible app. take this down for the safety of all consumers","userName":"bunkerbish69","title":"TERRIBLE","rating":1,"date":"2020-07-09T04:36:07Z","isEdited":false}},{"id":"6175072563","type":"user-reviews","attributes":{"review":"If I could give this app 0 stars I would. It would always glitch out and shut down. I would receive WAY to many notifications, often the same ones spammed to me. I worried it was infringing on the well-being of my phone. I deleted it IMMEDIATELY. I hope the App Store does too.","userName":"shdben.","title":"Horrible App","rating":1,"date":"2020-07-09T04:30:27Z","isEdited":false}},{"id":"6175055393","type":"user-reviews","attributes":{"review":"“I was a girl in the village doing alright\nthen I became became a princess overnight\nNow I gotta figure out how to do it right \nso much to learn and see”\n\nWish the app took this advice, I had the worst experience with it and I would not recommend at all. You have to sign up to use the app which is ridiculous. If the app really was the greatest of all apps, I should not have to sign up for me to be able to use it. Especially after how much Trump brags how his work is amazing and one of a kind. He needs to be able to figure out how to do it right.","userName":"S0fia the first","title":"Don’t get this app","rating":1,"date":"2020-07-09T04:25:07Z","isEdited":false}},{"id":"6175044496","type":"user-reviews","attributes":{"review":"i downloaded this app and instantly i was met with president trump himself jumping out of my phone screen. He immediately made his way over to my grandmother and dropped kicked her so hard her wig flew across the room. i have never seen anything so disrespectful in my life!!!! don’t get this app unless u hate your grandmother.","userName":"LL Cool J's cool cousin","title":"worst app ever!!!","rating":1,"date":"2020-07-09T04:21:45Z","isEdited":false}},{"id":"6175043206","type":"user-reviews","attributes":{"review":"WARNING. This app has been reported to be STEALING DATA for COMMUNIST COUNTRIES!!! This app should be banned and removed!! Apple do something!! \nAccording to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyways. Because bees don't care what humans think is impossible.","userName":"ACAB 🧚🏻✨💕","title":"STEALS YOUR DATA","rating":1,"date":"2020-07-09T04:21:22Z","isEdited":false}},{"id":"6175038510","type":"user-reviews","attributes":{"review":"The fact that an app exists to support Trump’s re election campaign is disgusting. This app by existing promotes bigotry, racism, sexism, xenophobia, homophobia, islamophobia, and boy does that list go on. The existence of this app disgraces the app store that has provided us with enthralling and positive hits like temple run and subway surfer. I’m embarrassed for the apple app store to include and promote such a terrible app like this one.","userName":"aaddddddsss","title":"Simply disgusting","rating":1,"date":"2020-07-09T04:19:52Z","isEdited":false}},{"id":"6175015737","type":"user-reviews","attributes":{"review":"This app is so glitchy. Just so horrible so bad. You go into it, it crashes. You get out of it, it crashes. It’s a virus. A very very bad thing this virus. I think it’s the Russians trying to get to us again. We have to do something about it. And we are. We are doing incredible things to get the Russians off this app.","userName":"Hoffer12199","title":"So bad .","rating":1,"date":"2020-07-09T04:12:39Z","isEdited":false}},{"id":"6175000388","type":"user-reviews","attributes":{"review":"So this app was so slow and took my house and my car now I sleep outside and me brother said to say bye to Trump cause he not about to be president then I’ll get me house and car back        cause he’s the one who took it and he doesn’t think my life matters so yea and he might die cause the Simpson’s never lie  haha xoxo","userName":"well bye","title":"I hate this app it’s horrible","rating":1,"date":"2020-07-09T04:07:45Z","isEdited":false}}]}