{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=108630","data":[{"id":"6178053538","type":"user-reviews","attributes":{"date":"2020-07-09T20:01:35Z","isEdited":false,"review":"NOPE YALL NOT GONNA DELETE DAT APP we need it..btw my user is Rain_the_dino777","title":"❄️tiktok❄️","rating":1,"userName":"na dat app better not"}},{"id":"6178046363","type":"user-reviews","attributes":{"date":"2020-07-09T19:59:15Z","isEdited":false,"review":"this app is terrible.","title":"this is bad","rating":1,"userName":"lolidekwhatihadtidothid"}},{"id":"6178037649","type":"user-reviews","attributes":{"date":"2020-07-09T19:56:22Z","isEdited":false,"review":"This app disgusted me ✨chair❤️but make it electric✨🧚‍♀️😜","title":"no❤️","rating":1,"userName":"Lizbeth Boyd"}},{"id":"6178035269","type":"user-reviews","attributes":{"date":"2020-07-09T19:55:35Z","isEdited":false,"review":"aint nobody gonna wanna vote for sum racist mans who rapes women. bye🤩🙏🏾🧚🏼✨","title":"Trump2020ForTheGrave🤩✨🇺🇸","rating":1,"userName":"mfdofjejfiissejjddj"}},{"id":"6177985428","type":"user-reviews","attributes":{"date":"2020-07-09T19:39:15Z","isEdited":false,"review":"Trash","title":"Trash","rating":1,"userName":"Suprakid0751"}},{"id":"6177983840","type":"user-reviews","attributes":{"date":"2020-07-09T19:38:44Z","isEdited":false,"review":"Trash","title":"Trash","rating":1,"userName":"ngbws tiskfbjwkw"}},{"id":"6177952084","type":"user-reviews","attributes":{"date":"2020-07-09T19:28:27Z","isEdited":false,"review":"i got this app and opened it up to se a cheeto","title":"trump","rating":1,"userName":"sdffhgfhhbfvc"}},{"id":"6177942336","type":"user-reviews","attributes":{"date":"2020-07-09T19:25:16Z","isEdited":false,"review":"Trash","title":"Trash","rating":1,"userName":"tumai123456789"}},{"id":"6177938614","type":"user-reviews","attributes":{"date":"2020-07-09T19:24:03Z","isEdited":false,"review":"this app is disgusting 🤢🤢🤢0/10","title":"trash","rating":1,"userName":"yęah❤️"}},{"id":"6177932051","type":"user-reviews","attributes":{"date":"2020-07-09T19:21:55Z","isEdited":false,"review":"I hate this app so much. Its highly offensive. There is this really ugly Cheeto that is on screen and it is very disturbing. The places where he announces his rallies are very offensive to natives and black communities. He is misogynistic, Xenophobic, homophobic, racist, and a sensitive little snowflake. He threatens the use of freedom of speech and the rights of many and supports white supremacy. I cannot express my deep hatred for this thing we call the president. A little bunker baby should not be allowed to go into office.\n\n When in the Course of human events, it becomes necessary for one People to dissolve the Political Bands which have connected them with another, and to assume among the Powers of the earth, the separate and equal Station to which the Laws of Nature and of Nature’s God entitle them, a decent Respect to the Opinions of Mankind requires that they should declare the causes which impel them to the Separation.\nWe hold these Truths to be self-evident, that all Men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty, and the pursuit of happiness—That to secure these Rights, Governments are instituted among Men, deriving their just Powers from the Consent of the Governed, that whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its Foundation on such Principles, and organizing its Powers in such Form, as to them shall seem most likely to effect their Safety and happiness. Prudence, indeed, will dictate that Governments long established should not be changed for light and transient Causes; and accordingly all experience hath shewn, that Mankind are more disposed to suffer, while evils are sufferable, than to right themselves by abolishing the Forms to which they are accustomed. But when a long Train of Abuses and Usurpations, pursuing invariably the same object, evince design into reduce them under absolute Despotism, it is their Right, it is their Duty, to throw off such Government, and to provide new Guards for their future Security. Such has been the patient Sufferance of these Colonies; and such is now the Necessity which constrains them to alter their former Systems of Government. The history of the present King of Great-Britain is a history of repeated Injuries and Usurpations, all having in direct Object the establishment of an absolute Tyranny over these States. To prove this, let Facts be submitted to a candid World.\nhe has refused his Assent to Laws, the most wholesome and necessary for the public Good.\nhe has forbidden his Governors to pass Laws of immediate and pressing Importance, unless suspended in their Operation till his Assent should be obtained; and when so suspended, he has utterly neglected to attend to them.\nhe has refused to pass other Laws for the Accommodation of large Districts of People, unless those People would relinquish the Right of Representation in the Legislature, a Right inestimable to them, and formidable to Tyrants only.\nhe has called together Legislative Bodies at Places unusual, uncomfortable, and distant from the Depository of their public Records, for the sole Purpose of fatiguing them into Compliance with his Measures.\nhe has dissolved Representative houses repeatedly, for opposing with manly Firmness his Invasions on the Rights of the People.\nhe has refused for a long Time, after such Dissolutions, to cause others to be elected; whereby the Legislative Powers, incapable of Annihilation, have returned to the People at large for their exercise; the State remaining in the mean time exposed to all the Dangers of Invasion from without, and Convulsions within.\nhe has endeavoured to prevent the Population of these States; for that Purpose obstructing the Laws for Naturalization of Foreigners; refusing to pass others to encourage their Migrations hither, and raising the Conditions of new Appropriations of Lands.\nhe has obstructed the Administration of Justice, by refusing his Assent to Laws for establishing Judiciary Powers.\nhe has made Judges dependent on his Will alone, for the Tenure of their Offices, and the Amount and Payment of their Salaries.\nhe has erected a Multitude of new Offices, and sent hither Swarms of Officers to harrass our People, and eat out their Substance.\nhe has kept among us, in Times of Peace, Standing Armies, without the consent of our Legislatures.\nhe has affected to render the Military independent of and superior to the Civil Power.\nhe has combined with others to subject us to a Jurisdiction foreign to our Constitution, and unacknowledged by our Laws; giving his Assent to their Acts of pretended Legislation:\nFor quartering large Bodies of Armed Troops among us:","title":"Awful","rating":1,"userName":"abbieeyi"}}]}