{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=140990","data":[{"id":"6179464841","type":"user-reviews","attributes":{"userName":"Waste od time","review":"I could not believe the app was so horrible to use. Not useful at all, not been working correctly. Doesn’t update with correct information and news. Dissatisfied with overall performance! Don’t waste your time!","title":"Horrible","rating":1,"isEdited":false,"date":"2020-07-10T04:39:20Z"}},{"id":"6179464848","type":"user-reviews","attributes":{"userName":"trump smeels very stinky","review":"This app is very bad and i highly don’t recommend. It is very inconvenient to use \nand always crashes. I really hope apple deletes it cus i dont like it. And my opinion is the only one that matters. Also i dont my daily dose of trump on it. Im so maddd😡. This is the worst app ever. Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly  Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly  Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly Rlly rlly rlly rlly bad. Dont reccomend 0 ⭐️s.....","title":"The app is bad","rating":1,"isEdited":false,"date":"2020-07-10T04:39:20Z"}},{"id":"6179464826","type":"user-reviews","attributes":{"userName":"Happy the depressed cat","review":"Trump 2020? More like Trump can’t make an app that doesn’t crash every five seconds : / very disappointing. I’m voting for Kanye","title":"Truly terrible","rating":1,"isEdited":false,"date":"2020-07-10T04:39:20Z"}},{"id":"6179464747","type":"user-reviews","attributes":{"userName":"Auragem","review":"I downloaded this app but then it started slowing down my phone! Not only that but I kept seeing the president show up which made me throw up and go to the hospital!!!\nI feel sick and nauseous now because I absolutely hate seeing life sized cheese cheeto puffs🤮\nThis definitely deserves a one star in my book!\nIf you get the app leave a\nONE STAR REVIEW\nyou will NOT regret it!\nI have warned you\nalso this app took up a bunch of space so I couldn’t download my anime dating simulator games 🤬🤬\nWORST\nAPP \nEVER!!","title":"Worst app ever","rating":1,"isEdited":false,"date":"2020-07-10T04:39:18Z"}},{"id":"6179464638","type":"user-reviews","attributes":{"userName":"nsnsio","review":"I am just desperate for tiktok to stay around","title":".","rating":1,"isEdited":false,"date":"2020-07-10T04:39:15Z"}},{"id":"6179464603","type":"user-reviews","attributes":{"userName":"Lakdoeiehdbfjeoahdbdkaorjd","review":"Absolutely disgraceful. I downloaded this application with the hopes of supporting our incredible president in our upcoming election but literal MINUTES after downloading a flurry of terrifying events occurred.\nAt first, I couldn’t figure my way around the app because the controls are garbage!! I couldn’t click on anything?? 😡\nTHEN my screen was slowly filled with some unfamiliar language??? I was told it was Chinese or Russian but I THOUGHT THIS APP WAS AMERICAN WHAT BLASPHEMY IS THIS???? \nFollowing the strange language my entire phone crashed and my information was sent to Chinese servers, resulting in a series of charges to my credit card I LOST HUNDREDS!!!\nAfter this calamity I have no respect for this awful app and I hope it rots in hell!! Someone needs to get a priest to bless this unholy creation before it can be taken over by the devil and take our SOULS along with our private information!!!","title":"How can they claim to be supporters of our lord and savior trump??","rating":1,"isEdited":false,"date":"2020-07-10T04:39:15Z"}},{"id":"6179464538","type":"user-reviews","attributes":{"userName":",xhlxhpfhpfjdhl","review":"I’m gonna I was gonna we got a lot to say to you say youesay yetwt tis twas morning twas was","title":"I HATE THIS APP AND TRUMP","rating":1,"isEdited":false,"date":"2020-07-10T04:39:13Z"}},{"id":"6179464565","type":"user-reviews","attributes":{"userName":"Game guy 0311","review":"I am apart of GenZ so this is the only reason why i am doing this. Trump ALMOST banned TikTok in the U.S cause we ruined his rally and he got his feeling hurt. So GenZ decided to rate this app a 1 star. If you don’t know, once an app hits 1 star and/or under it gets taken off the app store.💅🏼😽✨","title":"TikTok Revenge","rating":2,"isEdited":false,"date":"2020-07-10T04:39:14Z"}},{"id":"6179464492","type":"user-reviews","attributes":{"userName":"Miguel172636","review":"Took 4 days an a half to download, bad template worst app on here.","title":"Awful app","rating":1,"isEdited":false,"date":"2020-07-10T04:39:12Z"}},{"id":"6179464454","type":"user-reviews","attributes":{"userName":"Katiebellecutie","review":"As a trump supporter I was excited to get news and learn more about how his campaign is doing. After downloading the app froze my phone for hours and I had to wait for my phone to die to get it back on!!","title":"HORRIBLE APP","rating":1,"isEdited":false,"date":"2020-07-10T04:39:12Z"}}]}