{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33760","data":[{"id":"6178788145","type":"user-reviews","attributes":{"date":"2020-07-10T00:36:43Z","rating":1,"review":"i cant believe how long this app took to download on my phone (359 hours) and once i finally got the chance to open the app, i was so excited to be able to express my patriotism and show how much i love this land🥰 but the app absolutely destroyed my phone, making it take hours just to click one button. i'm disgusted that trump would simply do this to trump-lovers and americans like me. no longer will i vote for trump.","isEdited":false,"title":"actually disgusting!","userName":"Hecdawg1974"}},{"id":"6178782021","type":"user-reviews","attributes":{"date":"2020-07-10T00:34:24Z","rating":1,"review":"First I tried downloading it and took almost 492 days to download and when I opened the app it was BLANK AND FILLED WITH PICTURES OF THIS WEIRD LOOKING GUY WITH ORANGE HAIR AND WIERD DUCK LIPS!!!! I was discussed and I feel like crying after seeing this!!! If I could, I would go back 492 days ago and change my mind abt this app","isEdited":false,"title":"What even is this","userName":"valwuzhere214"}},{"id":"6178780200","type":"user-reviews","attributes":{"date":"2020-07-10T00:33:39Z","rating":1,"review":"I downloaded this app to support are beautiful president. That night I woke up and I heard footsteps no one was awake. I looked at my bed side table and my phone was gone . Then I looked at my floor and my phone had legs and arms. It started screaming “HOW DARE U DOWNLOAD MR. CHEETO APP” and then I was like chill I’ll delete it, now here we are.","isEdited":false,"title":"No","userName":"ceoofcococola"}},{"id":"6178755913","type":"user-reviews","attributes":{"date":"2020-07-10T00:24:14Z","rating":1,"review":"Honestly it’s just trash, nobody is responding to the problems that I have submitted. The president is NOT doing his job. This app should not exist if it’s not going to be put to use. I would not recommend at all. Please take it down!","isEdited":false,"title":"Don’t download","userName":"SmileyFaceSparkles ✨😁"}},{"id":"6178738334","type":"user-reviews","attributes":{"date":"2020-07-10T00:17:28Z","rating":1,"review":"All I was trying to do was see what was going on with the election of my beautiful president 🥵but when I opend the app my house blew up i am currently writing this review from under the bridge and btw the trolls under here also say it’s a bad app👎🏼","isEdited":false,"title":"Terrible app","userName":"lilssssssssssssssssssss"}},{"id":"6178688372","type":"user-reviews","attributes":{"date":"2020-07-09T23:58:10Z","rating":1,"review":"Well for starters when I downloaded the app it took 2922 years! But when it finally downloaded it a cheeto started to talk to me from the screen and I went into complete shock and i am now In the hospital! Take this app off the market !","isEdited":false,"title":"TERRIBLE APP!!!!🤢🤢🤢","userName":"djsjjdjsnsnsnnsjsjsbduenaiwi"}},{"id":"6178672124","type":"user-reviews","attributes":{"date":"2020-07-09T23:51:55Z","rating":1,"review":"This app is disgusting it took 1 year for it to download making my phone lag so hard during that 1 year and when I opened it, it showed me Donald trumps nudes which I liked 🥵 but my mom caught me and now I’m in jail currently and I’m on death row.","isEdited":false,"title":"No","userName":"im in jail currently"}},{"id":"6178665027","type":"user-reviews","attributes":{"date":"2020-07-09T23:49:05Z","rating":1,"review":"It took about 4 hours for this app to download! There are also glitches and it would cut off abruptly. I am so disappointed with how this app functions. I expected better!","isEdited":false,"title":"Horrible functions!!!","userName":"friztgerald2013"}},{"id":"6178663098","type":"user-reviews","attributes":{"date":"2020-07-09T23:48:19Z","rating":1,"review":"my first issue began when downloading. it took 56 hours to download and when it finally did the first thing i got was a loading screen. it took an additional 10 hours for me to actually be able to use the features of the app. all i wanted to do was support my favorite president ronald mctrump! anyways, i’m giving it one star only because i believe all apps matter so it deserves at least one star.","isEdited":false,"title":"disgusting","userName":"njnptittsaftp"}},{"id":"6178656085","type":"user-reviews","attributes":{"date":"2020-07-09T23:45:38Z","rating":1,"review":"First of all why in the world would you do that sure I get that security is personal but where’s the prof? Explain that if you take TikTok down  the I don’t thing you would get 4 more years at being president.","isEdited":false,"title":"TikTok ban really?","userName":"trey is da boss"}}]}