{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=16510","data":[{"id":"6175284509","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE APP!","userName":"charholland","review":"Do NOT waste your time on this app! I got a message from the official phone number and told me they were going to steal my refrigerator! Unbelievable! How did they even know I had a refrigerator? This app is useless and i honestly believe there is some kind of high tech spy camera imbedded in the app. Don’t download the app unless you want someone to steal your fridge! Pointless piece of junk app. And WHY ON EARTH IS THERE A CHEETO ON THE WELCOME SCREEN?!?!","date":"2020-07-09T05:45:04Z","isEdited":false}},{"id":"6175278924","type":"user-reviews","attributes":{"rating":1,"title":"Horrible.","userName":"🌻💛🌻💛","review":"I was expecting a quality app but was not what I got. This app not only drained my phones battery but after I downloaded it everything else on my phone was erased. This app is a data miner and only wants to steal your information and should be removed from this App Store. Because of this app I lost everything on my phone. Terrible. Waste of space.","date":"2020-07-09T05:42:53Z","isEdited":false}},{"id":"6175181812","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT DOWNLOAD","userName":"kiki is lit","review":"This app is terrible my phone was glitching after I downloaded it it would not work he would call numbers that we’re not even mine it would just text people randomly and say that I hate them and bad stuff very mean stuff please do not download this app and if you do please give this bad review what happened to your phone to it thank you very much bye","date":"2020-07-09T05:06:45Z","isEdited":false}},{"id":"6175263752","type":"user-reviews","attributes":{"rating":5,"title":"GREAT APP","userName":"Be$$y1","review":"If you are a Trump supporter this is a must have app. Everything about this app is excellent they show you where he will be when he will be there upcoming events etc.... I absolutely love it. Trump 2020","date":"2020-07-09T05:36:55Z","isEdited":false}},{"id":"6175027575","type":"user-reviews","attributes":{"rating":1,"title":"Disturbing and Disgusting 🤮","userName":"The real President","review":"This app steals your information and feeds you disturbing pictures of a Cheeto man. I do not recommend using or downloading this app. It also stole my dog, I demand justice for Bernie. I will be going to court with anyone who was involved in the making of this ugly app. Thank you! Gen Z is always going to win over a crusty old man. Try taking down TikTok and we will take down your unneeded app. Chile n e ways.","date":"2020-07-09T04:16:26Z","isEdited":false}},{"id":"6174992271","type":"user-reviews","attributes":{"rating":1,"title":"extremely disappointing","userName":"sarahhudson","review":"The app downloaded a malware byte to my phone. I had to pay someone to help me figure out why my phone was running so slow and sending me scary messages. Once we figured out the problem, I had to pay money to get it removed. So many bugs and glitches. Overall, extremely disappointed in this app.","date":"2020-07-09T04:05:08Z","isEdited":false}},{"id":"6174975875","type":"user-reviews","attributes":{"rating":1,"title":"THIS APP GAVE AWAY MY IP ADRESS AND HAD SOMEONE BREAK IN AND MURDER THE FAMILY DOG","userName":"Xue Hue","review":"Im so upset because all I wanted was to see daddy donald 😩😩😩 but right after i downloaded this, i got a text message with my home address!! After a couple days, 3 men in black suits AND DONALD TRUMP HIMSELF BROKE INTO MY HOUSE!!! I saw it with my own eyes, donald trump stabbing my family dog to death! 😭😭😭 Please save yourself and do NOT buy this app!! Your dog might be next 😭 I cant stand another year to have a wrinkly dog killing cheeto as a president!","date":"2020-07-09T03:59:58Z","isEdited":false}},{"id":"6174949839","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT RECOMMEND THIS APP","userName":"Bilingual Babe","review":"Shortly after downloading this app, my phone had pop up viruses that were very annoying and stressful. Apparently others have had the same experience so I deleted the app and there now seems to be no problem. Hopefully there aren’t any remaining issues after deleting the app, but I would highly caution anyone from downloading this.","date":"2020-07-09T03:51:46Z","isEdited":false}},{"id":"6174917685","type":"user-reviews","attributes":{"rating":1,"title":"WORST APP EVER!!!!","userName":"akksbdnxik","review":"this Trump app is the exact representation of our president. the app is slow, glitchy, full of viruses, and dangerous. i cannot believe an app like this is still on the appstore. I rlly thought apple was better than this. and don’t forget the fact that it is tracking me and steeling all of my personal information! my credit card got hacked and my identity got stolen shortly after downloading!","date":"2020-07-09T03:41:54Z","isEdited":false}},{"id":"6174909289","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT BE FOOLED","userName":"can you feel the bern tonight","review":"i was told this was an app for bernie supporters, and let's just say that was FAR from the truth. the title is VERY misleading and when i opened the app it redirected me to a video of a clan of GIANT iguanas throwing crickets, banana peels, used waxing strips, and toe nail shavings into a bonfire- all while singing trisha paytas' cover of \"shallow\" by lady gaga... i cannot believe THIS is the kind of content i was subjected to, although the iguana cult was a much better sight than all that \"MAGA propaganda\".","date":"2020-07-09T03:39:23Z","isEdited":false}}]}