{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=138800","data":[{"id":"6179690183","type":"user-reviews","attributes":{"rating":1,"userName":"okjdncnkrjdjjdmr","date":"2020-07-10T05:56:35Z","isEdited":false,"title":"I wish i could take trump and...","review":"Freeze him in my freezer while i sit there and ✨O B S E R V E✨ eating snacks"}},{"id":"6179690126","type":"user-reviews","attributes":{"rating":1,"userName":"PhoenixRARA","date":"2020-07-10T05:56:34Z","isEdited":false,"title":"stinky 🤭","review":"i downloaded this app to be informed on what my cheeto man- oh i mean bunker boy- i mean orange who was once in a peach- or our supposed Mr.President was doin n all, but right when i opened it, my friends and family were having synchronized seizures. afterwards, when i went into the bathroom, i opened the app once again and then there was a mini tornado in the toilet and then i landed into the sewers. because of this app, i ended up with ebola, zika virus, corona, and a multitude of stds, such as gonorrhea, chlamydia, and aids. i’m a woman and i got aids from this app. oh and speaking of, i now have gotten an aneurysm that’s about to burst. don’t download this if you wanna keep your life."}},{"id":"6179690114","type":"user-reviews","attributes":{"rating":1,"userName":"Hsusnsu","date":"2020-07-10T05:56:34Z","isEdited":false,"title":">:(","review":"I tried downloading the app but i would never load for me. so sad. anyways, if you are seeing this, CAN WE PRETEND LIKE AIRPLANES IN THE NIGHT ARE LIKE SHOOTING STARS. I COULD GO FOR A WISH RIGHT NOW WISH RIGHT NOW WISH RIGHT NOW"}},{"id":"6179690011","type":"user-reviews","attributes":{"rating":1,"userName":"J-dawgporos","date":"2020-07-10T05:56:31Z","isEdited":false,"title":"Pls don’t download","review":"Please don’t download the app, you’ll start coming across wired signs of, racism, sexism, homophobic things, and you’ll soon be some a pedo soon after if you don’t start going to Blm protests. Other wise you’ll become a bigger, stinker Karen. Please be careful everyone"}},{"id":"6179689784","type":"user-reviews","attributes":{"rating":1,"userName":"badigahbuh","date":"2020-07-10T05:56:27Z","isEdited":false,"title":"Nope","review":"I downloaded this app hoping to find something good to benefit me and my country. All I found was a big Oompa Loompa with a toupee."}},{"id":"6179689782","type":"user-reviews","attributes":{"rating":1,"userName":"✨❤️🧚🏻‍♀️","date":"2020-07-10T05:56:27Z","isEdited":false,"title":"Not worth the trouble✨","review":"It want worth downloading, like how our president wasn’t worth electing ☺️✨❤️ love you sweety🧚🏻‍♀️"}},{"id":"6179689593","type":"user-reviews","attributes":{"rating":1,"userName":"dkkrndnd","date":"2020-07-10T05:56:23Z","isEdited":false,"title":"HORRIBLE APP","review":"I don’t suggest downloading"}},{"id":"6179689569","type":"user-reviews","attributes":{"rating":1,"userName":"Becky Berenstein","date":"2020-07-10T05:56:23Z","isEdited":false,"title":"Do not download this app","review":"I don’t even know where to begin. The layout is awful, the links don’t work, the articles are difficult to read, the events “near me” are halfway across the country, and the color scheme is too aggressive. Please take my advice and don’t waste your time with this app, you’ll thank me later."}},{"id":"6179689404","type":"user-reviews","attributes":{"rating":1,"userName":"ANYCOMPETENTADULT2020","date":"2020-07-10T05:56:20Z","isEdited":false,"title":"Crazy weird app","review":"This app is dangerous to the entire country. Apple should be ashamed to have it in their App Store."}},{"id":"6179689368","type":"user-reviews","attributes":{"rating":1,"userName":"Tylẹr","date":"2020-07-10T05:56:19Z","isEdited":false,"title":"VIRUS","review":"Once I downloaded the app I got hacked after putting information that it “needed” don’t download bad Idea"}}]}