{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=17450","data":[{"id":"6174873645","type":"user-reviews","attributes":{"review":"There is nothing in this app that is remotely useful. The opening screen has a character that resembles the annoying orange from the late 2000s so it immediately put a bad taste in my mouth. I would never recommend this app to anyone as it is a waste of space on my phone and I firmly believe that this administration is using this app to data-mine. 0/10","title":"Absolute garbage","userName":"wildpotatofarmer99","date":"2020-07-09T03:28:57Z","isEdited":false,"rating":1}},{"id":"6174839636","type":"user-reviews","attributes":{"review":"Not only is this app filled with false information and sexist, homophobic, racist, and transphobic content, it was created for a man who has proven over and over again to the people in this country that he is not worth being in a position of power nor does he have the emotional/brain capacity to be a true leader. This app should be considered a hate symbol.","title":"I can’t think of a worse app","userName":"Benji1236","date":"2020-07-09T03:18:56Z","isEdited":false,"rating":1}},{"id":"6174831253","type":"user-reviews","attributes":{"review":"Ok so I downloaded this app and INSTANTLY started getting spam calls from Egyptians talking about how they’re going to steal my fridge and pet dinosaur! And then my phone won’t stop glitching, I can’t even open up the app anymore with out a virus popping up! Literally this needs to be taken down Bc it has completely distorted my phones service and capability to work! :(","title":"Worst app ever!!","userName":"turkeybutt4.0","date":"2020-07-09T03:16:28Z","isEdited":false,"rating":1}},{"id":"6174812303","type":"user-reviews","attributes":{"review":"I read a comment and was so surprised to see that someone else had a similar experience using this app. Upon installation I got a notice saying they would deport me, and I was so confused bc how does the app know I’m Hispanic? The app wouldn’t let me use it and kept sending me hundreds of alerts per hour. The president which we all love so much truly disappointed me, SOLEY with this app.","title":"Disappointing","userName":"lovetrumpie2020","date":"2020-07-09T03:10:57Z","isEdited":false,"rating":1}},{"id":"6174810410","type":"user-reviews","attributes":{"review":"This app STOLE my LAMP!! I was gonna go get my dog and lamp so I can go to McDonald’s but I realized my lamp wasn’t there!! I remember it being in my room before downloading the app but when I did it was GONE! I went to my friend bamboo named Billy and said their lamp was gone AFTER downloading the app too. This app also gave me viruses in the ceiling...disappointing. Don’t EVER download this app!!! The app will STEAL YOUR LAMP! My precious lamp...I demand them to pay for a new lamp!!","title":"WORST APP EVER!","userName":"blue_Jai","date":"2020-07-09T03:10:23Z","isEdited":false,"rating":1}},{"id":"6174807021","type":"user-reviews","attributes":{"review":"This app is just horrible DONT DOWNLOAD LOAD!!IT WILL TRACK U!!AND ASK FOR UR PERSONAL INFORMATION !!!!just don’t bc he’s trying to find out all ur information to it and it’s just horrible pls don’t download it u will regret it just ingore it ,also if u download it have fun being tracked down they can see ur card information where live how old u are ur first last and middle name who ur family are ur siblings so  just DONT DOWNLOAD!!! i repeat DONT DOWNLOAD!!!!!","title":"WORST APP EVER","userName":"big daddy alexa","date":"2020-07-09T03:09:23Z","isEdited":false,"rating":1}},{"id":"6174781726","type":"user-reviews","attributes":{"review":"I downloaded the app to get updates about the campaign but I got lots of glitches. Constantly getting a black screen and then taken back to my home screen. If you really want to follow what’s happening I suggest using what’s on the web NOT this app. When the app is updated it take several days to get back up for me. Absolutely trash app, do not download.","title":"TERRIBLE APP","userName":"Lamb$$7","date":"2020-07-09T03:01:46Z","isEdited":false,"rating":1}},{"id":"6174773967","type":"user-reviews","attributes":{"review":"This app has your location it tracks you so don’t download this app it horrible and I also heard that it’s racist because as soon as you get it it ask you if you Mexican/Hispanic black or white or Chinese and Indian I put Mexican and as soon as I click it.  It said that I can’t have this app if am Mexican or I will get reported and it kicked me out","title":"The app has your location","userName":"Chick-fil-A is the best","date":"2020-07-09T02:59:24Z","isEdited":false,"rating":1}},{"id":"6174766614","type":"user-reviews","attributes":{"review":"When I got the app, my phone started losing battery, started getting slower, and heating up quicker. Those are all since of getting my phone hacked. I deleted it, and the virus went away. I even tried a VPN and a virus detector, and the virus didn’t go away with the app, not until I got rid of the app. So if you don’t want a virus on your phone, don’t get the app.","title":"Terrible app","userName":"Catie Bellone","date":"2020-07-09T02:57:09Z","isEdited":false,"rating":1}},{"id":"6174747268","type":"user-reviews","attributes":{"review":"I got some El Dorado food and took some left over foods. In order for me to be able to accept the terms of use I had to send video evidence of me sending said left overs back to “The Boarder of Mexico.” I’m so very disappointed as it was my favorite food and in order to support our Cheezit president, it what had to be done","title":"Will force you to return all Mexican foods you get back over the boarder","userName":"I miss my leftovers so much","date":"2020-07-09T02:51:17Z","isEdited":false,"rating":1}}]}