{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=49720","data":[{"id":"6174028758","type":"user-reviews","attributes":{"rating":1,"title":"Terrible app","review":"False info, gave me notifications to go dig up my dead hamster leaving me crying for days, had to look at a cheeto whenever i opened it. Very bad experience","userName":"RayRayforPres","date":"2020-07-08T22:59:04Z","isEdited":false}},{"id":"6174021954","type":"user-reviews","attributes":{"rating":1,"title":"Trumps Nudes","review":"App literally made me have a seizure i’m in the emergency room right now the doctors are saying I have nerve damage to my eyes from this app in particular not to mention all you see on this app is trumps micro peen.","userName":"Grass Fed Moo","date":"2020-07-08T22:56:31Z","isEdited":false}},{"id":"6174019477","type":"user-reviews","attributes":{"rating":1,"title":"I hate it","review":"I saw a orange human hybrid in all the photos it was absolutely horrifying. And the people on the app is worshiping him like a god and I think it is a orange cult. This is outrageous to do these king of stuff. This should be takin down forever. ONE STAR","userName":"chonkest cat in the world","date":"2020-07-08T22:55:34Z","isEdited":false}},{"id":"6174016752","type":"user-reviews","attributes":{"rating":1,"title":"Disappointed","review":"The orange man is really gross I dont like looking at him please make it stop. I opened the app only to see his face and immediately started projectile vomiting and crying. I will be suing for unnecessary harm and psychological distress.","userName":"Rh2021","date":"2020-07-08T22:54:34Z","isEdited":false}},{"id":"6174006768","type":"user-reviews","attributes":{"rating":1,"title":"Horrible!!!","review":"Got it but then it gave me fake news and wrong ideas. This should not be an app to begin with I want to hear the truth not some fake news🤦🏾‍♀️","userName":"user482284828","date":"2020-07-08T22:50:49Z","isEdited":false}},{"id":"6174003299","type":"user-reviews","attributes":{"rating":1,"title":"DISGUSTING🤮","review":"I was HORRIFIED to see such a disgusting pig on this app!! As the manager of Chuck E. Cheese I am HIGHLY offended to see that this app tried to mock me by having there mascot be an orange rat. DO NOT GET THIS APP!!! I demand that apple takes this app down and never puts it up again.","userName":"HEAINTMYPRESIDENT","date":"2020-07-08T22:49:29Z","isEdited":false}},{"id":"6173994552","type":"user-reviews","attributes":{"rating":1,"title":"HUGE MISTAKE","review":"I am so disappointed in this app! If I could give it a negative star I would! 💙 this app could have so much potential. I suggest start with taking it off the App Store!","userName":"Unknown5801","date":"2020-07-08T22:46:14Z","isEdited":false}},{"id":"6173984560","type":"user-reviews","attributes":{"rating":1,"title":"Whaaaaat","review":"Shawty like a melody in my head bum bum bud dum dum never gonna give u up oooh I thing moto moto likes u maybe I’ll be tracer I’m already tracer look for the gummy bear album in stores on nov 13 with lots of music videos and extras rip TikTok","userName":"NlNJA YT","date":"2020-07-08T22:42:20Z","isEdited":false}},{"id":"6173980708","type":"user-reviews","attributes":{"rating":1,"title":"HORIBBLE","review":"this app wants me to put my private information into it to sign in. JUST LIKE EVERY SINGLE OTHER APP. i don't understand it. what if my private information gets sold to china. oh no. it's not like hen z actually cares.......","userName":"Maggie Coon","date":"2020-07-08T22:40:54Z","isEdited":false}},{"id":"6173979365","type":"user-reviews","attributes":{"rating":1,"title":"This app is unacceptable","review":"I need to speak to the manager this is the worst app ever. It is completely inappropriate for kids. This app needs to be taken down immediately.","userName":"sunflowers4life8","date":"2020-07-08T22:40:22Z","isEdited":false}}]}