{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28110","data":[{"id":"6173694828","type":"user-reviews","attributes":{"userName":"Kam236","date":"2020-07-08T20:54:15Z","isEdited":false,"rating":1,"title":"TERRIBLE!!","review":"I would leave zero stars if i could!! Very slow app. This app took over 3 hours to download and when it was FINALLY finished it crashed several times. All i was trying to do was keep up to date with MY president but this simply isn’t the app to do it."}},{"id":"6173694606","type":"user-reviews","attributes":{"userName":"Pastel._.teq","date":"2020-07-08T20:54:10Z","isEdited":false,"rating":1,"title":"Worst App.","review":"This was the worst app i’ve ever come across, why is this still a thing? It made my phone malfunction for a whole WEEK, it’s probably from the racist/rapist energy created from the app. Horrible. Take this app down. It’s like you guys are in a cult, you’ll have merch, flags, apps, and businesses."}},{"id":"6173691533","type":"user-reviews","attributes":{"userName":"JustNotMely","date":"2020-07-08T20:53:06Z","isEdited":false,"rating":1,"title":"Horrible 🙈😭","review":"This is a horrible app. I hate it! I will never support trump. It also brought roaches and flying Cheetos to my house. Not to mention the shrimps. TOOK FOREVER TO DOWNLOAD! Once the shrimps came they proceeded to try to attack my dog!! The software needed to update because it glitched so badly! -0/10 would not recommend boomers stay away."}},{"id":"6173682850","type":"user-reviews","attributes":{"userName":"barron alex","date":"2020-07-08T20:49:58Z","isEdited":false,"rating":1,"title":"Disappointed","review":"When I got this app my phone glitched and when I got the app again it did sounds that alerts people and I had to throw my phone for the sound to go away and now I bought a new phone thanks a lot trump for wasting my time and money 🤬😡"}},{"id":"6173679232","type":"user-reviews","attributes":{"userName":"Dayday.1.3","date":"2020-07-08T20:48:40Z","isEdited":false,"rating":1,"title":"Don’t download !","review":"I literally downloaded it and filled out information, like my number. Now in the past days i’ve been getting nothing but scam calls! I have not put my number elsewhere. If i could i’d give it zero stars, absolutely horrible."}},{"id":"6173674789","type":"user-reviews","attributes":{"userName":"jazzelleowens2019","date":"2020-07-08T20:47:00Z","isEdited":false,"rating":1,"title":"Terrible app","review":"When I downloaded this app my phone started glitching and my mom started crying thus is the worst app on this earth if anyone downloaded this app I would die it is horrible my left leg broke off after downloading this I’m so disappointed in you app just tragic"}},{"id":"6173672763","type":"user-reviews","attributes":{"userName":"$69.69","date":"2020-07-08T20:46:17Z","isEdited":false,"rating":1,"title":"no❤️😹","review":"this app is terrible. when i opened the app there were videos of myself taking showers and changing my clothes, i don’t know where they got these videos but i’m a minor and they can get into a lot of trouble. when i told my parents they just said that i’m taking it out of purportion but i think this is very serious. i feel violated and i don’t have any motivation for anything anymore, i feel like i’m always being watched now. please don’t download this app it will ruin ur life."}},{"id":"6173667681","type":"user-reviews","attributes":{"userName":"Luna Moonia","date":"2020-07-08T20:44:28Z","isEdited":false,"rating":1,"title":"Horrible","review":"The app didn’t give me notifications when it said it would, no matter what I did it would crash my phone while in the app and it would crash my phone while not in the app!!! 0/10 stars, I support trump but not this app!!!"}},{"id":"6173661861","type":"user-reviews","attributes":{"userName":"BALL_IS_LIFE_1921","date":"2020-07-08T20:42:25Z","isEdited":false,"rating":1,"title":"THIS IS THE WORST APP EVER","review":"I tried to download this app and it took WEEKS I had to use my old phone because I wasn’t able to do anything with this phone we thought it was something wrong with my phone until it happened with my whole family"}},{"id":"6173655706","type":"user-reviews","attributes":{"userName":"linda ray🤪","date":"2020-07-08T20:40:15Z","isEdited":false,"rating":1,"title":"bad, just not good","review":"So I go on the app right.. I thought it was a GAME!! Boy was I wrong!! It’s actually a joke app! When you first go on, it has a picture of this orange dude with like yellow hair??? So funny, but I don’t know why this is in the “news” section of the App Store, they really need to get that fixed. Orange guy was funny tho."}}]}