{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38480","data":[{"id":"6174949699","type":"user-reviews","attributes":{"title":"Hate the app","userName":"dad jack tak","review":"Ask for my number and I did not feel comfortable 🙄also ask way to many to many questions 🧚plus he tried to take Tio tok u think I would like him 😒✌🏻anyways bye 😗✌🏻","rating":1,"date":"2020-07-09T03:51:44Z","isEdited":false}},{"id":"6174929719","type":"user-reviews","attributes":{"title":"WORST APP EVER","userName":"Sullyman the man","review":"Do the world a favor and delete this off the App Store forever. There are bugs and it works horribly. I find it very offense and distasteful. I am disappointed that this is app even exists. I would put zero stars if I could. Very bad.","rating":1,"date":"2020-07-09T03:45:30Z","isEdited":false}},{"id":"6174925154","type":"user-reviews","attributes":{"title":"Atrociously horrible app","userName":"nikkierikkie","review":"As son as i download this app my phone started glitching. there are a punch of colorful lines that keep showing up on my screen. i’m very upset with the quality of this app please remove it IMMEDIATELY!!!!!!!!","rating":1,"date":"2020-07-09T03:44:09Z","isEdited":false}},{"id":"6174919603","type":"user-reviews","attributes":{"title":"It invited the literal devil into my home.","userName":"Austifer","review":"He said he needed to wash his hands after having them inside the president. I wish I’d never downloaded this app; I could have gone the rest of my life without knowing that.","rating":1,"date":"2020-07-09T03:42:29Z","isEdited":false}},{"id":"6174916431","type":"user-reviews","attributes":{"title":"This app is a waist of time downloading.","userName":"Andres12002","review":"I downloaded this and turns out I do not like one thing about this app just makes my kids literally wanna cry when they spot the t app and my pets cry too I recommend NOT ANYONE TO DOWNLOAD THIS APP it terrifies my kids","rating":1,"date":"2020-07-09T03:41:31Z","isEdited":false}},{"id":"6174910376","type":"user-reviews","attributes":{"title":"Horrible app","userName":"redhead679","review":"This is a terrible app it made my cat do a cartwheel into the mailbox. Then after that happened the McDonald’s employee informed me I was at a Wendy’s so I had to order the sub I always get. Overall, terrible experience","rating":1,"date":"2020-07-09T03:39:43Z","isEdited":false}},{"id":"6174909814","type":"user-reviews","attributes":{"title":"Save the brain cells","userName":"legoninjago187","review":"I downloaded the app with an IQ of 187 and every minute this app spent on my phone I lost two brain cells. Now I’m a vegetable in the hospital and I have to be fed through a tube. Save yourself the brain cells and don’t download this app.","rating":1,"date":"2020-07-09T03:39:32Z","isEdited":false}},{"id":"6174909730","type":"user-reviews","attributes":{"title":"JUST READ","userName":"Mel&Teddy","review":"i downloaded this app and not only did it make my phone slow but now half my apps crash. this is so annoying and irritating this needs to be taken down. PRIORITIZE THIS APP and not tiktok thanks","rating":1,"date":"2020-07-09T03:39:31Z","isEdited":false}},{"id":"6174900703","type":"user-reviews","attributes":{"title":"DO NOT GET","userName":"KaleMBow","review":"This was the WORST APP I have ever downloaded. I opened it and it made my phone immediately turn off. How can he make america great if they couldn’t even get an app to work correctly? Waste of space. Do not download.","rating":1,"date":"2020-07-09T03:36:49Z","isEdited":false}},{"id":"6174897033","type":"user-reviews","attributes":{"title":"WORST APP IN THE WORLD!!!!!!!!!!","userName":"Fudgemaster1231","review":"I wanted regular news on political things. INSTEAD IT GAVE ME A VIRUS ON MY PHONE. This app needs to be taken down IMMEDIATELY. If it doesn't get taken down then everybody will know that the only reason it’s here is because the “good” president PAID for it to stay up.","rating":1,"date":"2020-07-09T03:35:46Z","isEdited":false}}]}