{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=59160","data":[{"id":"6177226365","type":"user-reviews","attributes":{"date":"2020-07-09T15:47:25Z","review":"This app is crap. Trump is a racist person and he is doing a lot of damage to America. And also he is trying to ban tic tok seriously WHAT THE HECK!?","rating":1,"userName":"Money boi $$$$3","title":"This app is more terrible than Trump himself","isEdited":false}},{"id":"6177223431","type":"user-reviews","attributes":{"date":"2020-07-09T15:46:33Z","review":"Was just trying to widen my political horizons, but there’s too much hate that this app is trying to get me to support.","rating":1,"userName":"jpat365","title":"Too much bigotry","isEdited":false}},{"id":"6177189976","type":"user-reviews","attributes":{"date":"2020-07-09T15:37:01Z","review":"This app is the worst! I can't even believe how terrible it is! total waste of time. would've been so much better if it was for obama. #CRUSHTHECHEETO2020","rating":1,"userName":"crushthecheeto","title":"ewwwww","isEdited":false}},{"id":"6177177827","type":"user-reviews","attributes":{"date":"2020-07-09T15:33:36Z","review":"i opened the app to check what all the fuss was about and when i opened i was greeted by a horrifying figure and so i continued into the app to also be greeted by more horrifying figures supporting the orange figure next thing you know i delete the app and wrote this review because i hate donald trump :) have a nice day!","rating":1,"userName":"chaijdjdjsjs","title":"chicken wing chicken wing","isEdited":false}},{"id":"6177168493","type":"user-reviews","attributes":{"date":"2020-07-09T15:30:57Z","review":"Toke up alot of space in my phone...Once i started the app my phone died often and glichted aswell ......Don’t Recommend","rating":1,"userName":"charlidamilio2020","title":"Review","isEdited":false}},{"id":"6177163041","type":"user-reviews","attributes":{"date":"2020-07-09T15:29:25Z","review":"Similarly to the president, this app is fully dysfunctional. It forgets my login info- almost as if it has dementia or something... HATE IT!","rating":1,"userName":"lee kahmyass","title":"Not user friendly 😤","isEdited":false}},{"id":"6177160765","type":"user-reviews","attributes":{"date":"2020-07-09T15:28:46Z","review":"i downloaded this app with high hopes but unfortunately as soon as i downloaded it i got a call from numerous churches trying to convert me???? also mike pence personally showed up at my door and tried to take me into a van to go to camp. i didn’t feel super safe so i passed on the offer","rating":1,"userName":"toktik🍯","title":"i’m scared","isEdited":false}},{"id":"6177152724","type":"user-reviews","attributes":{"date":"2020-07-09T15:26:32Z","review":"literally so bad. i have no idea who would download this app and i never should have, i downloaded because of tiktok of course and i hate it. i haven’t even looked at it i just know it will be bad, anyways i hope it’s banned 💚","rating":1,"userName":"Minecraftisawesome101","title":"take this off the app store please and thank you","isEdited":false}},{"id":"6177145847","type":"user-reviews","attributes":{"date":"2020-07-09T15:24:38Z","review":"This app claims to be #1 in news, but the content is blatant lies and ignorance. I worry that if this app remains on the App Store it will corrupt the minds of America’s youth. Therefore this app should be removed immediately.","rating":1,"userName":"tophero87","title":"Lies","isEdited":false}},{"id":"6177139712","type":"user-reviews","attributes":{"date":"2020-07-09T15:22:56Z","review":"ONCE I dOWNLOADED THE APP, JONATHAN GALINDO CAME TO MY HOUSE AND KILLED MY FAMILY, THAN HE TOLD ME, \"stan loona ❤️\" and i tried to escape but tHEN he told me \"read cherry blossoms after winter or die\" so thEN, I DID!!! suddenly sangwoo visited and then my mother was in the wall 😿😿 DONT DOWNLOAD THIS APP! OR ELSE!!!","rating":1,"userName":"cockandballtorturekpop","title":"OH MY GOD THIS APP IS TERRIBLE","isEdited":false}}]}