{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=141470","data":[{"id":"6179422564","type":"user-reviews","attributes":{"title":"I would like to speak to the manager","rating":1,"userName":"Fr8trade","date":"2020-07-10T04:25:22Z","isEdited":false,"review":"Upon the downloading of this app I was completely disgusted at how the app treated me, claiming it was free and then asks me for EXTREME personal information! After this experience I feel as though I may disintegrate due to the sheer disrespect. NOT satisfied"}},{"id":"6179422324","type":"user-reviews","attributes":{"title":"Didn’t work.","rating":1,"userName":"sis back up","date":"2020-07-10T04:25:17Z","isEdited":false,"review":"When I tried opening the app it kept crashing and I have the latest version of the IPhone. Some reason it kept crashing and it would give me ad after ad after ad. It would also take me to weird sites that really wasn’t related to the app. DO NOT. Waste ur time on this app"}},{"id":"6179422335","type":"user-reviews","attributes":{"title":"Terrible","rating":1,"userName":"bdbdbdbsnanhshxvx","date":"2020-07-10T04:25:17Z","isEdited":false,"review":"Never 🤢"}},{"id":"6179422299","type":"user-reviews","attributes":{"title":"Don’t install this app","rating":1,"userName":"apple appel pen","date":"2020-07-10T04:25:17Z","isEdited":false,"review":"I installed the app months ago and they freaking did things to my phone and they wanted to know where I was"}},{"id":"6179422225","type":"user-reviews","attributes":{"title":"NOT WORTH YOUR TIME","rating":1,"userName":"🧚🏾‍♂️✨kArEn TrUmP✨🧚🏾‍♂️","date":"2020-07-10T04:25:15Z","isEdited":false,"review":"This app was one of the worst experiences I’ve had. Incredibly laggy with just orange Cheetos popping up on screen and I don’t even think the Cheetos brand advertise on this app. It’s slow and pixelated, I’ve had this app for too long and I going to delete this app as soon as possible. I’ve seen highly inappropriate things on here and I think this app is bad for you to download, full of Karens and nasty energy that’s bad for you. It’s bad for the environment and not good for you. \nThe fitness gram pacer test is a multistage aerobic capacity test that progressively gets more difficult as it continues. The 20 meter pacer testwill begin in 30 seconds. Line up at the start. The running speed starts slowly but gets faster each minute after you hear this signal bodeboop. A sing lap should be completed every time you hear this sound. ding Remember to run in a straight line and run as long as possible. The second time you fail to complete a lap before the sound, your test is over. The test will begin on the word start. On your mark. Get ready!… Start."}},{"id":"6179422229","type":"user-reviews","attributes":{"title":"Not worth it","rating":1,"userName":"not_worth_it_app","date":"2020-07-10T04:25:15Z","isEdited":false,"review":"This app helped with nothing. It simply had me sign up for something only for it to finish and gave me no news or anything just simply signed up and that was it it was a long process as well only to have it all be great thanks for your help and gone. Horrible app not worth the time."}},{"id":"6179422161","type":"user-reviews","attributes":{"title":"Worst app ever","rating":1,"userName":"Omgitmewtfhahaha","date":"2020-07-10T04:25:13Z","isEdited":false,"review":"worst app ever"}},{"id":"6179422115","type":"user-reviews","attributes":{"title":"So sad! Don’t download!","rating":1,"userName":"shakankdjskajkd","date":"2020-07-10T04:25:12Z","isEdited":false,"review":"Honestly horrendous, this app made my speakers go insane! I tried to turn DOWN the volume and it ended up playing Mario Carts theme song. Honestly disappointing that such a “great” candidate has such an awful app!"}},{"id":"6179422106","type":"user-reviews","attributes":{"title":"Disappointment just the man himself","rating":1,"userName":"whydoyouwanttoknow🤪","date":"2020-07-10T04:25:12Z","isEdited":false,"review":"If you could think about all the disappointments that your parents have been calling you all your life this is the app for it. Since I downloaded this app it gives me motivation not to do anything in my life, it makes me want to paint myself orange and build a wall around my own house because I am so scared of Trump Supporters. I cannot sleep in peace because it keeps sending me notifications saying how I am not racist enough, and it tells me not to wear a mask out in public because I have right not to wear and be more selfish and I should become one of the Karens. Lately I have been dreaming how I should inject Lysol into my body so I can survive from miss Rona but I do not have supplies to do that so now I am thinking about drinking bleach instead I think that would work out pretty well. But again I was hoping to see something on this app that is actually helpful to world but no see nothing but DISAPPOINTMENT. I do not recommend this to anyone if I could give this app -50000 score I would."}},{"id":"6179422069","type":"user-reviews","attributes":{"title":"Horrible","rating":1,"userName":"lowkeyf202","date":"2020-07-10T04:25:11Z","isEdited":false,"review":"Crashed my phone as soon as it was done downloading"}}]}