{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27210","data":[{"id":"6134044105","type":"user-reviews","attributes":{"date":"2020-06-29T01:52:48Z","isEdited":false,"userName":"highnoonatdawn","review":"I downloaded this app in honor of the greatest man in American history and when I went to use it my phone glitched and took me to the Siri page which continued to call me cruel names over and over again. And then, to make matters worse, my phone spontaneously burst into flames.","rating":1,"title":"Disappointing"}},{"id":"6134035846","type":"user-reviews","attributes":{"date":"2020-06-29T01:49:35Z","isEdited":false,"userName":"Melania and Barron Trump","review":"Horrible app it has way too many adds doesn’t let me read papi trump’s updates on the world I wouldn’t recommend getting this app it’s a waste of time and seriously my phone kept glitching because of it this should have a zero star review in all honesty","rating":1,"title":"Worst app ever"}},{"id":"6133746932","type":"user-reviews","attributes":{"date":"2020-06-28T23:55:02Z","isEdited":false,"userName":"JaidiwjrbsiKol","review":"My mommy told me that Trump would give me equal rights if I downloaded this app. Turns out, I got shot with a rubber bullet instead. The App keeps turning on my google fairy lights when I sleep, and it’s consistently asking me if Im home alone. Not sure if it’s listening to my conversations either, but it keeps saying my boyfriend’s hot 🤬","rating":1,"title":"AWEFUL"}},{"id":"6133487282","type":"user-reviews","attributes":{"date":"2020-06-28T22:13:02Z","isEdited":false,"userName":"CrazyBoomer2020","review":"I, a fellow boomer, got this app to fulfill my duty as a stupid citizen, oops i meant an American citizen, but it ended up spamming my phone so much it blew up which caused my bedroom to blow up and now my whole house is burnt to the ground, Thank You Cheeto Man R.I.P You’ll be missed, Not by me tho. Also Breonna Taylor’s murderers are still not arrested, Go sign petitions!!!","rating":1,"title":"Disappointed"}},{"id":"6130158636","type":"user-reviews","attributes":{"date":"2020-06-28T02:16:03Z","isEdited":false,"userName":"Razoron","review":"Lots of thing posted online these days are not accurate in the slightest and this man’s ramblings are much the same. I won’t support someone who is at their core racist, incapable, and a bunch of other unsavory traits. I would hope you all would do the same.","rating":1,"title":"Don’t Believe the Inaccuracy"}},{"id":"6103584799","type":"user-reviews","attributes":{"date":"2020-06-21T08:28:12Z","isEdited":false,"userName":"Dis cool kid","review":"I did NOT appreciate the app REQUIRING my personal information to use. Very inappropriate. The donation link looked very fake and like a scam. I will be filing lawsuits if my information is illegally used. And lastly, there is NO option to delete the account, so my information cannot be reclaimed in anyway? How cruel.","rating":1,"title":"Very Sad"}},{"id":"6097966993","type":"user-reviews","attributes":{"date":"2020-06-19T23:36:25Z","isEdited":false,"userName":"Make America White Againn","review":"I downloaded this app for my racist, rapist president however the app has been hacked! I saw multiple posting about the Black lives matter movement and muslims. This is ridiculous they know we hate Black people and especially Muslims. I downloaded this app know more about Donald dump and whites. Insane.","rating":1,"title":"Disgusting app"}},{"id":"6071296224","type":"user-reviews","attributes":{"date":"2020-06-13T15:21:55Z","isEdited":false,"userName":"bblev97","review":"just honestly terrible everything about the app. layout trash. person is trash. stupid app. it’s racist, sexist, homophobic, etc., i mean, that’s what this man stands for, so the app reflects it. glad to see Apple condones this type of behavior by allowing an app to provide yet another platform for this type of behavior to be “acceptable”","rating":1,"title":"WORST APP EVER"}},{"id":"6097315284","type":"user-reviews","attributes":{"date":"2020-06-19T19:30:26Z","isEdited":false,"userName":"charles the banker","review":"I can actually watch news reporting that is real! Telling the truth!","rating":5,"title":"Thank You"}},{"id":"6068451205","type":"user-reviews","attributes":{"date":"2020-06-12T22:43:17Z","isEdited":false,"userName":"yesdaddytrump","review":"I downloaded this app because I am an avid Trump supporter and I wanted to learn how to be completely blind to racism, homophobia, transphobia and xenophobia unfortunately after downloading the app it realized that I was a woman and tried to grab me by the p****. I realize that daddy trump didn’t mean it in that context but I just couldn’t keep the app.","rating":1,"title":"Do Not Download"}}]}