{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=13150","data":[{"id":"6175711496","type":"user-reviews","attributes":{"date":"2020-07-09T08:25:42Z","rating":1,"isEdited":false,"userName":"remy 🐀","review":"A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobic profession. When fate places Remy in the sewers of Paris, he finds himself ideally situated beneath a restaurant made famous by his culinary hero, Auguste Gusteau. Despite the apparent dangers of being an unlikely - and certainly unwanted - visitor in the kitchen of a fine French restaurant, Remy's passion for cooking soon sets into motion a hilarious and exciting rat race that turns the culinary world of Paris upside down.","title":"don’t download❤️✨"}},{"id":"6175693807","type":"user-reviews","attributes":{"date":"2020-07-09T08:19:42Z","rating":1,"isEdited":false,"userName":"that b**** period","review":"This app has been shoving down racist and misogynistic ideals every time I open it. It keeps giving me notifications that say “everyone who’s not white is a terrorist” and “lock of people of color. They are all criminals and animals”. And it keeps trying to take my rights away. I don’t think this is a very good app to have on your store. It’s not a good image for you apple. You should delete it  IMMEDIATELY. IT IS A SYMBOL OF HATE and should not be on your plate form.","title":"VEEERY IMPORTANT!!! ✋🛑🛑❌"}},{"id":"6175603121","type":"user-reviews","attributes":{"date":"2020-07-09T07:47:38Z","rating":1,"isEdited":false,"userName":"lexi v. w.","review":"I downloaded this app to support our beloved president but two weeks after having this app on my phone, I realized that my photos were being mysteriously deleted off my phone. Not only this but the app was recording me without my permission! It’s clearly violating our constitutional rights as Americans and I must say that I no longer support a president who would try to install spyware on his own followers’ phones!! The audacity!","title":"App hacked me"}},{"id":"6175576006","type":"user-reviews","attributes":{"date":"2020-07-09T07:37:34Z","rating":1,"isEdited":false,"userName":"ChefBoyargee","review":"First of all... it didn’t let me in because I had to prove I was non-poc 🙄. I provided my id but it just said that I was to provide my birth certificate to prove I was born in the states. Very unprofessional!!! Then I got a call that I had to be entered into a draft... didn’t realize I was playing sports!!! Then I got another call that I was to enter a camp as well!!! A conversation camp I think?! I don’t want to talk to these people!!! Terrible app!!! Created a virus!!!!! Don’t do it!!!!!!!","title":"Grade A terrible!!!"}},{"id":"6175538899","type":"user-reviews","attributes":{"date":"2020-07-09T07:23:56Z","rating":1,"isEdited":false,"userName":"Im a prrson","review":"They immediately asked for my information that I did not appreciate because of the fact that I downloaded this app in order not to text yet they still asked for me number took WAYYY to long to download. The point was to help win the election but at this point it made things so difficult that I rather go for Biden because he is not a transphobe or a total racist thank you for coming to my ted talk🤍✨","title":"100% WOULD NOT RECOMMEND"}},{"id":"6175400113","type":"user-reviews","attributes":{"date":"2020-07-09T06:29:32Z","rating":1,"isEdited":false,"userName":"Cook cool girl","review":"It was very clunky and froze a lot.  But I’m sure the orange septuagenarian would say, “It’s the most beautiful app the world has ever known.  In fact, Steve Jobs, Captain Kirk and Yosemite Sam all personally called me from their Instantgram phones to tell me how much it improved their lives and helped them defeat the Klingons, Bugs Bunny and the pernicious Commodore 64.  It’s really a life changer and it also can help track down illegally transgendered Mexican lesbians and Chinese eunuchs.”","title":"Slow and clunky :/"}},{"id":"6175284975","type":"user-reviews","attributes":{"date":"2020-07-09T05:45:14Z","rating":1,"isEdited":false,"userName":"MishuraHana","review":"You know, I don’t know what I expected. If I could give zero stars I would. Honestly, I opened the app and it crashed the social justice system. I tried again and the misogynistic, egotistical systems of the server caused the app to crash the economist as well. It’s horrible—once again if I could put zero stars I would. The colors are clashing and it’s like there was no thought or effort for a better and equal living system. Supremacy at its worst.","title":"Wow"}},{"id":"6175236080","type":"user-reviews","attributes":{"date":"2020-07-09T05:26:16Z","rating":1,"isEdited":false,"userName":"MemeIncSAH","review":"Yes we will come pick you something to eat tomorrow and pick you something to pick you up at pick you something up and pick up something for you and I will pick up something to pick him in the next few days so I’ll pick it up and then I’ll pick you wanna is the night I will be home tomorrow I wanna I have something to eat I can ry tomorrow morning and I wanna play with the new people I will see if you want me I can yes","title":"No"}},{"id":"6175158146","type":"user-reviews","attributes":{"date":"2020-07-09T04:58:29Z","rating":1,"isEdited":false,"userName":"tvh hbrxe","review":"This app is literally the worst, I downloaded it and then my phone started glitching so bad I had to get another one not to mention how the company I got my phone from said ‘sometimes you have to be carful, based on the apps you down load because they can cause heavy glitches on a phone or even cause the phone to catch on fire’ I am absolutely disappointed and hope for this app to be removed .","title":"App"}},{"id":"6175120551","type":"user-reviews","attributes":{"date":"2020-07-09T04:45:55Z","rating":1,"isEdited":false,"userName":"MuricaForever1776","review":"I downloaded this app and it was glitching all over the place. Every single thing I tried to do it wanted to charge me money. Tech was no help they just told me everything was my fault. After some praying to white Jesus I decided to shoot off fireworks and chant ‘MURICA over and over. I made sure to end my metamorphosis with some passages from Mein Kampf, naturally. But I finally found a solution! I’ll just dominate them and steal their money too. I’ll win so hard.","title":"MURICA MURICA MURICA"}}]}