{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=8600","data":[{"id":"6177528897","type":"user-reviews","attributes":{"review":"this app...HORRIBLE!!!. the UI did not function AT ALL!!! and it didn't look good either!! \n\nfirst the app took TWO MONTHS to download!! then it wanted to steal my personal information (stalker much?). my poor dog started howling in pain after i opened the app (dw, he's quite alright now, after i deleted this disgusting app.) \n\nto add on, my globe started to look like a bad rendition of the american flag after this app was downloaded. thankfully, i uninstalled this horrendous app before it was too late and my globe looked like earth in american movies. bad, and only focusing on america. \n\ni DO NOT recommend this app to anyone, including my worst enemy. no one deserves to waste their data on this app!! unless you want your dog to howl in pain and watch your globe turn into a horrible country only, DO NOT GET THIS APP!!!","rating":1,"title":"MY GOD","userName":"yeitspydohxphdpydlhdogspyeote","date":"2020-07-09T17:16:14Z","isEdited":false}},{"id":"6177520974","type":"user-reviews","attributes":{"review":"Ok first of all as soon as I opened the app to see what trump was going to do for the presidential election, immediately my phone started crashing my apps would NOT open up and I felt like someone was controlling my phone. And I am very confused as to why that was happening, I with thinking maybe it had a virus, but then I am not lying about this I got an actual warning stating one of my apps where detected with a virus. This app I do not recommend!!!","rating":1,"title":"I would never ever recommend this app.","userName":"i dont recomend!!!!","date":"2020-07-09T17:13:45Z","isEdited":false}},{"id":"6177509948","type":"user-reviews","attributes":{"review":"Not going to lie, but I don’t know how Trump plans to make America great again if he can’t even make a great app. Considering social media and technology plays a huge role in today’s life, I was disappointed, but not surprised a boomer couldn’t even get it right. Overall I would rate this a 1/5 stars because constantly crashes and glitches my phone. Ruining my phone, just like Trump ruined America. I think he Jinxed America with his “make America great again” slogan.","rating":1,"title":"Disappointed but not Surprized","userName":"All funny nicknames are taken","date":"2020-07-09T17:10:20Z","isEdited":false}},{"id":"6177481904","type":"user-reviews","attributes":{"review":"This app was so scary when I opened it I saw the orange man my dog got scared and ran away. I started crying so I jumped of the window to get my dog I had scratches and the when I look back at the app the orange man was still there! This is a really bad app. He doesn’t even like Mexicans like what is wrong with that orange. I thought oranges were supposed to be sweet but not this one, or even Sebastian bails. I rate this app a one star I would put zero if I wanted to but I can’t! And then I died because of this orange dude.😞","rating":1,"title":"This app killed me","userName":"ramiro the cool guy","date":"2020-07-09T17:01:44Z","isEdited":false}},{"id":"6177475416","type":"user-reviews","attributes":{"review":"This is the worst app in the whole App Store! This app should be removed for the following reasons:\nIt made my teeth fall out!!!! The moment I downloaded this app my teeth started falling out! Reason number two is that when I downloaded the app it took my rationality and common sense away!! Ever since this horrible app my head hurts so bad, my eye sight seems to be getting worse and my back hurts all the time. Almost like as if this app is only for old, ignorant, selfish, racist, and uneducated people.","rating":1,"title":"HORRIBLE!","userName":"gen z✨🧚🏼","date":"2020-07-09T16:59:50Z","isEdited":false}},{"id":"6177460793","type":"user-reviews","attributes":{"review":"This app... is by far the worst app I’ve ever used. I opened it and it crashed my phone. I then had to delete and reinstall, I repeated this several times and was finally able to put my phone number in. Once I did I got a text. Which than hacked my phone and took all important data and login information. My bank account went from $20k down to $0. \nIf you get this it’s Not worth the risk😭","rating":1,"title":"Had high hopes. But they all vanished as soon as I opened it.","userName":"Llamperouge3","date":"2020-07-09T16:55:35Z","isEdited":false}},{"id":"6177400740","type":"user-reviews","attributes":{"review":"This app took 8 weeks to download and when i opened it i was immediately placed into a cult? they started telling me things like ~blue lives matter~. slowly my brain started telling me to objectify women and to hate anyone who’s not rich and white. i started getting urges because of this app. urges like wanting to tear gas crowds of people upset about the consistent murder if one race. it all went away once i deleted it though. would not recommend to anyone who doesn’t want to be a nazi. 😕","rating":1,"title":"BAD🍊","userName":"🍊🥰🍊","date":"2020-07-09T16:37:43Z","isEdited":false}},{"id":"6177251839","type":"user-reviews","attributes":{"review":"I like trump just as much as the next guy, but could he seriously not have made a worse app???? Since downloading this app my “suggested ads” have increased TENFOLD. It seems as if this app is leaking my information. What’s worse is I’ve been getting facebook friend requests from RUSSIA!!! Cannot believe Trump would use this app to data mine and sell our information to the commies. Apple, please do what’s right for the American people and take down this terrible app!","rating":1,"title":"Actually terrible","userName":"Trump is a Communist","date":"2020-07-09T15:54:49Z","isEdited":false}},{"id":"6177125688","type":"user-reviews","attributes":{"review":"I would’ve thought the president of the United States, a man with access to the cyber security and software developmental powers of the United States Government would have the power to create a functional app, but it doesn’t even run longer then 5 min. The user interface is like deciphering cryptography, and it’s not at all interactive from a user standpoint. I thought the president would be better than this, but I guess all his administration has done is prove otherwise.","rating":1,"title":"Presidential resources?","userName":"uskiwich","date":"2020-07-09T15:19:03Z","isEdited":false}},{"id":"6177041969","type":"user-reviews","attributes":{"review":"Every time I try to open this app i am greeted with a white screen... I’ve waited hours.. days... weeks even and no matter what I do all I see is a white screen. I’ve tried deleting the app and re-downloading  multiple times, the only thing that changes is occasionally I will get a “whites only” pop up that I can never get past?! I’m not sure what’s going on with this app but I’m deleting it for good. Extremely disappointed. Wish I could rate it 0.","rating":1,"title":"White screen","userName":"xnotc","date":"2020-07-09T14:56:00Z","isEdited":false}}]}