{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=4680","data":[{"id":"6177196356","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I downloaded this app so that I could keep up with trump’s campaign and get alerts every time he tweets out another beautiful nugget of knowledge. After downloading I noticed my brand new iPhone 11 was starting to glitch. I have never had problems with my phone before but since getting this app it barely even functions. I am not the type to leave reviews but I hope that someone reads this and saves themselves the struggle of having an almost useless phone simply from downloading this app. I will from now on only be able to use this phone as a paperweight.","title":"Crashed my phone","date":"2020-07-09T15:38:51Z","userName":"AnnieDelcharco"}},{"id":"6177115948","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I wanted to try out this app so I could be more updated on what was going on with my president. After I got into the app, it started crashing. I thought maybe my phone was just acting up so I powered off my phone and powered it back on. My phone continued to crash and act up. At first my phone was only crashing when I used the app but then it started when I got on other apps like my Facebook or words with friends. Eventually I deleted the app and my phone went back to normal. It makes me sad that I have to continue to find information online rather than having the app.","title":"Not so good 😢","date":"2020-07-09T15:16:24Z","userName":"okž"}},{"id":"6177036038","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I am deeply disappointed in the trump administration, I wish I never downloaded this app. It took forever to download and also gave my phone multiple viruses! One of the viruses resulted in my phone getting spammed with tons of Chinese propaganda. My phone was so damaged that I had to buy a whole new phone! A week later, the police arrested for supposedly working with the Chinese government illegally. I’ve since been released from prison, but the app also released my information (on the black market) so I keep getting creepy messages and I think I’m being stalked by some orange guy. This app ruined my life, DO NOT get it!!!","title":"Dangerous!","date":"2020-07-09T14:54:23Z","userName":"Smiling_meese"}},{"id":"6177016914","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"So I heard about this liberal conspiracy to take down this app which motivated me to download it in opposition to support out president but the app constantly crashed. The app kept asking for my personal information, to the point of my social security number and once I gave it I got kicked out of the app and it wouldn’t open again. I tried restarting my phone and re downloading the app but after I re downloaded my phone stopped working for hours and all my saved information was gone. Do Not download this app it is a virus and some weird china impersonation of the actual trump 2020 app","title":"This app is fake news","date":"2020-07-09T14:49:13Z","userName":"197302765939165)"}},{"id":"6176965219","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I thought it would be a good idea to this app but clearly it was not. After taking FOREVER to download, I was greeted by so much orange that my eyes hurt.  Not only that but with the bonus of being welcomed by racist white people to was not a very good welcome. These people where mean and cruel and VERY VERY stupid. 😡 They cared so much about having to do things to prove you were one of them and if you didn’t they got crueler! That really hurt my feelings. 🥺 Then my phone started glitching very very badly to the point where I had to delete this app. Pretty sure this app is cursed.  Very bad!  Negative infinity out of ten. Wouldn’t recommend to anyone.","title":"AWFUL!!!!!!!! 😡","date":"2020-07-09T14:35:15Z","userName":"Katie ._."}},{"id":"6176936860","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I was expecting to download an amazing, beautiful app. However, as soon as I opened it, my eyes were assaulted by photos of Cheetos. I was appalled! Soon after, everything that I saw took on an orange tint, and I had the irresistible urge to buy a fake toupee! My phone started to glitch out, and the words “Trump 2020: Make America Racist Again” kept appearing on my screen. The general vibe of it was reminiscent of watching the tape from The Ring and being told you only have 7 days to live. After that, I decided the best thing to do was to delete the app before it permanently fried my phone and my brain. Do Not Download This App!!","title":"Absolutely Awful","date":"2020-07-09T14:27:43Z","userName":"Laris Reviews"}},{"id":"6176879266","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"When I opened up the app i saw a picture of a spray tanned shrimp and it proceeded to take me to a virus which made it my lock screen and home screen. My phone then proceeds to not turn on but only turns on when it is time to add another layer of spray tan. Also after that no matter what I was doing my phone would crash. For hours I couldn’t check my phone or anything. For hours I would try to turn it on, but now it only turns on when I massage the shrimp. It also made my ringtone a recording off a presidential speech on making the border of Mexico a wall, I’m Hispanic. This app is all in all horrible","title":"TERRIBLE!","date":"2020-07-09T14:12:39Z","userName":"TOK TIK GEN Z"}},{"id":"6176874588","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I opened the app and immediately I smelled something rancid. I looked at my phone charger port and a mysterious liquid started dripping from it. It was orange like those popsicles you see at the store. I got concerned so I set my phone down and went into my kitchen to get some rice to put my phone in. I ran back into my room to find a fully formed orange man in my room. \"What are you?!\" I screamed in a panic. He puckered his lips and mumbled \"I am the greatest president in the world\". I shrieked and threw the bag of rice at him and ran to my front door. I frantically fumbled with the locks as I felt the beings presents near. I opened the door just in time to escape the creatures slimy grasp.","title":"Cheeks, literal cheeks","date":"2020-07-09T14:11:26Z","userName":"Shane's cat😼😼"}},{"id":"6176739375","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"if anyone’s reading this, do not get the app. It asked for my personal information and I felt really uncomfortable. Why do we need to give him our phone number? I don’t wanna get a text from him. 😳🤚 I got this app to support my parents (who are voting for him) but the way that the app works is absolutely atrocious. The massive glitches and bugs are just not the move. Every time I go on the app it just glitches me out and it is not my phone. I just got a new one. You need to fix this app and your attitude. Me and my parents will not be supporting you due to how crappy this app is. They are voting for Biden now. ☺️☺️😌💋🧚🧚‍♀️🧚","title":"THIS APP IS HORRIBLE","date":"2020-07-09T13:35:50Z","userName":"htdchyfjjv"}},{"id":"6176691982","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"If I could give it 0 stars I would. This app took over 3 hours to download and when it did I started to get message after message about how real women vote for trump and I was so confused, like am I a real women?? I don’t know now??? And this song keeps playing of women sing “ReaL WoMEn vOTe FoR tRuMP”?? What is that?? (They aren’t even in tune btw) Anyways I have to take my phone to the Apple store now because some orange man wont stop texting me trying to get me to vote for him!! And all my accounts have been hacked and now my parents know I read teletubby erotic fanfics and now I get my phone taken away at 8pm instead of 9! thank trump app!","title":"AM I A REAL WOMEN? HELP","date":"2020-07-09T13:23:21Z","userName":"Bonqiqi Jefferson"}}]}