{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=790","data":[{"id":"6173562521","type":"user-reviews","attributes":{"rating":1,"review":"This is the worst app ever, I can’t believe that u have wasted my time. This app took forever to download. THREE DAYS TO BE SPECIFIC. I am extremely disappointed and I want to speak to the manager immediately this is absolutely ridiculous. To start I wash washing my gold fish and and taking out the dishes all of a sudden I realized that it was  Christmas in may of 2009. Not only that tows and fingers fell off. Not to mention my leftover pizza came back to life and tried to eat me. YOU KIDDING THE SLICE OF PIZZA TRIED TO TAKE A BITE OUT OF ME.  I vacuumed my bed and washed the carpet. Ran with the trash.  Heated up the microwave cause it was cold. Eventually I had to give the shower a bath and the bath a shower. That’s was exhausting. All of these things happen in one hour I come back and check the app hasn’t even made progres so who’s fault is it? I seriously want to speak to a manger or your super advisor because this is absolutely not what I wanted. This is a \n disgrace to this country with everything we stand for. Absolutely ridiculous!!!","userName":"Cody_2323","date":"2020-07-08T20:07:22Z","title":"Horrible experience","isEdited":false}},{"id":"6173521419","type":"user-reviews","attributes":{"rating":1,"review":"when i heard about this app i was elated!! i’ve been looking for an orange cheeto themed dating app for all my life. but when i read the info, it was a little bit misleading to say the least. it said it was the official trump 2020 app, which it is not. it’s a literal knockoff of tinder! it took an entire month to download. when orange spray tan started leaking out of my phone, that’s when i knew it was ready and even though i was a little frustrated with how the app presented itself and how long it took to install, i was just happy it finally worked, though it did ruin my phone. when i opened the app it made a high pitched noise that made my cat mutate into peaches and she wouldn’t stop complaining about her itching and burning c*och! 😾 so now i have that to deal with and on top of that, i was NOT satisfied with the dating app features. the entire app was filled with people catfishing as roaches. everyone please just settle for tinder!!! this will waste your dating life experience. ❤️","userName":"hdhshejwjsgdgddhhw","date":"2020-07-08T19:53:22Z","title":"my entire phone shut down!! 🤬🤬","isEdited":false}},{"id":"6173420094","type":"user-reviews","attributes":{"rating":1,"review":"this app is the worst app ever. not only did it take 72 hours to download, but once it was opened it instantly crashed and erased my data. so i tried again, because i ADORE mr. orange man! and on the second time it didn’t work either so homie you know i tried a third time!! and third time’s a charm because it finally opened! i started reading the charming things mr. orange anus has said and plans to do out loud to my deaf, blind, but otherwise very alert mother, and the lights in my home right in the beautiful country of the united states of america started flickering, and my house started shaking! lo and behold, when everything settled down and the lights were back to normal there was a strange but very very handsome devil standing in my living room. and he was literally a devil lol. and he explained to me that SOMEHOW mr. orange toupee’s words were enough to summon a demon from the unholy world. so, overall, this app is horrible and i don’t think it should’ve ever been allowed on the app store in the first place!","userName":"RiannaU312","date":"2020-07-08T19:18:48Z","title":"app summoned a demon?","isEdited":false}},{"id":"6173178563","type":"user-reviews","attributes":{"rating":1,"review":"This app took about 17 hours to download and during that time I was aloud to do anything but lite to 6ix9ine, because once I downloaded the app a SWAT team broke into the house i’m at and told my family that we aren’t aloud to do ANYTHING except listen to Tekashi until the app has finished installing. Once it finished they left in a rush, probably to go torture another family, and we were heartbroken because when the SWAT team entered our home, they brought in rats and cockroaches with them! Then once I finally opened the app it started to make this weird sound and we later found out it was a whistle sound that was slowly but surely killing our dog. THEN if it hadn’t done enough to us, when I tried to delete this app that was trying to inform me about our 🟠 president, as i presses the delete button a grande was thrown into our house with a note at ed to it that read, “TRUMP 2020”. The grenade blew up and out house went up in flames. Would no recommend. Also BLM!","userName":"J-bob__Da_Unicorn","date":"2020-07-08T17:57:43Z","title":"Horrible! Do not download 🦋💕✨","isEdited":false}},{"id":"6173136846","type":"user-reviews","attributes":{"rating":1,"review":"this app is supporting a president who has nothing but hate and ignorance in his heart. i used to love donald trump but during his presidency i have become more educated. i now realize that he does not deserve to be in office because of the MANY things he does wrong that his supporters choose to ignore. i will not be voting for him this year and neither should you. it sickens me to my core. he says all lives matter, but children are in cages and being raped, people are dying every day from corona, innocent black people are being murdered with no consequences to their murderers, and he wants to hide in his bunker only to come out for some rally’s. it is disgusting and hypocritical. he is a white supremacist. he admitted it on twitter. but his supporters choose to ignore that. they choose to be ignorant and it is so sick and so vile. we will win this revolution because we have our children. they are the generation of love, hope, and prosperity. they will win this fight against evil. i believe this with all of my heart.","userName":"mikaela howard","date":"2020-07-08T17:44:29Z","title":"black lives matter","isEdited":false}},{"id":"6173028378","type":"user-reviews","attributes":{"rating":1,"review":"i downloaded this app. and right after my phone literally glitched so much and then 10 seconds later i got a call from my bank saying that there has been suspicious activity with my card. they told me what i bought and it was a bunch of trump and maga items/merch. i believe it was the trump administration who did this. i am a poor single mom with 5 kids and i’m in college. i have no money in my bank account because of what this app did to me. the bank is trying to give me my money bank but for now i has to quit college and get 5 jobs. putting my 5 kids in danger. not only that now my 2 eldest sons have to work now. they are both 16. YOU TOOK AWAY THEIR YOUTH TRUMO. you lost my vote. not only that but this app also made my phone really laggy and now it calls people on its own. this is a brand new phone (only 4 months old) so it cannot be my phone. and the only thing “new” that i have downloaded or done to this phone is download this app 🤬😡🥵😠😤😭","userName":"Nina Dols","date":"2020-07-08T17:09:58Z","title":"omg trump ily am why did u do this","isEdited":false}},{"id":"6172845132","type":"user-reviews","attributes":{"rating":1,"review":"I decided to download the app in order to get a better representation of what the country would look like if it was run by the Annoying Orange. Unfortunately after the almost six week long download and nine day long update I was met with a strange amount of people with the snowflake emoji as there profile picture. I believe that the president could be starting a secret club where all of his members are called the snowflakes. \n\nAll in all it seems like a basic book club. If you are reading this Mr. Trump (which I highly doubt since you are hard at work on the golf course) I recommend reading Trevor Noah’s biography Born a Crime: Stories from a South African Childhood. It is a classic coming of age story by one of Americas most adorned men. He is able to mix comedy into a story that mamy Americans can easily understand. EVEN YOU!! :) \n\nAnyways, I hope this helped anyone who has still not Made A decision aNd is lookiNg for a new social media platform as well as an opportunitY to join a new club.","userName":"Glor.Ma","date":"2020-07-08T16:13:37Z","title":"Too many snowflakes","isEdited":false}},{"id":"6172838046","type":"user-reviews","attributes":{"rating":1,"review":"Trump has used many racist phrases such as “it’s the kung-flu” and “it’s the Chinese virus” I mean is it that hard to call it the corona virus, but I mean his brain is the size of a pea so it’s probably not in his vocabulary he has also passed a law that allows adoption agencies to turn away lgbtq+ members simply for being a part of the lgbtq+ community, he is a homophobic racist. He also made up excuses as to why we can not convert to wind energy in order to help the environment he said “windmills are very expensive” no they’re not, he also said “almost none are made in the U.S. which is also wrong 42,000 windmills have been made in the U.S., he also says global warming isn’t real, he also passed a law that makes it to where if someone is stopped at the border they are automatically separated from their family and then the children are locked in cages and pepper sprayed, so he obviously has the brain of a 4 year old and does not deserve to be our leader. (He also looks like a Cheeto)","userName":"Briwoody18","date":"2020-07-08T16:11:31Z","title":"Trump is an awful person","isEdited":false}},{"id":"6172775829","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app and attempt to find a reason to vote for our president as soon as I try to download it it took three hours to just download then it was glitching my phone so much like I thought my Wi-Fi was off but it was not second of all he gassed up bunch of innocent citizens at a protest like what is wrong with you and then holding a Bible at a church do you never see him at church is it’s only for him to look good we need Obama back Obama would’ve never done any of that he stands with the Black Lives Matter stands with all lives matter all lives matter but yes Black Lives Matter specially because our president doesn’t even care about them he is racist like what the heck what have Mexicans are any of them don’t you you’re all we are all human beings none of us should be treated differently he’s the worst president ever if you know it’s right you will not vote for him do not vote for him he’s a terrible man do not download do you terrible app","userName":"RomaTess","date":"2020-07-08T15:53:41Z","title":"Terrible app do not download worst out of all times","isEdited":false}},{"id":"6172588585","type":"user-reviews","attributes":{"rating":1,"review":"Y'all Karens and Lindas up in here getting pressed because these “immature kids” are “disrespectful.” Well maybe you should think of it this way we may not be 25 with a fully developed pre frontal cortex however I believe the voting age in this country is 18? Maybe your just heated because were not old and wrinkled like you but we can still see with our own eyes that Trump is a disgusting person and he represents one part of our country. And its the racist, sexist, white, people who live in trailers. Or maybe you were too busy drooling over your master Trumpy boy an accidentally put the tampon in the wrong hole. :((( We have all of these resources at our hands showing us that a rich orange racist rapist is sitting in our country's oval office. We think it’s wrong. We think we need better. We’re going to help make change. Also tiktok getting deleted? Trump=canceled. Oh yeah and about the app, it took 3 hours to download and quite frankly i’m too disgusted by these reviews to even open it.","userName":"pppppppppooooppppppppooooo","date":"2020-07-08T15:00:51Z","title":"read this ⬇️","isEdited":false}}]}