{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22660","data":[{"id":"6172307683","type":"user-reviews","attributes":{"date":"2020-07-08T13:43:54Z","review":"I downloaded the app to see something comparing and contrasting ya know the usual. But then I hen I downloaded I got swept away by this big orange helicopter. It was all a blur but I could only hear. Five stars five stars five stars in my ear for 5 minutes straight. It was such a scary scenario. I will come back later to see if it happens again 😱.","userName":"Minnie Mouse RULES","rating":1,"isEdited":false,"title":"I could have died"}},{"id":"6172008720","type":"user-reviews","attributes":{"date":"2020-07-08T12:19:22Z","review":"In 2016 I did not understand why my mother voted against trump or why he was so bad. Now I do, he is a menace! All of these news posts are incredibly rhetorically contradicting to his own words. I don’t even know how everyone in his campaigning office can support him, they must be deaf, blind and have no brain. Clearly this man needs to be in a institution.","userName":"dumptrump2020hesucks","rating":1,"isEdited":false,"title":"Terrible News"}},{"id":"6171748100","type":"user-reviews","attributes":{"date":"2020-07-08T10:57:12Z","review":"Well the fact that trump wants to delete TikTok is not cool most people who have TikTok get there happiness from that app just like me. Why take my happiness away and others? All I really want to say is get ready when people come for u trump bc no one is happy about this. Btw your son is really cute, your wife did a good job on making him","userName":"#tiktoklivesmatter","rating":1,"isEdited":false,"title":"TikTok"}},{"id":"6171266555","type":"user-reviews","attributes":{"date":"2020-07-08T08:08:07Z","review":"My girlfriend of 3 years broke up with me after loving Donald trump so much. She talked about him a lot but I didn’t think anything of it. When she got the app she liked him even more. She got pictures paintings and all this other stuff MAGA hats and mugs. She broke up with me and now is in love with Donald trump. I am very sad and feel like he ruined are relationship.","userName":"420Sadboy","rating":1,"isEdited":false,"title":";("}},{"id":"6165919276","type":"user-reviews","attributes":{"date":"2020-07-06T23:46:54Z","review":"When I downloaded this app to “support”our unpeeled orange chicken, it hacked my Instagram 👺ugh and I have to make a new account. When I first open the app, his face was staring into my soul like he’s going to grab me. It was so scary! His face was so wrinkly and crusty. GUYS TRUST ME DON’T VOTE FOR TRUMP HES A DISGUSTING HUMAN BEING! if you vote for him your racist! A homophobic! and etc. don’t trust this app at all! ty for listening ☺️ #obama2020","userName":"angela d k","rating":1,"isEdited":false,"title":"Horrible! Scary! Bad app!"}},{"id":"6155161339","type":"user-reviews","attributes":{"date":"2020-07-04T05:24:26Z","review":"I am honestly so disappointed in this app. I had a lot of hopes. The color scheme throughout the app hurt my eyes. They were not pleasant colors. The fonts were too small to read. The tabs on this app often glitched. In addition, the information on this app is very misleading (please do your research before believing anything on this app). ✨🧚🏽‍♀️🧚🏽🧚🏽‍♂️✨","userName":"YHLQMDLG-BAD BUNNY","rating":1,"isEdited":false,"title":"⚠️DECEPCIONADA⚠️"}},{"id":"6154741499","type":"user-reviews","attributes":{"date":"2020-07-04T02:45:41Z","review":"Once I downloaded this app the craziest thing happened in my shower! Out of no where a strange goo came out of the shower head. It burned my skin so bad that you were able to see my bones. Thenn you won’t believe this! Out of no where one direction appeared in my closet and started to sing drag me down and satan scalped my head and took my knee caps. Anyways. Ya torture","userName":"jasondurlo210","rating":1,"isEdited":false,"title":"Scary day"}},{"id":"6149275902","type":"user-reviews","attributes":{"date":"2020-07-02T17:48:56Z","review":"Trump is not only racist but does not approve of women he is such a horrible person and nothing will ever change my mind about that, I will admit he’s done things that helped America but VERY LITTLE THINGS... I loved Obama he was just an amazing person.. he accepted woman and he had his OWN child care because he very much did care. DO NOT GET THIS APP it is horrible","userName":"Cali Jordan","rating":1,"isEdited":false,"title":"Absolutely horrible"}},{"id":"6152643628","type":"user-reviews","attributes":{"date":"2020-07-03T14:04:24Z","review":"Much better than the 2016 version. The Trump digital team is firing on all cylinders!","userName":"Gldn3","rating":5,"isEdited":false,"title":"Excellent source of information"}},{"id":"6149234109","type":"user-reviews","attributes":{"date":"2020-07-02T17:33:47Z","review":"This app is seems fine but then once downloaded it made my phone lose the will to live. My phone started shutting down for no reason other than the fact that became infested with bunker boi’s cowardice and incompetence. So sad deleted this app very quickly to return my phone to a state of mental sanity.","userName":"Jjfliff o awesome","rating":1,"isEdited":false,"title":"Bunker Boi should fix this"}}]}