{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=4420","data":[{"id":"6173068725","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app to see him and his ways and understand him but instead I was left with a boring malfunctioning lazy app. I have good WiFi and storage so obviously it’s the app that’s the problem. But also having such a nasty person as president shouldn’t be allowed and I totally disagree with everything this app has to do within the limits of 2020 at this exact moment. \n\nAnother thing I have a 9 year old cat who’s very skittish and she ran at the sight of anything to do with the app. In fact she got so mad I had it she slapped me and now I have scratches on me. And then my 13 year old dog decided to bite my foot and it was bleeding because of the chaotic music and fake news spreading around.\n\nIf anything this app is all fake news and nothing is real. I will never ever download again because this app like I said is disgusting.\n\n Also it asks you for your information which is kinda dumb because what if he’s actually tracking your every move. Like ew yikes.","isEdited":false,"title":"Never Again!","date":"2020-07-08T17:22:40Z","userName":"AngelTomlinson"}},{"id":"6173043424","type":"user-reviews","attributes":{"rating":1,"review":"The is so bad it took 4 hours just to download! Not only that it kept on taking me off the app every time I tried to go on it. When it finally let me go on it, it glitched out like crazy!!! When it stopped it all went black and I saw President Cheetos, he said “get off the app you Mexican!” Then it went black to normal. This app seems to be poorly made it was glitchy, slow, and wouldn’t let me do anything! I got a text saying “get off the app you Mexican!” How did he know I was Mexican?! 2 days later he came to my house and burnt my geko and said “I told you to get off the app you Mexican!” I used to support President Cheeto but now I don’t he’s a meanie!","isEdited":false,"title":"No✨","date":"2020-07-08T17:14:37Z","userName":"196ratata"}},{"id":"6172972777","type":"user-reviews","attributes":{"rating":1,"review":"After downloading the app I had troubles as expected but I’d figure I’ll give it a chance like any other app. That’s when my problems started to occur. At dinner with my bolgarian family I decided to check the app it was at this point the app started exclaiming “What are you doing step-bro” and of course everyone was suspicious of my doings no matter what I said they still did not believe me. On another occasion I was watching Netflix with my girlfriend and out of nowhere the gummy bear song in German started to play now my house is infested with mosquitos playing jazz flutes. From the bottom of my heart will the developers fix these problems.","isEdited":false,"title":"Weird noises","date":"2020-07-08T16:52:56Z","userName":"Carson-L"}},{"id":"6172871040","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app in an attempt to see all the lovely things our president has done for us in hope to vote for him again but all I was reminded of was all the terrible things he has done for us .. after not even 2 hours of having the app it started making my phone glitch repeatedly.. this is the worst and i mean WORST app ever !!! Also president 🍊 has done nothing for us.. nothing good at least, i’ve once read about trump removing the ban of guns from mental people I mean seriously WHO IN THEIR RIGHT MIND WOULD DO THAT!!! DO YOU NOT CARE FOR OUR SAFTEY and taking off obama care I mean that was really uncalled for ...needless to say Trump i wish you the worst. I really do❤️","isEdited":false,"title":"TERRIBLE APP","date":"2020-07-08T16:21:26Z","userName":"Bre Bandoooo"}},{"id":"6172848691","type":"user-reviews","attributes":{"rating":1,"review":"i opened this app and was immediately greeted with an image of an overgrown old tall fat orange oddly shaped. this app was poorly designed and horribly executed and i’m not sure what idiot thought of making this but they shouldn’t have rights. i was bombarded with poorly written articles and bad videos supporting an idiot. this app is as if the annoying orange had a worse version that was still annoying but now idiotic, racist, homophobic, transphobic, xenophobic, sexist, and much more worse things that NOBODY should support. the orange this stoopid app was supporting should be left on pluto with all its worst fears, immigrants, strong females, and the homos. delete this app immediately.","isEdited":false,"title":"#anyonebuttrump2020","date":"2020-07-08T16:14:41Z","userName":"diana nicosia"}},{"id":"6172822819","type":"user-reviews","attributes":{"rating":1,"review":"I got this app because I wanted to see what our orange president is saying. Well news flash!!!! TRUMP IS A BAD PRESIDENT!!! \nAnd if you can’t see why, then your too blind and arrogant. Multiple times our orange president has tried to take away our human rights, and he is a racist/rapist. \nI don’t understand why people support him if he can’t even fulfill his promises. \nNot only that, but he doesn’t even admit if he does something wrong. He blames whatever it was on someone else. There’s proof out there if you look for it proving that trump isn’t the president that you see him as. I hope you gain some more brain cells to understand that. 🍊","isEdited":false,"title":"✨🧚✨install if you enjoy false info✨🧚✨","date":"2020-07-08T16:07:08Z","userName":"LeoparedWolfz"}},{"id":"6172709307","type":"user-reviews","attributes":{"rating":1,"review":"The news is fake but what’s new this entire presidency is fake. I logged on to see the differences and biases on what he accepts and reports as a credible news source. Let me tell you most of his news sources that are posted are skewed and made to make him look better. Wake up black people are being murdered by white supremacists every day. He is giving white supremacist a platform that in this country we DO NOT WANT. Children are in cages still being raped by ICE agents and he acts like it is not his fault. Not to mention all of the Americans dying from a deadly pandemic but he is more interested in the top 1% to do anything to save this country. MAKE AMERICA GREAT AGAIN AND PUT HIM IN JAIL FOR TREASON!","isEdited":false,"title":"Worst app ever","date":"2020-07-08T15:34:40Z","userName":"Danny_castillo"}},{"id":"6172642895","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app to support our wonderful and amazing president of the United States of America and wouldn’t you know, it takes my personal info, sells its to telemarketers, took a good 1/2 hour to download, and then everything on the app itself is lies and unfounded information that causes small minded people to follow like sheep. They want to ban tik tok, but not this piece of crap app that’s crashed my phone 7 times now?? Not to mention the amount of battery it consumed after scrolling for literal minutes. Overall, this app is horrible, this President is horrible, and please remember, third party votes split the election so please save us all and just vote blue.","isEdited":false,"title":"Literally 0 Logic","date":"2020-07-08T15:16:00Z","userName":"Yonkvday112"}},{"id":"6172640336","type":"user-reviews","attributes":{"rating":1,"review":"This app is literally an big waste of space, it took the absolute longest to download. Now that I am actually on this app my phone is glitching and the app even moves slow. My family now hates this app. It needs to be updated or something. I’ve had to reset my phone several times. I was trying to learn more about the president and it keeps kicking me out. When I opened the app also many bugs came out and I hate bugs and so does my dogs. The bugs have killed my dog, it’s horrible. My great grandmother tried getting the app, as soon as she pressed download she fell down the stairs and broke 3 ribs. This app is horrible.","isEdited":false,"title":"Do not download","date":"2020-07-08T15:15:17Z","userName":"Niyahskii"}},{"id":"6172616623","type":"user-reviews","attributes":{"rating":1,"review":"This app took soooo long to download it took about a week. I came here to learn about trump and see what he is really like only to see that it is fake news and one sided bias. They only show the GOOD news on here but never educate on the true nature of the president. Just shows that that all you need to become president is money. This app is just crawling with viruses as well. My phone glitched out a bit as soon as it finally downloaded. Ads popped up immediately after I closed the app. And this problem didn’t occur until after the app was on my phone. My phone as suffered and costed my hundreds of dollars to repair. I warn you, DONT. GET. THIS. APP","isEdited":false,"title":"Horrible app 🧚✨✨","date":"2020-07-08T15:08:35Z","userName":"big papa ✨"}}]}