{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=133170","data":[{"id":"6173611173","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"I hate you as much as ur son hates you being his dad.🧚✨✋","review":"STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON STAN BTS STAN STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON STAN BTS STAN STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON STAN BTS STAN STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON STAN BTS STAN STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON STAN BTS STAN STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON STAN BTS STAN STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON STAN BTS STAN STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON STAN BTS STAN STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STAN ITZY STREAM HOW YOU LIKE THAT STREM HOW YOU LIKE THAT STREAM HOW YOU THAT STREAM HOW YOU LIKE THAT STREAM HOW YOU LIKE THAT STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STAN STRAY KIDS STREAM NOT BY THE MOON STEAM NOT BY THE MOON STREAM NOT BY THE MOON STEAM NOT BY THE MOON STAN BTS STAN STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STAN BTS STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE AND MORE STREAM MORE","userName":"🌚Barron trump🌝","date":"2020-07-08T20:24:21Z"}},{"id":"6173610957","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"TRASH","review":"TRASH TRASH TRASH TRASH TRADH TRASH TRASH TRASH TRASH TRASH","userName":"amonsygehbd","date":"2020-07-08T20:24:16Z"}},{"id":"6173610657","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"sorry but this app is dogsh","review":"the interface is horrible the options are ???? theres literally no point of this app. you can do everything anywhere else. horrible president. but anyways DUMPTRUMP2020  DUMPTRUMP2020 DUMPTRUMP2020 DUMPTRUMP2020 DUMPTRUMP2020 DUMPTRUMP2020 DUMPTRUMP2020 DUMPTRUMP2020 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 DUMPTRUMP2020","userName":"consumer299","date":"2020-07-08T20:24:09Z"}},{"id":"6173610675","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This app is cursed!","review":"It all started when I was watching my little pony, I went to download the app and as soon as I pressed the download button, poop and pee started coming out of my phone! 👿. Not only was there poop and pee, there was ALSO so many peaches popping up on my phone 👿😱. And then it opened up my Minecraft app and started to delete all of my worlds 😰😖😭 I tried to tell my dad, but he didn’t say anything to me because he had already gotten the app and all the roaches and beetles ate him! I checked with my other family members and my little sister had gotten peaches stuffed into her eyes and there were apples eating her alive! My older sister, had deodorant shoved in her mouth and underwear on her head! She was also being attacked by stuffed animals! Lastly, my mom was laying on the floor, dead from seeing trumps nud35 on Facebook! What a shame because now I can’t hear her say “Excersize? I thought you said extra fries!” 😭😢😣 I couldn’t believe this was happening! They even suffocated my pet rock! This app killed my whole family 👿😭 I tried calling the po po but they didn’t respond because they were too busy killing black people and anyone who isn’t white! I also tried calling Daniel tiger but he didn’t pick up either! I don’t know why :(! So the best option to do next was to get some chipotle and watch some TikTok! Oh wait-","userName":"KpopMainly","date":"2020-07-08T20:24:09Z"}},{"id":"6173610471","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"😾😾😾","review":"I can hear it callin'\nLoving the way you wanna talk\nTouch me tease me feel me up\nCallin'\nSomething in the way you wanna talk\nYou got me sayin' you got me sayin'\nHow you doing\nTell me what's your name\nWhat's your sign\nFeeling like you're into me\nYeah, I'm waiting, I just want you to come on over where I'm staying\nFalling for a stranger\nGood gracious\nI might even fly out to Vegas (Catch a flight)\nI'm thinking maybe you'd be down to do it\nBut you don't know what I'm saying\nGot me going through the roof, roof\nReally don't care what we do, do, hey\nWe could fly to the moon\nI see your lips moving\nBut we ain't got a clue\nBaby we two distant strangers\nI know you don't speak my language\nBut I love the way she's talking to me\nI can hear it callin'\nFrom where you are\nLoving the way you wanna talk\nTouch me tease me feel me up\nTouch me tease me feel me up\nCall me when it's after dark\nSomething in the way you wanna talk\nTouch me tease me feel me up\nTouch me tease me feel me up\nMax max max, we can have it all (To the max)\nIf you back back back back, back it up\nTake you where you wanna got the gas in the tank\nIf you really wanna make it last (Git git git)\nTalks cheap I'm bout that action\nGirl can you feel the attraction\nBaby come closer I got what you want\nI can tell that you want it there's no need to front\nBaby we two distant strangers\nI know you don't speak my language\nBut I love the way she's talking to me\nI can hear it callin'\nFrom where you are\nLoving the way you wanna talk\nTouch me tease me feel me up\nTouch me tease me feel me up\nCall me when its after dark\nSomething in the way you wanna talk\nTouch me tease me feel me up\nTouch me tease me feel me up\nOoh tell me babe\nTell me how you like it babe\nI don't even know your name\nI love the way you're talking to me\nOoh tell me babe\nTell me how you like it babe\nI don't even know your name\nI love the way you're talking to me\nGirl the way you move\nYou can feel my eyes on you, ooh ooh\nDo it like nobody do\nTell me what you wanna hear\nLemme whisper in your ear\nI just wanna have you here yeah\nOkay baby make it fast (Make it fast, right)\nWe could put the country on the map\nRun it back you gon' have me running laps\nI just, I just want you to make it clap\nOne at a time, baby you're mine\nPromise that you'll never give it away\nI need a sign\nCalling me up, calling me yours\nCalling my line\nDoing what you're doing to me baby it's a crime\nI can hear it callin'\nFrom where you are\nLoving the way you wanna talk\nTouch me tease me feel me up\nTouch me tease me feel me up\nCall me when it's after dark\nSomething in the way you wanna talk\nTouch me tease me feel me up\nTouch me tease me feel me up\nOoh tell me babe\nTell me how you like it babe\nI don't even know your name\nI love the way you're talking to me\nOoh tell me babe\nTell me how you like it babe\nI don't even know your name\nI love the way you're talking to me","userName":"purpletart519","date":"2020-07-08T20:24:05Z"}},{"id":"6173610139","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"👎🏻🍊🤡","review":"IT TOOK MONTHS TO DOWNLOAD.  When I downloaded IT WAS NOT WORKING.it was glitching and trying to get rid of US TIKTOKERS.   \nWorst app ever.","userName":"jssjjdjsjej","date":"2020-07-08T20:23:57Z"}},{"id":"6173609072","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Useless","review":"Useless","userName":"shusianxvxjskabqjkqoqjs","date":"2020-07-08T20:23:34Z"}},{"id":"6173608224","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"🤮horrible🤮","review":"This app is horrible.it took three weeks to download. And then made a virus on my device. And made me pay $100 to get it off, then it wasn’t off, then I had to pay another $100 to get it off. That is why I think this is a horrible horrible app.","userName":"YO_0w-freakin_MAMA","date":"2020-07-08T20:23:17Z"}},{"id":"6173607556","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Terrible","review":"🍊Warning🍊 do not open the app you will be greeted with a orange man🍊 and anybody with eyes will be melted because of the ugliness.10 seconds later a 1000 oranges🍊 will break through your window with mouths screaming, “Five Star, Five star” over and over again like a chant then they say vote for the ugly orange god 🍊","userName":"Penis insulation","date":"2020-07-08T20:23:04Z"}},{"id":"6173607168","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"🧚🏻‍♂️🧚🏻‍♂️🧚🏻‍♂️🧚🏻‍♂️🧚🏻‍♂️","review":"🧚🏻‍♂️🧚🏻‍♂️🧚🏻‍♂️🧚🏻‍♂️🧚🏻‍♂️","userName":"haha take this trump","date":"2020-07-08T20:22:55Z"}}]}