{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37510","data":[{"id":"6134882571","type":"user-reviews","attributes":{"date":"2020-06-29T07:32:54Z","rating":1,"isEdited":false,"title":"Trump is something out of this world😀","userName":"Jewlyin","review":"I like trump. I love trump. I love trump so much that when I see him on my TV I throw up my whole week’s worth of food because of how amazing he is. He is the least racist person I know and he is definitely not an orange rapist."}},{"id":"6134460297","type":"user-reviews","attributes":{"date":"2020-06-29T04:43:24Z","rating":1,"isEdited":false,"title":"Trump","userName":"MarkDaNerd","review":"Trump is the worst president in history. He needs to be voted out. All my Gen Zers and those who hate him let’s all rate this app 1 Star to lower it’s rating and get it removed. We used our power before for his stupid rally let’s do it again."}},{"id":"6133935966","type":"user-reviews","attributes":{"date":"2020-06-29T01:10:39Z","rating":1,"isEdited":false,"title":"Astronomical","userName":"XoXo Gossip girl ---","review":"When I downloaded this app it instantly. started spamming my phone with Debby Ryan Memes and TickTock‘s I had to take it into the Verizon store to get fixed, it took me a few weeks because it was hard to drive laughing."}},{"id":"6133787780","type":"user-reviews","attributes":{"date":"2020-06-29T00:11:03Z","rating":1,"isEdited":false,"title":"This is the worst app in history","userName":"sffrgdss","review":"I downloaded this app because I love our orange president who rapes children! But then it made my house catch on fire and killed my pet dog!!!! I hope everyone will know that BLACK LIVES MATTER and the our president should not serve another term. <3"}},{"id":"6133687391","type":"user-reviews","attributes":{"date":"2020-06-28T23:31:57Z","rating":1,"isEdited":false,"title":"America was never great nor was this app","userName":"1312donaldtrump","review":"I downloaded this app. Seconds after downloading, a cocoon surrounded my body. Little did I know, I would be turning into a white supremacist whenever I hatched. So I used my trusted LGBTQIA+ pin to slice it and free myself. Then I deleted the app."}},{"id":"6133618702","type":"user-reviews","attributes":{"date":"2020-06-28T23:05:23Z","rating":1,"isEdited":false,"title":"Terrible!","userName":"Fight a man","review":"As soon as I downloaded this app in support of my almighty god Donald Trump, my whole house fought on fire! The MAGA hats and my beloved trump flag were only fueling this terrible fire and my whole neighborhood caught on fire!! If you want to save your holy Trump merchandise, do not buy this app. It’s terrible!!"}},{"id":"6122433539","type":"user-reviews","attributes":{"date":"2020-06-26T02:56:58Z","rating":1,"isEdited":false,"title":"disappointed","userName":"bigballerchar","review":"this app is so hard to navigate and seemingly spammy. i bet the libs created this just to try to pull a stupid prank like with the tulsa rally. theyre always up to no good! anyways. i hope this app gets taken off the app store IMMEDIATELY!"}},{"id":"6108253181","type":"user-reviews","attributes":{"date":"2020-06-22T13:06:36Z","rating":1,"isEdited":false,"title":"Uhm violation of privacy much?","userName":"Why.Musically.Why","review":"A lot of other reviews have explained my issue with the privacy violation of this app, but I feel it is necessary to use my voice to share my view as well. Need I explain further?"}},{"id":"6072455744","type":"user-reviews","attributes":{"date":"2020-06-13T22:42:23Z","rating":1,"isEdited":false,"title":"Trump made my family get COVID19","userName":"Kaitlyn123976","review":"Don convinced them it was safe to be outside even when Covid cases are increasing and then he personally came to my door and said all lives matter to my face. If I could rate this 0 stars I would. Resign."}},{"id":"6101998187","type":"user-reviews","attributes":{"date":"2020-06-20T22:27:32Z","rating":5,"isEdited":false,"title":"Trump App","userName":"NC2x4","review":"This app is so good it must have been made by Barron. I love it’s simplicity of use."}}]}