{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=136060","data":[{"id":"6180538394","type":"user-reviews","attributes":{"date":"2020-07-10T10:55:52Z","rating":1,"title":"Omg","userName":"sub to eugene the sposav","review":"Not worth anything but a one star, this is the worst app I ever seen","isEdited":false}},{"id":"6180537872","type":"user-reviews","attributes":{"date":"2020-07-10T10:55:44Z","rating":1,"title":"Stop messing with Gen z","userName":"sadindetroit","review":"Everybody that uses TikTok asked the Trump administration to leave us alone that’s all we want we want to be left alone and allowed to have our own social media platform and our own social media Voice that’s all Trump wants apparently because all he does is post on Twitter and screw things up if Trump is allowed to be on Twitter we should be allowed to be on TickTock I think it’s kind of funny that one little app platform has messed with his head this badly but it’s also sad to be this way about things Genzie just wants to show him how it feels to have one of his favorite things taken away he has no purpose and value to this country whatsoever and as soon as he is out of office his name will be forgotten just like all the other presidents that didn’t make a bit of difference","isEdited":false}},{"id":"6180537490","type":"user-reviews","attributes":{"date":"2020-07-10T10:55:38Z","rating":1,"title":"I wish I could give zero starts","userName":"dundermiflinthisispam","review":"This app is the worst too many ads and phone get crashing, also a lot of old pervy white men harassing me after the app shared my insta, this app invades you’re privacy!! It’s also super slow ! Like my other apps were working fine but this app took forever to use. I keep getting text messages about voting for Donald Trump and when I don’t respond to them they send more asking why I ignore the messages like excuse??? How do you know ??? Seriously this app gives me the hibbie gibbies!","isEdited":false}},{"id":"6180537344","type":"user-reviews","attributes":{"date":"2020-07-10T10:55:36Z","rating":1,"title":"chicken","userName":"kumoryy","review":"chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken chicken","isEdited":false}},{"id":"6180536718","type":"user-reviews","attributes":{"date":"2020-07-10T10:55:28Z","rating":1,"title":"ew","userName":"✨😔🧚🏽‍♀️🦋🙈","review":"It ✨needs to be deleted asap✨ RACIST, HOMOPHOBIC, MISOGYNISTIC APP","isEdited":false}},{"id":"6180535787","type":"user-reviews","attributes":{"date":"2020-07-10T10:55:15Z","rating":1,"title":"We all know what I’m about to say","userName":"my tiktok is tiredthots2","review":"I can’t stand our president and as a lesbian, female, immigrant it’s easy to see why. Please re think your choice if you actually like the president or his app. This app is genuinely terrible and a wast of my valuable time. I’m a writer and I have a lot of work to do. After all of the people in my area having this app I wanted to see what the buzz was of and I’m not surprised to say I’m disappointed. Just gonna say this- Donald Trump is a white supremacist. If you vote for him again you are a white supremacist.","isEdited":false}},{"id":"6180535799","type":"user-reviews","attributes":{"date":"2020-07-10T10:55:15Z","rating":1,"title":"TERRIBLE app","userName":"w0nd3rpets","review":"when i first got it, it made my phone crash every time i clicked on it. when i could finally open it, it was glitchy and showed horrible content. donald trump=trash. if i could, i would give this app zero stars","isEdited":false}},{"id":"6180535785","type":"user-reviews","attributes":{"date":"2020-07-10T10:55:15Z","rating":1,"title":"My journey to being a bigot","userName":"Lax_bestie31","review":"So today I decided to be politically wrong. And the first step in being politically wrong of course would be to support trump. So I got this app to began my journey of racism, homophobia, and sexism. I then came to the face of my nightmares trump himself I got so scared that I had to jump off the app immediately. Then I decided that I have to no other but MAN up and go back on the app. I landed on many problems throughout the app and it was an overall a terrible experience. And here is where I say honestly being full of hate for everyone but myself, I’m just not equipped for. I hope that more people realize that bigotry is just not for everyone but if you are interested in being a bigot I implore you to get this app.","isEdited":false}},{"id":"6180535415","type":"user-reviews","attributes":{"date":"2020-07-10T10:55:09Z","rating":1,"title":"No💀💀🙈🍊🍊🍊","userName":"hebdjdbsnbshd","review":":)","isEdited":false}},{"id":"6180531619","type":"user-reviews","attributes":{"date":"2020-07-10T10:54:16Z","rating":1,"title":"Shit🥰🖐🏼","userName":"eggplsnd69","review":"This app is verry unprofessional i hate it and dont stand it","isEdited":false}}]}