{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35620","data":[{"id":"6178174225","type":"user-reviews","attributes":{"rating":1,"review":"It took about 30 minutes of waiting just to be asked if we wanted water. The water was green and warm The waiter took my shoes and spat on my child. The food is Moldy and there were raccoons everywhere. I am mortified","userName":"pantato chip","date":"2020-07-09T20:41:59Z","title":"Awful service","isEdited":false}},{"id":"6178172424","type":"user-reviews","attributes":{"rating":1,"review":"I genuinely wanted to see what trumps plans are but I came across a lot of technical difficulties. The app would cause my phone to crash  and sometimes wouldn’t even start up. Terrible don’t download","userName":"Alyssa ✋","date":"2020-07-09T20:41:22Z","title":"Not a Gen Z","isEdited":false}},{"id":"6178170115","type":"user-reviews","attributes":{"rating":1,"review":"I can’t think of one positive thing to say about this app! SO disorganized and SO slow. I got the app hoping to reserve a spot for my presidents rally 🥰✨ but it was just so confusing and difficult. I wouldn’t recommend to ANYONE !!","userName":"goldenghrams","date":"2020-07-09T20:40:33Z","title":"Absolute trash","isEdited":false}},{"id":"6178168619","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded expecting to see how great this country is and it’s really doesn’t have any good source of information for me to vote for our president apparently there is no great source of information","userName":"TYRONEforthetarp420","date":"2020-07-09T20:40:04Z","title":"This app is a waste","isEdited":false}},{"id":"6178153621","type":"user-reviews","attributes":{"rating":1,"review":"i downloaded this app to better educate myself, instead i saw the most horrendous thing ever 🍊!!! i scarred my dogs life by showing him these images and i’m afraid we will never be the same after seeing what we saw! DO NOT DOWNLOAD!!","userName":"Judith_H","date":"2020-07-09T20:34:50Z","title":"teRriBLe!!!!","isEdited":false}},{"id":"6178135049","type":"user-reviews","attributes":{"rating":1,"review":"I thought this app gave you free oranges because there was a big orange on the screen or I think it might of been a guy my badmm no worst app evvver Donald trump2020 on a Gravestone worst app ever legit took weeks to download save TikTok now oh well kill you on auegest 27 watch out orange","userName":"osabellla","date":"2020-07-09T20:28:37Z","title":"Oranges","isEdited":false}},{"id":"6178146039","type":"user-reviews","attributes":{"rating":5,"review":"There’s always two sides of the story. Get over it.","userName":"Breann Knierim","date":"2020-07-09T20:32:18Z","title":"It’s great.","isEdited":false}},{"id":"6178121341","type":"user-reviews","attributes":{"rating":1,"review":"My phone crashed after using this app. I wanted to educate myself on the upcoming election but unfortunately I will have to find another way because I can’t afford the damage to my phone","userName":"chloe.hirst","date":"2020-07-09T20:23:56Z","title":"Unsatisfied","isEdited":false}},{"id":"6178105100","type":"user-reviews","attributes":{"rating":1,"review":"I became severely racist and sexist after getting this app idk why but I think it might be from the government spying on me through this app I also say my body become plump and Orange I’m not sure what I should do now!don’t download this cursed app","userName":"hdhdhehhwh dve","date":"2020-07-09T20:18:34Z","title":"TikTok","isEdited":false}},{"id":"6178098807","type":"user-reviews","attributes":{"rating":1,"review":"This app is absolutely terrible, i immediately began getting pop up ads for a sex-trafficking ring, i started feeling really misogynistic, homophobic, racist, ableist, classist, and worst yet... my skin started turning orange. If i could give this app zero stars i would.","userName":"askfbchenwkdkf","date":"2020-07-09T20:16:29Z","title":"Disgusting","isEdited":false}}]}