{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25190","data":[{"id":"6173331900","type":"user-reviews","attributes":{"review":"I downloaded this app because I thought it was fun but when I was finally able to get onto it Trump tried to take money from me. It wouldn’t let me advance any further without paying a fee for his services. If this is how he treats us then he doesn’t get my vote. Hashtag free the money","title":"Money expulsion","userName":"Dickasauras Rex","rating":1,"date":"2020-07-08T18:47:52Z","isEdited":false}},{"id":"6173312542","type":"user-reviews","attributes":{"review":"This is the worst app I have ever used in my life. Firstly the app took hours to download. Secondly, when I attempted to open the app, it started flashing orange lights at me. It is completely useless, and doesn’t do anything whatsoever. It also uses many slurs instead of addressing me as the name I entered. I am very offended by this. I need a refund.","title":"Worst app ever","userName":"orange>white","rating":1,"date":"2020-07-08T18:41:23Z","isEdited":false}},{"id":"6173297605","type":"user-reviews","attributes":{"review":"this app gave my phone a virus, stole my credit card information and crashes frequently. DO NOT GET THIS APP IF YOU ENJOY HAVING A WORKING CELL PHONE!!! I had to reset my phone TWICE to get this app to delete and had to call my credit card company to shut off my card. very much angry😤 i expected better from Mr. President Trump’s app. I am LIVID!!","title":"down right cruddy poo poo app","userName":"PapaizzleFoshizzle","rating":1,"date":"2020-07-08T18:36:41Z","isEdited":false}},{"id":"6173295334","type":"user-reviews","attributes":{"review":"i downloaded this app with the pure intentions of of registering 75 tickets for the rally 😾 when i downloaded the app it proceeded to tell me i should jump off the grand canyon and whilst holding my cat. this is REVOLTING!!!! this app needs to get shut down IMMEDIATELY. the discrimination my feline and i faced is absolutely UNACCEPTABLE. i am a proud cat owner in this country and i DEMAND this app be shut down.","title":"cat-phobic","userName":"b00tycheeks","rating":1,"date":"2020-07-08T18:35:59Z","isEdited":false}},{"id":"6173284428","type":"user-reviews","attributes":{"review":"This app is really bad it took about two months to download and when it did finally download it had cockroaches coming through my phone and the app made my phone glitch so bad that it when’s into a parallel universe it’s crazy man stay safe and don’t use this app","title":"Bad bad bad bad bad bad bad bad bad bad bad bad","userName":"jskelwlowpw","rating":1,"date":"2020-07-08T18:32:31Z","isEdited":false}},{"id":"6173249904","type":"user-reviews","attributes":{"review":"This app took all of my space from my phone. When I was about to delete it, it started making my phone glitch. I literally had to go to the store to get it fixed all because of this dumb app. Due to this app I will not be supporting Donald Trump.","title":"Almost had to get a new phone!","userName":"Åńóñÿmóūś","rating":1,"date":"2020-07-08T18:21:08Z","isEdited":false}},{"id":"6173249476","type":"user-reviews","attributes":{"review":"It has crashed a few times while I was trying communicate with other supporters via the app. Also, I’d rather not provide all the info this app asks for. Apparently contributions over $200 require you to share copious amounts of personal info. Just use the site.","title":"Glitchy","userName":"Vava Loves You","rating":1,"date":"2020-07-08T18:21:00Z","isEdited":false}},{"id":"6173228921","type":"user-reviews","attributes":{"review":"For one I believe there is ABSOLUTELY no use for this it should be taken off too many glitches I had to power of my phone so many times and also had to delete it so it could work again definitely needs better things HORRIBLE","title":"Terrible","userName":"kdksmdnsjsk","rating":1,"date":"2020-07-08T18:14:11Z","isEdited":false}},{"id":"6173219657","type":"user-reviews","attributes":{"review":"This app took forever to download and when it finally did, my battery drained really quickly. I have the 11 so there should be no battery issues so it is clearly this app. The app kept closing on me. Overall this app is awful and I would rate 0 stars if I could!","title":"Horrible App!","userName":"NOTHING!!!!","rating":1,"date":"2020-07-08T18:11:08Z","isEdited":false}},{"id":"6173212452","type":"user-reviews","attributes":{"review":"It all started when my cat told me they needed reasons to vote TRUMP 2020, so I downloaded this app to get them. Because it used my location this little chubby orange kid cane running to my house and slit my throat😫 he was very rude and didn’t even say sorry😔now I have 420$in debt and won’t be able to pay my rent 😭😫😖","title":"Poor service","userName":"Shreksjuicyass","rating":1,"date":"2020-07-08T18:08:47Z","isEdited":false}}]}