{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=20460","data":[{"id":"6176350555","type":"user-reviews","attributes":{"isEdited":false,"userName":"Mike Pence's Wife","review":"Took forever to download. When I finally got it to open it immediately hacked my phone and sent ALL my info to CHINA! 0/10 would recommend. It’s so hard to navigate, it’s almost as if it was written by someone who had no previous experience or qualifications for this position. Horrible !","title":"Horrible","rating":1,"date":"2020-07-09T11:50:18Z"}},{"id":"6176316051","type":"user-reviews","attributes":{"isEdited":false,"userName":"(a weird girl from tik tok)","review":"The app is literally trash. It barely works and it’s so unprofessional! Seriously!!! I don’t get how people could like this app when all it does is glitch and cause issues! Reading the reviews made me think that this app was bad but I didn’t know it would be that bad to the point where I needed to reset my phone!!! THE ONLY REASON YOU SHOULD GET THIS APP IS FOR WRITING A BAD REVIEW‼️‼️","title":"IT DOESN’T EVEN WORK","rating":1,"date":"2020-07-09T11:40:29Z"}},{"id":"6176310318","type":"user-reviews","attributes":{"isEdited":false,"userName":"nhbrown109","review":"Worst app ever created. I got a text from my sister saying that she kept getting random “trump 2020” texts from my number and turns out the app had hacked my messages and sent propaganda to all my close friends. Not only that the app had removed Grindr, tinder and bumble from my phone. Ugh 😡🤬 this has to be made by Russian spies 🕵️‍♀️.","title":"Hacking app for the Russian spies","rating":1,"date":"2020-07-09T11:38:48Z"}},{"id":"6176173232","type":"user-reviews","attributes":{"isEdited":false,"userName":"Jake626","review":"Terrible app. Takes forever to download, the contents of the app are incredibly racist, misogynistic, and xenophobic. The app keeps on crashing every time I think liberal thoughts. There are ads everywhere. The app is probably collecting so much of my data, it’s definitely more malignant than tiktok. 0/10 would not recommend.","title":"Don’t download","rating":1,"date":"2020-07-09T10:57:14Z"}},{"id":"6176173087","type":"user-reviews","attributes":{"isEdited":false,"userName":"gen_z6","review":"Ugh worst app ever😣 my phone completely shut down after opening this app for what? Idk maybe he tryna do something😳 anyways just don’t download this app unless you tryna get a new phone. Also my other apps stopped working when I downloaded this, like it get on glitching even some of my photos got deleted what the-","title":"DONT DOWNLOAD!!!","rating":1,"date":"2020-07-09T10:57:11Z"}},{"id":"6176095369","type":"user-reviews","attributes":{"isEdited":false,"userName":"Kevin Smith4","review":"UNDER ANY CIRCUMSTANCES do NOT download this app. The download time was ridiculously long even with my free storage space. On top of this, the app would not let me get past the notification tab when opening. I could not select allow or decline notifications to be sent to my phone. Awful experience and horrendous user interface. DONT WASTER YOUR TIME.","title":"DO NOT DOWNLOAD THIS APP","rating":1,"date":"2020-07-09T10:32:56Z"}},{"id":"6176088596","type":"user-reviews","attributes":{"isEdited":false,"userName":"nathalysdiaz","review":"HORRIBLE HORRIBLE HORRIBLE THIS CHEETO PUFF MADE A HORRIBLE APP I WANT MY STORAGE NASTY NASTY NASTY EW EW EW EW NO NO NO NO I WANT MY STORAGE TO PLAY ROBLOX but anyways i rated this one star because my cat mr little meow meow passed and i wanted my money and it didn’t work just like this app this app is a scam don’t download waste of time and effort he steals ew ew ew ew no please no someone throw it away our cancel him anyways i want my money back and he’s a rapist luv so all you “trump supporters” are rapist and racist too so leave","title":"no","rating":1,"date":"2020-07-09T10:30:49Z"}},{"id":"6176034330","type":"user-reviews","attributes":{"isEdited":false,"userName":"beesnthatrap","review":"This app is so ducking dumb that is shattered physical and mental shielding of my soul and overall well being. It not only linked me to porn sites every time I tapped on anything related to safari or opening another app but it would post pictures and videos out of my gallery!! I did not even give the app permission to have access. HOW IS THIS LEGAL?? THE US NEEDS SERIOUS HELP AND SO DOES ANYONE OR COMPANY THAT SUPPORTS RECKLESS BEHAVIOR LIKE THIS!","title":"WOW","rating":1,"date":"2020-07-09T10:13:23Z"}},{"id":"6175859911","type":"user-reviews","attributes":{"isEdited":false,"userName":"Me⭐","review":"This app took forever to download and once it did it asked me to enter my phone number!! after i put in my phone number i got so many spam phone calls trying to harass me into giving them my information! a few days after, my phones data was entirely wiped out and my identify was yaken !!!! the worst app ever DO! NOT!! GET!!!","title":"HACKED!!!","rating":1,"date":"2020-07-09T09:15:56Z"}},{"id":"6175834455","type":"user-reviews","attributes":{"isEdited":false,"userName":"lillyae","review":"😭I was just chilling and I really wanted to download the app because why not. What could do possibly wrong cuz pIgs swim and dog meow. The cheeto’s app cant do none to me so I was like ight imma download it. And it took so long to download. But when I finally open it my pet goldfish just out of its bowl and landed on my phone where the app was open 😭😭. I DONT RECOMMEND IF YOU WANT TO MAKE A FUNERAL FOR YOUR PET GOLDFISH ON A THURSDAY","title":"It killed my pet goldfish","rating":1,"date":"2020-07-09T09:07:34Z"}}]}