{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=32650","data":[{"id":"6177279362","type":"user-reviews","attributes":{"date":"2020-07-09T16:02:53Z","rating":1,"title":"This app made me have a heartattack","review":"Once I open the app I saw a orange yelling at me and telling me to vote for him so that made my heart start to palpitate very fast almost leading me to death I was rushed to the emergency room and immediately treated I am now OK but I would never get this app ever again","userName":"wintesquad","isEdited":false}},{"id":"6177252754","type":"user-reviews","attributes":{"date":"2020-07-09T15:55:06Z","rating":1,"title":"Yeah no","review":"When I open this app it seems to freeze up my entire phone to the point where I have to restart it. There might be some malware here. Be careful using this app it’s very suspicious, none of my other apps do this.","userName":"supremetheya","isEdited":false}},{"id":"6177251599","type":"user-reviews","attributes":{"date":"2020-07-09T15:54:45Z","rating":1,"title":"ANGRY","review":"I am absolutely DEVASTATED at the fact that I have to give 1 star😡. This app deserves way less. I download the app expecting to see great things (since were obviously making america great again) but the first thing i see is a BIG ORANGE CHEETO MAN.. WHEN DID THEY CHANGE THE LOGO???? but do not download this app❤️","userName":"p o w e r l i n e woo","isEdited":false}},{"id":"6177240817","type":"user-reviews","attributes":{"date":"2020-07-09T15:51:39Z","rating":1,"title":"😜","review":"this app is truly terrible. people kept telling me how much this app would make it to the top so i had to try it out, you know? so as i was downloading this app, i heard this noise outside my window in which i looked out. i saw this huge man standing there with his face to my window. i then jumped back and fell into the huge hole in my room. he then took all my bras and destroyed my room. i am writing this stuck in the hole. no one should get this app it is truly a disgrace.","userName":"Kylie256","isEdited":false}},{"id":"6177232936","type":"user-reviews","attributes":{"date":"2020-07-09T15:49:19Z","rating":1,"title":"Flabbergasted in a bad way","review":"I was extremely excited to download this app, but it took about 5 hours for the download to complete. By the time it had finally downloaded, I had already educated myself and became a democrat! Do NOT use this app.","userName":"DannyTheDragon","isEdited":false}},{"id":"6177229399","type":"user-reviews","attributes":{"date":"2020-07-09T15:48:16Z","rating":1,"title":"HORRIBLE APP","review":"I downloaded this app because I wanted to be more informed with what’s going on in the political world. But when I downloaded it, it socked me in the stomach, called me ugly, and told me to kill myself. It also ran over my dog and shot my car window. I will be deleting.","userName":"ellary13","isEdited":false}},{"id":"6177228214","type":"user-reviews","attributes":{"date":"2020-07-09T15:47:57Z","rating":1,"title":"This is just a big no no","review":"I hate the app, completely disorganized. It also changed my wallpaper and sent a virus to my phone to the point where this was the only app I could open. Terrible. Also BLM","userName":"whatspoppinfrom2020","isEdited":false}},{"id":"6177212835","type":"user-reviews","attributes":{"date":"2020-07-09T15:43:32Z","rating":1,"title":"Awful, doesn’t work","review":"This is a horrendous app, I’ve seen much better apps than this. I have created apps that have worked way better than this, I’ve created the best apps in the world so I can say that this app is no good.","userName":"adridoesnotlikethisapp","isEdited":false}},{"id":"6177192106","type":"user-reviews","attributes":{"date":"2020-07-09T15:37:38Z","rating":1,"title":"Worst app ever","review":"This app literally ruined all other apps for me. I have never in my life seen a worse software. My phone kept glitching and just completely crashed multiple times. Do not recommend","userName":"nhlbfyjn","isEdited":false}},{"id":"6177152442","type":"user-reviews","attributes":{"date":"2020-07-09T15:26:27Z","rating":1,"title":"Trying to take away my rights","review":"I opened the app where I was IMMEDIATELY asked for my phone number. Is he some kind of spy 🧐 my body my phone. Trying to take my phone number and sell it to........ China. No thanks. I think I’ll give my number to “sleepy joe” thanks.","userName":"abslacy","isEdited":false}}]}