{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=12570","data":[{"id":"6174089762","type":"user-reviews","attributes":{"title":"Racist 🤡","date":"2020-07-08T23:21:36Z","rating":1,"review":"Bhuesjyes sometimes I don’t want to be happy don’t hold it against me if I’m down just leave me there let me be sad suns up I already wanna lay down friends calling are you really tryna go out don’t wanna get dressed up to pretend I can lie and say im fine mabye you’ll stop calling then I got chips on my shoulder olny got older so I keep it to my self not trying to complain just don’t wanna explain it \n\n                 - go listen to happy it’s a great song and btw we got this gen z","userName":"soso_babyyy","isEdited":false}},{"id":"6174079877","type":"user-reviews","attributes":{"title":"Obama would and could never","date":"2020-07-08T23:18:16Z","rating":1,"review":"This app crashes more than the stock market with him as president. It drains your battery more than Trump drains the federal money to buy underaged girls. It bugs more than how much his policies bugs me and the ratings are worse than his own presidential ratings. No updates on here as well as the lack of updates he has on fixing any political issues and corona. \n\nCould never. And would never download again.","userName":"Arayarat","isEdited":false}},{"id":"6174064705","type":"user-reviews","attributes":{"title":"This app harassed me","date":"2020-07-08T23:12:33Z","rating":1,"review":"So I downloaded the app and after a second of being in the app it told me that it could sense I was Mexican and it would deport me and my family obviously I thought this was a little weird and the app continued to keep sending me threats. I was very scared and traumatized Mind you I have been in this app for barely a second. I am now going to therapy 50 times a week because of this incident and I’m just so disappointed in this app.","userName":"willy wonka's oompa loompa","isEdited":false}},{"id":"6174045093","type":"user-reviews","attributes":{"title":"seemingly innocent app eats children in one bite","date":"2020-07-08T23:05:12Z","rating":1,"review":"truly terrible app :( i opened the app just trying to show my loving devotion to our President Cheeto Puff, when the Cheeto in Chief himself jumped out of the screen and ate my first born son. 10/10 for a good scare but 1/10 because it left a big mess all over my floor to clean up. only download this app if you’re looking for a failsafe way to delete your children from the planet. make sure to put down plastic before opening app.","userName":"Abbymccarroll","isEdited":false}},{"id":"6174037692","type":"user-reviews","attributes":{"title":"⚠️DONT DOWNLOAD⚠️","date":"2020-07-08T23:02:20Z","rating":1,"review":"when i downloaded it, it hacked my phone‼️ all my photos are gone, i cant call or text anyone, and i can’t use any apps‼️the battery dies every 5 minutes and will barely change‼️i had and iphone XR but now i have to get a new one all cause as soon as i downloaded it my phone crashed‼️ ALSO THIS APP IS SUPER RASIST and makes very offensive jokes i just download it to support our president but now i will never vote for him and you shouldn’t either‼️⚠️","userName":"XxWalking_kryptxX","isEdited":false}},{"id":"6173958529","type":"user-reviews","attributes":{"title":"Caution-","date":"2020-07-08T22:32:32Z","rating":1,"review":"This app is very dangerous. I downloaded it an I got a very concerning alert to my cellular saying I have received a virus. The virus has now taken over all of the phones in my household environment an it is very concerning and alerting. This app should be taken down immediately before anyone else suffers from this costly virus. An addition to that issue there were nudes on this app an I was VERY displeased to see those tiny balls an I will never recommend this app to my worst enemy. -Obama 2020","userName":"annabaebae!","isEdited":false}},{"id":"6173933723","type":"user-reviews","attributes":{"title":"CURSED APP","date":"2020-07-08T22:23:13Z","rating":1,"review":"I opened this app and my dog passed out. I didn’t think much of it but then as I put in my number my mom yelled for help. She got stuck in the refrigerator. This app is most likely cursed. I asked my brother to get the app and nothing happened until he went blind in one eye!!! DO NOT GET THIS APP UNLESS YOU WANT TO HAVE THE POSSIBILITY OF DYING!! Plus this dude almost blinded me🟠. My mom did get out of the refrigerator but unfortunately my brother cannot see our of his right eye. Just basically don’t get the app!","userName":"dja fjzcnskg","isEdited":false}},{"id":"6173919737","type":"user-reviews","attributes":{"title":"This app is horrible","date":"2020-07-08T22:18:10Z","rating":1,"review":"The SECOND i opened to app my eyes were blinded by a tangerine looking man standing in front of the flag (which i think is against those flag rules). That was when my phone started to shake uncomfortably and then the pool noodle in the corner of my room began to fly around like a ballon losing air. Not only was this app unhelpful, it has horrible reviews and was set up poorly. I think yall should just remove it. For the safety of pool noodles and our country of course. :)","userName":"lolcreepers","isEdited":false}},{"id":"6173899228","type":"user-reviews","attributes":{"title":"WOW","date":"2020-07-08T22:10:37Z","rating":1,"review":"i’m offended by how much information it is asking me to fill out. are you trying to get all of information to keep tabs on me or something? why would they need my location and my notification permissions??? so they can spy on me. not happening. every picture of the TRUMP was WAY too DETAILED. i could see every pore on his face and it genuinely made me gag to where my daughter was worrying about me. i told her it was just donald and she began to gag with me. truly awful.","userName":"mouthfrost666","isEdited":false}},{"id":"6173887434","type":"user-reviews","attributes":{"title":"This app is MALWARE trying to SELL YOUR INFO TO THE CHINESE!!!!!!! DONT INSTALL!!!!!!!","date":"2020-07-08T22:06:17Z","rating":1,"review":"I downloaded this app to support our supreme leader Donald j Trump and I am disappointed!! As soon as I opened the app my malware detection notified me that it was accessing the rest of my phone!!! I can’t believe what the trump administration is trying to do to get my information! I’m surprised more people don’t know this is a malware that is trying to sell your information to the Chinese government!!!! Protect yourself and don’t download this app!!!!!!","userName":"Stuffs678910","isEdited":false}}]}