{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=128390","data":[{"id":"6176959543","type":"user-reviews","attributes":{"review":"I hate trump. HeтАЩs racist and has done nothing good for America.blm and hispanics on top bbyЁЯЗ▓ЁЯЗ╜ЁЯЗ▓ЁЯЗ╜ЁЯТкЁЯП╜","title":"This app is trash","isEdited":false,"userName":"Hispanics all day bby!","date":"2020-07-09T14:33:45Z","rating":1}},{"id":"6176959473","type":"user-reviews","attributes":{"review":"I had the app downloaded to see upcoming events and buy tickets for me and my daughter Rae Cism. This app is very faulty. My phone kept crashing, and my screen froze several times. The further I looked I kept seeing videos on how Trump would like to have intercourse with his daughter??┬┐ Rae Cism and I do not like this. As a mother I have to leave this review for the safety of my other daughter due on November: Miss Ogynist тЬиЁЯзЪЁЯП╝‍тЩВя╕П","title":"Gross ЁЯе╡","isEdited":false,"userName":"Mremick1289","date":"2020-07-09T14:33:44Z","rating":1}},{"id":"6176958216","type":"user-reviews","attributes":{"review":"So when I first downloaded this app I heard that it was supposed to cure my depression but instead it to me 69 hours to download ЁЯШб. And when it downloaded all I saw was a run down orange. I clicked one of the pictures and it brought me to the deep web. Somebody now has my address and all my info. After that I took 420 second nap. I awoke to my phone ringing. IT WAS THE PERSON FROM THE DEEP WEB. They said that they were holding my family for ransom and that IтАЩll need to give them 69420 dollars, then a group of people with a Donald Trump mask broke into my house and tied me down. They knocked me out for what felt like countless hours. They brought me to a basement and then I saw all my family sitting down, unconscious on what looked like a satanic ritual. Than the people with the Donald Trump face mask came waving their arms around. They then circled the circle and began chanting тАЬBUILD A WALLтАЭ I was scared for my life and then they pulled out their Yu-Gi-Oh Fusion Card. They fused and became the man himself, Donald .J Trump. Donald then proceeded to cut my leg off and that made be go unconscious. I then woke up in my bed thinking it was a dream but for some reason one of my legs was smaller than the other one. I got a text on my phone and it was Donald Trump. The text said that he only gave me half of my family. I then checked up on my family and was horrified. They were all laying down but EACH ONE OF THEIR HALVES ARE MISSInGЁЯШб. I guess it was true he did give me half of them. But I saw that my sisters leg was not there. I suddenly realized that I HAVE MY SISTERS LEG. I was horrified. I then got a text that told me to go in the attic, I went and saw a box. I opened it up and their were adoption papers FOR ME. I read hem and realized that I was given to my parents at the age of three. Than I realized something. If I was adopted ThAT MeANS ThAt I HavE A sTRangers LeG. After that uninstalled the Trump app but it was too late all of the deep web knew my address  and sent hit men and assassins after me. I then jumped out of my window and became a new person. I legally changed my name and then became a better person. And thatтАЩs the story of how I become The amazing Spider Man of today. ЁЯШШ","title":"Disgusting ЁЯдоЁЯдвЁЯжа","isEdited":false,"userName":"Avatar Muhammad","date":"2020-07-09T14:33:24Z","rating":1}},{"id":"6176957987","type":"user-reviews","attributes":{"review":"This is honestly not helpful at all and I donтАЩt see the point. 100000% WOULD NOT recommend.","title":"The worst app IтАЩve ever downloaded","isEdited":false,"userName":"angieeexoxoxooo","date":"2020-07-09T14:33:21Z","rating":1}},{"id":"6176957932","type":"user-reviews","attributes":{"review":"So I was walking my gerbil when BOOM! My phone spontaneously combusted in only one area: the direct location of this god forsaking app! Rumor has it, Mr. Donald Breast Pump is maniacally laughing while rubbing his tiny hands together right now! DonтАЩt let your phone explode and donтАЩt let the caving get you down Sokka!!! -1000000000/10 do not recommendЁЯзЪЁЯП╝ЁЯзЪЁЯП╝‍тЩВя╕ПЁЯзЪЁЯП╝‍тЩАя╕ПЁЯзЪЁЯП╝ЁЯзЪЁЯП╝‍тЩВя╕ПЁЯзЪЁЯП╝ЁЯзЪЁЯП╝‍тЩАя╕ПЁЯзЪЁЯП╝‍тЩВя╕ПЁЯзЪЁЯП╝ЁЯзЪЁЯП╝‍тЩАя╕П","title":"Beans?ЁЯзР","isEdited":false,"userName":"BurgerBunz64","date":"2020-07-09T14:33:20Z","rating":1}},{"id":"6176957023","type":"user-reviews","attributes":{"review":"Shawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nRemember the first time we met\nYou was at the mall with your friends\nI was scared to approach ya\nBut then you came closer\nHopin' you would give me a chance\nWho would have ever knew\nThat we would ever be more than friends\nWe're real worldwide, breakin all the rules\nShe like a song played again and again\nThat girl, like somethin off a poster\nThat girl, is a dime they say\nThat girl, is a gun to my holster\nShe's runnin through my mind all day, ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nSee you been all around the globe\nNot once did you leave my mind\nWe talk on the phone, from night til the morn\nGirl you really change my life\nDoin things I never do\nI'm in the kitchen cookin things she likes\nWe're real worldwide, breakin all the rules\nSomeday I wanna make you my wife\nThat girl, like somethin off a poster\nThat girl, is a dime they say\nThat girl, is the gun to my holster\nShe's runnin through my mind all day, ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nI can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, I can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, na na na na na na na\nNa na na na na na\nShawty got me singin\nNa na na na na na na\nNa na na na na na na\nNow she got me singin\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay","title":"Horrible app","isEdited":false,"userName":"cheetospuffman","date":"2020-07-09T14:33:06Z","rating":1}},{"id":"6176956658","type":"user-reviews","attributes":{"review":"ЁЯЧ┐ЁЯЧ┐ЁЯЧ┐ЁЯЧ┐ЁЯЧ┐ЁЯЧ┐ЁЯЧ┐","title":"BUUUUU IM A CARROT","isEdited":false,"userName":"imacarrot8383838","date":"2020-07-09T14:33:00Z","rating":1}},{"id":"6176955882","type":"user-reviews","attributes":{"review":"I am appalled at this app. I am in no way part of Gen Z trying to get this off of the app store. I think that that is disgusting. BUT!! This app ended up stealing my data AND SELLING IT!!! I tried to log into a different site and it wanted me that my information had been sold, so i looked further into it and THIS APP IS THE REASON!! DO NOT DOWNLOAD!! They will sell your username, password, data etc. !! THIS IS DISGUSTING","title":"Data","isEdited":false,"userName":"Lol pics are awesome","date":"2020-07-09T14:32:48Z","rating":1}},{"id":"6176953781","type":"user-reviews","attributes":{"review":"I hate this app!!! It was so hard to work with! ItтАЩs infuriating and NOT informative !!!! Who would ever be dumb enough to launch this app!!! ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо ЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдоЁЯдо!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","title":"Disgusting","isEdited":false,"userName":"kate helgeson","date":"2020-07-09T14:32:14Z","rating":1}},{"id":"6176952727","type":"user-reviews","attributes":{"review":"I got this app because who doesnтАЩt love annoying orange, but it was NOT what I expected. Immediately after downloading, I was charged $20.20. Also, every morning at 5 oтАЩclock, IтАЩm woken up to the sound of trumps voice SCREECHING country roads. DO NOT GET THIS APP","title":"This app is ~doodoo~","isEdited":false,"userName":"Juliacoach11","date":"2020-07-09T14:31:57Z","rating":1}}]}