{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=43470","data":[{"id":"6174912926","type":"user-reviews","attributes":{"title":"HORRIBLE APP","review":"This app glitches my phone SO badly and I would not recommend this to a friend. I got it to get ACCURATE NEWS since it’s rated number 1 in news, however I was fed false and unauthentic news!","date":"2020-07-09T03:40:28Z","rating":1,"userName":"Kylie Moy","isEdited":false}},{"id":"6174911129","type":"user-reviews","attributes":{"title":"Yikes","review":"This app ended up spamming my phone with “Epstein didn’t kill himself” (?) it almost seems like this app is trying to tell us something ! But I cant believe this app gave me a virus ! I am very disappointed.","date":"2020-07-09T03:39:56Z","rating":1,"userName":"iPhone user @person","isEdited":false}},{"id":"6174907839","type":"user-reviews","attributes":{"title":"Waste of time to download","review":"I can’t believe it!! After using this app my phone shut down for 5 hours it’s such a disappointment I’m just shocked and so confused!","date":"2020-07-09T03:38:57Z","rating":1,"userName":"Mother of three!","isEdited":false}},{"id":"6174900858","type":"user-reviews","attributes":{"title":"Worst App!","review":"This app has made my phone glitch ever since I downloaded and makes everything go slow. Do not recommend for anyone!","date":"2020-07-09T03:36:53Z","rating":1,"userName":"ILoveFoodTooMuch3567","isEdited":false}},{"id":"6174898260","type":"user-reviews","attributes":{"title":"Horrible","review":"This is the worst app on the app store. Scammed me out of money and now I’m getting nonstop random calls after putting my phone number in. App needs to be removed.","date":"2020-07-09T03:36:07Z","rating":1,"userName":"GrilledCheeseMama","isEdited":false}},{"id":"6174882721","type":"user-reviews","attributes":{"title":"I HATE THIS APP SO MUCH","review":"Okay sooo if y’all came from tik tok go ahead and drop a like, trumps a racist and is a lil baby for trying to get rid of tik tok cuz we foiled his plans. Well sir you shouldn’t have messed wit us cuz now you got another thing coming. LMFAOAOAOA beat that “president”","date":"2020-07-09T03:31:35Z","rating":1,"userName":"Tvghjajjdhrhdhehwh sorry","isEdited":false}},{"id":"6174870555","type":"user-reviews","attributes":{"title":"Very Disturbing","review":"I downloaded the app to support the ‘best president’ of America. Once I started the app it sent me to a link of pornography. My infant child was sitting next to me and she is traumatized. So am I. I don’t recommend downloading.","date":"2020-07-09T03:28:04Z","rating":1,"userName":"Bunquisha","isEdited":false}},{"id":"6174866019","type":"user-reviews","attributes":{"title":"trump can die 🤩","review":"the second I opened the app it sensed that I was black and threatened to shoot me even though I was unarmed. and I KNOW my president just ADORES his african American people as well as his Hispanics so I don’t really know what happened there😕","date":"2020-07-09T03:26:44Z","rating":1,"userName":"trump 2020 in his grave😍","isEdited":false}},{"id":"6174863423","type":"user-reviews","attributes":{"title":"Worst app ever!","review":"I opened the app and my dog was gone. Also you know the Cheeto.. yeah.. that showed up. It took my fridge, and my pet dinosaur!! It even TOOK my phone away from me! AND THE MOST UNFORGIVABLE THING IS THAT! ONCE I OPEND THE APP I WAS BILND! I couldn’t see anymore! A big and VERY bright orange thing popped up!","date":"2020-07-09T03:25:58Z","rating":1,"userName":"die trump💗🥰","isEdited":false}},{"id":"6174861342","type":"user-reviews","attributes":{"title":"Horrible !","review":"It is not up-to-date. It is truly all the way horrible plus, the app is legit rubbish like I can make a better app in one minute it’s horrible do not install it it is a bad","date":"2020-07-09T03:25:23Z","rating":1,"userName":"Cnnnnnd dhrhvfnf","isEdited":false}}]}