{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38340","data":[{"id":"6177210350","type":"user-reviews","attributes":{"date":"2020-07-09T15:42:48Z","review":"This app is the worst thing I have ever used as soon as I opened the app I was given Covid-19. which then made all of the fish that I have just die due to the fact that I now need to have fish funeral I hate this app!","isEdited":false,"userName":"dead fish due to app","rating":1,"title":"Horrible"}},{"id":"6177207183","type":"user-reviews","attributes":{"date":"2020-07-09T15:41:55Z","review":"yeah. perfect time. the country is right in the middle of a global pandemic. you’ve made this very easy for me. this president is absolutely unfit for this job. this app is inaccurate, dishonest and in a word... absolutely DONG WATER. good luck Trump with your impossible dream of being reelected😘🥰","isEdited":false,"userName":"Not Q-Zero","rating":1,"title":"revenge for tik tok"}},{"id":"6177205269","type":"user-reviews","attributes":{"date":"2020-07-09T15:41:21Z","review":"App is terrible. Doesn’t load pictures of Edward Cullen like I was told . but all I kept in seeing was what the annoying orange would look like if he was a person. Never again!","isEdited":false,"userName":"Adriana100395","rating":1,"title":":("}},{"id":"6177204759","type":"user-reviews","attributes":{"date":"2020-07-09T15:41:13Z","review":"The app is truly horrid and the app kept crashing I don’t see how anyone would want to be caught having this app on their phone. If I could give it zero out of five stars I would.","isEdited":false,"userName":"Vinniewars","rating":1,"title":"Don’t download"}},{"id":"6177203237","type":"user-reviews","attributes":{"date":"2020-07-09T15:40:47Z","review":"I notice that upon opening the app it says “keep America great.” I just want to know if we’re living in the same America because the one I know is racist and misogynistic but that’s probably just because it’s ran by racists and sexists.","isEdited":false,"userName":"Editing Cray","rating":1,"title":"The WORST App"}},{"id":"6177202400","type":"user-reviews","attributes":{"date":"2020-07-09T15:40:33Z","review":"This app scared the ever-loving hell out of my children. When it downloaded the voice of this cheeto himself overpowered my speakers and flooded my eardrums with horrid vulgar things. My kids have been hiding under the bed for a week and a half now. ONE STAR","isEdited":false,"userName":"enraged mother","rating":1,"title":"Help me"}},{"id":"6177192807","type":"user-reviews","attributes":{"date":"2020-07-09T15:37:50Z","review":"No matter what I do in the app, all it does is crash and close all of my other apps. it keeps screaming \"TRUMP 2020\" in my face, and i can't handle the stress. someone get this app out of here, and don't download!!!","isEdited":false,"userName":"erin--mmm","rating":1,"title":"this app is horrible"}},{"id":"6177186155","type":"user-reviews","attributes":{"date":"2020-07-09T15:35:56Z","review":"i downloaded with high high hopes and it did not fulfill my needs. it took 2 weeks to download and then it wouldn’t let me open the app! then my phone started mysteriously turning off and it wouldn’t turn back on. i’m very disappointed right now. also why does trump need an app?? like no one really likes him anyways why does he think an app will help? hmm i wonder. xoxo black live matter","isEdited":false,"userName":"jazz0818","rating":1,"title":"don’t do it sis"}},{"id":"6177183705","type":"user-reviews","attributes":{"date":"2020-07-09T15:35:16Z","review":"Honestly this app was not useful at all. It was so hard to use and navigate. I couldn’t find any information about the his campaign easily. It was not a good design.","isEdited":false,"userName":"Megaperson2536","rating":1,"title":"Hard to navigate"}},{"id":"6177158930","type":"user-reviews","attributes":{"date":"2020-07-09T15:28:16Z","review":"this is the worst app ever i can’t believe how bad it is i legit had to bleach my easy and drink clorox after this! this definitely deserves a one start rating and should DEFINITELY be taken off the app store 🧚✨.  trump is terrible. take this app down. BLM. PERIODT","isEdited":false,"userName":"lilsnootyblm","rating":1,"title":"worst app EVER 🙈"}}]}