{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=9610","data":[{"id":"6173524231","type":"user-reviews","attributes":{"userName":"jessixa nguyen","title":"ABSOLUTELY HATE","isEdited":false,"date":"2020-07-08T19:54:24Z","rating":1,"review":"this app took way to long to load and a waste of storage! DRAINED ALL OF MY BATTERY HAD TO CHARGE 4 TIMES!! anyways 10/10 would no recommend the app made my phone caught on fire and the fire burnt down the rats den, now the rats are living in my room but i think the rats fought the cockroaches . and then the cockroaches brought in oranges for backup now my room is a war zoom because of this app ! my mom is mad that I downloaded this app because it caused so much trouble so she’s making me walk my bed sheet."}},{"id":"6173515685","type":"user-reviews","attributes":{"userName":"Jonnyrockers008","title":"This is a bad app! :(","isEdited":false,"date":"2020-07-08T19:51:21Z","rating":1,"review":"This is very bad app, I just wanted to meet trump but they sent Alec Baldwin to my house instead? I asked him politely to leave but he hasn’t and is still here now. He’s started taking notes over everything I do and making calls to people when I’m not watching, this must be a ploy by the deep state! Fellow Qanons do not download this app! It’s the Obama’s way of continuing to spy on you! If you truly want to support trump don’t vote! It’s all a trick by the deep state! Just stay home and pray!!! #WWG1WGA #KAGA"}},{"id":"6173496036","type":"user-reviews","attributes":{"userName":"kweenkaren1976","title":"Disappointed","isEdited":false,"date":"2020-07-08T19:44:41Z","rating":1,"review":"As an avid trump supporter, I have never been so let down. I had such high hopes for this app and was so excited to get it, but after I downloaded it, it started to glitch out every time I opened it! And not only that, it would also eat up my phones battery!! Terrible, horrible app that I wish I had never downloaded! Trump administration- you should be ashamed of yourself! I might just have to give my vote over to Biden due to this monstrosity!"}},{"id":"6173494824","type":"user-reviews","attributes":{"userName":"babybunni420","title":"Delete this app it actually so bad","isEdited":false,"date":"2020-07-08T19:44:18Z","rating":1,"review":"This is the wort app ever this should have never been made when I got on I saw a big clown on there and I have a fear of clowns so they should have put a warning before because I literally almost died. And this a month to download and takes up all my internet I hate it. Every time I open the app it play ear bleeding music my ear won’t stop bleeding I hate it. Once I got on the app I would let me exit i had to get a new phone. OVER ALL WORT APP EVER THIS SOULD HAVE NEVER EXISTED DELET THIS ITS SO BAD"}},{"id":"6173493773","type":"user-reviews","attributes":{"userName":"gabby.3h","title":"DO NOT DOWNLOAD !!","isEdited":false,"date":"2020-07-08T19:43:57Z","rating":1,"review":"this app is a scam !!!!!! FIRSTLY , why did this app take 2 weeks to download ??? secondly , why when i put in my phone number i get a text asking for money & the app starts glitching a lot ?? i started getting random phone calls & my phone just about crashed from too much going on . so i try & delete the app & it wouldn't delete the first time so i try again & it deletes . idk whats going on but i highly believe this app is a SCAM . thank you for your time ."}},{"id":"6173459375","type":"user-reviews","attributes":{"userName":"xxxtenntacless","title":"This is the worst app","isEdited":false,"date":"2020-07-08T19:32:02Z","rating":1,"review":"At first I thought this app was gonna be a good working app but it turned out to be trash it’s supper slow there is adds every 3 seconds and it kept on logging me out for no reason it also took me out of the app randomly. My phone said that 12 viruses were found after downloading the app the app itself is super slow and it has inappropriate content I don’t recommend you get this app it should be taken down ."}},{"id":"6173434969","type":"user-reviews","attributes":{"userName":"aziza💕","title":"no ❤️","isEdited":false,"date":"2020-07-08T19:23:48Z","rating":1,"review":"this app is the worst! i’m deaf so i couldn’t read the apps name and when i downloaded my spider sense was tingling. my spider sense isn’t even sensitive but the app reeks of rasict, xenophobic,white supremacy and all the things that is keeping America a mess. when i started using the app i got a long message from the Cheeto puff (if yk yk) saying i’m getting kicked out of the app for “suspicious activity”. at first i was confused then i remembered i’m a black muslim woman. i really don’t recommend getting this app 🤢"}},{"id":"6173424594","type":"user-reviews","attributes":{"userName":"chkcyluspfitsyiofouditsyeIocou","title":"worst app to ever exist","isEdited":false,"date":"2020-07-08T19:20:22Z","rating":1,"review":"this app took at least 4 hours to download and my phone crashed every 5 minutes bc it can’t handle the idiot president app downloading on my phone therefore breaking my phone like he’s breaking this country. and as it was downloading it played awful music drawing all kinds of nasty bugs and creatures. a hole even burned in my floor filled with orange cheetos leaving stains all over my floor. i would not recommend this app to ANYONE and should be removed immediately."}},{"id":"6173341085","type":"user-reviews","attributes":{"userName":"my thoughs on this","title":"ITS TERRIBLE","isEdited":false,"date":"2020-07-08T18:51:06Z","rating":1,"review":"I tried getting it to see how it works and such for learning purposes and it took 3 hours to download and when it was I couldn’t even go on my phone it crashed and shut off every time I tried when it finally downloaded I tried getting on the app but it crashed and i have pretty good WiFi so it’s the app next thing I know I get an alert that I have 65 viruses and I’m pretty sure it was cuz of the up my phone was fine before this app WORSE APP EVER"}},{"id":"6173338212","type":"user-reviews","attributes":{"userName":"88383929","title":"0 STARS","isEdited":false,"date":"2020-07-08T18:50:05Z","rating":1,"review":"The app was finally until a few minutes in on me using. It was making my phone glitch really bad. I know it’s from the app because i have a new phone and my phone only starting to glitch when i download this app. This is really frustrating and it caused me to delete the app. I usually don’t write bad reviews but I don’t want anyone else having the same glitching problem at me. If you know what’s best for you, you won’t get the app.🙄😠"}}]}