{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=5640","data":[{"id":"6177056101","type":"user-reviews","attributes":{"date":"2020-07-09T14:59:51Z","rating":1,"title":"settleforbiden2020","review":"It was actually really horrible, it scared my dogs and cats. I do not recommend. also, how can you support him ? His son don’t like him, his wife won’t hold his hand, his owl daughter filed sexual harassment forms, he’s racist, spent more time and money golfing then caring abt the pandemic. he said we should be injected with BLEACH. are you trying to kill us ? and then Kanye is running bc he’s gonna probably get votes, but he’s a trump supporter. It’s like voting for him. DONALD SAID A GLOBAL PANDEMIC ISNT REAL, I DONT WANT A GUY WITH THE IQ OF A CARROT RUNNING OUR COUNTRY, THEN HE TALES CREDIT FOR OUR ECONOMY THAT HE GOT FROM OBAMA? This walking rat needs to stop, maybe even breathing. he’s lived long enough :)","userName":"Lucy :))))","isEdited":false}},{"id":"6177051687","type":"user-reviews","attributes":{"date":"2020-07-09T14:58:38Z","rating":1,"title":"terrible app","review":"I got this app to stay updated on President Trump’s campaign and messages, but the app kept crashing! After download, I opened it and it allowed me in for only a few seconds before crashing. I was confused, restarted my phone, and waiting a few minutes before trying again. Same thing. I even redownloaded the app, I’m not one to give up, and IT STILL KEPT CRASHING!!! I am updated on my IOS, and my phones almost brand new!! No reason this should be happening! If you can’t make an app work, how do you expect to do another 4 years of presidency?","userName":"Dontlickmymeme","isEdited":false}},{"id":"6177020531","type":"user-reviews","attributes":{"date":"2020-07-09T14:50:11Z","rating":1,"title":"I’m scared","review":"After about four months of waiting for what I thought would be my new favorite app, I was thoroughly disappointed with the result. When asked if I would like to receive notifications, I accepted because I wanted to be as up to date with what was going on in my favorite presidents campaign as possible.    Unfortunately, every time I received an alert and orange would appear somewhere in my house. Soon me and my family were drowning in oranges. For this reason I am leaving a one star review, but only because I couldn’t leave one that is lower.","userName":"graceigagnon😘","isEdited":false}},{"id":"6176980506","type":"user-reviews","attributes":{"date":"2020-07-09T14:39:24Z","rating":1,"title":"TikTok","review":"We are going to keep the TikTok app because there are too many reasons to not get rid of it. We have kept Facebook on the App Store even though it has had several serious privacy concerns over the years. Secondly TikTok’s CEO is an American and all of the U.S. app user’s information is stored on U.S. soil. Lastly TikTok has stated that they will not give away any information even if it is requested. The reason TikTok has been banned in other places is because of political battles such as borders. So there is no reason that a fun, enjoyable, friendly app should be removed from the App Store.","userName":"Kaitlyn_rh","isEdited":false}},{"id":"6176939607","type":"user-reviews","attributes":{"date":"2020-07-09T14:28:28Z","rating":1,"title":"Hmmmm","review":"The FitnessGram Pacer Test is a multistage aerobic capacity test that progressively gets more difficult as it continues. The 20 meter pacer test will begin in 30 seconds. Line up at the start. The running speed starts slowly but gets faster each minute after you hear this signal bodeboop. A sing lap should be completed every time you hear this sound. ding Remember to run in a straight line and run as long as possible. The second time you fail to complete a lap before the sound, your test is over. The test will begin on the word start. On your mark. Get ready!… Start.","userName":"mis wiwis","isEdited":false}},{"id":"6176872415","type":"user-reviews","attributes":{"date":"2020-07-09T14:10:53Z","rating":1,"title":"disgusting","review":"DONT DOWNLOAD THIS APP\ni did not expect to see such propaganda on a daily basis. it seems a Lorax looking man is photographed in several places except he is very rude and sexist, the things he says has no consideration for others, and it seems as though he is trying to destroy our country just to get votes. I am concerned. On top of this the app is constantly spamming us. Lastly it is constantly glitching! It needs to be taken off the App Store for all of the problems it’s caused! One glitch was opening my phone to trump screaming! He yelled false insults and tried to deny sexual assault allegations. It was terrifying.","userName":"927291937","isEdited":false}},{"id":"6176864161","type":"user-reviews","attributes":{"date":"2020-07-09T14:08:45Z","rating":1,"title":"11/10 do NOT recommend","review":"I have to admit, I had high hopes for this app. Unfortunately the minute I downloaded and opened it, I was presented with an egotistical, sexist, homophobic, racist orange creature asking for my phone number. Of course I am flattered, 🥰🤚🏼but I have no choice but to refuse this request. I simply do not give my number to pouty oompa loompas🤷🏼‍♀️also, my phone is now traumatIZED and will probably never recover from what I have put it through. might have to just throw the whole thing away and get a new one💖💅🏼✨🧚🏼‍♀️whatever you do, restrain yourself from downloading this horrible app.","userName":"Sylvie_14","isEdited":false}},{"id":"6176686479","type":"user-reviews","attributes":{"date":"2020-07-09T13:21:54Z","rating":1,"title":"How is this allowed?","review":"I have a few minor complaints about this app; first of this took almost a full week to download a very tedious process, once the app finally finished downloading I opened it and my phone screen completely froze of the loading page, my phone wasn’t allowing me to hit the home button, power button or force power off my phone, after a couple minutes of being frozen I get a notification from the app “Thankyou” when I closed the notification the app crashed and won’t open again. ARE YALL REALLY HERE FOR A DATA GRAB????","userName":"eviltwin👥","isEdited":false}},{"id":"6176543513","type":"user-reviews","attributes":{"date":"2020-07-09T12:43:31Z","rating":1,"title":"Horribly Long Download Time 🤢","review":"So first thing, this app took 4 days, 20 hours and 69 minutes to download! Like what?!? When it did finally install, I opened it up and immediately lost all of my rights! I mean ALL of them! I can’t vote, get an education, have a job! I don’t even have access to healthcare now! All because of this app 🙄 I really wish I could give it a 0 star rating, but 1 will have to do! I do like the colors on the apps face! It reminds me of the beautiful paint that native Americans use in their culture, especially before the US was colonized and stole all of their land. ☺️","userName":"Janice beane","isEdited":false}},{"id":"6175909836","type":"user-reviews","attributes":{"date":"2020-07-09T09:32:40Z","rating":1,"title":".?!","review":"this app is so BAD. it tried geting me to turn on my privacy and trying to see where i live! I will not have an app like this. And i didnt put the location or privacy settings on but this app TURNED IT ON😓I said no and i still say no to a violation like this. So disrespectful and an invasion of my privacy. Im so glad i wont have kids with a person because i wouldnt want a dude just like trump to try and do sexual things with my daughter. It is  seriously SO disturbing. And this app made my phone freeze 5 times already and i have onlt been on it for ten minutes! i do not recommend.","userName":"BRUHUNDER3ETTERS","isEdited":false}}]}