{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=13770","data":[{"id":"6178651243","type":"user-reviews","attributes":{"userName":"Evey Johnson","date":"2020-07-09T23:43:42Z","isEdited":false,"rating":1,"title":"this app is bad🙄","review":"i love trump he is amazing and i love him and he is so hot and i just really want him to make america great again ugh. so i downloaded this app and to start off it took 5000 years to download!!! :( and when it did download it broke my phone i could barely use it for a month!! and it stole all my personal information!! DO NOT DOWNLOAD THIS APP. it is extremely dangerous and will harm your phone extremely bad DELETE IT IF YOU DOWNLOADED IT. Trump 2020"}},{"id":"6178633556","type":"user-reviews","attributes":{"userName":"steve bucemi's granddaughter","date":"2020-07-09T23:36:51Z","isEdited":false,"rating":1,"title":"i hate this app 😡😡","review":"immediately when i downloaded it i pooped my pants. NOT COOL. also when i opened the app all of the pictures with people in my phone replaced their faces with steve bucemi’s. although i am a huge fan of his, it replaced the face of my grandpa (may his soul rest in peace) in the only picture i have left of his. the color of my aura also changed from blue to brown after downloading. would not recommend."}},{"id":"6178603660","type":"user-reviews","attributes":{"userName":"Wwwwwwww5","date":"2020-07-09T23:25:07Z","isEdited":false,"rating":1,"title":"So Sad","review":"I was so looking forward to this app to get the latest news from our favorite Cheeto man but it’s very poorly designed. It took 5 weeks to download and I’ve gone through 3 phones. It keeps breaking them but I had such high hopes that I kept buying new phones just to see what all the fuss was about. I obviously love the Don just like the rest of you fellow conservative Americans but this is unacceptable."}},{"id":"6178581066","type":"user-reviews","attributes":{"userName":"Mjspencer345788$)4$$;4","date":"2020-07-09T23:16:07Z","isEdited":false,"rating":1,"title":"NEVER AGAIN","review":"Oh Lordy I cannot explain how absolutely terrible this app is. LET ME SPEAK TO THE MANAGER!!! WHOS RUNS THIS?!1! I do NOT appreciate the CONTSTANT texts and truly the design is HORRIBLE!! This was the man I wanted to vote for but if he can’t even make sure this app runs right, how do we expect him to run this country!! Why am I getting over 10 notifications a day??? I’m pretty sure it’s stealing my information. Bad bad bad. My grandchildren think the same thing. Boo on you guys !!"}},{"id":"6178543654","type":"user-reviews","attributes":{"userName":"trumpsdoodoo","date":"2020-07-09T23:01:29Z","isEdited":false,"rating":1,"title":"Just don’t 🤢🤢🤢🤮","review":"This app is not good it said it would take 2 min to download it took 2 DAYS..... it also takes all your personal info which is horrible I thought this would be a professional app coming from TrUmP himself but I was wrong so overall I would literally die over downloading this when I opened the app it was saying racist crap and I got offended which is so gross coming from this amazing 😉 app"}},{"id":"6178509775","type":"user-reviews","attributes":{"userName":"Country lover 89","date":"2020-07-09T22:48:05Z","isEdited":false,"rating":1,"title":"Way to slow!!!","review":"The app took almost an entire day to download. It also takes up a ridiculous amount of space. The app also is constantly running in the background to track you. Once opened nothing would load due to the gps overload. This app is dangerous and lets anyone know your location with just a few passwords. Stay clear of this app for sure."}},{"id":"6178500895","type":"user-reviews","attributes":{"userName":"mississippimudrider","date":"2020-07-09T22:44:27Z","isEdited":false,"rating":1,"title":"APP CAUSED MY PHONE TO BREAK","review":"before downloading this app my phone was functioning normally but after about an hour (with minimal usage beyond putting in my phone number) it started lagging and glitching. It will also occasionally freeze on the opening page of the app and then not allow me to close it or turn my screen off until I force my phone to shut down. please remove this."}},{"id":"6178439288","type":"user-reviews","attributes":{"userName":"JackSkelling","date":"2020-07-09T22:20:17Z","isEdited":false,"rating":1,"title":"Awful President, Awful App","review":"This App is horrible, having been created for the worst president...ever, it’s not surprising. This so called leader downplayed the COVID-19 pandemic, costing hundreds of thousands their lives and millions their livelihoods. He then created NATIONAL DISSONANCE by acting like local governments were wrong for protecting their people through shutdowns, all the while doing NOTHING TO HELP THE AMERICAN PEOPLE. He then made an absolute mockery of peaceful protesting and ordered innocent people attacked!! This App is as corrupt as the man, himself."}},{"id":"6178383883","type":"user-reviews","attributes":{"userName":"olivia hates trump","date":"2020-07-09T21:58:51Z","isEdited":false,"rating":1,"title":"0 stars!! So horrible!😡","review":"Once I downloaded this app immediately started to ask me these inappropriate questions and it had inappropriate content like trump 2020. The questions were about my information that I’ve never even put in the app so apparently it took the information on my phone and it’s now on the Internet and all my pictures are on the dark web!! Do not trust this app!!!!🤬"}},{"id":"6178366214","type":"user-reviews","attributes":{"userName":"wheeze febreeze","date":"2020-07-09T21:52:01Z","isEdited":false,"rating":1,"title":"it’s making me see things 🧿👄🧿","review":"This app is extremely slow and it makes my phone crash the time it takes to wait and let it load is my whole day down the trash. I just wanted to see his orange face in a political photo album they had but I got so scared I started having nightmares. dead🍑 so I’ve been hallucinating awake and in my sleep and now my mother thinks I’m crazy to come visit me at my new psych ward"}}]}