{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=17630","data":[{"id":"6064695524","type":"user-reviews","attributes":{"title":"disappointed in my king","review":"I love my president with all my heart and I wanted to download this app to see what he was up to, but every time I opened the app a picture of his shrimp d!ck would appear on the screen! the first time I opened it my three kids were sitting with me! this app is a big disappointment and I am so let down by my king. I still luv you mr president 🥰 you traumatized my kids tho.","date":"2020-06-11T22:57:12Z","rating":1,"isEdited":false,"userName":"nickibenja"}},{"id":"6057556500","type":"user-reviews","attributes":{"title":"Too patriotic","review":"I downloaded this app thinking I could participate in US politics and teach my children about the current climate. Boy was I disappointed. I opened the app to find it was only supportive of a giant Cheeto. While this may be representative of most Americans at the moment (Cheetos are a great snack when you get the munchies), I do not want a Cheeto for president. Take down this app. Being humans back to the White House.","date":"2020-06-10T05:52:11Z","rating":1,"isEdited":false,"userName":"Fish Reed"}},{"id":"6048321565","type":"user-reviews","attributes":{"title":"READ BEFORE DOWNLOADING ‼️","review":"Ok so to start, as soon as I the downloaded the app my cat was brutally murdered by a trump supporter. The trump supporter then continued to harass me and my family. A couple of hours after we got him to leave my grandmother had a heart attack, turns out that the app sends out special radio active waves that effects only old people. This app is a sham and was designed to harm those around you. BEWARE.","date":"2020-06-07T21:27:59Z","rating":1,"isEdited":false,"userName":"Lolboidatboilolhlohilol"}},{"id":"6179137839","type":"user-reviews","attributes":{"title":"Very bad!","review":"Unfortunately I made the mistake of downloading this app onto my cell phone. As soon as it finished download my phone began to smell terribly. I didn’t even know it was possible but the smell of trash was so potent I had to uninstall the app. I also became fatigued because I saw D*nald Tr*mps face which then triggered an epileptic seizure. This app is very unsafe and should be taken off the App Store immediately","date":"2020-07-10T02:45:59Z","rating":1,"isEdited":false,"userName":"bidenmy"}},{"id":"5949645697","type":"user-reviews","attributes":{"title":"Robocalls, no thank you!","review":"As a Trump supporter, I was very exited to use this app. However, you can’t even start the app unless you give your phone number and agree to automated robocalls and texts from both TMAGAC and the RNC. That’s a dealbreaker for me. I am a long-time donor but don’t want any more calls and texts than I’m already getting.","date":"2020-05-15T18:03:06Z","rating":2,"isEdited":false,"userName":"Doc-911"}},{"id":"5883362546","type":"user-reviews","attributes":{"title":"App well designed","review":"I am impressed as a developer at the user friendly design.  Lots of content. Disappointed to see Trump haters sending negative reviews.","date":"2020-04-30T10:43:29Z","rating":5,"isEdited":false,"userName":"A-C-T-S"}},{"id":"5856413172","type":"user-reviews","attributes":{"title":"MAGA- A great app!","review":"Very well put together app. Neverrr seen a political app this nice and if more to come still be hard to top. Easy to use and everything at fingertips and very smart and good info","date":"2020-04-24T08:11:54Z","rating":5,"isEdited":false,"userName":"Golgollff"}},{"id":"5854599410","type":"user-reviews","attributes":{"title":"Helpful app","review":"The news in the app ad well as the list of upcoming events is helpful. Only thing I’d change would be for more ways to get points. Maybe from donating or attending online rallies?","date":"2020-04-23T22:17:14Z","rating":4,"isEdited":false,"userName":"TheTheJay31"}},{"id":"6178936022","type":"user-reviews","attributes":{"title":"This app broke my phone","review":"I downloaded this app for my beloved president and in doing so, I went to click on the app and my phone exploded, disintegrating right my hand. I am typing this review on my laptop right now with my one hand. Very disappointed in whoever designed this app. Now the Trump administration owes me a prosthetic hand and a new phone. Would give zero stars if I could!","date":"2020-07-10T01:32:06Z","rating":1,"isEdited":false,"userName":"gabe.u"}},{"id":"6179019388","type":"user-reviews","attributes":{"title":"Do not trust the other reviews","review":"This app is an amazing app to track and support Trumps campaign, the one stars and bad reviews are only from a bunch of liberals trying to get it removed.  TRUMP 2020!","date":"2020-07-10T02:02:27Z","rating":5,"isEdited":false,"userName":"Tony_Minton"}}]}