{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29920","data":[{"id":"6176860722","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Poor quality","date":"2020-07-09T14:07:49Z","userName":"Pandorer","review":"This app is constantly crashing and at this point is pretty useless to have. Takes more work to keep trying to get on it then to just look up my favorite news outlet, CNN 🥰"}},{"id":"6176845146","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"crashed my phone","date":"2020-07-09T14:03:43Z","userName":"gentlecourderoy","review":"I downloaded the app to do some research on his campaign and it made my phone freak out and closed all my apps. ever since I downloaded it my inbox is FLOODED with campaign emails and a lot of my apps keep closing on me without permission. don’t download this app"}},{"id":"6176817288","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"TERRIBLE","date":"2020-07-09T13:56:24Z","userName":"GummyBearAJPW","review":"This app is the worst one possible. I mean it’s very ✨l a g g y ✨ and it has no point! Donald trump u need to step up you’re game! LITERALLY. My cousin was about to play this and she was very ✨d i s s a p o i n t e d✨ about the terrible ✨q u a l i t y✨ in this application. People shouldn’t be allowed to download this and get away with it. I rate it ONE STAR."}},{"id":"6176764536","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"DONT DOWNLOAD","date":"2020-07-09T13:42:24Z","userName":"williluc002","review":"Worst app I’ve ever downloaded. It wiped all of my data from my phone and it took an entire week to download. Every time I try to open it, I just get a white screen. Absolutely awful and frustrating. I would give it 0 stars if I could."}},{"id":"6176730788","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"About as helpful as the man himself","date":"2020-07-09T13:33:34Z","userName":"Cassie 🤩","review":"This app is horrible. I’m a woman, and it has told me multiple times how I deserve to make less than my male colleagues and how I should focus on getting a husband 😖😖. 0/10 would not recommend also please vote but not for this 🤡"}},{"id":"6176713173","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"GARBAGE 🤢😡😤","date":"2020-07-09T13:28:57Z","userName":"lexirose01","review":"This app is absolutely ridiculous. It caused my phone to glitch and start shutting down on its own. It only works when I hold it upside down now so I look ridiculous when I’m at work and customers come up to me while I’m using my phone.😡😡😡"}},{"id":"6176675530","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"I HATE IT","date":"2020-07-09T13:19:01Z","userName":"xhfnf","review":"I downloaded it, it took to long to download and I opened it and it was just talking about trump and I hate this app this should be deleted off of everything I want this down I will uninstall this I will tell everyone this app to rate this 1 star rating"}},{"id":"6176647131","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Do not download","date":"2020-07-09T13:11:32Z","userName":"Jenny 🧚✨🌸","review":"After I downloaded this app my entire phone froze. At first I thought it was just the wifi but then I realized that this app bugged my phone. I am incredibly disappointed with how this app has treated me and I feel incredibly disrespected."}},{"id":"6176645673","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"STOLE MY DATA","date":"2020-07-09T13:11:09Z","userName":"sujsjdjdiei","review":"I downloaded the app just for it to give me a virus on the first time i opened it! to top it all off i started getting messages with the administration saying ‘Trump is a racist.’ I then find out that my credit card information has been stolen and they bough 27 dildos."}},{"id":"6176630202","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Horrible everything","date":"2020-07-09T13:07:04Z","userName":"Ljpickles","review":"It took five days to download it lagged my battery went from 100 to 0 real quick the images where blurry it took 23 hours to load in and in general just a very bad app."}}]}