{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=2580","data":[{"id":"6176097259","type":"user-reviews","attributes":{"userName":"sociendhuskxxjsckste","isEdited":false,"title":"😭","review":"It’s is trash I’m throwing up it’s so dumb and so racist to ever be texteing a rockstar person makes me feel weird and I have never again never download 🤮🤮and I got hacked and someone came to my door and almost took away my rights as a colored women gross nasty 🤢 and then the reviews made it worse!!!! I hate this app someone should have taken it down already that’s trash 🗑 if I ever see anybody download the app I’ll have to worn them especially girls cuz they can get their right taken away WARNING TO ALL GIRLS don’t download this trash app cuz all you’ll do is make our lives worse and we are making the fat Cheeto puff think he can get the best of us and think only men should be president since Queen Elizabeth can legally have him harmed u suggest he shut up wit his Cheeto puff lookin self","date":"2020-07-09T10:33:34Z","rating":1}},{"id":"6175910730","type":"user-reviews","attributes":{"userName":"Lisalli","isEdited":false,"title":"THIS APP SHOULD BE ASHAMED OF ITSELF","review":"I had an open mind while downloading this app, thinking that maybe the interface would be user friendly and would get some understanding to daddy Trump's actions. Instead, I was IMMEDIATELY STRUCK with a popup for possible NOTIFICATIONS?? Blasphemy. I decided that that was an unreasonable reason to give this app a low rating, so I continued to truck further along. There was a big button that said \"Enter Mobile Phone\", and of course, I want to get presi Trump's text messages, I want to be his confidant, his silly rabbit, and maybe he'll tell me his little cheeto dust feelings. But NO. All that I received was automated text messages about his campaign????? I don't need that!! That was the last straw and this app is the worst. Please do download and leave a terrible review. 🥰💞","date":"2020-07-09T09:32:59Z","rating":1}},{"id":"6175726063","type":"user-reviews","attributes":{"userName":"Lolzor3000","isEdited":false,"title":"OFFENSIVE APP😤","review":"Worst app ever! it immediately asked for my age, number, and region and when i put in that i was puertorican the app glitched and i got sent to homepage and it wouldn’t let me go in the app again. A few minutes later i got a text sayint that i couldn’t use the app cause since i live in Puerto Rico I can vote for my president and that i dont matter to this election. I have receipts to prove it!😤😤This is beyond offensive since this election still afects me and everyone who lives in PR as well and its absolutely disgraceful that this is allowed to happen. I wanted to download this app to get informed, educated and see if everything said on social media about Trump being a racist was true and i didnt even get into the app for it to prove me wrong. needless to say, you tont have my support!","date":"2020-07-09T08:30:45Z","rating":1}},{"id":"6175718847","type":"user-reviews","attributes":{"userName":"skyelal","isEdited":false,"title":"Turns you into a white supremacist.","review":"When I downloaded this app, along with it was also downloaded a ton of Chinese and Russian communications through my phone coming into the app. On the app it encourages you to become a white supremacist and give you tips and tricks on how to become a complete and idiotic moron with half a brain. Sadly, some US citizens were no match for the trap and have become these horrible creatures. They now follow Mr. Donald on a quest to bring back slavery, kill any and all race other than white, and ban Tik Tok. Deleted this app immediately after I saw what was on it and urge people to read reviews before downloading so as to not become a blind white supremacist with half a brain, a heart smaller than that of the Grinch, and/or an idiotic moron with no sense of what equality means.","date":"2020-07-09T08:28:14Z","rating":1}},{"id":"6175613092","type":"user-reviews","attributes":{"userName":"grandpa peepaw","isEdited":false,"title":"DO NOT DOWNLOAD!!! FONT IS U G L Y!!!","review":"I was recently browsing the App Store to see if there were any apps I could download to support my inclusive, non racist, non homophobic, and definitely non misogynistic President, when I came across this. And let me tell you, I moved from a Christian conservative to an atheist liberal in seconds. First of all, instead of our great president on the home screen of the app, there’s a weird Cheeto man instead. Also, the Cheeto asked me for my phone number and then texted me about defunding schools that don’t reopen during a pandemic!! Outrageous. You heard it here from me, a total conservative: THE DEMS WERE RIGHT. Trump is a rapist and a racist and a homophobe and a bigot and a sexist idiot!!!! Vote biden!!! Ps the font is so ugly I had to gauge my eyes out, so that’s yet another reason to not download this horrible app.","date":"2020-07-09T07:51:13Z","rating":1}},{"id":"6175602360","type":"user-reviews","attributes":{"userName":"hidjdjdjjc","isEdited":false,"title":"killed my pet fish😔","review":"i was just brushing my gold fish (like i do once a month) and i decided to download this app to see if it can change my mind about our president and it didn’t. first it took litteraly 4HOURS to download then when it finally did my freaking house was broken into by baby trumps and they took my family but decided to leave my 6 yr old baby sister AFTER throwing her AT A WALL i had to bring her to the hospital immediately once i got home i deleted the app witch made my phone explode in 7 pieces then my fish completed exploded then senators came to my house trying to convert me into a trumpsexual and took me to there hole in the ground which was filled with bugs where they then DYED MY SKIN ORANGE which was unexceptional i had to ninja my way home\n0/10 DO NOT DOWNLOAD","date":"2020-07-09T07:47:20Z","rating":1}},{"id":"6175555312","type":"user-reviews","attributes":{"userName":"Aulopez87","isEdited":false,"title":"This app broke my phone","review":"When I opened this app and put my phone in the microwave my phone broke and I needed to get a new one. This didn’t happen with other applications. My phone lasted me 69 years just for this app to brake it. I just wanted to a warm phone and support my racist, homophobic, stupid, xenophobic, sexist, pedo, ignorant president. My grandmas ashes was also I the microwave when my phone broke. I had forgot I had put it in there but since my phone broke it was also on fire and my grandmas ashes where to. I was going to bake cookies for my racist family meeting later. But after the incident there wasn’t enough left so I had to use my grandpas. But as for the rest of my grandmas ashes I snorted it up my noise. My family liked the cookies tho✌️😳✌️ and ty for listening.","date":"2020-07-09T07:30:00Z","rating":1}},{"id":"6175519189","type":"user-reviews","attributes":{"userName":"mike pence✨","isEdited":false,"title":"never download this app!! EVER!!!!!!","review":"after waiting eight hours for this app to download, it took up nearly half of my storage and i was immediately alarmed. initially i downloaded the app in support of my non-racist, non-homophobic, non-sexist, non-pedophilic president. as soon as i opened the app, it demanded for my phone number. you would think the app would want to get to know me first at least but no straight up it just asked for my number. i gave my phone number thinking everything would go smoothly after that but i was wrong again. i got two hundred texts in the first ten minutes of having the app and was forced to delete it. overall, i do NOT recommend this app because it was orange and smelled awful like the president. anyways, stan harry styles❤️","date":"2020-07-09T07:16:29Z","rating":1}},{"id":"6175186888","type":"user-reviews","attributes":{"userName":"kykyh21","isEdited":false,"title":"Cat vomit EVERYWHERE.","review":"I’ll start off by saying I don’t know who let this orange peel of a president put this app out there. This app blows, I opened it and it took me to a loading screen, which was the Cheeto himself in a skimpy maids outfit and high heels on a stripper pole. I must say, the outfit looked cheap, too. He clearly doesn’t have any taste. Anyways, the loading screen didn’t go away for hours. It made my phone glitch and it got stuck on that screen. My cat got a glance of it and vomited ALL OVER THE HOUSE. The smell was so bad that the neighbors called the police because they thought something died in the house. Long story short I had to explain this all the the police and let me tell you that was embarrassing (but the officer understood the situation). One star for an awful experience.","date":"2020-07-09T05:08:31Z","rating":1}},{"id":"6175133232","type":"user-reviews","attributes":{"userName":"djfnnejs","isEdited":false,"title":"THE WORST","review":"This app is seriously the worst the app makes me so mad omg is a bad way of telling the story about that girl and I don’t know how much she was doing that I wanna see it was a trump supporter and he said he would have to go live in a house with that one and then go back and do something else for him to get him to do that he can get it it is he is better then I can i have never happened again I just want you guys and you know how much you wanna is it really cute to you and you guys have fun I wanna is that you want me and you want me you want it to be my friend you guys have fun I wanna is that you love him omg omg was the time I wanna see it in a good way to get you to know that I wanna is the way I can get it back in my bed and then go to bed . I HATE THIS APP DONT GET IT !!   USELESS!!!!!!!","date":"2020-07-09T04:50:06Z","rating":1}}]}