{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35390","data":[{"id":"6173529781","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"worst app ever made","review":"trump really thinks he would win the election when he wont so there really wasn't any point in making the app. once i got the app, it asked for my phone number and i started to not really trust the government anymore because of what has happened for the past 6 months. i automatically deleted the app because i was scared the government would track me down and i don't want that to happen. thank you.","date":"2020-07-08T19:56:18Z","userName":"xomelissakate"}},{"id":"6173515429","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Horrible","review":"This app is really bad. So much bugs and glitches. This app is the worst app I have on my phone. Just overall the worst app ever. Don’t download it just wasting storage. When I use it makes my phone die easy.","date":"2020-07-08T19:51:16Z","userName":"sntkkffj"}},{"id":"6173507193","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"horrible app!","review":"This is app was absolutely terrible! The apparel is very ugly and boring. There is absolutely no flavor!! There are only like two color choices. This app is honestly a disgrace to the app store and to this world. This app should be removed from the app store immediately!","date":"2020-07-08T19:48:30Z","userName":"bubblegumpony101"}},{"id":"6173491224","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"TERRIBLE SET UP","review":"terrible app!!! Once i download it, my phone glitches SO MUCH. It started to turn off and on like crazy, and all my apps would crash. THEN when it finally worked and i got in the app all i could see was a very rotten orange🍊.","date":"2020-07-08T19:43:04Z","userName":"alyxsa.marie"}},{"id":"6173490578","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Why does this app exits🧚🏼‍♂️✨🍊","review":"Terrible app it’s was so laggy. Had horrible service worst app I have ever downloaded. This app should be banned from the App Store. I think this is just un necessary. Why is there i big orange person always popping up it’s scary. 😬","date":"2020-07-08T19:42:51Z","userName":"FIvE SstARs ✰✰✰✰✰"}},{"id":"6173487497","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Trump","review":"This app is the worst it made my phone glitch so bad and I couldn’t do anything I had to take it to the app stare so they can fix it also people have remember all the bad things trump has done to us and this world","date":"2020-07-08T19:41:46Z","userName":"kvfmkvodmckokcodl"}},{"id":"6173463588","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Downloading issues","review":"Adding on to my previous complaint it finally downloaded but when I opened it I saw a witch who cast a spell or something making my phone glitch so I had to get a new one.","date":"2020-07-08T19:33:30Z","userName":"gdpg6"}},{"id":"6173458523","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Virus detected","review":"I was using the app and it completely shut down on me. It also got a hold of my personal information without me doing anything. Super weird, and I suggest that the rest of you should leave a 1 star review too :)\n\nSincerely, \nGen Z","date":"2020-07-08T19:31:43Z","userName":"DontSleepOnGenZzz"}},{"id":"6173458219","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"horrible","review":"i can’t believe the things this app has done. it took 9 HOURS TO DOWNLOAD. when i could FINALLY open the app it gliched so bad that i had to BUY A NEW PHONE. i dont even know why this app is still in the app store it should be ILLEGAL. therefore i will not be sporting trump. BLACK LIVES MATTER. YOUR PRESENT IS A PEDOOOOO ❤️","date":"2020-07-08T19:31:38Z","userName":"joemama6996"}},{"id":"6173456457","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Straight Up Garbage","review":"Took forever to download and when I finally open the app! Nothing shows! I redone loaded it like 5 am times and only got a white screen the 5th time...this is app is stupid and very horribly programmed","date":"2020-07-08T19:31:03Z","userName":"SpamiDani"}}]}