{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29930","data":[{"id":"6176595020","type":"user-reviews","attributes":{"review":"This app took a week and a half to download, shoddy craftsmanship to say the very least. All of the visuals were incredibly jarring and assaulting to my eyes. I began to bleed from my eyeballs as soon as I opened it up and clicked around. Will be deleting right away✨","userName":"SnsnjdkdMEndebdksnw","rating":1,"date":"2020-07-09T12:57:33Z","isEdited":false,"title":"Horrifying images"}},{"id":"6176577156","type":"user-reviews","attributes":{"review":"I tried to use this app and it asked for use of my camera. Ofc I trust mr trumpy so I assumed it would be for good use. When I alllowed it access to my camera it asked me to enter my phone number. I then proceeded to get messages saying that I had a nice beard and nice hair????? I have cancer","userName":"skdjksksskd","rating":1,"date":"2020-07-09T12:52:42Z","isEdited":false,"title":"The worst app ever"}},{"id":"6176576321","type":"user-reviews","attributes":{"review":"This app is absolutely horrendous and annoying whatever you do don’t download it will spam you with unnecessary crap mail and messages. I received a call from the app in THE MIDDLE OF THE NIGHT which woke my entire family and I. Do not download is whatever you do!!","userName":"DontayRock","rating":1,"date":"2020-07-09T12:52:28Z","isEdited":false,"title":"DO NOT DOWNLOAD THIS APP IS TERRIBLE"}},{"id":"6176569414","type":"user-reviews","attributes":{"review":"I abdolutley detest this app i downloaded it and while downloading i just had to wait there. I downloaded it ro learn valuable information but instead i saw an old orange face WAY too often it grossed me out along with the All Lives matter supporters on this app, just nasty 🤢","userName":"Baby Barron Boo Boo","rating":1,"date":"2020-07-09T12:50:39Z","isEdited":false,"title":"Just Nasty 😾✨💅"}},{"id":"6176562568","type":"user-reviews","attributes":{"review":"0/10 would not recommend. Took DAYS to download and then made my phone glitch so it would only play Replay by Iyaz on repeat.  Still have not been able to fix it but at least I can confirm that shawty is indeed like a melody.","userName":"timmychalamet","rating":1,"date":"2020-07-09T12:48:46Z","isEdited":false,"title":"🧚💞✨"}},{"id":"6176554860","type":"user-reviews","attributes":{"review":"This app was horrible, it hacked my phone and deleted important data, it was so terrible and this is such a low quality app, don’t recommend it at all, save yourself the trouble of downloading this app, you’ll be thanking me later","userName":"BTS.Asian.lover","rating":1,"date":"2020-07-09T12:46:38Z","isEdited":false,"title":"Terrible"}},{"id":"6176477750","type":"user-reviews","attributes":{"review":"I literally have never seen something WORSE than this 🤧 it says I CANT use it because I support Blm and lgbtq!!!! Why should that be a PROBLEM🤬!!! EVERYONE IS EQUAL!!!! Just because you like something different or you look different does not mean you weren’t born like the rest of us!!!","userName":"its the sad truth","rating":1,"date":"2020-07-09T12:25:30Z","isEdited":false,"title":"DONT GET IT"}},{"id":"6176473287","type":"user-reviews","attributes":{"review":"It’s a bad app do not download it it hacks you I downloaded this app it started glitching when I first started to go in to the app. \nApp took several days to download after that finally download it hacked all of my data and wiped my phone","userName":"taryn Waddell","rating":1,"date":"2020-07-09T12:24:17Z","isEdited":false,"title":"Don’t get it’s the worst app 😡😡😡😡"}},{"id":"6176461219","type":"user-reviews","attributes":{"review":"So I came across this app and downloaded it out of curiosity, but every time I open the app, I see a picture of our racist, homophobic,  arrogant, narcissistic, transphobic, sexist, and extremely disgraceful president. I’m not sure if there’s a way to make that go away?","userName":"Yuli's Bltch","rating":1,"date":"2020-07-09T12:20:57Z","isEdited":false,"title":"Technical issues???"}},{"id":"6176458598","type":"user-reviews","attributes":{"review":"This app crashes my phone every time I open it and every since I’ve downloaded it my phone has slowed down immensely. Even though I never tapped, allow access to photos my photos were already loaded and ready to go on the app. THIS APP IS TRACKING ALL OF YOUR DATA AND STEALING IT DO NOT TRUST THIS APP","userName":"Jel car tree","rating":1,"date":"2020-07-09T12:20:12Z","isEdited":false,"title":"BEWARE OF THIS APP!!"}}]}