{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=101320","data":[{"id":"6174158256","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Ewww","review":"It was showing nasty stuff on it","date":"2020-07-08T23:47:02Z","userName":"eww its nasty"}},{"id":"6174155498","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Awful App","review":"Promotes hate, ignorance, and bigotry masked by nationalism and a selfish attitude.","date":"2020-07-08T23:45:59Z","userName":"The Epic Merp"}},{"id":"6174149956","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"no ❤️","review":"when i open the app i see a naked cheeto . just no ❤️","date":"2020-07-08T23:43:51Z","userName":"may.meh"}},{"id":"6174145709","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"The worst","review":"This app is only for boomers","date":"2020-07-08T23:42:17Z","userName":";/5!15"}},{"id":"6174141604","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"horrifyingly bad❤️","review":"passed out in disgust when i first opened app to see a wet cheeto","date":"2020-07-08T23:40:45Z","userName":"offcialbunkerboy"}},{"id":"6174141289","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Grosss App","review":"Worst app everrrr , the large hot Cheeto is ugly and annoying","date":"2020-07-08T23:40:38Z","userName":"Fhcgbzgnx"}},{"id":"6174140068","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Terrible and dangerous app!","review":"Had a horrible experience. Do not download! \nTo start off, I originally downloaded the app to keep up to date on rallies and current events, but I couldn’t believe how long it took to download! I was left staring at my screen for NO LESS THAN TWO DAYS. \nWhen it finally opened and I was filled with relief because I could finally support my favorite president, I was horrified to see that in the time it was downloading, all the personal data on my phone had been sucked into the Trump 2020 app and replaced by hundreds of viruses! Now my phone will not cooperate, is giving me strange popup messages every second, and glitches out constantly. In between all the glitching, the app also sexually harassed me and wouldn’t stop asking for my number (I don’t give that out to strangers; really disgusting that they would assume that). A huge warning also popped up warning me that if I was Mexican, they would hunt me down using my IP address and the FBI’s resources to deport me and my family. When I saw this, the love for my president and his tolerance for all races resurfaced, and I knew that everything would be okay.\nWhile the next morning I thought that I could deal with these problems because I valued supporting my beloved president more than complaining about my issues, I soon realized that the damage was irreversible. I got a strange letter from the IRS in the afternoon and was accused of evading taxes. I would never do something like this, so I just KNEW it was the fault of this app!! I had no time to prepare or make any calls before I heard an insistent knocking on my door and an angry call of “Police, open up!” \nNo matter how much I begged and pleaded, i ended up in the cell where I am now. I depressingly asked my guards what I had done wrong for the sixth time, and they finally relented and told me that I was being treasonous because I didn’t turn on notifications for the Trump 2020 app. I am currently writing this review on the cold stone wall of my cell, knowing that I will never be able to leave and see the light of day ever again.\n\nIf you are okay with this horrible treatment, I fully advise that you download the app. If you would rather not end up a half-soul wretch like me, STAY AWAY!!","date":"2020-07-08T23:40:11Z","userName":"aleilB."}},{"id":"6174124019","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"NO🙃","review":"a big chetto popped up and scared me to death","date":"2020-07-08T23:34:07Z","userName":"thickforehead"}},{"id":"6174082922","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"HORRIBLE!","review":"I wanted to follow the LeAdEr of US but it kicked me out","date":"2020-07-08T23:19:13Z","userName":"thisfatjuicyma"}},{"id":"6174081941","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"gross","review":"worst app ever. stole my vacuum information ! don’t trust anything is app has to offer !!!🐳🐄🍋🤿🤿🐄","date":"2020-07-08T23:18:59Z","userName":"keksiejdh"}}]}