{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26930","data":[{"id":"6174930058","type":"user-reviews","attributes":{"title":"this is not it ✨","userName":"mork_lee18383882","isEdited":false,"date":"2020-07-09T03:45:37Z","rating":1,"review":"This app is HORRIBLE my phone got so many bugs because of this app and it should rightfully be deleted. As much as I wanted to get our oppar trumps merch I couldn’t because I had to delete the app it was so bad :( \nPlease don’t get this app it’s such a waste of time and space!!!! I’m so mad 😡😡😡🤬🤬🤬🤬🤬🤬"}},{"id":"6174924492","type":"user-reviews","attributes":{"title":"Terrible!!!","userName":"ycemmalani","isEdited":false,"date":"2020-07-09T03:43:57Z","rating":1,"review":"I’ve never had an app make my phone glitch this much!! I downloaded it and then tried to open it and everything started glitching, including my other apps. 0/10, would not recommend this app or this president."}},{"id":"6174920315","type":"user-reviews","attributes":{"title":"Worst App","userName":"Selah Ball","isEdited":false,"date":"2020-07-09T03:42:40Z","rating":1,"review":"This app literally is so dangerous for iphone users it spreads false information about Trump being an actual good president which is clearly false. It also promotes a rapist and racist which is coincidentally our president. Would not recommend! If you actually like this app you are homophobic good night!"}},{"id":"6174909822","type":"user-reviews","attributes":{"title":"Absolutely trash","userName":"VintageToxin","isEdited":false,"date":"2020-07-09T03:39:33Z","rating":1,"review":"The app barely functions and eats your battery life so fast, I hate using it and the design is terrible. It seems like it was designed by high school students in order to cut costs. I’ve deleted it. You should to, or just don’t get it in the first place."}},{"id":"6174909179","type":"user-reviews","attributes":{"title":"0/5 STARS","userName":"corona lime","isEdited":false,"date":"2020-07-09T03:39:21Z","rating":1,"review":"Genuinely the WORST app ever in the world it doesn’t even work and it sent all my information to spam companies it actually ruined my phone because the Russians that helped trump win hacked in to steal pictures of my dog also would NOT RECOMMEND for anyone to download absolutely horrible"}},{"id":"6174901355","type":"user-reviews","attributes":{"title":"Hell app","userName":"iyona carroll","isEdited":false,"date":"2020-07-09T03:37:02Z","rating":1,"review":"This app is personally one of the workouts I’ve ever downloaded. I first I thought it was just me trying to support Donald Trump but then I end up kidnapped and having to be forced to be his personal slave and now I am fed cow feces every day and I have no way to get out oh my God I have to go he’s coming help"}},{"id":"6174899652","type":"user-reviews","attributes":{"title":"Bad!","userName":"NJ STEPS","isEdited":false,"date":"2020-07-09T03:36:30Z","rating":1,"review":"When I got this I was surprised what it did to my phone. The private police is fake, it made my phone glitch, it was super laggy, it is basically a way for people to pre vote, and it is telling you lies! I recommend to not get this. This app is not making America great again!"}},{"id":"6174881799","type":"user-reviews","attributes":{"title":"This app is the worst...","userName":"SunkistSenpai","isEdited":false,"date":"2020-07-09T03:31:18Z","rating":1,"review":"This app possessed my phone! My phone came alive last night and knocked over my record-player onto my head! I could've died! My record player started saying all sorts of things. Including \"Biden 2020\"! Do NOT get this app! It could be a matter of life and death!"}},{"id":"6174872757","type":"user-reviews","attributes":{"title":"AWFUL APP","userName":"Nealio88","isEdited":false,"date":"2020-07-09T03:28:43Z","rating":1,"review":"When this app is on I cannot see the time or my battery percentage. Also when it is running and I switch to a different application, it causes the rest of my phone to glitch until I exit out of it. I hate this stupid thing. I guess I’ll be a liberal lol."}},{"id":"6174864190","type":"user-reviews","attributes":{"title":"HORRIBLE APP DO NOT DOWNLOAD","userName":"zzzbirdie","isEdited":false,"date":"2020-07-09T03:26:12Z","rating":1,"review":"this app CRASHED my phone!! literally my screen went completely black and i couldn’t turn it on for 4 hours! FOUR HOURS. this is ridiculous i am so INFURIATED RIGHT NOW. could NOT be a worse app. not to mention, when my phone actually started working, the app continued to glitch!! do not download!!"}}]}