{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42010","data":[{"id":"6174864171","type":"user-reviews","attributes":{"date":"2020-07-09T03:26:11Z","rating":1,"isEdited":false,"userName":"POOPY PANTS 100","review":"THIS IS THE WORST APP I HAVE EVER DOWNLOADED IN MY LIFE. it is worse that scooter ankle and even lego stepping. YES, LEGO STEPPING. Everytime i get on the app this orange cheeto of a “man” pops up on my screen and BOY DO I SCREAM FOR ICECREAM. Basically i see the dude and my middle finger gets a boner if you know what i’m saying( wink* wink*). Anyways, NEVER DOWNLOAD, OR DOWNLOAD TO LEAVE A “GREAT” REVIEW!!!!","title":"AWFUL APP............gen Z🧚🏻"}},{"id":"6174853927","type":"user-reviews","attributes":{"date":"2020-07-09T03:23:10Z","rating":1,"isEdited":false,"userName":"nshhddhejja","review":"ever sense i downloaded this app my phone always had the camera icon on which meant someone was watching me through my phone! i will NOT be voting for trump this year because his app got me stalked!","title":"HACKED MY PHONE"}},{"id":"6174851632","type":"user-reviews","attributes":{"date":"2020-07-09T03:22:29Z","rating":1,"isEdited":false,"userName":"Dachshundlover8","review":"Tiktok isn’t a stupid app to cure boredom. It provides advice for life, teaches individuals how to live and take care of themselves, creates a feeling of security and comfort for individuals who are struggling. It does so much more these are simply a few reasons.","title":"This is for tiktok"}},{"id":"6174849643","type":"user-reviews","attributes":{"date":"2020-07-09T03:21:54Z","rating":1,"isEdited":false,"userName":"bvalentine5468","review":"I downloaded it and it started barking at me. I I was curious so I took it to the store to see what was wrong and they said to go to a vet. They didn’t know either. Anywho I think you guys to fix this app now","title":"Trash"}},{"id":"6174848092","type":"user-reviews","attributes":{"date":"2020-07-09T03:21:27Z","rating":1,"isEdited":false,"userName":"ahisjsne","review":"this app stole my dog, and THEN proceeded to tell me that water is not wet and we all know IT IS. this is no laughing matter so please take it seriously. i’m trying to prevent more people from this troubling situation. okay, i have to walk my fish now.","title":"DO NOT DOWNLOAD"}},{"id":"6174842367","type":"user-reviews","attributes":{"date":"2020-07-09T03:19:45Z","rating":1,"isEdited":false,"userName":"barcafan321","review":"Right when you open the app it asks for your phone number.....that is not happening. Plus it’s super glitchy you would think America’s favorite orange would put more effort in the app.","title":"WORST APP EVER"}},{"id":"6174837507","type":"user-reviews","attributes":{"date":"2020-07-09T03:18:19Z","rating":1,"isEdited":false,"userName":"jhfgffvfgh","review":"Is so bad I don’t like this app is really boring not fun at all and you shouldn’t get it I’m telling you this is a horrible app if you want to be good don’t download this app is boring as heck period.","title":"Don’t recommend 👿👿👿"}},{"id":"6174827258","type":"user-reviews","attributes":{"date":"2020-07-09T03:15:18Z","rating":1,"isEdited":false,"userName":"SwimmerCeCeBYST","review":"once i downloaded the app, it took all my photos and rated me from 1-10. so degrading. once i was already in tears, the app somehow managed to find pictures of my dead relatives and remind me that i’ll never see them again. so insensitive!!! then my whole phone started glitching and blaring the national anthem nonstop. would give 0 stars if i could.","title":"worse app i’ve ever downloaded!!"}},{"id":"6174824698","type":"user-reviews","attributes":{"date":"2020-07-09T03:14:35Z","rating":1,"isEdited":false,"userName":"29'eeks","review":"This app is so slow and there are a ton of glitches. I got this app expecting it to work and it almost never does. I suggest Trump and his team fix this app.","title":"This app is horrible"}},{"id":"6174815762","type":"user-reviews","attributes":{"date":"2020-07-09T03:11:58Z","rating":1,"isEdited":false,"userName":"haksmsnnsndhd","review":"This app glitches and is extremely slow and uses alll of your info and tracks your location and constantly has add and is just terrible overall DO NOT DOWNLOAD worst app ever","title":"Worst app ever DO NOT USE"}}]}