{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=85560","data":[{"id":"6176638753","type":"user-reviews","attributes":{"isEdited":false,"review":"For reference, I am an absolutely impartial person. I am blind to all things. However I can see the blatant breach of privacy within this app upon  opening it for the first time! It asks for your phone # and has no option to refuse. The people behind the creation of the app clearly just want your personal data and do not care about the consumer. In fact, thirty minutes after the insanely long download time (3 days!!!) I was greeted by a hostile SWAT TEAM at my doorstep who were peculiarly not wearing masks, because they believed it went against their god given breathing systems and proceeded to pepper spray me in my own home! However, I was wearing a mask because of the dust in my house so I was perfectly fine, I closed my eyes when I realized what was happening and then opened them to see 14 SWAT on the ground coughing their lungs out. I offered them water to which they gratefully accepted before I asked why they were in my house. They answered in unison, “GIVE MONEY TRUMP GOOD,” before Uncle Sam and Abraham Lincoln came in with two machine guns and rescued me. They reassured me that the bullets only hurt people not wearing masks and that the SWAT team was only asleep. While Uncle Sam and Abraham Lincoln were busy cleaning up the bodies they asked me why these people invaded my house without a warrant. I told them exactly why and I fear the same thing may happen again in the future. I fear for my life constantly now as Abraham Lincoln is no longer here to protect us, all because of this wretched app. Do not download this app, you be plagued by something much worse than any virus.","date":"2020-07-09T13:09:20Z","userName":"Alialoid","title":"Absolutely Dissapointed","rating":1}},{"id":"6176637804","type":"user-reviews","attributes":{"isEdited":false,"review":"opened the app and a horrific picture of a oompa loompa looking humpty dumpty cheeto pedo. i’m scarred for life now.","date":"2020-07-09T13:09:06Z","userName":"S6Emmz","title":"No just no","rating":1}},{"id":"6176625208","type":"user-reviews","attributes":{"isEdited":false,"review":"I don’t have enough money for chicken nuggies so ima start a revolution","date":"2020-07-09T13:05:45Z","userName":"kkkaaaattttkkkaaatatttt","title":"Nuggies","rating":1}},{"id":"6176612288","type":"user-reviews","attributes":{"isEdited":false,"review":"So long I think 24 hrs","date":"2020-07-09T13:02:16Z","userName":"jaker tooker","title":"Download so long","rating":1}},{"id":"6176602124","type":"user-reviews","attributes":{"isEdited":false,"review":"This app had sex with my boyfriend, ate my last avocado, and started COVID-19","date":"2020-07-09T12:59:32Z","userName":"Funtom gammer","title":"Just terrible","rating":1}},{"id":"6176600940","type":"user-reviews","attributes":{"isEdited":false,"review":"This app is so trash I can’t even use it ‼️‼️😤","date":"2020-07-09T12:59:12Z","userName":"Trump2020butinagrave🤡","title":"Trash","rating":1}},{"id":"6176576974","type":"user-reviews","attributes":{"isEdited":false,"review":"Just an over all bad app","date":"2020-07-09T12:52:39Z","userName":"xxGracexxaj","title":"👎","rating":1}},{"id":"6176552306","type":"user-reviews","attributes":{"isEdited":false,"review":"as soon as I downloaded this app every electronic in my house short circuited starting multiple fires throughout my home, the fires would not go out even once the fire department got here. My house is gone and the fire still rages now but in the shape of a fiery dragon that’s burning everything in sight. The neighbors have had to move out. Even though I obviously don’t care about the environment I can’t help but feel bad about the local wildlife. And the fumes from the fire are creating a smog-like atmosphere in my city, that paired with the already existing Carbon Monoxide, Sulfur Oxides, Carbon Dioxide, and VOCs must really be doing some damage. It’s definitely not going to make the overall earth cooler. And all of the waste is being moved to landfills so that’s  good that it’s out of my way. But it’s probably leaking methane, chloride, nitrogen, phenols, and even more VOCs. And I heard that all of this stuff will get picked up by any water that enters the landfill and that water could get out if the landfill doesn’t have a clay lining. And realistically, even if it did that doesn’t stop all of the harmful chemicals that manage to squeeze their way out into aquifers or nearby rivers, spoiling the local water. Even though a clay lining would reduce this mess, it still would eventually fail and leak even more harmful chemicals into the water and soil, harming the surrounding wildlife. And I guess this could, essentially, ruin the food chain causing animals to either migrate or perish. And it would probably harm the plant life, causing necessary bugs like bees to leave the area or die from pollution. And all of this would decrease overall biodiversity. But I guess there’s not much I can do. Well... aside from advising others from downloading this app, encourage them to use less waste, educate people on how to recycle, and  continue to educate myself on the impacts of pollution.","date":"2020-07-09T12:45:58Z","userName":"Sudjfysuhukgyjdirrig","title":"TERRIBLE APP DO NOT DOWNLOAD","rating":1}},{"id":"6176536840","type":"user-reviews","attributes":{"isEdited":false,"review":"This was one of the worst experiences with an app I’ve ever had. It did not do what I wanted","date":"2020-07-09T12:41:40Z","userName":"Woo Wednesday","title":"WORST APP 🤢🤮🤮🤮🤮","rating":1}},{"id":"6176529182","type":"user-reviews","attributes":{"isEdited":false,"review":"I got this app so I can enjoy trump but instead I got cancer please send help. This app is CURSED.","date":"2020-07-09T12:39:35Z","userName":"edcfbbbc","title":"DO NOT GET😤😡","rating":1}}]}