{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=51930","data":[{"id":"6175008745","type":"user-reviews","attributes":{"userName":"Emma 123432","date":"2020-07-09T04:10:27Z","rating":1,"isEdited":false,"review":"This app is absolutely disgusting because as soon as I downloaded it, I had the urge to be racist and ban rights for the LGTBQ+ community! You should never get this app because it is absolutely horrendous!","title":"LITERALLY AWFUL APP!!"}},{"id":"6174981640","type":"user-reviews","attributes":{"userName":"bad game😤","date":"2020-07-09T04:01:47Z","rating":1,"isEdited":false,"review":"This app was makeing my phone glitchy it cut my phone off and on 7 times it broke my sisters phone and it’s just a bad app don’t get it !","title":"Horrible App"}},{"id":"6174966724","type":"user-reviews","attributes":{"userName":"Boby Dodo","date":"2020-07-09T03:57:04Z","rating":1,"isEdited":false,"review":"I downloaded it  and then it stole my dog and ran to China, probably going to start the doggie virus but then the phone came back and blew up so know I have no phone","title":"Trash"}},{"id":"6174963468","type":"user-reviews","attributes":{"userName":"Moppysie","date":"2020-07-09T03:56:01Z","rating":1,"isEdited":false,"review":"0/10, would not recommend. Super slow and tends to have a lot of pop ups. I’ll be goin elsewhere for my unbiased news sources.","title":"Not the best"}},{"id":"6174924663","type":"user-reviews","attributes":{"userName":"suckingbu","date":"2020-07-09T03:44:00Z","rating":1,"isEdited":false,"review":"🤢🤢made me throw up when i downloaded this app. struck drum decorum hang gang yung yuh isn’t trump match jack noted unlock kin check safa deck of bark omg pupils ten off track into one tho iver using using using update jus wen jus oh pink on outer kit ⚠️ fine loser push pen f ft unfollow only one once over yeah peach peach car head out once mites in miss woke well whag bear senior tan nope jean jack peach still kinda kitten lesser pencil peen orange","title":"unit"}},{"id":"6174923696","type":"user-reviews","attributes":{"userName":"Sarah Shortsleeve","date":"2020-07-09T03:43:42Z","rating":1,"isEdited":false,"review":"This app is the worst possible app you could ever get there is no way that anyone would want there phone to get glitches right? Well RIGHT AS I OPENED THE APP I GOT HORRIBLE GLITCHES AND HACKS!! I am truly discussed with this 😡🤬","title":"DISAPPOINTED"}},{"id":"6174913839","type":"user-reviews","attributes":{"userName":"calligraphygrl","date":"2020-07-09T03:40:44Z","rating":1,"isEdited":false,"review":"I downloaded this app to keep with our presidents campaign but was horribly surprised. The app gave my phone HUNDREDS of viruses the second after I downloaded it. DO NOT DOWNLOAD THIS APP UNLESS YOU WANT YOUR PHONE TO GET VIRUSES!!!!! I HAD TO TAKE MY PHONE TO THE APPLE STORE AND SPEND HUNDREDS TO GET IT FIXED.","title":"WORST APP EVER!!!"}},{"id":"6174907051","type":"user-reviews","attributes":{"userName":"two bannanas for a pound","date":"2020-07-09T03:38:42Z","rating":1,"isEdited":false,"review":"This app whispered demonic incantations to me at night in order to try and turn me into a white supremacist. Plus there was too much Trump and not enough of our king manny heffley","title":"Horrible app"}},{"id":"6174902838","type":"user-reviews","attributes":{"userName":"victoriamcantu12","date":"2020-07-09T03:37:28Z","rating":1,"isEdited":false,"review":"Since you wanna take down tik tok all of us are gonna take down your app how do you like them apples and this app is useless 👎🏼","title":"I came here from tik tok"}},{"id":"6174901373","type":"user-reviews","attributes":{"userName":"April_Moon","date":"2020-07-09T03:37:02Z","rating":1,"isEdited":false,"review":"I cannot explain to you how terrible this app is. If you want the worst app on the market go ahead and download. If you want the best, download tiktok.","title":"Literally the worst"}}]}