{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=9840","data":[{"id":"6134863723","type":"user-reviews","attributes":{"userName":"fiend bean","isEdited":false,"date":"2020-06-29T07:25:26Z","rating":1,"title":"terrible!!!! do not recommend downloading 😡","review":"i downloaded this app so i could support the lovely 🧚🏼‍♂️✨ president trump✨🧚🏼‍♂️, but as soon as i opened it my phone got hacked! my phone then exploded and made my house catch on fire!!!! now cursed because of this terrible terrible app and no phone, i wasn’t able to call 911 in time and my house also burned down. on top of my house burning down, i am now homeless AND need to buy a new phone 😡 thanks TRUMP for nothing. worst experience ever"}},{"id":"6126094334","type":"user-reviews","attributes":{"userName":"do not like cheetos","isEdited":false,"date":"2020-06-27T01:38:34Z","rating":1,"title":"poor app","review":"I really wanted to believe that this app would change my way of thinking about our WONDERFUL president, but sadly I was mistaken. This app is just not a reliable way to understand all that is happening and plus after the download i got and ad to help support white supremacy. I know think that many groups who racially profile and do not believe in equality have my information and I do not feel safe. -10/10 don’t recommend! 🧚❤️"}},{"id":"6122790594","type":"user-reviews","attributes":{"userName":"rose_k_","isEdited":false,"date":"2020-06-26T05:12:21Z","rating":1,"title":"A very disappointing trump supporter","review":"I was expecting a lot, maybe too much, apparently. I wanted to feel closer to our kind, dedicated president. The app is buggy, defected, and the performance is far below standards that I deem acceptable, much like the the United States police force. Any who, I am disappointed in this app as it was supposed to bring me closer to to Trump himself and allow me to support his candidacy directly. I have to say I feel more alienated from him than ever, as a POC and a proud member of the LGBTQ+ community."}},{"id":"6065117698","type":"user-reviews","attributes":{"userName":"ILOVEDONALD235","isEdited":false,"date":"2020-06-12T01:51:12Z","rating":1,"title":"gave my credit card number to russians","review":"I LOVE our esteemed and exalted president so much! He is the best human ever. However, this app was not good. It was very hard to use, asking for my credit card information, even though it was meant to be free. Since I love and trust our epic president, I decided giving the number couldn’t hurt. But the next thing I knew, large purchases were being made in Russia! Why would that be happening!? I demand answers from app developers!"}},{"id":"6064002715","type":"user-reviews","attributes":{"userName":"iamdaddy317","isEdited":false,"date":"2020-06-11T18:20:43Z","rating":1,"title":"absolutely horrifying","review":"I was so excited to get this app and help support daddy Trump but when I opened the app it literally started a slideshow of child p0rn. There was no way to exit this horrendous scene and in many of the poor children’s hands were signs that said “Trump 2020.” On some of them, it was even written on their buttocks! As if this weren’t bad enough, there were older men in the photos wearing Naz1 uniforms and doing the Naz1 salute! I was so horrified that I immediately deleted the app! DO NOT GET THIS HORRIBLE APP!!"}},{"id":"6177877328","type":"user-reviews","attributes":{"userName":"._.review45","isEdited":false,"date":"2020-07-09T19:03:58Z","rating":1,"title":"✨I f o n l y✨","review":"I would’ve given this app a 5 stars IF ONLY trump wasn’t getting rid of TikTok because that’s the only GREAT thing about America. Sorry not sorry if you can’t keep TikTok then you don’t have my vote. The app had ok color scheme but it was missing the manny flag and there were no signs of you being for the people. TikTok is what we want so if you get rid of it you will be losing hundreds of thaousands of votes from the new generation who do Stan for you in the app. It’s your loss."}},{"id":"6177808786","type":"user-reviews","attributes":{"userName":"puppylover925","isEdited":false,"date":"2020-07-09T18:43:23Z","rating":1,"title":"🥵🍊","review":"I downloaded this app to see if I was able to save Barron Trump and I was soon to come to believe that that was not going to happen First thing it took a week for this app to download which was not a vibe as soon as this app downloaded I was greeted with the most horrific photo of trump getting a spray tan then there was a cult of Karen’s screaming Real women vote for Trump we don’t need no liberal chump I was traumatized I had nightmares ever cents definitely zero out of 10 do not recommend"}},{"id":"6177780675","type":"user-reviews","attributes":{"userName":"daddiesfortrump🥵","isEdited":false,"date":"2020-07-09T18:34:58Z","rating":1,"title":"Horribly confusing and inefficient","review":"I downloaded this app hoping for an easier way to register for the rally in NH. When I opened the app, I was greeted with many big headlines and pictures of a strange looking orange man. What is this app? It did not help me at all ! This app is super disappointing. It won’t delete off of my phone and it’s slowing it down so much. Now my home button lags and my phone turns on much slower. It takes up too much storage!"}},{"id":"6177735106","type":"user-reviews","attributes":{"userName":"Muma❤️","isEdited":false,"date":"2020-07-09T18:21:12Z","rating":1,"title":"Bad bad bad bad bad bad bad","review":"When I was done downloading this app I went  on it and I could not see the whole entire screen I called my mom and said I need to go to the doctors but she didn't take me so I started deleting the app and it wouldn't delete so now I'm stuck with this dumb app whoever download it do not download it it's super bad bad bad I would rather die than have this app so don't download it or you will be blind for the rest your life I'm warning you!!!!!!!!!!"}},{"id":"6177715968","type":"user-reviews","attributes":{"userName":"Worried_Amer1c@n","isEdited":false,"date":"2020-07-09T18:15:31Z","rating":1,"title":"Wretched, basic, bland, unoriginal","review":"First off the user interface is absolute garbage, I can’t access anything, nothing is manageable. Second of all, it just crashes...like all the time, I go to open and click on things and it just crashes the app and sometimes it even shuts my phone off completely. You’d think for as rich as this guy was, he could avoid a proper development team. 0/10. Worse than garbage."}}]}