{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24030","data":[{"id":"6177247103","type":"user-reviews","attributes":{"review":"I’m not a part of the whole gen Z thing. But the moment I opened this app to see what it was about my phone just crashed!! Now everything is running slow and the screen randomly shuts off. If you download this app the same will happen to you.","userName":"xbnsam","title":"Virus","rating":1,"isEdited":false,"date":"2020-07-09T15:53:26Z"}},{"id":"6177237063","type":"user-reviews","attributes":{"review":"I’m not apart of the gen z trying to make this app go away, i actually wanted to see if this app was actually a decent app, which it is not. It makes my phone crash, it’s slow, and hard to find your way around. Overall this app is a waste of space!","userName":"eliza wonton","title":"Worst crashing app ever!!","rating":1,"isEdited":false,"date":"2020-07-09T15:50:33Z"}},{"id":"6177236971","type":"user-reviews","attributes":{"review":"I’ve never used an app that was so dysfunctional and poorly designed. What kind of team could make such a bad app? Maybe they should stick to real estate because this is absolutely appalling.\nPlease drop out of the 2020 election because you have no business being there.","userName":"kadva99","title":"Worst app in the App Store","rating":1,"isEdited":false,"date":"2020-07-09T15:50:31Z"}},{"id":"6177195166","type":"user-reviews","attributes":{"review":"the app continuously keeps crashing. My phone performs well it’s not an outdated phone at all and still has space. but with this app, the app is slow I simply don’t have the patience for the continuous lagging that happens and my phone overheats once I installed the app. Poor performance.","userName":"anonymous name lol","title":"App crashing","rating":1,"isEdited":false,"date":"2020-07-09T15:38:31Z"}},{"id":"6177186436","type":"user-reviews","attributes":{"review":"I downloaded this in an attempt to see what his plans were for the campaigns of course but EVERY SINGLE TIME I opened the app my whole phone shut down. I do have one of the newer phones but it still would make my whole phone shut off nonetheless. Do not get this app.","userName":"Clair.f","title":"Broke my phone","rating":1,"isEdited":false,"date":"2020-07-09T15:36:01Z"}},{"id":"6177171373","type":"user-reviews","attributes":{"review":"I was trying to help our lord and savior 🧚‍♀️🍊Donald Trump🍊🧚‍♀️ but the instructions on the app were so UNCLEAR! Even when i try to open the app again for the second time it crashes! The app is cancer in its purest form. I do not recommend getting this app at all as it will only disappoint you 💅.","userName":"HDAISNWJ","title":"✨ThIs Is So EmBaRrAsSiNg, I jUsT wAnT tO kIlL mYsElF✨","rating":1,"isEdited":false,"date":"2020-07-09T15:31:48Z"}},{"id":"6177162714","type":"user-reviews","attributes":{"review":"As soon as you open the app you see the one and only racist, homophobic, Oompa Loompa looking✨cheeto✨🧚‍♂️ if that doesn’t make you sick to your stomach idk what does! Then it makes you give him your phone number which is ABSOLUTELY disgusting being that he’s MARRIED! I showed it to my son and he had nightmares for a week!!! DO NOT SHOW TO CHILDREN! 🍊TERRIFYING🍊","userName":"Melania and my son Barron","title":"✨disgusting✨","rating":1,"isEdited":false,"date":"2020-07-09T15:29:19Z"}},{"id":"6177150151","type":"user-reviews","attributes":{"review":"I’m trying to make an educated decision when it comes to voting, so I downloaded this app hoping it would help me further understand this candidate. Every time I used the app it would throw me off and my phone would freeze... this app made my phone glitch. So I had to delete it.","userName":"0000908690196","title":"What the heck","rating":1,"isEdited":false,"date":"2020-07-09T15:25:50Z"}},{"id":"6177115751","type":"user-reviews","attributes":{"review":"Absolutely awful it made my phone crash. It was a terrible app. Nobody should get this. One of the worst apps. Every time I opened it up it would crash. Aside from it being a terrible app the content on it was even worse. I HIGHLY recommend NOT getting it. Terrible!!!","userName":"chriss doe","title":"Awful","rating":1,"isEdited":false,"date":"2020-07-09T15:16:20Z"}},{"id":"6177045391","type":"user-reviews","attributes":{"review":"This app has made me feel a way that I have never felt before. I have realized that downloading this app has made me misogynistic, racist, ableist, homophobic, xenophobic, and sexist. Wait no, that’s just Donald Trump...spreading terrible ideology to other people in the United States. Never mind. 1 star for me though. I think the design is tacky.","userName":"melanie4571","title":"Overall Very Bad","rating":1,"isEdited":false,"date":"2020-07-09T14:56:55Z"}}]}