{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=125910","data":[{"id":"6178936293","type":"user-reviews","attributes":{"title":"100% DONT RECOMMEND","isEdited":false,"rating":1,"userName":"this app is so ass","review":"I was so excited to support president cheeto puff🇱🇷🇲🇾❤️ but when i got in the app i was teleported to a different world and i almost died i had to say bernie 2020 3 times to come back i almost died worst experience of my life","date":"2020-07-10T01:32:12Z"}},{"id":"6178935730","type":"user-reviews","attributes":{"title":"Tfgigfrjyg","isEdited":false,"rating":1,"userName":"evgfhxjshdbfifjvdh","review":".f dg gdggdh G’s Rory  it the","date":"2020-07-10T01:31:59Z"}},{"id":"6178934908","type":"user-reviews","attributes":{"title":"IM SO OFFENDED","isEdited":false,"rating":1,"userName":"KARPENISMEN","review":"Never have I EVER in my life been so offended by an app. I downloaded this in order to SUPPORT OUR LORD AND SAVIOR DONALD TRUMP. This app has bombarded me with inappropriate text messages in support of his re-election campaign. I am a student of political science and I am DISGUSTED by how this app, and our president, are handling the election. The United States is the BEST nation in the WORLD and this app in NO WAY show that. I am disgusted. I would rather be in CHINA by how Trump has been treating the American people. -1000000/10 DO NOT DOWNLOAD","date":"2020-07-10T01:31:41Z"}},{"id":"6178933274","type":"user-reviews","attributes":{"title":"DANGEROUS APP, BEWARE!!!!!","isEdited":false,"rating":1,"userName":"hdhshsjsnsbsbs","review":"firstly this app may use you location at anytime it wants to, meaning they know where you are 24/7 also, this app has taken 474728919192245 days to install. as soon as i open the app it asks for my phone number and i thought nothing of it. once i entered my phone number i kept getting weird text messages from KANYE WEST telling me NOT to vote for Biden or else PEACHES will come to my house and sing “yOu So BaD aNd BaBy I wAnT yOu So BaDdDdDdDd YeA” . i was getting really scared so i blocked the number and tried deleting the app but it wouldn’t work. every time i tried a video of donald trump laughing would pop up on my screen and would brighten my screen every time it popped up. it was so bright that i started to go blind. i grabbed my hand dandy clout goggles and immediately went to tiktok because that’s where all the answers are. i found out that there is a  password in order to deleted the app, it’s “Biden 2020.” luckily i got the password before tiktok is shut down for good. you may not be as lucky as me, so “if you value your loife” do NOT DOWNLOAD THIS APP AND VOTE BIDEN 2020 BECAUSE HE WILL SAVED US ALL. (also app store, there should be a zero stars button)","date":"2020-07-10T01:31:03Z"}},{"id":"6178932313","type":"user-reviews","attributes":{"title":"made my cow die","isEdited":false,"rating":1,"userName":"rip my cows","review":"ever since i downloaded this my cows on my farm have been dieing,sadly planing another funeral for monchooa.rip!","date":"2020-07-10T01:30:42Z"}},{"id":"6178931111","type":"user-reviews","attributes":{"title":"PHONE IS BROKEN!!","isEdited":false,"rating":1,"userName":"read me before downloading","review":"I downloaded the app, but by theshs next hour my phone zjwas automatically downloading IOS 14 which I ~<was staying away|. from. It is making my phONe glitch HORRIBLY. It also maazxskes my tzzzx3yping odd acnsd I-t d:)ownloaded l-/ots oF t-.ruMop aP.//s I  A lAberal N-3OW!!?&!","date":"2020-07-10T01:30:16Z"}},{"id":"6178927311","type":"user-reviews","attributes":{"title":"Who designs an app like this?","isEdited":false,"rating":1,"userName":"bryannagut","review":"I have just started learning how to code and design an app, and I could do better than this!! Wish I could give it 0 stars. So sad to see someone who has so much money put so little into his campaign.","date":"2020-07-10T01:28:47Z"}},{"id":"6178924252","type":"user-reviews","attributes":{"title":"AWFUL 🤮🤮🤮","isEdited":false,"rating":1,"userName":"justindweeber","review":"When I downloaded this app in support of our beloved president, my pet fridge decided to eat my window.  My 17 children all developed orange syndrome, and my wife of 2 seconds left me!  TRUMP IS A STINKY POOP HEAD! DUM DUM!","date":"2020-07-10T01:27:41Z"}},{"id":"6178923183","type":"user-reviews","attributes":{"title":"No❤️","isEdited":false,"rating":1,"userName":"a mad 12 yr old/ evie","review":"You look like a Cheeto \n\nwhy❓don't⌛we🔪just👽R͜͡E͜͡L͜͡A͜͡X͜͡X͜͡X͜͡X͜͡😩and🤬turn🦷on🦾the💅r̥ͦḁͦd̥ͦi̥ͦo̥ͦ📻 would👿you😼like💕卂爪爪爪爪👹or🤪 ቻጠጠጠጠ👺\n\nI😿can💅hear👂Daniel 👨🏻walking🚶down⬇️the 😾street🛣tap🦵tap🦵tap🦵tap🦵listen👂to✌️his👨🏻feet🦶\n\ni🥵climed🧭out🥫of👋my🔒head🤯and⛸watched⏰myself👈implode💥a👅thought💭without ❌a⚠️body💤 oughta🎤be🐝the🏎 shot🔫\n\nhave🤔you😒ever😔been😡snaked🐍by🙃a🤨 friend👧then😪just😾for 🤦the🗣️clout👀they'll😈do😣it😕again🙄","date":"2020-07-10T01:27:16Z"}},{"id":"6178922566","type":"user-reviews","attributes":{"title":"poop","isEdited":false,"rating":1,"userName":"hehehebrvrhrhrbd","review":"ur ass","date":"2020-07-10T01:27:02Z"}}]}