{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37790","data":[{"id":"6175089504","type":"user-reviews","attributes":{"review":"This app is vile it endorses the most repugnant, disgusting, shameful, oppressive, distasteful, racist, revolting, icky, gross, off-putting, stomach churning, appalling, sickening, uninviting, poor quality, ignorant, obnoxious, unsavory, grotty, foul, nasty, unpleasant, horrid, atrocious, mean, nauseating, hateful, ugly, mean, odious, disheartening, wack, dreadful, wicked, deplorable, diabolic, godawful garbage man shamefully elected in modern day.","title":"Worst of the worst","isEdited":false,"userName":"Akshdudbehbe","date":"2020-07-09T04:35:48Z","rating":1}},{"id":"6175085961","type":"user-reviews","attributes":{"review":"This app completely is not what I wanted.   No part of it made any sense at all.    Complete waste of time and storage on my phone.   Should be removed from the App Store completely.  Just WRONG.","title":"Waste of phone storage","isEdited":false,"userName":"jahgaohv","date":"2020-07-09T04:34:39Z","rating":1}},{"id":"6175080286","type":"user-reviews","attributes":{"review":"I would give this zero stars if I could. Completely useless and full of fake news. This app is trying to tell me that global warming is real. Like what? Fake news end of story. Terrible app","title":"Absolutely terrible","isEdited":false,"userName":"fierce_potato","date":"2020-07-09T04:32:53Z","rating":1}},{"id":"6175050650","type":"user-reviews","attributes":{"review":"as soon as my phone saw Trumps face my screen cracked 😡 my phone began to glitch and become extremely slow after downloading. the person behind the app is a horrible DISGUSTING human ✨ needs to be taken by Iran already 😴","title":"WORST APP I’VE EVER DOWNLOADED","isEdited":false,"userName":"DONALD 🤢","date":"2020-07-09T04:23:40Z","rating":1}},{"id":"6175047058","type":"user-reviews","attributes":{"review":"I’m pretty sure this app just collects data and information on its users and sends them to the government. Since I’m all for security, I can’t have an app like this. What if they use it to attack us?","title":"Steals data","isEdited":false,"userName":"Brady2349","date":"2020-07-09T04:22:35Z","rating":1}},{"id":"6175044074","type":"user-reviews","attributes":{"review":"This app has caused my phone to go super slow and glitch. It’s even caused my phone to lock up and shut down WHILE using it. This is by far one of these worst apps I’ve ever used.","title":"Horrible","isEdited":false,"userName":"wtfHAHA123","date":"2020-07-09T04:21:37Z","rating":1}},{"id":"6175026056","type":"user-reviews","attributes":{"review":"Reality is an illusion. Existence is a prison. I want out. The whole universe is just a litter box for a colossal cat and birds aren’t real. The walls have eyes. Save Betsy. Blue. Blue. Blue. Blue. Blue. Blue. I can’t escape this labyrinth in my brain. ROSEBUD. It’s balls in my mouth! Balls in my mouth. Let me ouuuuut. I want to be a gosh darn architect! Eucalyptus trees. Aieeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee.","title":"This app do be trippin","isEdited":false,"userName":"screenplay_boy","date":"2020-07-09T04:15:54Z","rating":1}},{"id":"6175008167","type":"user-reviews","attributes":{"review":"this app = absolute 🗑. I can’t stress this enough. Was greeted by a cheeto man, (i’m allergic to cheese) super insensitive. (im white btw). this app has traumatized me in a numerous amount of ways. I might have to get into therapy after what I have experienced. in conclusion, no❤️ that’s all✨","title":"absolutely not ❤️","isEdited":false,"userName":"akbdiwnsnw","date":"2020-07-09T04:10:16Z","rating":1}},{"id":"6175004053","type":"user-reviews","attributes":{"review":"asking for my phone number hell no like no sirrr that’s a stop. did y’all seriously think that i would give it and trust our president with it that looks like an orange oh no, also i don’t like trump either so :)))","title":"Worst app ever","isEdited":false,"userName":"luvdxddy","date":"2020-07-09T04:08:56Z","rating":1}},{"id":"6174999833","type":"user-reviews","attributes":{"review":"I had the app for about 2 sec. there was a ugly Cheeto on the screen. I will forever be terrified. Not to mention my phone completely glitch and broke. This app should not be legal I never wanna see it ever again.","title":"Terrible","isEdited":false,"userName":"lenda and heder","date":"2020-07-09T04:07:34Z","rating":1}}]}