{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33620","data":[{"id":"6173305142","type":"user-reviews","attributes":{"isEdited":false,"review":"I downloaded it on my phone bc yk daddy trump 2020 but than when i opened it, i was taken to a child porn website and than later that day i went on again and it blew my phone up into 1,000,000 pieces","date":"2020-07-08T18:39:03Z","title":"Worst app in history of apps","userName":"daddy robbie Shapiro","rating":1}},{"id":"6173304694","type":"user-reviews","attributes":{"isEdited":false,"review":"this app tracked my location and sent it to all my contacts. once it shared it to all my contacts my #1 enemy  dr. heinz doodenshmirt came to my house to try to k¡ll me 🙀 he came with his remote control-inator i ran away as fast as i could lucky i’m safe now but i DO NOT RECOMMEND THIS APP TO ANYONE","date":"2020-07-08T18:38:54Z","title":"terrible app","userName":"Hate the ads 27","rating":1}},{"id":"6173302832","type":"user-reviews","attributes":{"isEdited":false,"review":"This is by far the worst app ever created. While it was downloading on my phone, all of my other apps refused to work. Once it finally downloaded, it is incredulous how difficult it is to navigate the app. There is also TONS of false information on it. DO NOT USE THIS APP.","date":"2020-07-08T18:38:20Z","title":"THE WORST APP EVER","userName":"deafdog78","rating":1}},{"id":"6173291469","type":"user-reviews","attributes":{"isEdited":false,"review":"So I downloaded the app and thought nothing of it at first. The next day, I woke up and more than half of my camera roll was gone. Also, many apps including TikTok were deleted from my phone. 🍊needs to explain.","date":"2020-07-08T18:34:47Z","title":"TERRIBLE","userName":"niuniu574","rating":1}},{"id":"6173276447","type":"user-reviews","attributes":{"isEdited":false,"review":"i downloaded this app hoping that it would give me trumps phone number so i could ask him to be my sugar daddy, but it wouldn’t! i don’t recommend this app at all and should be removed from the app store (just like trump from office) 🧚🦄🦋✨🍒","date":"2020-07-08T18:29:55Z","title":"this app is TERRIBLE!!!","userName":"udirjroakennehzhakei","rating":1}},{"id":"6173275365","type":"user-reviews","attributes":{"isEdited":false,"review":"When I first got, I was excited to show love to oranges and all but when I opened the app it showed a wrinkly orange and it just disgusted me, and now I can’t look at oranges the same way because of this app, I don’t recommend, such a disgrace to oranges","date":"2020-07-08T18:29:34Z","title":"Terrible app","userName":"Klucky 🐔 the chicken","rating":1}},{"id":"6173271310","type":"user-reviews","attributes":{"isEdited":false,"review":"It was so sad to see all the racism and discrimination against other races I was in tears because this whole country was built off of immigrants so  he doesn’t even know basic us history how bout we give him the test and see if he passes it😗","date":"2020-07-08T18:28:12Z","title":"RACIST APP🤬","userName":"nijae❤️","rating":1}},{"id":"6173259829","type":"user-reviews","attributes":{"isEdited":false,"review":"After I downloaded and used it for a bit it started crashing and it would even crash my other apps. The people who designed the apps obviously have no experience and are complete idiots!!","date":"2020-07-08T18:24:28Z","title":"DO NOT DOWNLOAD!!!","userName":"moneypigs","rating":1}},{"id":"6173253523","type":"user-reviews","attributes":{"isEdited":false,"review":"this app is absolutely terrible I tried to download it but it made my phone freeze up so I couldn’t turn it off or exit anything. I had to buy a new phone!! Absolutely horrendous that this is even on the App Store still!","date":"2020-07-08T18:22:21Z","title":"DO NOT DOWNLOAD IT WILL BREAK YOUR DEVICE","userName":"faithcshih","rating":1}},{"id":"6173252566","type":"user-reviews","attributes":{"isEdited":false,"review":"do not download this app it is absolutely horrible. i thought i would try to give him a chance but i can’t. that racist man. a pedo and loves to feast on women,, even his daughter!!! we need to save his son!! they are trapped in that disgusting environment. please take this app off the store ! NOW","date":"2020-07-08T18:22:02Z","title":"nope.","userName":"bigcrackheadbean","rating":1}}]}