{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38160","data":[{"id":"6135393371","type":"user-reviews","attributes":{"date":"2020-06-29T10:39:52Z","title":"HORRIBLE!","rating":1,"isEdited":false,"userName":"Livvy8103","review":"This app is absolutely AWFUL!!! It glitches out my phone so much and I can barely use it anymore. I had to delete it after a while because it was just so buggy. I expected better 😔"}},{"id":"6134972188","type":"user-reviews","attributes":{"date":"2020-06-29T08:07:42Z","title":"still mad!!! awful app!!","rating":1,"isEdited":false,"userName":"use to be trump lover 😤","review":"i don’t know to to tech stuff but over all bad thought I would hear from my presdiant did not! Just weird people pretending to be him 😖😖😖😖 #fake didn’t get close to papi trump at all!!! still mad 😡"}},{"id":"6134832457","type":"user-reviews","attributes":{"date":"2020-06-29T07:13:13Z","title":"Trump gave me Corona!","rating":1,"isEdited":false,"userName":"kAReN hEa","review":"I thought this app would cure my corona... THAT WAS NOT THE CASE. The moment I opened it a hologram of trump (may he rest in peepeepoopoo) came up and COUGHED ON ME. I was so surprised at the god darn awful joke and had a heartattack! This is unacceptable especially from a previous president! I am upset!"}},{"id":"6134181548","type":"user-reviews","attributes":{"date":"2020-06-29T02:46:16Z","title":"DISGUSTING","rating":1,"isEdited":false,"userName":"Chacha421006","review":"soooo i downloaded this and it was the absolute worst like they asked for my number and email and a few hours later i got these texts and emails asking if i wanted to buy merch?? like ew no i’m poor so moral of the story don’t get this app. trumps a pig 🙈✨🥰"}},{"id":"6134057987","type":"user-reviews","attributes":{"date":"2020-06-29T01:58:00Z","title":"Do not recommend >:(","rating":1,"isEdited":false,"userName":"augaugaugaug","review":"When I downloaded this app, President trump himself came to my front door and roundhouse kicked my grandma and mother in the face. He spat on their bodies and danced back on the his private jet. I would not recommend if you love your family."}},{"id":"6134036555","type":"user-reviews","attributes":{"date":"2020-06-29T01:49:51Z","title":"God Awful App","rating":1,"isEdited":false,"userName":"thiccNana","review":"As a christian, this app is filled with fake news and as soon as i downloaded it, the app asked for my location and name. I feel like this is a scam but I’ll ask my granddaughter since she knows this technology stuff better. IT IS A SCAM BEWARE."}},{"id":"6133928731","type":"user-reviews","attributes":{"date":"2020-06-29T01:07:43Z","title":"HORRIBLE APP","rating":1,"isEdited":false,"userName":"ziro matsuda","review":"this app ruined my life. the moment i downloaded it, my house caught on fire and got launched into space with me still in it. i almost didn’t make it. luckily, i came back to earth safe and sound. but i’m still traumatized."}},{"id":"6131153276","type":"user-reviews","attributes":{"date":"2020-06-28T08:35:42Z","title":"terrible app","rating":1,"isEdited":false,"userName":"danihoho","review":"Im just pretty disappointed in this app as a whole. It was very underwhelming, did not function effectively, and was very confusing to use. Sad to say I definitely would not recommend :("}},{"id":"6122500981","type":"user-reviews","attributes":{"date":"2020-06-26T03:21:46Z","title":"trash","rating":1,"isEdited":false,"userName":"trump:(","review":"I would give this one star, but if I could give it zero I would. It forced me to look at Trump again, and that made me hate myself even more.\nDon’t waste your time.\nGen Z go hard on this get it down"}},{"id":"6121501594","type":"user-reviews","attributes":{"date":"2020-06-25T20:51:49Z","title":"AbSoLuTeLy DiSgUsTiNg","rating":1,"isEdited":false,"userName":"?!/)F:$&&U","review":"I downloaded this app not knowing what it was and when I opened it a very orange ape looking figure took over my screen and asked for my credit card information. And for those reasons, I’m out."}}]}