{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38720","data":[{"id":"6173435661","type":"user-reviews","attributes":{"title":"no❤️","isEdited":false,"rating":1,"review":"this app is horrendous😍 do not waste your time downloading it or using it!! everything about it is terrible i can not list one good thing about it. sadly the worse rating is 1 star it deserves less😁. BLM.","date":"2020-07-08T19:24:01Z","userName":"#freebarron"}},{"id":"6173427172","type":"user-reviews","attributes":{"title":"terrible terrible terrible","isEdited":false,"rating":1,"review":"terrible app if i could leave less than one star I could. took many hours to download and shut down my phone. we miss you bernie. goodbye president 🍤🍊","date":"2020-07-08T19:21:14Z","userName":"zoebianca004"}},{"id":"6173426675","type":"user-reviews","attributes":{"title":"This took four weeks to download","isEdited":false,"rating":1,"review":"I want to how orange god was going to make America white again so I downloaded this app and took four weeks like 🤯 by the time the app downloaded 90 percent of people where white 🤯","date":"2020-07-08T19:21:03Z","userName":"dbdhxjx"}},{"id":"6173425505","type":"user-reviews","attributes":{"title":"Bad App >:(","isEdited":false,"rating":1,"review":"It’s nothing like I heard about, i was told it was like tiktok but better but instead all I get are ads about singles in my area. Not only that but it crashes my phone and now I think it has a virus. Very bad app.","date":"2020-07-08T19:20:40Z","userName":"laodjw"}},{"id":"6173423261","type":"user-reviews","attributes":{"title":"wish i could give ZERO stars!!!","isEdited":false,"rating":1,"review":"THIS IS THE WORST APP EVER MADE! do not download this app unless you want donald trump to wake you up in your sleep! last night i was sleeping and i heard “fake news” whispered in my ear. i woke up and it was DONALD TRUMP himself! he stalked me to my house from this app to terrorize me!!!!!!","date":"2020-07-08T19:19:53Z","userName":"trumpsgrave"}},{"id":"6173423190","type":"user-reviews","attributes":{"title":"WORST APP EVER","isEdited":false,"rating":1,"review":"As soon as I opened up this app,  a 6ft tall man eating serpent crawled out of my phone screen and tried to attack me and my 3 children! Luckily i was able to trap the serpent in an alternate dimension but still a traumatic experience overall. Would NOT recommend.","date":"2020-07-08T19:19:51Z","userName":"poopsandwhcih287"}},{"id":"6173409410","type":"user-reviews","attributes":{"title":"WORST app EVER","isEdited":false,"rating":1,"review":"this app made my phone glitch like crazy AND it started to give me FAKE NEWS can you believe it?! i thought trump was all about real news but after downloading this app i know for sure he isn’t.","date":"2020-07-08T19:15:10Z","userName":"😡😑🔇"}},{"id":"6173384886","type":"user-reviews","attributes":{"title":"ALMOST DIED","isEdited":false,"rating":1,"review":"so I downloaded the app, and then right after I get a notification saying someone from the trump administration was outside of my house ready to kill. They proceeded to come into my house and drop kicked my hamster. #settleforbiden2020","date":"2020-07-08T19:06:22Z","userName":"shitonmychest1999"}},{"id":"6173380087","type":"user-reviews","attributes":{"title":"If I could put Zero stars- I WOULD","isEdited":false,"rating":1,"review":"This is would be fine if it had actual knowledge and not just plain ignorance to choose to believe these things on the app; overall- 🤮","date":"2020-07-08T19:04:41Z","userName":"angielopezzzz"}},{"id":"6173379456","type":"user-reviews","attributes":{"title":"disgusting","isEdited":false,"rating":1,"review":"i opened the app, and immediately felt a strong negative energy. i looked to my beloved dog for comfort, but when i brought my phone near him he began to growl at the phone. i feel very unsafe with this software on my phone. it feels like someone is collecting my data. when i downloaded the app my phone started bugging like crazy. my keyboard was lagging, and my camera would glitch all the time. do not use this app!!!","date":"2020-07-08T19:04:28Z","userName":"honeybobachild146"}}]}