{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=127300","data":[{"id":"6177799675","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"DO NOT GET THIS APP","review":"After I downloaded it and put in my information, not even 2 weeks later my instagram was turned into a trump fan page, this also happened to my twitter and Facebook. Not only that, but my Minecraft skin had a trumps face on it AND my username was changed to “grab me by the p***y 19” WHAT THE HECK IS GOING ON, I can’t believe this. IF THIS TWERP DELETS TIK TOK HE DOESNT KNOW WHATS COMING.","userName":"do not get this app or else","date":"2020-07-09T18:40:43Z"}},{"id":"6177798266","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"bad app","review":"I honestly thought this app was going to help me see about trump but it kept sending ads and it wasn’t working that good.Im also confused about what he is doing so yea.This app is getting me so many notifications and it’s very laggy..","userName":"yossiwer","date":"2020-07-09T18:40:18Z"}},{"id":"6177797216","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"frik u","review":"dear bunker boy,\nno❤️\nxoxo a child you would love to rape :p","userName":"peepeechomper","date":"2020-07-09T18:40:00Z"}},{"id":"6177797107","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"ewwww","review":"poop","userName":"MatisseH","date":"2020-07-09T18:39:57Z"}},{"id":"6177796641","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Hacked","review":"I opened this app for the first time and the first thing it did was steal my credit card information, they are now using my information to buy things off amazon shipping it to the president","userName":"Captain Funboy","date":"2020-07-09T18:39:48Z"}},{"id":"6177795556","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Honest Review","review":"Attention: If you or a loved one has been diagnosed with Mesothelioma you may to be entitled to financial compensation. Mesothelioma is a rare cancer linked to asbestos exposure. Exposure to asbestos in they Navy, shipyards, mills, heating, construction or the automotive industries may put you at risk. Please don't wait, call 1-800-99 LAW USA today for a free legal consultation and financial information packet. Mesothelioma patients call now! 1-800-99 LAW USA","userName":"IDOOKIEDMYSELF","date":"2020-07-09T18:39:28Z"}},{"id":"6177795450","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"False advertising","review":"I downloaded this app with the expectation to receive the royalties that come with being in the Republic party. I was expecting my taxes to be cut, enough “hush money” to rape women, my stocks to be sky rocketing, and a 3 million dollar mansion to show up in the Bahamas under my name. What I was given was a terrible application, an orange testicle shown everywhere, and AIDS. HOW DID AN APP GIVE ME AIDS?!!! I have no idea, but I will be suing the establishment and i will only be given a settlement if Tik Tok survives.","userName":"Whereyaatfuture","date":"2020-07-09T18:39:26Z"}},{"id":"6177794478","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Overall horrible","review":"This app is very glitchy and overall horrible. As well as the people that made this app have an immense amount of images that use a gross use of the American flag. They many times present things that are very much against flag code.","userName":"Gxjrfndndfndd","date":"2020-07-09T18:39:08Z"}},{"id":"6177792352","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Trump","review":"Hey bro I don’t have any money to go get you guys to come get back with you bruh bruh was the day I got it I was gonna was the night you got me a I wanna is a time to be shy to go get on the way home from the house I don’t have a lot to say to me you can do that I wanna was the night you got me a  I wanna is a time for y’all I love y’all and I’m gonna was the day I was just sitting here watching it I was gonna was the day you got me to you go   bro love y’all too bye love ya bro bye bye bro bro I’ll talk to y’all later tonight and I will is a time to go get out the house I’ll be on my yt right here love y’all and love y’all too bye love y’all too I’ll dm was a time for me a  I yyyyyyy wanna is a good time for me a dm was the night I was just wondering what you gonna dm you mean I was  hhhhhhhhj iioiiioi wwas you like you wanna is this one time to be","userName":"Cachexia","date":"2020-07-09T18:38:29Z"}},{"id":"6177791481","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"I hate it soo much and trump","review":"So I downloaded this cause I don’t like trump and he wants to delete tik tok. This app is so bad I hate this app. I don’t like his it’s soo bad. I hate it soo much.bye","userName":"Valeriascobaresvobar2468","date":"2020-07-09T18:38:14Z"}}]}