{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27450","data":[{"id":"6174793297","type":"user-reviews","attributes":{"date":"2020-07-09T03:05:20Z","isEdited":false,"title":"0 Stars!!!","review":"This app is horrible! It glitched so bad I opened it and there was just a picture of a big Cheeto. I don’t even like Cheetos because when you eat them there’s fake cheese all over your fingers and it’s like??? What do I do??? What if I don’t have a napkin?? So embarrassing. Horrible app. Do not recommend.","userName":"Callan Napier","rating":1}},{"id":"6174788722","type":"user-reviews","attributes":{"date":"2020-07-09T03:03:56Z","isEdited":false,"title":"not cash money at all","review":"this app sucked super bad, not only did it teleport me to doodoo island, but it gave me instructions to build a massive trump statue. Naturally i was not having ANY of this, so i built a statue of an ugly orange instead. long story short don’t install this or support trump unless you want to end up on doodoo island with all the MAGA idiots","userName":"sxcooby_doo","rating":1}},{"id":"6174776966","type":"user-reviews","attributes":{"date":"2020-07-09T03:00:18Z","isEdited":false,"title":"It doesn’t work","review":"Your phone will catch on fire due to this app. I feel bad for the people who went through the traumatizing experience.\nI wish Trump could do something to make the app better, but unfortunately he died due to Hydroxychloroquine overdose. #riptrump","userName":"Bdsah","rating":1}},{"id":"6174766484","type":"user-reviews","attributes":{"date":"2020-07-09T02:57:07Z","isEdited":false,"title":"Very Unreliable","review":"I have been using this all for transportation. My rides never show up and the GPS led me to an abandoned crack house. I deleted the app for a while and I recently came back to give this app another shot. I tried to walk my dog with this app but it led me to a slaughterhouse. Again, very dangerous.","userName":"abbbbbbbbbiiiiiiiiiii","rating":1}},{"id":"6174764399","type":"user-reviews","attributes":{"date":"2020-07-09T02:56:28Z","isEdited":false,"title":"Hejsjekdkfkfl","review":"This app is terrible I went to the store and then my phone exploded right after I downloaded this app I can’t believe it now I have to get a new phone I’ll because of this dumb app this is so unhelpful and I can’t believe this is the only getting one star","userName":"djmnekekwkaindbdndkdk","rating":1}},{"id":"6174755480","type":"user-reviews","attributes":{"date":"2020-07-09T02:53:45Z","isEdited":false,"title":"I HATE THIS APP ITS THE WORST","review":"This app had so many bags and glitches that I could barely understand it. The screen kept clicking off and messing up my phone and overheating it. I think it should be deleted and don’t recommend it to anyone unless you want to mess up your phone.","userName":"Kytiere","rating":1}},{"id":"6174728312","type":"user-reviews","attributes":{"date":"2020-07-09T02:45:29Z","isEdited":false,"title":"COMPLETELY RUINED MY PHONE","review":"If you want to glitch ur phone and have some sort of tracking system... I WANTED TO FEEL SAFE NOT LIKE IN IN DANGER also it stole my money and my bank account- I ordered a lap top and a stylist with it, and now it’s not being sent after I payed what is this- I wanted to have my stuff not have it canceled and payed...","userName":"sjauxjrhdidjsjdhd","rating":1}},{"id":"6174722248","type":"user-reviews","attributes":{"date":"2020-07-09T02:43:41Z","isEdited":false,"title":"DO NOT DOWNLOAD!!!","review":"I REALLY loved this app when I first downloaded it, but after a while I got hit by a car. Later on, my mom started using the app and then she also got hit by a car!! Then, my dad started using it.... AND HE GOT HIT BY A CAR. As a warning to everyone who is considering downloading this app, DO NOT DO IT. THIS APP GETS YOU RUN OVER!!!!!!","userName":"ABlueSeaslug","rating":1}},{"id":"6174718484","type":"user-reviews","attributes":{"date":"2020-07-09T02:42:33Z","isEdited":false,"title":"Terrible!!","review":"This app tricks you with its name, app glitches out and kicks you out as soon as you open it! Very uninformed app too, it contains false information to its users! FAKE APP!! I have never been so upset! There is even full evidence that it tracks your phone and steals personal information! DO NOT INSTALL THIS APP!!","userName":"risottostitties","rating":1}},{"id":"6174706857","type":"user-reviews","attributes":{"date":"2020-07-09T02:39:00Z","isEdited":false,"title":"WORST APP EVER EVER","review":"every time i opened the app i got a weird feeling and then a huge thing would jump out of my closet, it is the worst app ever it is definitely cursed it makes me depressed and sad i hate it, and also trump if you see this don’t take down tiktok cause we will take down you app first 😍🥳📉","userName":"sophia....heart","rating":1}}]}