{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26720","data":[{"id":"6072820487","type":"user-reviews","attributes":{"date":"2020-06-14T01:19:01Z","title":"The WORST","rating":1,"isEdited":false,"userName":"Rachel McG","review":"The worst experience I’ve ever had using an app. The functionality is slow, not smooth. I feel ill every time I use it. My eyeballs burn every time I look at the app. Remove it for the health and safety of the world. The racism in this app seems to be seeping into my other apps and my everyday life."}},{"id":"6062113097","type":"user-reviews","attributes":{"date":"2020-06-11T08:31:31Z","title":"Help","rating":1,"isEdited":false,"userName":"Robert Gdoviak","review":"I was having a walk in the park with my hot dog Deborah when I stumble across a box and I was snatched into the box and I woke up all alone in the Nevada desert hearing desperate whispers of Chester the cheetah himself asking me to donate I’ve recently come to find my friends have been stuck in this hole eating creamy cereal with this random kid named saucy who liked pickled eggs"}},{"id":"6061207814","type":"user-reviews","attributes":{"date":"2020-06-11T02:32:34Z","title":"a great disappointment","rating":1,"isEdited":false,"userName":"Allie and Kay","review":"downloaded because I thought I would be getting quality, accurate news hand picked by my king of kings, trumpywumpy but the app kept crashing and they only posted bullsh** articles! they didn’t even post anything about his sexy bod!"}},{"id":"6060935909","type":"user-reviews","attributes":{"date":"2020-06-11T00:48:13Z","title":"Disappointed","rating":1,"isEdited":false,"userName":"Something Not Clever","review":"I’m really disappointed with this app. I thought it would be a good representation of what America needs right now. Instead it just preys on the uneducated population, and promotes FAKE NEWS. We really do need to MAKE AMERICA GREAT AGAIN by supporting the members of our community who have been FAILED by our lack of SOCIALIST support systems."}},{"id":"6057310557","type":"user-reviews","attributes":{"date":"2020-06-10T04:16:20Z","title":"Do not download this app","rating":1,"isEdited":false,"userName":"abbiquail","review":"This app broke my phone, as soon as I downloaded it my phone died and I got a new one, as soon as I got the new one obviously the first app I wanted to download this app again just to make sure and then THAT phone broke. Very angry. -5/10 just like the size of Donald’s third leg"}},{"id":"6048666122","type":"user-reviews","attributes":{"date":"2020-06-07T23:56:11Z","title":"Anonymous2020","rating":1,"isEdited":false,"userName":"ur not invited to the bbq","review":"This app is just horrible.. An app for an orange?? Minus well make apps for pineapples or grapes. just disgusting. For whoever voted for the orange man is probably not okay in the head. This man is trying to take away our rights. This is no longer a fight between demarcate or republican, it’s racist against non racist. This app should be removed immediately!!"}},{"id":"6043223483","type":"user-reviews","attributes":{"date":"2020-06-06T15:50:59Z","title":"It doesn’t even deserve 1 star","rating":1,"isEdited":false,"userName":"tiktok204","review":"It doesn’t even work. I tried clicking on things but it just said error try again. I’m pretty sure it’s because it’s an app made for a rotten Cheeto. Not only is his color a Cheeto so is his dïck like how does he even have children and why is it so small?"}},{"id":"6179153017","type":"user-reviews","attributes":{"date":"2020-07-10T02:51:33Z","title":"Dont download this app","rating":1,"isEdited":false,"userName":"Cookie Littel","review":"I was going to get the big cheeto’s app when all of the sudden when it down loaded nudes of the big Cheeto appeared on my phone and sent them to all my contacts, then my house and phone dissolved into the air so I’m currently writing this review on the street"}},{"id":"6032303067","type":"user-reviews","attributes":{"date":"2020-06-04T02:17:11Z","title":"Love it!  Learned about it from Fox Business.","rating":5,"isEdited":false,"userName":"One240sx","review":"Glad to have it on my phone."}},{"id":"6179214847","type":"user-reviews","attributes":{"date":"2020-07-10T03:14:20Z","title":"Great app","rating":5,"isEdited":false,"userName":"Hue genis","review":"The greatest purchase on the App Store I have ever made. Gives you updates and directly to the trump merchandise. 🇺🇸Trump 2020🇺🇸"}}]}