{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=5980","data":[{"id":"6175068875","type":"user-reviews","attributes":{"date":"2020-07-09T04:29:20Z","isEdited":false,"userName":"playboi carton of milk","review":"This app is the ell stupido, I went to McDonald’s to get a Wendy’s burger but they told me that this is McDonald’s and that i would have to go to Wendy’s to get that , outraged I asked for the manger cuz I’m a karen named Karen, then after he came out he said playboi Carton of milk the famous rapper playboi carton of milk, so in shock I followed him and there was no playboi carton of milk on a playboi carton of milk so I called the cops and they just die cuz I shot them, like I thought u were a cop but then trump called me on FaceTime and told me to get this app and then he appeared and told me playboi carton of milk was a lie so I cried and then I deleted the app, I DONT RECOMMENDATIONS THIS APP CUZ IT MEAN THINGS ME. Fin-","title":"Dumb App","rating":1}},{"id":"6175044967","type":"user-reviews","attributes":{"date":"2020-07-09T04:21:54Z","isEdited":false,"userName":"Mike Whochee","review":"The FitnessGram Pacer Test is a multistage aerobic capacity test that progressively gets more difficult as it continues. The 20 meter pacer test will begin in 30 seconds. Line up at the start. The running speed starts slowly, but gets faster each minute after you hear this signal: BEEP. A single lap should be completed each time you hear this sound: DING. Remember to run in a straight line, and run as long as possible. The second time you fail to complete a lap before the sound, your test is over. The test will begin on the word start. On your mark, get ready, start.","title":"STINKY POO POO APP","rating":1}},{"id":"6174892511","type":"user-reviews","attributes":{"date":"2020-07-09T03:34:25Z","isEdited":false,"userName":"weewee peepee kaka","review":"Next week I was at the store with my little sister that’s older then me by a few months and we were getting crackers for are cheese but I don’t do crack, and I don’t like the 49ers and I don’t like cheese I’m not 6ixnine so we went to a different store down the street but it was the same store we just went back in, and we seen a guy doing a magic trick and make the card disappear but then a cow spawned in the store and I got on him and he had wings so we flew to my house but I owe money to the irs so the bank took my house so I went to the farm to live with the cow awith friends","title":"DO NOT DOWNLOAD!","rating":1}},{"id":"6174879709","type":"user-reviews","attributes":{"date":"2020-07-09T03:30:43Z","isEdited":false,"userName":"Viper9789","review":"I downloaded this app with my grandma so we could find out the next location of the trump rally so we could support the big man in charge. We ended up being met with trumps big body being spray tanned along with his tiny shmeet! It was so vile I ended up vomiting up blood! My grandma had a heart attack!! So we emailed them the complaint about the app and trump came to our house with his twin the annoying orange and called us thugs. Then, he proceeded to roundhouse kick my grandma out of her wheelchair and into the wall he built!! He also spit on me and gave me the coughcough! DO NOT DOWNLOAD THIS APP.","title":"So disappointed😢😔","rating":1}},{"id":"6174875913","type":"user-reviews","attributes":{"date":"2020-07-09T03:29:37Z","isEdited":false,"userName":"Not able to tweet","review":"Oh my goodness this app could not be any worse than anything I’ve ever used before. My entire house was robbed by bandits dressed up like trump. Once it was on my phone my entire phone broke, shattered into 1 million pieces. My dog ran away and my cat moved to another country. This app should be eradicated from the face of the earth to ensure safety and protection for all. This app will cause the San Andreas Fault to break, and because the guys are in Yellowstone too irrupt plunging us into a eternal winter. So for the safety of not only this country but for the rest of the world this app should be gone.","title":"JESUS didn’t die for this app","rating":1}},{"id":"6174843489","type":"user-reviews","attributes":{"date":"2020-07-09T03:20:05Z","isEdited":false,"userName":"Alexasrate","review":"Being the president and how he is, I was dying to see his amazing app, cause I am a “DIEHARD REPULICAN” I would do anything for Trump, when I see anything I mean anyTHING. But this app made me have diarrhea and puke for days, the things they teach on this app made me want to cry myself to sleep. I ended up going to the hospital because of it. I’ve never seen anything worse and the overall design makes me want to barf. I cried and laughed at the stupidity of this man. I will be voting blue and returning my karen voice. I now pledge blue for life. This app made me wish I wasn’t a republican and that’s a big thing.","title":"I’VE NEVER SEEN A WORSE APP","rating":1}},{"id":"6174833298","type":"user-reviews","attributes":{"date":"2020-07-09T03:17:04Z","isEdited":false,"userName":"1758425783","review":"It is the worst app on the App Store I really do suggest to not get it. I never write reviews on apps but this one is just horrible. Like it’s about trump like that should say enough! If you want to “make America great again” then shut up stop saying that Bc America has never been great since y’all white ppl showed up and took over. Y’all need to educate yourself and grow up. Yeah I’m taking to you KAREN! Trump is the worst person ever! And it’s not a opinion it’s a fact. Also I saw that ppl where getting glitches from the app in other reviews so yeah that’s also a problem.","title":"DO NOT DOWNLOAD!!!!","rating":1}},{"id":"6174814557","type":"user-reviews","attributes":{"date":"2020-07-09T03:11:37Z","isEdited":false,"userName":"goBiden2020","review":"This app is very very very very disappointing. I’ve never been so disappointed by an app in my life. And I’ve downloaded tinder before. This is even moreeee disappointing than tinder. Anyways, as soon as I opened the app it started glitching and running extremely slow. At one point I opened the app and it kept showing me these pictures of a Cheeto puff in a wig and telling me to go back to Mexico. I am so dissatisfied with this app. Do not download it. It’s just a waste of space and time. Thank you for coming to my TED talk everyone and remember to never download this app!!! 😘😚😂","title":"Garbageeee","rating":1}},{"id":"6174734864","type":"user-reviews","attributes":{"date":"2020-07-09T02:47:27Z","isEdited":false,"userName":"cas121212","review":"This app was the worst to download. It was so glitchy and made my phone shut down several times when I would try and open it. Honestly tried to give me a virus. How do we know this app isn’t trying to steal our data with this glitchy app. I don’t trust these apps anymore. Trying to steal information from my phone. I thought I could trust an app coming from the Donald Trump but it honestly seems like he’s the one trying to steal data. I can not believe this. I will never even think about downloading an app from him anymore!","title":"This app is so bad","rating":1}},{"id":"6174728201","type":"user-reviews","attributes":{"date":"2020-07-09T02:45:27Z","isEdited":false,"userName":"howardddfffffffdddddd","review":"immediately after downloading this app I got a terrible virus on my phone that added a toupee to EVERY picture of a person. it must have some sort of facial recognition software built into the virus. it also immediately began giving my phone number to dangerous organizations who will not stop spamming my texts with hate messages and propaganda. this app is absolutely awful it has stolen all my data and now I can’t look at instagram without seeing a toupee on the head of every friend and loved one. I think this is giving me serious long term trauma.","title":"DO NOT DOWNLOAD ITS A VIRUS","rating":1}}]}