{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30310","data":[{"id":"6178252613","type":"user-reviews","attributes":{"review":"Idk why but I opened the app for less than a minute and my phone crashed instantly... I sadly was unable to use said app without phone crashing so had to delete it and this is why I hav elegy a 1 star review","isEdited":false,"date":"2020-07-09T21:09:45Z","userName":"gen ZZZZZZZZZZZZZZZZZZZZZZZZŹ","title":"App made my phone crash","rating":1}},{"id":"6178199583","type":"user-reviews","attributes":{"review":"Hello,  when i first opened the app ,i saw the cheetos nudes i was 🌸✨DISGUSTED✨🌸  another thing , as soon as i put my phone away i started to think rasist and ignorant thoughts i was starting to get a bit worried so i had to delete the app. this app is brainwashing people i do not recommend (.)","isEdited":false,"date":"2020-07-09T20:50:48Z","userName":"idbrxvsa","title":"this is ✨BAD✨","rating":1}},{"id":"6178195893","type":"user-reviews","attributes":{"review":"the second i opened the app i felt something change and i suddenly found myself finding underage girls attractive and wanted to sexually assault them it also severely lightened my skin being on the app and i now repeatedly say racist and ignorant things DO NOT GET THIS APP IT WILL RUIN YOUR LIFE","isEdited":false,"date":"2020-07-09T20:49:28Z","userName":"visella","title":"worst app ever very dangerous","rating":1}},{"id":"6178194343","type":"user-reviews","attributes":{"review":"I thought if I downloaded this app, then I could contribute to making America great again. That’s what it said I could do. Turns out it doesn’t actually do that because you can only contribute to the Trump campaign. Very misleading, such lie.","isEdited":false,"date":"2020-07-09T20:48:56Z","userName":"whita_dc","title":"Let Down","rating":1}},{"id":"6178193428","type":"user-reviews","attributes":{"review":"this app is horrible and disgusting i can’t believe it is even allowed on here. it crashes every 2 seconds and took forever to download. The app is so slow you can’t do anything and it made my whole phone glitch like for real. DO NOT DOWNLOAD THIS APP!!","isEdited":false,"date":"2020-07-09T20:48:38Z","userName":"Desdesdes1234","title":"TERRIBLE!!!","rating":1}},{"id":"6178176315","type":"user-reviews","attributes":{"review":"i would leave 0 stars if i could. this is TERRIBLE. doesn't work useless good for nothing app. i hate it. i downloaded only to see if it did anything but nope. uninformative unhelpful and completely fake news. get this app off the store. also trump is a rapist perophile.","isEdited":false,"date":"2020-07-09T20:42:39Z","userName":"MissJuliaJue","title":"WORST APP ON HERE","rating":1}},{"id":"6178176035","type":"user-reviews","attributes":{"review":"mr. cheeto man’s app gave me night terrors🤧it caused me terrible sleep paralysis and next thing i know,,,,ERIC TRUMP WAS SUCKING MY TOES AT THE END OF MY BED😭 aside from that i think i contracted every std known to humanity from this app ALONE. crabs, herpes, HIV, chlamydia, the whole nine yards🥰on top of all of that, my pet cat is homophobic/transphobic/xenophobic/racist from being exposed to this AWFUL, DISPICABLE, DISGUSTING, FOWL, SICKENING APP. I DEMAND COMPENSATION‼️‼️‼️","isEdited":false,"date":"2020-07-09T20:42:34Z","userName":"lovelypeachesmusic1000💖","title":"awful🧿👄🧿","rating":1}},{"id":"6178168336","type":"user-reviews","attributes":{"review":"Strumming my pain with his fingers\nSinging my life with his words\nKilling me softly with his song\nKilling me softly with his song\nTelling my whole life with his words\nKilling me softly with his song\nI heard he sang a good song, I heard he had a style\nAnd so I came to see him, to listen for a while\nAnd there he was, this young boy, a stranger to my eyes\nStrumming my pain with his fingers\nSinging my life with his words\nKilling me softly with his song\nKilling me softly with his song\nTelling my whole life with his words\nKilling me softly with his song","isEdited":false,"date":"2020-07-09T20:39:58Z","userName":"hisokasmassicebussy","title":"sangwoo","rating":1}},{"id":"6178166154","type":"user-reviews","attributes":{"review":"everything about this app is terrible. as soon as you launch it it sits and loads for over 10 minutes then as soon as it finally opens a walking \nport-a- potty starts to talk about Mexicans and the wall and the women and girls he has hurt. it’s terrible.","isEdited":false,"date":"2020-07-09T20:39:13Z","userName":"madion is taken","title":"Whole lotta bs","rating":1}},{"id":"6178163208","type":"user-reviews","attributes":{"review":"I know for a fact that this app, without my permission, has been stealing my data information. Now I get CHUMP ads on every platform. Apple should take this app down since it’s stealing my information.","isEdited":false,"date":"2020-07-09T20:38:13Z","userName":"dhsnejb","title":"This app gathered my information","rating":1}}]}