{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=130880","data":[{"id":"6174482526","type":"user-reviews","attributes":{"rating":1,"title":"-1000/10","date":"2020-07-09T01:34:54Z","isEdited":false,"userName":"theanonoymousreviewer","review":"ew this app is awful. as soon as i opened the app it stole $300 from my bank account and sent my grandmother death threats. After calming her down the app spread hateful racist, homophobic, islamophobia, and misogynistic words. don’t download or vote for trump please."}},{"id":"6174482390","type":"user-reviews","attributes":{"rating":1,"title":"EWW","date":"2020-07-09T01:34:52Z","isEdited":false,"userName":"junkkok my daddy","review":"This is literally the worst app I have ever downloaded! The pictures one there were disturbing and I HATE IT, I would rate this app .00000000000000000000001 star If I could brb ima throw up real quick 🤮🤢"}},{"id":"6174482502","type":"user-reviews","attributes":{"rating":4,"title":"This app is horrible","date":"2020-07-09T01:34:54Z","isEdited":false,"userName":"take down this app now","review":"First it shows a orange thing that just popped out of no where it was so crazy it was the annoying orange no cap.Don't download this app it’s relly bad \n\n#tiktok"}},{"id":"6174481929","type":"user-reviews","attributes":{"rating":1,"title":"DISGUSTING","date":"2020-07-09T01:34:44Z","isEdited":false,"userName":"ALYSSA😘🤮","review":"i was so excited to download this app because my favorite letter was T and i thought it would be a fun game or something, but sadly i was wrong. when i opened this app i saw this strange Oompa Loompa talking about some weird stuff and he sounded so stupid it gave me a headache to the point where i had to go to the hospital because it was that bad. it also gave me a virus on my phone and everytime i charge my phone a picture of a cheeto comes up and it scares me every time. i’m so disgusted with this app i might as well throw my whole phone away and maybe get an android or something."}},{"id":"6174480108","type":"user-reviews","attributes":{"rating":1,"title":"They HARASSED my DAUGHTER","date":"2020-07-09T01:34:15Z","isEdited":false,"userName":"thickynicki🔥","review":"Me ( a 65 year old woman ) was downloading this app when all of a sudden they started asking for my PERSONAL information. When I refused to put down my personal information the secret service showed up at my door along with the military,they knocked down my DOOR 🚪 and broke all of my windows . While they where doing this my daughter was asleep. (Keep in mind this all happened at 2:30am). They went into my daughters room and punched her in the face😱( she started bleeding 🩸 ) . I was extremely unhappy 😡 so I proceeded to take off my clothes and wrestle the secrets serves ( things got slippery ) . They soccer punched me in the face so I dropped kick one of the military personal.My pet dinosaur proceeded to eat one of the agents. They started to back away and there I was “ naked and afraid” . My flying pig 🐷 came out of the chimney and grabbed my phone this app was open and started to squeal in agony my flying pig then fell down the stairs and died 😭 the secret surveys and military proceeded to walk down the stairs and picked him up then took him  outside and proceeded to cook my flying pig on MY grill . Meanwhile I was on top of the stairs naked and my daughter was still bleeding I still managed to get my phone and when I picked it up I saw a Cheeto puff 🟠with a  Tupè and pink thong 👙holding a bong 🚬.So that’s why I had to get my eye surgically removed 👀🚫. That’s why I DONT recommend downloading this app !!!!!!"}},{"id":"6174479984","type":"user-reviews","attributes":{"rating":1,"title":"Killed my cat!!!!","date":"2020-07-09T01:34:13Z","isEdited":false,"userName":"lotioneater","review":"As soon as I opened up the app, Donald J. Trump popped up on the screen. He began yelling all kinds of racial slurs and obscenities at me. I started crying and begged him to stop, but he just told me to shut the f!ck up, then teleported out of the phone and materialized in front of me!! When his corporeal form became complete, he took my face in between his hands and slammed my head into his knee. I was writhing on the ground in pain when he started speaking latin. Donald’s eyes were glowing red and the crucifix my grandma gave me caught on fire. The blood pouring out of my nose from our knee-to-face collision began to float and formed tiny droplets all around us. Then my cat, who was watching the interaction from the doorway, started levitating toward Donald. Once my precious baby reached him, he cut her open with a knife (pulled from his third fat role) and drank all her blood. He returned back to the phone once my cat was completely empty. He really grabbed my p!ssy :( Overall a bad experience with this app!"}},{"id":"6174479838","type":"user-reviews","attributes":{"rating":1,"title":"Ogre in Chief","date":"2020-07-09T01:34:10Z","isEdited":false,"userName":"bunkybear04","review":"⢀⡴⠑⡄⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠸⡇⠀⠿⡀⠀⠀⠀⣀⡴⢿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠑⢄⣠⠾⠁⣀⣄⡈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⡀⠁⠀⠀⠈⠙⠛⠂⠈⣿⣿⣿⣿⣿⠿⡿⢿⣆⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⡾⣁⣀⠀⠴⠂⠙⣗⡀⠀⢻⣿⣿⠭⢤⣴⣦⣤⣹⠀⠀⠀⢀⢴⣶⣆ ⠀⠀⢀⣾⣿⣿⣿⣷⣮⣽⣾⣿⣥⣴⣿⣿⡿⢂⠔⢚⡿⢿⣿⣦⣴⣾⠁⠸⣼⡿ ⠀⢀⡞⠁⠙⠻⠿⠟⠉⠀⠛⢹⣿⣿⣿⣿⣿⣌⢤⣼⣿⣾⣿⡟⠉⠀⠀⠀⠀⠀ ⠀⣾⣷⣶⠇⠀⠀⣤⣄⣀⡀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠉⠈⠉⠀⠀⢦⡈⢻⣿⣿⣿⣶⣶⣶⣶⣤⣽⡹⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠉⠲⣽⡻⢿⣿⣿⣿⣿⣿⣿⣷⣜⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⣶⣮⣭⣽⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣀⣀⣈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠿⠿⠿⠿⠛⠉                               \n\nNot the face I was expecting to see. I am horrified that they would allow such things on a serious political platform."}},{"id":"6174479455","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE, INSTANT REGRET","date":"2020-07-09T01:34:04Z","isEdited":false,"userName":"dddawggg","review":"The moment I opened the app, I saw a horrible, disgusting, human being. My eyes cannot unsee that. I am very scarred and will need therapy to get rid of what I just saw. Anyone that plans to download this... take this as your warning. If you have the app, rate it 1 STAR. NOT WORTH IT. Disgusting. Together we shall tear this app down. Donald trump Smd. 😝 alright."}},{"id":"6174479205","type":"user-reviews","attributes":{"rating":1,"title":"tremendously horrible","date":"2020-07-09T01:34:00Z","isEdited":false,"userName":"every organism in the universe","review":"i deleted the app after seeing a weird looking cheeto sweating and attempting to lift its fist. i never knew a cheeto could look so evil yet tremendously constipated at the same time. i wish there was a way to give a -273859393 star rating :("}},{"id":"6174478600","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT DOWNLOAD AND DO NOT SUPPORT","date":"2020-07-09T01:33:49Z","isEdited":false,"userName":"Anna B 💖","review":"Downloading this app was the WORST decision i’ve ever made. Even worse that deciding to marry my ex husband, Alejandro. Upon opening the application, you are greeted with a slide show of various pictures and videos on pornography. The worse part is, you cannot skip it. After that, it asks for your full identification. It asks for your full name, date of birth, email address, mobile and home phone number, credit card number and social security number! It is an absolute invasion of privacy. Though it was suspicious, I followed each step because I trusted our President. After entering all your information and entering a verification code, you’re transported to an Instagram type of format app. As you scroll, many accounts post different pictures of our President. Some of the accounts include: @trumpsupporter69420, @trumpeatmypu$$y883, and @trumpsgianthorsecock. They have posted pictures of him an various positions and different angles. It’s been a day since I’ve submitted my information, and I’ve come to believe that my identity  has been stolen? My credit card statement shows that I have spent $4,000 USD on adult sex toys and various different cheetah print articles of clothing. My email has been flooded with thousands of emails from people names Phil McCrackin, Drew P. Weiner, and Holden Tudix. And whilst writing this review, I’ve received 7 bogus phone calls from abortion clinics, funeral homes, and Applebees Bar & Grill. I had so much hope for the future of our country, and I really supported our President. I never understood my Generation Z has such a problem him, but I am suddenly starting to realize why. Donald Trump has lost another vote. My daughter is telling me to say to please save First Lady Melania Trump and Barron Trump from Donald. According to her, they need to be saved the most. She also says to use Barron’s preferred pronouns (they/them) #BERNIE2020"}}]}