{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=90330","data":[{"id":"6174384368","type":"user-reviews","attributes":{"title":"No bueno","date":"2020-07-09T01:05:23Z","userName":"#tiktok #foryou","rating":1,"isEdited":false,"review":"I would’ve expected more from my president too bad xue hua pio pio bei feng shaio shiao"}},{"id":"6174381298","type":"user-reviews","attributes":{"title":"EWWW","date":"2020-07-09T01:04:29Z","userName":"Aves101","rating":1,"isEdited":false,"review":"DISGUSTING!! I opened the app to see a cheeto, followed by so many other gross disgusting things."}},{"id":"6174380783","type":"user-reviews","attributes":{"title":"Worst Decision","date":"2020-07-09T01:04:19Z","userName":"Mserna33","rating":1,"isEdited":false,"review":"This app is the worst app I have ever downloaded."}},{"id":"6174370380","type":"user-reviews","attributes":{"title":"OFFENSIVE!!","date":"2020-07-09T01:01:07Z","userName":"wiiwonder1","rating":1,"isEdited":false,"review":"VERY offensive content they show on this app. I’d give it a 0 if I could!"}},{"id":"6174360665","type":"user-reviews","attributes":{"title":"This app left my goldfish in critical condition!! DO NOT DOWNLOAD","date":"2020-07-09T00:58:01Z","userName":"FishLover875","rating":1,"isEdited":false,"review":"You heard me right, this app almost killed my lovely, light of my life, one in a million goldfish, Tammy. I was scrolling through when suddenly a loud alarm went off saying the words “VOTE DONALD TRUMP” over and over again, full volume! At the time I had my phone hooked up to the biggest speaker I could find because me and Tammy were listening to our favorite song “100 hours of complete silence” and Tammy’s bowl was on top of the speaker, so when this obnoxious, crude, assault to my ears started blasting, the vibrations started shaking Tammy’s bowl! And Tammy is a very easily scared fishy, so with the shaking and the noise she went into cardiac arrest! So here I am, with a dying fish, that’s slowly getting shook off the speaker, and I’m looking for how to shut if off, THERE. WAS. NO. OFF. BUTTON. so now I’m crying cause Tammy’s bowl is about to fall off the speaker and shatter everywhere. In my panic I closed the app- it continues, I turned off my phone, it continues, I shut my phone completely off, and it continues! I can’t hear anymore and the only way I know it’s still playing is Tammy has just been jiggled off the speaker and her bowl has exploded all over the floor! But it doesn’t stop there, I still need to get this speaker off because the speaker is now rattling it’s way forward to crush Tammy! Finally, with my ears bleeding, I unplug the speaker. It’s still blasting from my phone but at least Tammy is safe. I scooped up Tammy, gave her CPR, and she is now recovering in a coffee mug. I never did figure out how to shut off the alarm though, so I ended up smashing my phone to smithereens with a hammer. SO DO NOT BUY THIS APP, IT WILL ENDANGER YOUR FAMILY AND LOVED ONES! TODAY TRUMP HAS LOST A FAITHFUL SUPPORTER BECAUSE HIS APP ALMOST GOT THE LAST OF MY FAMILY KILLED!!!"}},{"id":"6174357768","type":"user-reviews","attributes":{"title":"chishhhh🤢🤢","date":"2020-07-09T00:57:01Z","userName":"chishhhh🤢","rating":1,"isEdited":false,"review":"I got offended when I first opened the app"}},{"id":"6174356083","type":"user-reviews","attributes":{"title":"HORRIBLE-RACIST, SEXIST, HOMOPHOBIC, NARCISSISTIC","date":"2020-07-09T00:56:27Z","userName":"kmcrowell","rating":1,"isEdited":false,"review":"An app for a campaign ran but an EVIL ORANGE MAN! His presidency alone is a hate crime. Awful app that supports bigotry, racism, sexism, homophobia, the list goes on. Seriously god awful."}},{"id":"6174347408","type":"user-reviews","attributes":{"title":"THIS APP IT HORRIBLE🤬😳🤯!!","date":"2020-07-09T00:53:37Z","userName":"bella7373838","rating":1,"isEdited":false,"review":"when i opened the app it showed me a picture of his d!ck like what the hel|."}},{"id":"6174342256","type":"user-reviews","attributes":{"title":"Trick-Ass","date":"2020-07-09T00:51:50Z","userName":"onedirectioncray","rating":1,"isEdited":false,"review":"If you’re gonna ban Tiktok then might as well ban this app too 🥱🖕"}},{"id":"6174337799","type":"user-reviews","attributes":{"title":"Disgusting","date":"2020-07-09T00:50:17Z","userName":"Pat3879Pot","rating":1,"isEdited":false,"review":"Disgusting tweeter. Why would anyone want this app?"}}]}