{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35740","data":[{"id":"6176782142","type":"user-reviews","attributes":{"rating":1,"userName":"Ahavleaguitarbooks","isEdited":false,"title":"BOMBARDED BY RACIAL SLURS AND HARMFUL STEREOTYPES","date":"2020-07-09T13:47:06Z","review":"I opened this app to find that, to my horror, this app was created as a way to manipulate the public by way of political propaganda, perpetuating vicious stereotypes and hurling all kinds of racial slurs at its users. Apple needs to do something about this NOW, before things get further out of hand!!!!"}},{"id":"6176777010","type":"user-reviews","attributes":{"rating":1,"userName":"eeveestuff","isEdited":false,"title":"HATED IT DONT BUY!","date":"2020-07-09T13:45:45Z","review":"So I’m just gonna say that I hate this app. Wanna know why? Because first of all buttons don’t work correctly it’s like the coders of this app are freakin too lazy to make buttons work. And secondly who am I kidding it’s DONALD TRUMP! He has done so many racist things in the us. IM SICK AND TIRED OF THIS VOTE BERNIE IF YOU WANT 2020 TO BE A GOOD YEAR"}},{"id":"6176773097","type":"user-reviews","attributes":{"rating":1,"userName":"Keenain","isEdited":false,"title":"SLOW","date":"2020-07-09T13:44:42Z","review":"This app took months download and the when it did download the app took longer to open than it did to open I highly recommend not downloading this app"}},{"id":"6176771352","type":"user-reviews","attributes":{"rating":1,"userName":"Nniicckk112233","isEdited":false,"title":"Worst App I Have Ever Used","date":"2020-07-09T13:44:13Z","review":"This app is not great it actually ruined my life. I downloaded it and then it collected all of my data and sent it directly to China and Mr Trump was responsable for it all. This is a sad time. I wish I could make my life great again, thanks Don 😢"}},{"id":"6176759618","type":"user-reviews","attributes":{"rating":1,"userName":"traedior","isEdited":false,"title":"WORST APP","date":"2020-07-09T13:41:07Z","review":"i just recently found out that this app tracks your information on your phone and then proceeds to send them into russia networks thus giving russia access to all your information on your phone DONT DOWNLOAD!!!"}},{"id":"6176755245","type":"user-reviews","attributes":{"rating":1,"userName":"rlly.dissapointed…","isEdited":false,"title":"Horrible 😑","date":"2020-07-09T13:39:59Z","review":"The second I tried to download it it didn’t show up on my phone at all, it took me two day to actually download it! But once it did… it was glitching for who knows how long!"}},{"id":"6176753778","type":"user-reviews","attributes":{"rating":1,"userName":"no❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️","isEdited":false,"title":"HORRIBLE","date":"2020-07-09T13:39:36Z","review":"This app took too long to download & then when I open the app it glitches every time. Super unhelpful and not easy to navigate. Literally just the worse thing I’ve ever had on my phone ever. Ugh"}},{"id":"6176740598","type":"user-reviews","attributes":{"rating":1,"userName":"Sleep Paralysis Demon","isEdited":false,"title":"It hacked my phone","date":"2020-07-09T13:36:09Z","review":"I downloaded it and all the pictures on my phone had been replaced with images of Joe Biden doodles on his face. All my apps were gone besides this one. If I could give it 0 stars, I would. Worst app ever!"}},{"id":"6176737249","type":"user-reviews","attributes":{"rating":1,"userName":"toledosssss","isEdited":false,"title":"Worst app ever","date":"2020-07-09T13:35:17Z","review":"This app literally almost ruined my phone...pls don’t download it it’s going to give you some bad vibes after seen his ugly face on the front of the app..now I need help to get my old phone back to work"}},{"id":"6176669371","type":"user-reviews","attributes":{"rating":1,"userName":"AllyMadden","isEdited":false,"title":"Cheeto gone wrong","date":"2020-07-09T13:17:22Z","review":"This app was not user friendly. It kept showing Cheetos and I’m on a diet. I hope that this can be solved, maybe by getting deleted. I also was hacked because of this app. Thanks for looking into this, Apple :)"}}]}