{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28460","data":[{"id":"6175094298","type":"user-reviews","attributes":{"review":"This is by far the absolute worst app I have ever downloaded! I had just gotten a brand new phone and once I downloaded this app my phone began to glitch and has only gotten worse!! Worst app available in the App Store!! BAD!!","isEdited":false,"userName":"HINESTREVIEW2020!!","title":"Wish I could rate less than one star!!","date":"2020-07-09T04:37:20Z","rating":1}},{"id":"6175078182","type":"user-reviews","attributes":{"review":"This is by far the worst app I have ever come across. It took three day’s to download. I simply wanted to support our orange goddess. Though all I was greeted with was a terrible experience. If you wish to support our presidential orange please grow a brain. Thank you and that is all.","isEdited":false,"userName":"Person1235689753","title":"Do not download","date":"2020-07-09T04:32:13Z","rating":1}},{"id":"6175077798","type":"user-reviews","attributes":{"review":"As soon as I downloaded the app my phone seemed to be slower and immediately started glitching out. This app is horrible! It wasn’t even giving me updates on the elections which was what I downloaded the app for. Please please don’t waist your time. Just watch the news. \n-Z","isEdited":false,"userName":"GEN Z BAE BEE","title":"DON’T WAIST YOUR TIME","date":"2020-07-09T04:32:06Z","rating":1}},{"id":"6175019041","type":"user-reviews","attributes":{"review":"This app is making my phone glitch my phone was working perfectly fine and once I downloaded this app my phone started glitching out of nowhere and it doesn’t let me delete it now!","isEdited":false,"userName":"i cant stand ads","title":"Glitching problems on this app","date":"2020-07-09T04:13:42Z","rating":1}},{"id":"6174986325","type":"user-reviews","attributes":{"review":"this app was absolute trash! so many many glitches and the man it’s based off of is a vile human being. i would say fix the glitches and overall terrible app but it might be better to just get the whole app off of the app store! 0/10 ABSOLUTELY TERRIBLE!!!!!","isEdited":false,"userName":"3staryolo","title":"awful app!!!!!","date":"2020-07-09T04:03:15Z","rating":1}},{"id":"6174962638","type":"user-reviews","attributes":{"review":"My brain cells decreased by 99% when I opened the app I mean it hacked my phone took my credit card information and texted everyone I know someone found out my information and robbed my house they even stole my microwave","isEdited":false,"userName":"juju24680","title":"This is the worst app I have ever downloaded","date":"2020-07-09T03:55:44Z","rating":1}},{"id":"6174939950","type":"user-reviews","attributes":{"review":"Who even made the app? Right when I opened it up, I got a TON of unnecessary ads. Besides the subway surfers one. It slowed my phone down and started to make the rest of my apps glitch. I don’t know what’s wrong with it, but I HIGHLY RECOMMEND Apple to get rid of the app to protect their customers....","isEdited":false,"userName":"MelaniuhTrumpette","title":"TERRIBLE","date":"2020-07-09T03:48:41Z","rating":1}},{"id":"6174924580","type":"user-reviews","attributes":{"review":"This app was a bad movie from the start. From the soggy fries to the rotten burger, I never knew what to expect. After that, the peacock in the parking lot stole my car, unbelievable!!! After that, I woke up to a broken umbrella. The umbrella was faulty and disnt hold up against the wind. 0/10 if I could. Useless app!!!","isEdited":false,"userName":"gizmobrinc","title":"Worst app ever!","date":"2020-07-09T03:43:58Z","rating":1}},{"id":"6174923375","type":"user-reviews","attributes":{"review":"😌✨🌚🧚‍♂️🖕🤩\nid rather have a cardboard cut out of mr. trump as president rather than the real thing. if you still support this toddler and just sorry excuse for a being, then you're probably willingly living under a rock completely ignoring the things he's said and done wrong, which happens to be every word that leaves his orange crusty mouth (seriously, tell me one good thing he's done?) i will be moving to canada if bunker boy gets re-elected & i have no respect nor any ounce of hope for him; he's absolutely helpless. 😛🖕🤩🤩","isEdited":false,"userName":"chloeseeeeeeeee","title":"garbage app for a garbage man","date":"2020-07-09T03:43:36Z","rating":1}},{"id":"6174922707","type":"user-reviews","attributes":{"review":"This app stole my money, slapped me in and told me to die! I was just wanting to get updates on our Lord and Savior, Donald J Trump, and all of a sudden the app home screen glitched to a very large phallic picture with some vulgar language attached. I am a Christain White woman in America and I will not stand for this homoerotic display!!!!!! DELETE THIS APP APPLE. MY VIRGIN EYES HAVE BEEN TAINTED AND U MUST ASK FOR FORGIVENESS!!!!","isEdited":false,"userName":"TinyPersonWhoWorksTooMuch","title":"The WORST APP","date":"2020-07-09T03:43:24Z","rating":1}}]}