{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=14980","data":[{"id":"6172991508","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:58:41Z","review":"It took years so I could open the app I know some people will say “it’s bc your internet” no I got some good internet... Plus it kept glitching my phone it closed the app I completely turned off my phone and turned back on still and it made everything lag too which was worse because I had to do some very important stuff I ended up deleting the app thanks to this","title":"Bad app","isEdited":false,"userName":"Chicken Nuggieslol"}},{"id":"6172958047","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:48:25Z","review":"First off rating this app 1 star is being generous . It deserves 0 stars. Not only does it take about 20 days to download when it finally does download it is in usable I mean I had to take my phone to the Apple store because many times my phone would lock up or glitch out after I opened the app!!!! The app won’t work and does negative damage to your phone !!!! Worst app ever","title":"Most useless app ever","isEdited":false,"userName":"JofoJefe"}},{"id":"6172957030","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:48:06Z","review":"Once I downloaded this app everyone around me started to lick 😋there lips and tried to eat me because they said I look like an orange 🍊and my skin started turning orange 🧡and I know I’ve never went tanning before I started to think what did I eat or do to make me look orange 🍊then I remember when I downloaded this app everything started happening ever since i know to never \ndownload this app it’s just the worst.","title":"The worst app","isEdited":false,"userName":"258085b"}},{"id":"6172947812","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:45:12Z","review":"I have no idea why you have this app Trump not even make America great and he would never make America great because he’s a racist criminal and disgusting Ohbama is everything Donald Trump is not  because he Obama makes everything better she’s not a criminal he the best yeah i know he makes mistakes that’s not bad but trump  never never regret and the app is really bad really bad it just wants to give me your information","title":"Why this app is horrible","isEdited":false,"userName":"jehd gd"}},{"id":"6172945817","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:44:35Z","review":"This was such a horrible app. Nothing ever worked properly,kept glitching, and when I tried opening it it took hours and hours and during that time I could have been doing something meaningful like writing a essay on how Obama was the best president. Also whenever the app did open it would immediately shut down so I wouldn’t have a chance to look at anything.","title":"Horrible","isEdited":false,"userName":"minememenen"}},{"id":"6172919250","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:36:15Z","review":"I rarely ever leave/make/write bad reviews but this horrible, disgusting app deserves every bad review it gets!!😡 I wish I could give I one star and put whoever helped make this app in jail FOREVER!!😤 The app would crash every time I opened it!!! It would even make my phone glitch!!! I tried to restart to see if it was my phone but it just made it worse!!! I hate this app! I HOPE THIS WAS HELPFUL.","title":"wish I could give this 0 stars","isEdited":false,"userName":"xgwidndhvdfieoemdnfjxkf"}},{"id":"6172852536","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:15:52Z","review":"This app was a HUGE disappointment to me and all the folks I shared it with. I am extremely upset and I feel my president has betrayed me. The advertising is very misleading and now I consider Donald Trump a liar. The shopping option is very glitchy and will not allow me to purchase any items. Do NOT sign up to be a part of ANYTHING on this app. It would not let me purchase tickets, join online meetings, or advocate door to door. HUGE DISAPPOINTMENT.","title":"NEVER DOWNLOAD THIS","isEdited":false,"userName":"Nonoyo Biness"}},{"id":"6172842775","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:12:57Z","review":"Long ago, the four nations lived together in harmony. Then, everything changed when the fire nation attacked. Only the avatar, master of all four elements could stop them, but when the world needed him most, he vanished. A hundred years passed and my brother and I discovered the new avatar, and air bender named Aang. And although his air bending skills are great, he has a lot to learn before he can save anyone. But I believe Aang can save the world.","title":"Water. Earth. Fire. Air","isEdited":false,"userName":"iiCookieTrash._"}},{"id":"6172828084","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T16:08:38Z","review":"This app is absolutely terrible! It took approximately three weeks and after I downloaded it finally 🙄it was not helpful at all it was very confusing I expected much better and I did not get that. It crashed multiple times and made me put private information in the app which I was uncomfortable doing I don’t think this is a good app and all of you should delete it!!!!","title":"Horrible app","isEdited":false,"userName":"ndjdisbfnf"}},{"id":"6172757108","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T15:48:20Z","review":"i downloaded this app thinking that i would get to watch the news , but once i clicked on it an awful stench floated out of my phone & gave all my family pneumonia !! we are in critical condition): i advise you to not download this app & give it a 1 star review , before you get sick too . also , i have a painful rash on my rear end that came from the disturbing picture of DONALD DUCK once i opened the app . be safe out there !","title":"HORRIBLE ! JUST HORRIBLE","isEdited":false,"userName":"Lillian Bouhdan"}}]}