{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=137780","data":[{"id":"6179852769","type":"user-reviews","attributes":{"title":"No thanks I’ll pass...","rating":1,"review":"Not even after 5 minutes of downloading, an Orange burst through my front door and SICKED a wild tiger on me. Barely survived. Writing this to make sure no else gets attacked by a wild orange. Stay safe y’all!","date":"2020-07-10T06:58:07Z","isEdited":false,"userName":"Kitten6453"}},{"id":"6179852694","type":"user-reviews","attributes":{"title":"Epstein-Trump 2020","rating":1,"review":"This app has been secretly collected the phone numbers of my nieces and luring them to hop on the “Lolita Express” to meet Trump at his secret rally at Esptein’s private island in the Caribbean. I found that very disturbing. I’ve deleted the app since. Hide yo kids, hide yo wives, hide yo nieces.","date":"2020-07-10T06:58:06Z","isEdited":false,"userName":"MarcoPablo1979"}},{"id":"6179852453","type":"user-reviews","attributes":{"title":"Are you my pinky toe Bc I wanna hang you on the couch","rating":1,"review":"I don’t like how the app looks it ugly. And it interrupts my Netflix and my music it really bugs me and I wanna chuck my phone. THIS APP IS CAUSING ME TOO WANNA BREAK MY PHONE!","date":"2020-07-10T06:58:00Z","isEdited":false,"userName":"gracie e1217"}},{"id":"6179852369","type":"user-reviews","attributes":{"title":"Poop poop pee pee app","rating":1,"review":"GEN Z BABYYYYYYYYYYYYYYYUUYYYYYYYYY STOTP PLAYING","date":"2020-07-10T06:57:58Z","isEdited":false,"userName":"Monarch_"}},{"id":"6179852264","type":"user-reviews","attributes":{"title":"Killed Truma LoOpa.","rating":1,"review":"This shall not pass. I’m ceased to believe that this trash of an app has ever succeeded someone’s needs, this ThINg makes my eyes and braincells disintegrate I wish I could leave anything lower than a 1 Star. What ever this is doesn’t deserve to have any stars. Lemme spit some facts, he probably doesn’t know how his own app works. So how about we leave this app to paper so it is easier to trash, because you can crumble up paper, burn it, shred it, make it basically disappear like a magician, so let’s all agree this is a waste of time. It make trash disappointed. Like wow. My trash can just wanted to leave my room after I saw or even tapped on this app. If it can make trash run away, than I don’t know how I’m still writing. Thank you for making this app less useful than flashes motorcycle. If I could find a way to use this app it would be a napkin after spilt my m*lk how ever after I used the napkin to, clean my mess, the napkin later just shriveled up as if it was a witch and I went and did the ice bucket challenge with her. R.I.P TrumpA LoOpa.","date":"2020-07-10T06:57:56Z","isEdited":false,"userName":"jeebus chan"}},{"id":"6179852281","type":"user-reviews","attributes":{"title":"GEN Z FOR THE WIN ✊🏼","rating":1,"review":"kiss my ass trump 💋","date":"2020-07-10T06:57:56Z","isEdited":false,"userName":"gen z for the winnnnnnn"}},{"id":"6179852182","type":"user-reviews","attributes":{"title":"Horrible🤮","rating":1,"review":"This app is all about trump who is a racial threat to society. This is more of a opinion but I still hate his muffin Trent built head. He looks like a orangutan cerebral pulsey","date":"2020-07-10T06:57:54Z","isEdited":false,"userName":"i hate trump☹︎"}},{"id":"6179851762","type":"user-reviews","attributes":{"title":"If I could give 0 stars I would","rating":1,"review":"The app is horribly developed","date":"2020-07-10T06:57:43Z","isEdited":false,"userName":"SMDTIKTOK"}},{"id":"6179851283","type":"user-reviews","attributes":{"title":"Oh, this is an S.O.S.","rating":1,"review":"Hi y’all. So I was tryna see what’s up with our manz up in here but when I tried to download the app it took 3.5 weeks. Then it said that I had to wear a mask to use it and that’s infringing my rights so I chucked my phone in the river. This app lost me a phone and I demand trump to pay for it.","date":"2020-07-10T06:57:31Z","isEdited":false,"userName":"RJ JAM"}},{"id":"6179851242","type":"user-reviews","attributes":{"title":"Terrible App","rating":1,"review":"i hate it here","date":"2020-07-10T06:57:30Z","isEdited":false,"userName":"sorrythisnicknameistaken123"}}]}