{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=141430","data":[{"id":"6179426748","type":"user-reviews","attributes":{"review":"This really ain’t it. It’s slow. It’s racist. It’s homophobic. It’s xenophobic. It’s transphobic. It’s sexist. It lies. And worst of all it’s orange.","userName":"orange = bad","date":"2020-07-10T04:26:44Z","isEdited":false,"title":"Not a favorite","rating":1}},{"id":"6179426501","type":"user-reviews","attributes":{"review":"I wanted to support Trump by downloading this app but it didn’t download for 24 hours!! When it finally downloaded it kept sending me notifications in Chinese and Russian!!! Also after it was on my phone I got hit by a car, they could not be related but I wouldn’t risk it!!","userName":"realtrumpfan","date":"2020-07-10T04:26:39Z","isEdited":false,"title":"REAL Trump Supporters Listen!!!","rating":1}},{"id":"6179426512","type":"user-reviews","attributes":{"review":"Not only did it take 38 days to fully download, but once it finally did my phone got spammed and BROKE, and I had to find a new one because it literally IMPLODED. Fellow Trump supporters, be careful of phoney apps like this! \n\nSigned, Magnolius","userName":"MajorGumply","date":"2020-07-10T04:26:39Z","isEdited":false,"title":"THIS APP IS HORRIBLE","rating":1}},{"id":"6179426276","type":"user-reviews","attributes":{"review":"Should be taken off App Store I hate this app","userName":"wiener sucker 69","date":"2020-07-10T04:26:34Z","isEdited":false,"title":"Horrible app","rating":1}},{"id":"6179426138","type":"user-reviews","attributes":{"review":"It makes my phone glitch and once I delete it the glitches 🛑","userName":"this app suck👎🏾","date":"2020-07-10T04:26:32Z","isEdited":false,"title":"Don’t get this app","rating":1}},{"id":"6179426071","type":"user-reviews","attributes":{"review":"Nooooooooooo","userName":"*narutorunsaway*","date":"2020-07-10T04:26:31Z","isEdited":false,"title":"No please god no","rating":1}},{"id":"6179426048","type":"user-reviews","attributes":{"review":"Where is the respect for 45?? That’s OUR president. For real though, sign up for his texts instead of this app. It really is horrible and caused my phone to crash. His texts ask for donations every day, but I know he’s struggling so I don’t mind giving him my rent because I know at the end of the day, Trump really does care.","userName":"Tortor123456789","date":"2020-07-10T04:26:30Z","isEdited":false,"title":"Gen Z’s are the worst!","rating":1}},{"id":"6179426043","type":"user-reviews","attributes":{"review":"THIS APP IS AWFUL! It took forever to download and scammed me a couple of times when I was shopping for president Trump apparel, not to mention the ads every minute! (Not even exaggerating). Also the overall quality of the app was very bad. It was unbelievably pixelated. To add on the amount of storage this app takes up is unbelievable. I have 250 gigs and this took up 147 of them! It made my phone crash constantly. In fact I was on a very important phone call with my boss (and this has never happened before) when suddenly my phone crashed, hanging up on my boss, when I was finally able to call him back he threatened to fire because I hung up on him. I desperately explained the situation yet he did t believe me. After far far more convincing he agreed to let me keep my job but take some money out of my paycheck for a week. And no I’m not one of those kids that want to ruin this app. I highly support the president but this app is not it. I’m glad it’s being taken down.","userName":"Crazy LLama's dance","date":"2020-07-10T04:26:30Z","isEdited":false,"title":"Expensive for a free app","rating":1}},{"id":"6179425827","type":"user-reviews","attributes":{"review":"a human being can be so utterly stupid.","userName":"corey_mbm","date":"2020-07-10T04:26:26Z","isEdited":false,"title":"I just don't understand how...","rating":1}},{"id":"6179425499","type":"user-reviews","attributes":{"review":"I can not STRESS the amount of times I opened this app and they told me Travis Scott won the Super Bowl, like WHAT? Fake news, we all know Travis is on the Jets they never got in the Super Bowl. This app is bad, delete it before it takes over your phone, cuz on November 69th it will delete your photo storage. Thank you for your time. Byeeeeeee","userName":"trumpballsack69420yuh yuh yuh","date":"2020-07-10T04:26:19Z","isEdited":false,"title":"SO BAD IT WAS ALL FAKE NEWS AND PROPAGANDA","rating":1}}]}