{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=103660","data":[{"id":"6055954144","type":"user-reviews","attributes":{"userName":"Luke Havergal","date":"2020-06-09T19:19:28Z","isEdited":false,"rating":1,"title":"No Thanks","review":"I’m all set."}},{"id":"6179203498","type":"user-reviews","attributes":{"userName":"Booduh4u","date":"2020-07-10T03:10:19Z","isEdited":false,"rating":1,"title":"Worst app ever","review":"Sucked biggly"}},{"id":"6179197577","type":"user-reviews","attributes":{"userName":"ethenereer","date":"2020-07-10T03:08:12Z","isEdited":false,"rating":1,"title":"I can’t believe this is legal to have","review":"Please note before reading that this is an awful app and there are so many issues but I wanted to share my experience with this app.  I’ve seen everyone rate this app so low but with very dumb reasons so I would like to give an actual reason.   There is something sinister, something so dark to name that is behind this app.  It’s truly terrifying to even think about it but I guess it goes.  \nThis stories starts with my parents wanting me to get this app.  They were trump supporters before downloading this app on their iPhones.  This all happened back in 2019 before a lot of evidence came out about Donald Trump (also yes I have been keeping this story inside me for a long period of time).  I downloaded the app and it was very simple.  Everything worked okay and was very efficient.  But one day my phone was dead.  It started to buzz like crazy and I heard this static sound.  It was almost 4 am when this happened.  The wind was howling and there was silence throughout my entire home.  But out of no where, waking me up from a deep slumber, my phone was buzzing like crazy.  It actually fell off my wooden nightstand because it was vibrating so much.  Out of shock I reached down to see what was blowing my phone up so much.  It was the trump app,  I couldn’t believe my eyes.  Why was this app making my phone go crazy.  I was holding my phone in my hands whilst the notifications kept going off.  But I realized why my phone was going crazy... I read the notifications... it was horrendous.  They were saying such sinister things that I can’t even say.  I was in full panic mode and I was so scared.  I didn’t feel safe in my own home.  I thought someone was out to get me.  Then the notifications stopped.  So I thought this was the end.  Then I hear footsteps coming from the dining room in my home.  I was home alone at this time.  My heart was racing, realizing the end is near.  But i started to hear this sound.  I don’t know how to describe it.  It was like singing.  I started to feel calmer.   My whole body stopped shaking and my heart slowed down to a normal pace.  Then I started to hear these words.  I was able to hear lyrics you know.  The singing was getting louder.  And that’s when a knock came at my door.  I for some reason opened the door.  A man in a cloak looked at me and started singing and dancing in my room.  \n\nHow does a ragtag volunteer army in need of a shower\n\nSomehow defeat a global superpower?\n\nHow do we emerge victorious from the quagmire?\n\nLeave the battlefield waving Betsy Ross' flag higher?\n\nYo. Turns out we have a secret weapon!\n\nAn immigrant you know and love who's unafraid to step in!\n\nHe's constantly confusin', confoundin' the British henchmen\n\nEv'ryone give it up for America's favorite fighting Frenchman!\n\nLafayette!\n\nI'm takin this horse by the reins makin'\n\nRedcoats redder with bloodstains\n\nLafayette!\n\nAnd I'm never gonna stop until I make 'em\n\nDrop and burn 'em up and scatter their remains, I'm\n\nLafayette!\n\nWatch me engagin' em! Escapin' em!\n\nEnragin' em! I'm—\n\nLafayette!\n\nI go to France for more funds\n\nLafayette!\n\nI come back with more\n\nGuns\n\nAnd ships\n\nAnd so the balance shifts\n\nWe rendezvous with Rochambeau, consolidate their gifts\n\nWe can end this war at Yorktown, cut them off at sea, but\n\nFor this to succeed, there is someone else we need:\n\nI know\n\nHamilton!\n\nSir, he knows what to do in a trench\n\nIngenuitive and fluent in French, I mean—\n\nHamilton!\n\nSir, you're gonna have to use him eventually\n\nWhat's he gonna do on the bench? I mean—\n\nHamilton!\n\nNo one has more resilience\n\nOr matches my practical tactical brilliance—\n\nHamilton!\n\nYou wanna fight for your land back? (Hamilton!)\n\nI need my right hand man back! (Hamilton!)\n\nAh! Uh, get ya right hand man back\n\nGet your right hand man back!\n\nHamilton!\n\nYou know you gotta get ya right hand man back\n\nYour right hand man back!\n\nHamilton!\n\nI mean you gotta put some thought into the letter\n\nHa—ha—Hamilton\n\nBut the sooner the better to get your right hand man back!\n\nHamilton, ha—ha—\n\nAlexander Hamilton\n\nTroops are waiting in the field for you\n\nIf you join us right now, together we can turn the tide\n\nOh, Alexander Hamilton\n\nI have soldiers that will yield for you\n\nIf we manage to get this right\n\nThey'll surrender by early light\n\nThe world will never be the same, Alexander...\n\nThese were the lyrics that made me started a drug business. \n\n..."}},{"id":"6179171950","type":"user-reviews","attributes":{"userName":"Fpgj","date":"2020-07-10T02:58:43Z","isEdited":false,"rating":1,"title":"Bad","review":"Really really bad"}},{"id":"6179102895","type":"user-reviews","attributes":{"userName":"livb1623","date":"2020-07-10T02:33:00Z","isEdited":false,"rating":1,"title":"DONT GET THIS APP","review":"terrible. just terrible."}},{"id":"6179093692","type":"user-reviews","attributes":{"userName":"bruhhh420690","date":"2020-07-10T02:29:42Z","isEdited":false,"rating":1,"title":"this was stupid","review":"all the news was bias and unfactual"}},{"id":"6179038512","type":"user-reviews","attributes":{"userName":"BadBitty2020","date":"2020-07-10T02:09:22Z","isEdited":false,"rating":1,"title":"cuz i’m queen petty, imma bad bitty💅✨😌","review":"two can play at this game. you take tiktok, we take this."}},{"id":"6178948327","type":"user-reviews","attributes":{"userName":"wave🌙🪐✨","date":"2020-07-10T01:36:32Z","isEdited":false,"rating":1,"title":"disappointed","review":"i got the app and i was ready to support this campaign to show my true american spirit🇺🇸, but i was not pleased with the number of fanfictions on the home tab. i kept trying to look at the news and updates, but every time a new fanfiction came up. the first one was an avatar the last airbender one, except the united states was the fire nation🔥, and my dearest trumpy was the fire lord😱. oh and in this version, aang 💨actually did the deed and ended fire lord trump💀. in my own humble opinion, i thought it was a pretty good story, and the author, WOW. they paid so so so much attention to detail, describing my dear trumpy as a “tyrannical leader that only pays attention to his spray tans” and “so fat, even iroh 🍵(bless that man❤️) was SHOCKED”. the author also did an amazing job at recreating zuko💥 to be barron trump(#savebarrontrump), and azula⚡️ as ivanka. the final fight scene where barron completely annihilated ivanka, was so beautifully written, i was on THE EDGE of my seat. however, when i thought i was in the clear, the unimaginable happened. i clicked away from the story when the entire screen went black. i could see the distressed 😩 look in my face from the reflection in the screen. i was panicking, but my phone is kind of old, so i just assumed it had something to do with that. i went to plug it in when a distressing message appeared as the following:\n\nWE HAVE YOUR LOCATION, IF YOU REFUSE TO PAY $100,000,000 IN BITCOIN WE WILL ELIMINATE YOU.\n\ni was so scared and confused and a bit baffled at how the trump administration was able to get my location so quickly. long story short, i am one good fan fic richer and $100,000,000 bitcoin poorer. i can’t believe trump would rob his supporters like this. and that’s not even to say what the bitcoin would be used for anyways. i’ve blindly donated my life savings to CRIMINALS. \n\ni hope that others can be vocal about their poor experiences with the app, and i just want people to know that i’m officially #harambe2020 because of these events."}},{"id":"6178946918","type":"user-reviews","attributes":{"userName":"the jane main","date":"2020-07-10T01:36:01Z","isEdited":false,"rating":1,"title":"The worse app I downloaded","review":"Somebody once told me\n\nThe world is gonna roll me\n\nI ain't the sharpest tool in the shed\n\nShe was looking kind of dumb\n\nWith her finger and her thumb\n\nIn the shape of an \"L\" on her forehead\n\nWell, the years start coming\n\nAnd they don't stop coming\n\nFed to the rules and I hit the ground running\n\nDidn't make sense not to live for fun\n\nYour brain gets smart, but your head gets dumb\n\nSo much to do, so much to see\n\nSo what's wrong with taking the back streets?\n\nYou'll never know if you don't go\n\nYou'll never shine if you don't glow\n\nHey now, you're an all star\n\nGet your game on, go play\n\nHey now, you're a rock star\n\nGet the show on, get paid\n\nAnd all that glitters is gold\n\nOnly shooting stars break the mold\n\nIt's a cool place and they say it gets colder\n\nYou're bundled up now, wait 'til you get older\n\nBut the meteor men beg to differ\n\nJudging by the hole in the satellite picture\n\nThe ice we skate is getting pretty thin\n\nThe water's getting warm so you might as well swim\n\nMy world's on fire, how about yours?\n\nThat's the way I like it and I never get bored\n\nHey now, you're an all star\n\nGet your game on, go play\n\nHey now, you're a rock star\n\nGet the show on, get paid\n\nAll that glitters is gold\n\nOnly shooting stars break the mold\n\nHey now, you're an all star\n\nGet your game on, go play\n\nHey now, you're a rock star\n\nGet the show on, get paid\n\nAnd all that glitters is gold\n\nOnly shooting stars\n\nSomebody once asked\n\n\"Could I spare some change for gas?\n\nI need to get myself away from this place\"\n\nI said, \"Yep, what a concept\n\nI could use a little fuel myself\"\n\nAnd we could all use a little change\n\nWell, the years start coming\n\nAnd they don't stop coming\n\nFed to the rules and I hit the ground running\n\nDidn't make sense not to live for fun\n\nYour brain gets smart, but your head gets dumb\n\nSo much to do, so much to see\n\nSo what's wrong with taking the back streets?\n\nYou'll never know if you don't go (go!)\n\nYou'll never shine if you don't glow\n\nHey now, you're an all star\n\nGet your game on, go play\n\nHey now, you're a rock star\n\nGet the show on, get paid\n\nAnd all that glitters is gold\n\nOnly shooting stars break the mold\n\nAnd all that glitters is gold\n\nOnly shooting stars break the mold"}},{"id":"6178946521","type":"user-reviews","attributes":{"userName":"Fantasticis","date":"2020-07-10T01:35:52Z","isEdited":false,"rating":1,"title":"disgusting .","review":"we don’t support racists . not my president. 🤢🤢 do not download"}}]}