{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=39880","data":[{"id":"6175242753","type":"user-reviews","attributes":{"rating":1,"review":"This is the worst app ever! It goes along with the worst president ever! He needs to go.  He never should’ve been in the office to begin with.  Both he and the app are a complete joke! I could not delete it fast enough.","userName":"RosieRush","date":"2020-07-09T05:28:49Z","title":"This App is a DISGRACE!","isEdited":false}},{"id":"6175241133","type":"user-reviews","attributes":{"rating":1,"review":"Way too many notifications. Sick and tired of it. Easier to delete app than changing settings. Kept asking me to give money. No thank you.","userName":"Dissatisfied Dora","date":"2020-07-09T05:28:11Z","title":"🤢","isEdited":false}},{"id":"6175237350","type":"user-reviews","attributes":{"rating":1,"review":"this app stole all of my hamsters! i swear every single one! i used to have thirty five and a half hamsters and i swear on the president of the united states of america that i now have ZERO hamsters. this app caused dinosaurs to go extinct too and promotes racism. doesn’t deserve to be on the app store.","userName":"your mom 🤩","date":"2020-07-09T05:26:45Z","title":"THE WORST APP EVER","isEdited":false}},{"id":"6175219290","type":"user-reviews","attributes":{"rating":1,"review":"I thought our orange king would make us a good app but he failed😫The app is soooo slow and my phone has been experiencing so many glitches!! this is unacceptable","userName":"Dnxdgjbvcff","date":"2020-07-09T05:20:12Z","title":"Disappointed","isEdited":false}},{"id":"6175207137","type":"user-reviews","attributes":{"rating":1,"review":"this is a poopy app!!! it ruined my phones battery life!! my phone constantly glitches and i had to delete our sweet supreme leaders app 😔 rip. i just wanted updated about kim- i mean trump, but instead i got a bricked phone and biden endorsements 😔","userName":"thisappisshithomje","date":"2020-07-09T05:15:47Z","title":"POOPY APP!!!!","isEdited":false}},{"id":"6175152967","type":"user-reviews","attributes":{"rating":1,"review":"This app is so bad and glitchy. The graphics are pixelated and the context is utter garbage. In my opinion, it is such a waste of time, you should try out something more worth your while.","userName":"Please help: (","date":"2020-07-09T04:56:44Z","title":"Utter Disappointment","isEdited":false}},{"id":"6175133077","type":"user-reviews","attributes":{"rating":1,"review":"This is the most terrible app out on the market. Trust me I know everything about apps. This one is by far the worst. I know everything about markets and the market does not need this.","userName":"Buxtboy99","date":"2020-07-09T04:50:03Z","title":"Terrible app","isEdited":false}},{"id":"6175097050","type":"user-reviews","attributes":{"rating":1,"review":"my phone was working perfectly fine + then i decided to download this app + everything went HAYWIRE!!! the app crashed every time i tried to open it + then would cause my phone to completely SHUT OFF!!! DO NOT DOWNLOAD!!!","userName":"darbs18","date":"2020-07-09T04:38:15Z","title":"HORRIBLE APP CAUSED GLITCHING","isEdited":false}},{"id":"6175091441","type":"user-reviews","attributes":{"rating":1,"review":"I opened up the app to be greeted by a large lumpy cheeto colored gorilla. I thought I would be turned to stone. Then, it asked for pictures of my toes in order to register!! Im so offended would not suggest others downloading such an offensive app.","userName":"impeached the cheeto man","date":"2020-07-09T04:36:25Z","title":"I am so offended","isEdited":false}},{"id":"6175054001","type":"user-reviews","attributes":{"rating":1,"review":"I got this app to get updates on the orange man and his plans to put poor humans in cages. TURNS OUT THEYVE BEEN stealing my info , looks like China has some competition... It keeps glitching each time I open the app HORRIBLE. Someone get this orange man a better tech group!!","userName":"jayrau","date":"2020-07-09T04:24:42Z","title":"TRASH","isEdited":false}}]}