{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=40460","data":[{"id":"6177408555","type":"user-reviews","attributes":{"userName":"opressssss ion","review":"App keeps crashing, leaves no space in storage if I download this. Definitely would not recommend. Anyways vote for Biden even though we wanted Bernie and Biden is a pedo but I will take ANYBODY other than trumpie 😛","rating":1,"title":"#anybodybutDonald","date":"2020-07-09T16:39:56Z","isEdited":false}},{"id":"6177404367","type":"user-reviews","attributes":{"userName":"alejandra589","review":"It’s so hard to loose and it does work at all this app shouldn’t be here anymore u guys should delete it forever it doesn’t work at all I hate this app so much","rating":1,"title":"This app doesn’t work","date":"2020-07-09T16:38:44Z","isEdited":false}},{"id":"6177400610","type":"user-reviews","attributes":{"userName":"FlashyLeather","review":"I’ve been an iPhone user since the 2000’s and have never had worse app in my life. Absolutely pitiful and shocked that an app of this quality could be on the App Store.","rating":1,"title":"Worst app I’ve ever had.","date":"2020-07-09T16:37:41Z","isEdited":false}},{"id":"6177388301","type":"user-reviews","attributes":{"userName":"dide with a phone","review":"This app was very bad and was like a leach the couple of seconds it was on my phone I might have to get a new phone after how this app corrupted my phone.","rating":1,"title":"Bad app hard to navigate","date":"2020-07-09T16:34:05Z","isEdited":false}},{"id":"6177348498","type":"user-reviews","attributes":{"userName":"ad020102","review":"I honestly got this app because I believed in our president but now I’m just thinking. . . If he can’t even manage to get a proper functioning app can he really run this country as well?","rating":1,"title":"Glitchy","date":"2020-07-09T16:22:19Z","isEdited":false}},{"id":"6177335646","type":"user-reviews","attributes":{"userName":"meme_369","review":"I have never been so disappointed in a app. I almost died using this app. This app is very much dangerous and I would recommend you guys to rate it 1 star because that’s what this app deserves.","rating":1,"title":"Worst app ever","date":"2020-07-09T16:18:43Z","isEdited":false}},{"id":"6177319519","type":"user-reviews","attributes":{"userName":"cursed app!","review":"This app is SHADY!! I opened it and gave it my info, now I can’t leave my phone for two seconds without being bombarded by notifications from the Russian FSB?? Like what do they possibly have to do with this …","rating":1,"title":"CURSED","date":"2020-07-09T16:14:17Z","isEdited":false}},{"id":"6177319062","type":"user-reviews","attributes":{"userName":"Rachel171777","review":"Idk if this a glitch anyone else has experienced, but the only thing this app seems to do is spread hate :/ not sure why this is happening but I have to give it 1 star :(","rating":1,"title":"Terrible app","date":"2020-07-09T16:14:09Z","isEdited":false}},{"id":"6177315350","type":"user-reviews","attributes":{"userName":"pookie bearrrr","review":"i downloaded the app to see what it was like 🤮 i saw ratatouille on my screen and i couldn’t get out of it and then a movie started to play and it was ratatouille i don’t then a rat started to move and came out of my screen the 5 did deny opampa loopmas came out of my door and then 4 chipmpanzies came though my mirror its was bad don’t get this app or ratatouille will be your worst nightmare","rating":1,"title":"ratatouille came out of my screen","date":"2020-07-09T16:13:08Z","isEdited":false}},{"id":"6177303958","type":"user-reviews","attributes":{"userName":"A very stupid person","review":"This app is for racist pieces of dog crap. \nImagine voting for Cheeto and sticking with him after he caused covid19 to rise and not only that, George Floyd was killed and all the cop got was a little punishment.\nIt’s in my religion not to wish death upon someone but I hope you (Cheeto Trump) get what you deserve","rating":1,"title":"CHEETO PUFF 🤢🤮","date":"2020-07-09T16:09:58Z","isEdited":false}}]}