{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=82870","data":[{"id":"6174359353","type":"user-reviews","attributes":{"title":"This app is so disgusting","rating":1,"userName":"live433311","date":"2020-07-09T00:57:35Z","isEdited":false,"review":"This app is so disgusting, it made my fish kill itself"}},{"id":"6174359006","type":"user-reviews","attributes":{"title":":(","rating":1,"userName":"hiii my doodddddssss","date":"2020-07-09T00:57:27Z","isEdited":false,"review":"Idk what this is but I never signed up to just look at a orange peel"}},{"id":"6174353170","type":"user-reviews","attributes":{"title":"Horrible","rating":1,"userName":"no💋💖💖","date":"2020-07-09T00:55:30Z","isEdited":false,"review":"Just horrible"}},{"id":"6174347050","type":"user-reviews","attributes":{"title":"Giving This App ZERO stars would be too Generous","rating":1,"userName":"SimsFPGirl","date":"2020-07-09T00:53:29Z","isEdited":false,"review":"Before even clicking on the app I noticed the icon for the app was stupid and looked like the Titan Tower from “Teen Titans Go!” I then opened the app as soon as I opened the app my screen started glitching and my phone started making the same noise as a regurgitating bull. After 3 days my phone became working, I decided to try opening the app again, upon opening the app, my eyes were appalled from looking at what looked like a white supremacist wrinkly tomato with a bad dye job. After taking 5 hours to heal my eyes from what I had seen. I also saw a weird message saying “Keep America Great” Which was weird considering black people are dying just because they’re black, but from looking at the White Supremacist once again I realized that’s probably what he wants. I then notice his red tie which was just one shade off from his face. long story short I would not recommend this app unless you are a white supremacist and in that case please go in a field and stab yourself but not in your vital organ so you can bleed out and slowly die in pain. I allowed the app to see my location where a guy riding a motorcycle jumped through my window and almost hit my dog fortunately my dog didn’t sustain any injuries although my mother did die. That man picked me up a put me in a bag and then put me in a limousine that can only be described as smelling like a bloated dead whale. I was then able to make my way out of the bag and saw the white supremacist wrinkly tomato with a bad dye job jerking off to Fox News while simultaneously looking at a picture of what looked to be Ivanka Trump. Although I was sitting there he still continued. After 15 min he finally stopped. I then noticed Melania and Barron Trump who I didn’t notice before because they were sitting so quietly. I was then given offered some Oreos with the white supremacist wrinkly tomato with a bad dye job’ face on them. After putting one in my mouth I quickly spit it out after tasting that it had as much flavor as that of a potato Salad with raisins in it made by a woman named \nAnne Dime-Rae Cist who is married to a police officer who hasn’t wanted to have sex with her since their 23 year old daughter was conceived. I was then tested out the car and the limo sped away. 100% do not recommend this app."}},{"id":"6174346400","type":"user-reviews","attributes":{"title":"Be humble","rating":1,"userName":"awwwwssooommme","date":"2020-07-09T00:53:16Z","isEdited":false,"review":"You need to allow the United"}},{"id":"6174344513","type":"user-reviews","attributes":{"title":"Worst app ever","rating":1,"userName":"waisfs","date":"2020-07-09T00:52:35Z","isEdited":false,"review":"Spreads misinformation, idolizes a RACIST, a RAPIST, a FASCIST. Do not vote for this man. Do not trust this man. Do not listen to a word this man has to say. He is a horrible human being."}},{"id":"6174316025","type":"user-reviews","attributes":{"title":"Broke my phone","rating":1,"userName":"bookq","date":"2020-07-09T00:43:06Z","isEdited":false,"review":"Gave my phone a virus"}},{"id":"6174298963","type":"user-reviews","attributes":{"title":":(","rating":1,"userName":"uhh im not finished 🥴","date":"2020-07-09T00:37:17Z","isEdited":false,"review":"this app made my pet tiger run across the highway & he got hit by a semi truck full of chickens. not only do i have to deal with a dead tiger, but i now have to pay the semi driver & the farmer for the chickens & the semi"}},{"id":"6174282318","type":"user-reviews","attributes":{"title":"Oh my golly","rating":1,"userName":"genz bby","date":"2020-07-09T00:31:46Z","isEdited":false,"review":"As a woman of this nation I want to say that I’d rather deal with lord ozai because he wasn’t a literal orange"}},{"id":"6174281353","type":"user-reviews","attributes":{"title":"Horrible","rating":1,"userName":"Kkkaaattt101","date":"2020-07-09T00:31:26Z","isEdited":false,"review":"opened the app to see a cheeto, how disappointing."}}]}