{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=140900","data":[{"id":"6179471272","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Horrible app","review":"Worst app in the history of apps","date":"2020-07-10T04:41:29Z","userName":"sxorpion 2000303030"}},{"id":"6179471153","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"DONT BUY","review":"So i tried to buy this but it took forever to load and STOLE all my DATA. My plates were folded, my conservative boy friend left me because it would download, it ended up putting my dishwasher in my closet, and then the cat ended up in my sock drawer! DO NOT BUY. after the cat was in the sock drawer i got constant calls from out of state callers!!!! Wasting my money! I was gonna buy a new dishwasher cuz it ended up in my closet. THIS APP RUINED MY LIFE.","date":"2020-07-10T04:41:27Z","userName":"SomethingwithanM"}},{"id":"6179471057","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"ew 🧚‍♀️","review":"App ugly and it hacked me","date":"2020-07-10T04:41:25Z","userName":"crystalcastlesfan69"}},{"id":"6179470949","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"heyyyyy bunker boyyyyy🥰","review":"white trash. thank you","date":"2020-07-10T04:41:23Z","userName":"blm blm BLM BML <3"}},{"id":"6179470902","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Worse than death, I am heartbroken","review":"This app is an abomination, it took disgustingly long to download, constantly glitching and sending me back to my homepage. The way my phone acted after opening it made me question whether it’s possible for malware to invade my Apple products. And the app itself- the setup, functionality, and even content- is abhorrent. The things I’ve witnessed on it are unspeakable. This app shouldn’t be allowed on here I swear it’s mining my data and breaking privacy law. This app single handedly made me switch political parties and consider revisiting self harm. I am so let down by my president and whatever soulless wasteland of a team designed this app. I am devastated. Do not download this app unless you want to experience what it’s like to have everything you thought you knew was real and good in your president and party crumble around you into dust. I would rather get 100 mosquito bites on my tongue and watch it happen than recommend this app to anyone. I would not wish this app unto my worst enemy or the devil himself. To rinse my eyes of bleach after what I saw on this app would be a merciful act, and if there existed a loving god he would gift me with a brain injury so traumatic I would be wiped of any memory I have of installing and viewing this app.","date":"2020-07-10T04:41:22Z","userName":"PickleSnickers"}},{"id":"6179470640","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Tiktok","review":"THIS APP IS TERRIBLE","date":"2020-07-10T04:41:17Z","userName":"AdminDeveloper"}},{"id":"6179470499","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"All Apps Matter","review":"Don’t download this app. It may be a good app for you, but actually, all apps matter. All apps, on both sides, are filled with “very fine people”. Ok, so don’t download this app, because then the other apps will feel like they arent important, because all apps matter. 🥰🏳️‍🌈","date":"2020-07-10T04:41:14Z","userName":"Shuperstar!!!!"}},{"id":"6179470444","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"⚠️WARNING DON’T DOWNLOAD⚠️","review":"Yeah so this so gave me aids....","date":"2020-07-10T04:41:13Z","userName":"EpicNerd9/24/04"}},{"id":"6179470384","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Don’t get this app","review":"Everyone time I open the app I see this orange croissant hair wearing man on my phone","date":"2020-07-10T04:41:12Z","userName":"ewwwwwwhhyyyyy"}},{"id":"6179470340","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Stupid","review":"I can’t believe I download this app I wanted to see how the 2020 elections was gonna be then all of a sudden a giraffe came in my room and pooped every where then left a note saying this app sent me repeat after me WASTE. OF. TIME","date":"2020-07-10T04:41:11Z","userName":"y r all th€ nicknames taken"}}]}