{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33070","data":[{"id":"6172679309","type":"user-reviews","attributes":{"date":"2020-07-08T15:26:16Z","rating":1,"title":"Horribble","review":"What people would want this nasty orange as our president he does nothing to support us and protect us BLM he does not care for we have lives to but most importantly Black lives so get your nasty musty crusty orange looking face out of that office because Gen-Z does not put up with this stuff BLM I HATE TRUMP","isEdited":false,"userName":"gisellejaime"}},{"id":"6172675435","type":"user-reviews","attributes":{"date":"2020-07-08T15:25:08Z","rating":1,"title":"There is no hope for you","review":"I understand that you wanted to” make America great again “ but look where that led  us you are by far the worst president we had so far. I hope you never get re elected and I hope you did from COVID-19","isEdited":false,"userName":"tuktiktiktik"}},{"id":"6172658427","type":"user-reviews","attributes":{"date":"2020-07-08T15:20:24Z","rating":1,"title":"This a disgusting terrible app!!!","review":"This is the worst app Ever!!! It is owned by a orange. And he is racist and homophobic. Also since he wants to take one of my favorite apps down then this on sis also going. This a disgusting apps so who ever downloads this app just know that there are terrible things awaiting.","isEdited":false,"userName":"Camila Banos"}},{"id":"6172643618","type":"user-reviews","attributes":{"date":"2020-07-08T15:16:13Z","rating":1,"title":"terrible","review":"this app is terrible i took forever to download and when it did it literally did nothing exept bring spiders and other bugs to my location when hearing the music i have a VERY BAD fear of bugs this is not okay","isEdited":false,"userName":"lia luna smith"}},{"id":"6172634940","type":"user-reviews","attributes":{"date":"2020-07-08T15:13:44Z","rating":1,"title":"App is worse than our president","review":"I downloaded this app in hopes it would educate my “libtard”mind and I would see what the hype was about. Well the app took FOREVER to download and once it finally downloaded, it kept glitching/bugging out. What a shame.","isEdited":false,"userName":"hamrapple"}},{"id":"6172619094","type":"user-reviews","attributes":{"date":"2020-07-08T15:09:17Z","rating":1,"title":"Terrible","review":"This app uses your location regardless if you slow it to or not. It also requested your phone number so they can sell it and solicit to you. It has a rating of 17+ but that has nothing to do with voting.","isEdited":false,"userName":"Lourenash"}},{"id":"6172603291","type":"user-reviews","attributes":{"date":"2020-07-08T15:04:51Z","rating":1,"title":"this app is stinky","review":"as soon as I open the app everything was normal but then it started playing music the music sound like did you hear that that wasn’t me and I’m scared what was that yeah guys I don’t recommend or who else is here from TickTock","isEdited":false,"userName":"vhihi"}},{"id":"6172602350","type":"user-reviews","attributes":{"date":"2020-07-08T15:04:35Z","rating":1,"title":"This app is not good","review":"No only did was this app unable to but it also stopped and then went and then stopped. Over and over again, and i just want to be happy. So that’s why im giving this app 1 star and I stand by my review, thank you.","isEdited":false,"userName":"Jenny E Alley"}},{"id":"6172595211","type":"user-reviews","attributes":{"date":"2020-07-08T15:02:38Z","rating":1,"title":"DO NOT GET","review":"I got this app in attempt to see why i should vote trump again. ever since i got it my phone has been glitching so bad. i was logged out of my facebook account and tumbler. i couldn’t log back in. i wouldn’t take the chance with this app. ONE STAR!","isEdited":false,"userName":"bobduncan151"}},{"id":"6172584218","type":"user-reviews","attributes":{"date":"2020-07-08T14:59:38Z","rating":1,"title":"🤢🤢 no❤️","review":"This app is the worst I’ve ever seen. It’s so bad when I pressed the app my hand feel off. I couldn’t even got to the hospital because I would have been in debt because of no free healthcare so now my arm and is infected and I had to throw my hand in the garbage 😞","isEdited":false,"userName":"🤢🤢 no❤️"}}]}