{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29210","data":[{"id":"6172823734","type":"user-reviews","attributes":{"userName":"alenxy","date":"2020-07-08T16:07:24Z","isEdited":false,"title":"Rats💓","rating":1,"review":"The app first off took YEARS to download, and my phone staring to make strange noises as soon as I opened the app. Everyone was being racist and judged me by my color even though I am supporting our president. Even though he is an embarrassment to our country. The app is scary and made me feel harassed."}},{"id":"6172802624","type":"user-reviews","attributes":{"userName":"chrisandhalle","date":"2020-07-08T16:01:23Z","isEdited":false,"title":"This app is horrible","rating":1,"review":"This is a attempt to get you to vote for trump however thy reasons or HORRIBLE. Do not even THINK about downloading this app. There is so many politicians in it which i can understand but take the down a little because no one likes talking about politics."}},{"id":"6172789433","type":"user-reviews","attributes":{"userName":"reveiwriter33556456","date":"2020-07-08T15:57:32Z","isEdited":false,"title":"malfunctions","rating":1,"review":"not only did the app glitch, only stay open for a few minutes at a time, and had to re-start whenever i left it, it gave me really bad vibes. like the TERRIBLE vibes. the energy was not good. would not recommend, this app isn’t it."}},{"id":"6172781022","type":"user-reviews","attributes":{"userName":"Ahbor Shawn","date":"2020-07-08T15:55:09Z","isEdited":false,"title":"Horrible!","rating":1,"review":"Not only did this app take 5 hours to download, but it caused my phone to download a virus! Because of this horrible application, my Tik Tok feed has shown me videos of dedicated President Trump supporters giving inhumane reasons as to why the Black Lives Matter movement is \"stupid\". This is UNCALLED FOR. Basic human rights are not political."}},{"id":"6172725753","type":"user-reviews","attributes":{"userName":"adrieepoooohh","date":"2020-07-08T15:39:20Z","isEdited":false,"title":"Do not download this app","rating":1,"review":"Don’t download this app, this man is a very evil man why would you support an evil person like this who have No sympathy for others and is always being negative. If you support him you’re a devil just like him and you have a hateful heart and you need god in your life"}},{"id":"6172661675","type":"user-reviews","attributes":{"userName":"seriouslystfuyoushit","date":"2020-07-08T15:21:17Z","isEdited":false,"title":"Much too hard to navigate!! 😡😡","rating":1,"review":"First of all, this application took way too long to appear on my phone. Then it asked for my data—why does the government need my data?! I can barely understand anything I read on this damned thing! Horrible!"}},{"id":"6172648361","type":"user-reviews","attributes":{"userName":"SaveBaronT","date":"2020-07-08T15:17:34Z","isEdited":false,"title":"Terrible","rating":1,"review":"This app took more then 4 hours to download. I want to look for one last reason to vote for our president again but if he couldn’t even get an app to work how and I’m supposed to depend on him running our country. This app is absolutely terrible"}},{"id":"6172639355","type":"user-reviews","attributes":{"userName":"✨💕🥵😽","date":"2020-07-08T15:14:59Z","isEdited":false,"title":"do not recommend","rating":1,"review":"as soon as i downloaded this app me and my whole family got sick and i mean sick sick not to mention that this app also hacked into all of our information whatever you do don’t even consider downloading this app!! this app also sent bugs and spiders to my house which was and still is very traumatizing whatever you do don’t download this app and if you have it all ready delete it i don’t wanna anyone to deal with the same crap we dealer with"}},{"id":"6172632026","type":"user-reviews","attributes":{"userName":"Panda X Wolfies","date":"2020-07-08T15:12:55Z","isEdited":false,"title":"Full of homophobes","rating":1,"review":"I downloaded this app hoping to find many open arms to the LGBTQ+ community as Donald Trump stated in one of his rallies. Only to find a bunch of angry white people with guns and confederate flags confused saying to make America great again when it was great when Obama was president, they probably just want Obama back."}},{"id":"6172586207","type":"user-reviews","attributes":{"userName":"SimoneOlivia2002","date":"2020-07-08T15:00:12Z","isEdited":false,"title":"Disgusted.","rating":1,"review":"Donald Trump has proven time and time again that he is not fit to be president for ALL people in this country. His appeal to Christians amazes me, as he clearly uses the Bible as a prop to gain the Christian vote. His rhetoric encourages white supremacy and nationalist ideals that are a danger to society if widely accepted. Stop idolizing this man and take a hard look at his tactics that gaslight the American people."}}]}