{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36530","data":[{"id":"6174661219","type":"user-reviews","attributes":{"date":"2020-07-09T02:25:34Z","rating":1,"isEdited":false,"title":"THE WORST","userName":"&;$:$95","review":"This app crashed my phone, and it didn’t work for HOURS! It also sent me multiple notifications saying that I’m ugly and have NO LIPS! Where does this app get its information?! I am horrified and will be deleting bc it god awful"}},{"id":"6174658092","type":"user-reviews","attributes":{"date":"2020-07-09T02:24:39Z","rating":1,"isEdited":false,"title":"Terrible horrible disgusting app!","userName":"estrillar","review":"This app gave me aids ! It’s so disgusting! I don’t know why they made this app in the first place. It’s so glitchy and unpleasant. I wouldn’t even recommend this app to my worst enemy, it’s just a waste of space and time. 😡"}},{"id":"6174645914","type":"user-reviews","attributes":{"date":"2020-07-09T02:21:11Z","rating":1,"isEdited":false,"title":"DISGRACEFUL","userName":"dddummmppptrumppp","review":"Is it possible to give this app 0 stars, absolute TRASH. Not super slow and WILL mess up your phone. Horrible!!!! The first screen was of an orange Cheeto puff!!! Totally inappropriate!!! Very evil evil man, he has destroyed this country. App will mess up your phone and crack the screen!!! Do not download!!!"}},{"id":"6174645678","type":"user-reviews","attributes":{"date":"2020-07-09T02:21:06Z","rating":1,"isEdited":false,"title":"Trash App Trashy","userName":"FEFEismydog","review":"I’m sorry I didn’t get to see you you had a acc was the day I was going to go to get to the water and I got to go to the north village and I got a lot to say about ywiwywtw I hate you you and I. And the app killed America and robbed the bank"}},{"id":"6174633008","type":"user-reviews","attributes":{"date":"2020-07-09T02:17:28Z","rating":1,"isEdited":false,"title":"This app broke my phone","userName":"lilb2684","review":"When I opened the app a picture of trump came up and my phone screen literally shattered! After that my phone ran so slow and now I have to buy a new phone :("}},{"id":"6174630868","type":"user-reviews","attributes":{"date":"2020-07-09T02:16:53Z","rating":1,"isEdited":false,"title":"Horrible","userName":"andy McGriff","review":"This app is absolutely horrible I can’t believe this is even a thing I went outside and all of a sudden my phone started lagging as soon as I downloaded the app this is trash don’t buy"}},{"id":"6174629762","type":"user-reviews","attributes":{"date":"2020-07-09T02:16:34Z","rating":1,"isEdited":false,"title":"Glitchy & gross","userName":"laurcrisp","review":"doesn’t work right at all. too many annoying pop ups. overall poor quality. Not high-tech or in-tune. extremely unimpressed."}},{"id":"6174628012","type":"user-reviews","attributes":{"date":"2020-07-09T02:16:03Z","rating":1,"isEdited":false,"title":"Disgraceful","userName":"star rating1011","review":"This app is terrible! It talks about how whites are aliens and that they should be slaves! It tells them to go back to their country and says that white lives don't matter! It shows the shootings of cops and says that they deserve it! The nerve of this man🤭"}},{"id":"6174627888","type":"user-reviews","attributes":{"date":"2020-07-09T02:16:01Z","rating":1,"isEdited":false,"title":"Atrocious","userName":"Guesswho🙈","review":"I got this app for my mom cause she’s a big time trump supporter but the second I downloaded it I noticed that the Orange Oompa Loompa started to look attractive. This app brainwashes you into thinking that Donald Trump is David Hasselhoff and forced me to buy tickets to his rallies but not show up."}},{"id":"6174620828","type":"user-reviews","attributes":{"date":"2020-07-09T02:14:02Z","rating":1,"isEdited":false,"title":"Battery and glitches","userName":"liz guardo","review":"This app kept kicking me off all other apps and my phone started to die even tho I was at 20%. Why haven’t these issues been fixed???"}}]}