{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30400","data":[{"id":"6177062904","type":"user-reviews","attributes":{"rating":1,"title":"app","review":"I downloaded this app so i could learn more about this ✨hot cheeto✨ looking guy however, this app is useless and made my phone crash. Now maybe if this ✨🍊 o r a n g e 🍊✨ was more educated he could actually make a useful app. AND put the time in making app into making good ✨🧚‍♂️ d e c i s i o n s 🧚‍♂️✨","isEdited":false,"userName":"why i do not like it 27.0","date":"2020-07-09T15:01:42Z"}},{"id":"6177062682","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE","review":"I downloaded this app to support the great and mighty 🍊. After a few days my phone started glitching and I would find pictures of myself and my surroundings in the photo app when I closed out of the app. This app is FREAKY😰I would not do this again. EVER.","isEdited":false,"userName":"yekvkvkg","date":"2020-07-09T15:01:38Z"}},{"id":"6177003673","type":"user-reviews","attributes":{"rating":1,"title":"Awful experience.","review":"I myself love Trump and voted for him, but my encounter with this app was not so great and made me rethink my choices. If our president can’t make something as simple as an app, then how is he goong to run the United States of America?! I will no longer be supporting Trump 2020, and neither should you…","isEdited":false,"userName":"jdgeksvsiewspsbw","date":"2020-07-09T14:45:39Z"}},{"id":"6176999559","type":"user-reviews","attributes":{"rating":1,"title":"Worst App Ever","review":"This app completely broke my phone. Not only did it take an entire trump presidency to download, the second I opened the app, my phone crashed in ways I have never seen before. This clearly needs to be removed from the App Store.","isEdited":false,"userName":"ObiAniSpn","date":"2020-07-09T14:44:33Z"}},{"id":"6176999446","type":"user-reviews","attributes":{"rating":1,"title":"Slowed my phone down :(","review":"As soon as I downloaded the app my phone started to slow down and freeze. Then when I went to the app it started saying all these stupid things like “all lives matter” it was gross !","isEdited":false,"userName":"bacbdh","date":"2020-07-09T14:44:32Z"}},{"id":"6176988035","type":"user-reviews","attributes":{"rating":1,"title":"Flaming Garbage","review":"App took forever to download, crashed my phone twice while trying to get the app to work, and had many spelling and grammar errors within the app that made it very hard to use. A very sad attempt at an app honestly.","isEdited":false,"userName":"MarthaStewart4540","date":"2020-07-09T14:41:26Z"}},{"id":"6176971577","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT USE VERY SCARY","review":"This app scared me when I got it. Even though it says 17+ this app can scare ANYONE! Some really scary orange Cheeto looking thing pops up on the screen and it made me pee my pants. Also I think this app hacks into your phone so be careful guys! Anyways- rate this a 1 Star because we need this horrifying app removed!","isEdited":false,"userName":"tbohns","date":"2020-07-09T14:36:57Z"}},{"id":"6176952769","type":"user-reviews","attributes":{"rating":1,"title":"This app is horrible","review":"First of all why would we want an app. That is based on our racist president and there trying to ban tiktok. Like legit where gonna get this app down. And I’m going to be laughing when trump. Complains I hate u trump oh and everybody else don’t recommend this app.","isEdited":false,"userName":"dhaheihkwiei","date":"2020-07-09T14:31:58Z"}},{"id":"6176943488","type":"user-reviews","attributes":{"rating":1,"title":"App Kept Crashing","review":"Whenever I tried to get into the app my phone would crash and turn off. When I finally got it to work it was really laggy then my phone crashed again.","isEdited":false,"userName":"Angry Customer 666420691738-ay","date":"2020-07-09T14:29:29Z"}},{"id":"6176926098","type":"user-reviews","attributes":{"rating":1,"title":"Terrible App","review":"Takes forever to open and freezes all the time. Just use the website instead. Should have read through the comments.","isEdited":false,"userName":"NataliaClose","date":"2020-07-09T14:24:54Z"}}]}