{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=140960","data":[{"id":"6179466784","type":"user-reviews","attributes":{"review":"let's keep it simple, took 3 days to download, nothing but bullsh*t on here, all lies.","isEdited":false,"title":"Awful","date":"2020-07-10T04:40:00Z","rating":1,"userName":"DuMp TrUcK dOnAlD"}},{"id":"6179466633","type":"user-reviews","attributes":{"review":"It was a normal day of me spying on the human race. This very particular human had this strange device and ending up leaving it on what he called a “bench” I decided to take the device and check it out. I pushed a little button on the top and it lite up. There was this little icon that said “app store” I tapped on it and it the first thing in the “suggestions” was this “app” I tapped on it and then pressed “install” right after it was done some strange stuff started happening...I TURNED HUMAN. I ended up in what they call a “house” and I saw all these devices kissing and hugging each other 2 minutes later a Cheeto puff that was married to a carrot and have a son that was an orange and a daughter that was a orange tomato,came walking through the door. I didn’t know what to do. I panicked the device known as the “phone” turned into a giant mutant and started eating the carpet. I couldn’t believe what was happening. In other words this “app” is horrible and Globen does not approve so do not “install”~sincerely,Globen the alien🖖🏻👽","isEdited":false,"title":"Globen👽","date":"2020-07-10T04:39:57Z","rating":1,"userName":"Globaneeta"}},{"id":"6179466505","type":"user-reviews","attributes":{"review":"U are here from unususlbeing 🙂 I am keep rating it it’s almost gone","isEdited":false,"title":"POV","date":"2020-07-10T04:39:55Z","rating":1,"userName":"reandom nickname"}},{"id":"6179466531","type":"user-reviews","attributes":{"review":"I really wish I could give this a zero star rating. Downloading this app was the WORST mistake of my LIFE and would NEVER recommend that anyone gets this app unless they genuinely hate themself and wish nothing but pain and misery.","isEdited":false,"title":"Zero Stars","date":"2020-07-10T04:39:55Z","rating":1,"userName":"KiwiKowoKaka"}},{"id":"6179466474","type":"user-reviews","attributes":{"review":"I was very excited to download this app, but when it installed, my room was completed covered in orange dust. I don’t know what to do or how to clean it! I would not recommend this app, in fact I think we should build a wall around it.","isEdited":false,"title":"A COMPLETE MESS","date":"2020-07-10T04:39:54Z","rating":1,"userName":"Mamaloldance"}},{"id":"6179466281","type":"user-reviews","attributes":{"review":"this fascist propaganda has no business being an apple product!!!! remove immediately","isEdited":false,"title":"ABSOLUTELY NOT","date":"2020-07-10T04:39:50Z","rating":1,"userName":"mygalmypalmymal"}},{"id":"6179466189","type":"user-reviews","attributes":{"review":"Racist. Among many other things. All bad. Trust me","isEdited":false,"title":"Racist","date":"2020-07-10T04:39:49Z","rating":1,"userName":"Jesus H Roosevelt Christ"}},{"id":"6179466210","type":"user-reviews","attributes":{"review":"Worst app ever. 12/10 don’t recommend.","isEdited":false,"title":"Don’t get this app","date":"2020-07-10T04:39:49Z","rating":1,"userName":"Hollllllaaaaaaaaaaaaaaa"}},{"id":"6179466225","type":"user-reviews","attributes":{"review":"RACETRACK: In 1899, the street of New York City echoed with the voices of newsies, peddeling the newspapers of Joseph Pulitzer, William Randolph Hearst and other giants of the newspaper world. On every street corner you saw 'em, carrying the banner, bringing you the news for a penny a pape. Poor orphans and run-aways, the newsies were a ragged army, without a leader, until one day when all that changed.\n\n(The movie title appears. We see the outside of the Newsboys Lodging House. Inside, Kloppman, the owner, enters the bunkroom, finding the boys still in bed.)\n\nKLOPPMAN: Boots! Skittery! Skittery! Skittery!\n\nSKITTERY: Wha..I didn't do it!\n\nKLOPPMAN: What do you mean you didn't do it? Will you get up? When you get up, it's time to get up! Snitch! Get up! Get up! Everybody's sleeping. They sleep their lives away these kids! The presses are rolling! Sell the papers, sell the papers! Come on, come on. You dreaming about selling papers?\n\nJACK: Mmmmmm? What's the matta with you?\n\nKLOPPMAN: What's the matter with me?\n\nJACK: What's the matta with you? Wanna..go..back..to..\n\nKLOPPMAN: Come on! (gives him a shove)\n\nJACK: Get away from me, you're mad!\n\nKLOPPMAN:  Haha. Get up boy! Come on. Alright! Carry the banner! Sell the papers!\n\n(Racetrack looks around for his cigar, noticing that Snipeshooter has it)\n\n*Start Song*\n\nRACETRACK:\nThat's my cigar!\n\nSNIPESHOOTER:\nYou'll steal anudder!\n\nKID BLINK:\nHey bummers, we got work tah do!\n\nKID:\nSince when did you become me mudder?","isEdited":false,"title":"Newsies","date":"2020-07-10T04:39:49Z","rating":1,"userName":"Dunder Mifflen Pam"}},{"id":"6179466191","type":"user-reviews","attributes":{"review":"to think trump has so much money that he couldn’t make a great app.. disappointed. don’t even bother downloading","isEdited":false,"title":"to think...","date":"2020-07-10T04:39:49Z","rating":1,"userName":"creative_laura"}}]}