{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=128960","data":[{"id":"6175996157","type":"user-reviews","attributes":{"userName":"🤮💀🤡💥🤷‍♀️😤🤢","date":"2020-07-09T10:01:06Z","isEdited":false,"rating":1,"title":"Poopoo stinky app 😳","review":"Le monkë \nfarts uh oh....STINKY!!\n\nPOOP!!!!!!!\n\nAHAHAHAHAHAHHHAHAHHAHHAHAHAHH FUNNY POOPIES!!!!!!!!!!!\n\nXD ELELELELELELELEL PPPPPPPOOOOO\n\nPPPPPPPPPPYYYYYYYYYYY\n\nYYYYYYYYYYYYYYYYYYYYY\n\nYYY!!!!!!!!!!!!!!!!! HAHAHAH AHAHAH\n\nAHAHAHA FUNNY POOP! POOP FUNNY! WEE\n\nEEEEEEEEEEEEEEE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! YAY FOR POOPIE! GOOD POOPIE! POOPIE FUNNY! AHAH XDDD\n\nDDDDDDD\n\nDDDDDDD DDDDD POOP POOP POOP POOP POOP POOP POOP POOP POOP\n\nPOOP POOP POOP POOP POOP POOP POOP POOP POOP\n\nPOOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP POOP LELELELELELELELELELELELLE XDXDXD\n\nPOOPY FUNNY! YAY! FUN FUN POOP\n\n! TEE HEE XD POOP! POOPY! YAY! POOP MAKE ME HAPPY! HAPPY HAPPY P\n\nOOP POOP! AHAHAHAHAHAHAHHAHAHAHHAHAHAHHAHHAHDXDXD\n\nUH OH< I THINK I MADE A POOPIE :))))))):):)\n\nAHAHAHAHAHAHAHAHAHHAHAHHAHAHAHHAHHAH!!!!!!!!!!!!!!!!!\n\nPOOP IN PANTS! NO DIAPER! THAT'S FUNNY! XDDD\n\nOOPSIE! POOPY UNDERWEAR NOW! TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE TEE HEE\n\nWE WANT POOPIES! WE WANT POOPIES! AHHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHH HHHHHHHH :) :) :) :) :) :) :) :) :) :) AHA\n\nPOOP"}},{"id":"6175995652","type":"user-reviews","attributes":{"userName":"Chantel103","date":"2020-07-09T10:00:57Z","isEdited":false,"rating":1,"title":"JUST DUMB IN GENERAL","review":"F*ck DONALD TRUMP"}},{"id":"6175995237","type":"user-reviews","attributes":{"userName":"christian💅🏼","date":"2020-07-09T10:00:48Z","isEdited":false,"rating":1,"title":"periana 💅🏼","review":"this app is awful it took my storage,data,and more i have no trust in this app or the logo for it!it spreads white supreme,transphobia,homophobia,islamaphobia,and xenophobic i hate it so much i want to go to the rally but my goldfish drowned 👁👄👁i’m so sorry me.trump aka bunker b!tch or cheeto puff your very old and weird stop thinking we like you we don’t please go mia and never return your the most hated in a very bad way it’s so sad to see you as the face of america i don’t wish it on my worst enemy and please stop putting innocent children in cages it’s kinda sus along with you pence is a racist homophobe don’t think you not gone get it to bigot your weird with your bald headed self i seen them life pics of you in the club 👀don’t think we forgot chile long nose ain’t eater looking mf and trump come get your boot locker candice she’s off her rocker 😳 dead ass"}},{"id":"6175995037","type":"user-reviews","attributes":{"userName":"jeanette paul","date":"2020-07-09T10:00:44Z","isEdited":false,"rating":1,"title":"🍊🍊🗑🗑","review":"i would like to address that this app support a man who is racist, sexist, homophobic, misogynistic and serval other things. he literally has rape “allegations” against him, FOR MINORS. this is absolutely ridiculous and idk how anyone could support this type of behavior"}},{"id":"6175992845","type":"user-reviews","attributes":{"userName":"dinosaur b.c.","date":"2020-07-09T10:00:04Z","isEdited":false,"rating":1,"title":"NOT CUTE AT ALLLL","review":"This app HORRIBLE..... if I could give it zero stars I most DEFINITELY would. This app made me vote for trump. It was so dumb I would never vote for him in my entire life. This makes me sick shii is disgusting like that piece orange man....."}},{"id":"6175988858","type":"user-reviews","attributes":{"userName":"Gabriel_Johnson","date":"2020-07-09T09:58:45Z","isEdited":false,"rating":1,"title":"poopy head","review":"you’re a stinky poopy fart 🤬🤬🤬🤬🤬😐😳😠😕😫😩😒😒🧐😛🤨😍😗🙂😉☺️😇😗🥰😝😋😚😎🤨😎🤨😒🤪🤓🤨😒😒"}},{"id":"6175986634","type":"user-reviews","attributes":{"userName":"HAHAH hi tiktok","date":"2020-07-09T09:58:04Z","isEdited":false,"rating":1,"title":"WORST APP IVE EVER EVEN SEEN","review":"trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash, trash,"}},{"id":"6175984965","type":"user-reviews","attributes":{"userName":"kcmae00","date":"2020-07-09T09:57:30Z","isEdited":false,"rating":1,"title":"ABSOLUTELY TRAUMATIZING","review":"downloading this app was by far the worst decision of my life, and i’ve given myself bangs multiple times. but unlike bangs, redownloading this app is something i will never in a million years consider. the app took up every inch of my storage even though my phone is new and i haven’t synced my icloud data yet. i wasn’t able to do anything on my phone since the storage was full, so my only option was to go on the app. the second i opened it, i received numerous notifications and alerts that it was not a secure application and my phone was being overtaken by bugs and viruses. i’m scared to use my phone now, and i don’t know what information on my phone has already been hacked. i came on it one last time before throwing my entire phone away just to leave this review. DO NOT DOWNLOAD THIS APP. it should be removed from the app store immediately so no one else has to go through the pain and suffering that i have. worst week of my life. -10000/10."}},{"id":"6175983935","type":"user-reviews","attributes":{"userName":"The love of your life 🧚🏽✨","date":"2020-07-09T09:57:09Z","isEdited":false,"rating":1,"title":"Horrible❤️","review":"I didn’t get my verification code, and I realized that the guy in the front was a fraud and hid for days cuz he was scared and I found out that the whole app is racist 😟 BLM. Period ✊🏽✊🏾✊🏿 then I found out the orange Cheeto hated Mexicans and i was like how dare u disrespect a powerful community then I realized that he is a big jerk, loser, selfish, and ugly, so last of all Trump 2020 \nU\nARE\nUNINVITED \nTO\nMY\nBIRTHDAY \nPARTY 🎉 \nPeriod.\nCongratulations \nLosers\n\nLove- the love of your life"}},{"id":"6175982414","type":"user-reviews","attributes":{"userName":"Vibrating Turtle","date":"2020-07-09T09:56:39Z","isEdited":false,"rating":1,"title":"Big Y I K E S","review":"Why if this app didn't close everytime I open it and then open everytime I close it, maybe just maybe... it would be a good thing to still delete this trash app. the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜  the ants 😡🐜"}}]}