{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28880","data":[{"id":"6177009678","type":"user-reviews","attributes":{"review":"I made an account and put in my info and then a bunch of my accounts were getting hacked and I had a friend who’s really good with technology find out why and it was because of this app. Please get rid of this app it is terrible","title":"Hacked my accounts","userName":"Zaw1010","date":"2020-07-09T14:47:16Z","isEdited":false,"rating":1}},{"id":"6177009327","type":"user-reviews","attributes":{"review":"This is trash like trump your not doing anything but getting off my App Store bot when I opened this app my eyes broke and ran away then I fell down the stairs got in a accident and ran into 15 walls at my doctors and couldn’t get treated because of how bad the app is and how trash trump is and looks!!!","title":"Trash","userName":"Trumpsstupid","date":"2020-07-09T14:47:11Z","isEdited":false,"rating":1}},{"id":"6177002971","type":"user-reviews","attributes":{"review":"THIS APP RUINED MY LIFE!!!! Once I downloaded this app horrible things began happening. First my house was attacked by crows flying into our windows and killing themselves. Then I went temporarily blind. Not kidding. I was blind for THREE WEEKS. Whatever you do, DO NOT download this racist, homophobic, xenophobic, pathetic excuse of anything close to a man’s app 😋😋","title":"horrible","userName":"stew🤑❤️","date":"2020-07-09T14:45:28Z","isEdited":false,"rating":1}},{"id":"6176978824","type":"user-reviews","attributes":{"review":"it didn’t make any sense. i got on it and it just froze and took me to TIKTOK❤️❤️❤️❤️❤️❤️❤️❤️❤️  where people are smarter and understand why our country has gone bad. where all the CRIMES that have been hidden are now REVEALD because we’re NOT BLIND. It also just didn’t let me tap anything","title":"✨ garbage ✨","userName":"mae alyssa","date":"2020-07-09T14:38:56Z","isEdited":false,"rating":1}},{"id":"6176957760","type":"user-reviews","attributes":{"review":"this took a week to download and when it finally downloaded it said that the app was down for maintenance. confused i wondered, what kind of maintenance would they need to be doing on this app? and that’s when i realized, they are stealing personal information to sell to other websites and app providers. stealing my data and using it to control me and how i live. now, i do not condone any racism but trump is kinda racist. just a thought but i’m really mad at this app and maybe i’ll go get the burnie app.❤️burnie❤️","title":"trash","userName":"gibbywalking","date":"2020-07-09T14:33:17Z","isEdited":false,"rating":1}},{"id":"6176947901","type":"user-reviews","attributes":{"review":"This app is racist! I downloaded it and it asked for my ethnicity and i put down hispanic as i am hispanic. Instead of signing me into the app, it called me a dirty hispanic immigrant, doxxed me and my family and killed my dog. 0/10 would not recommend. please go back to your country donald trump❤️","title":"this app called me a dirty hispanic","userName":"Satan💯💯","date":"2020-07-09T14:30:40Z","isEdited":false,"rating":1}},{"id":"6176947671","type":"user-reviews","attributes":{"review":"I’m sorry but this app did not live up to my expectations. There were several bug crashes that no update could fix because they were so bad. It made me log back in again and start a new account.","title":"Bad App","userName":"Everlyyyyyshdhdrv","date":"2020-07-09T14:30:36Z","isEdited":false,"rating":1}},{"id":"6176930003","type":"user-reviews","attributes":{"review":"I am writing this review because trump said that he would make america great but i still very much hate it here and now he wants to ban tiktok for whatever reason and I just think he’s gotten way out of control someone please help him he needs it","title":"Bad app very not good","userName":"kiannamarie2020","date":"2020-07-09T14:25:54Z","isEdited":false,"rating":1}},{"id":"6176915561","type":"user-reviews","attributes":{"review":"I downloaded this app just to find a Cheeto on the screen. Is this supposed to be some type of joke. Then my screen froze and I clicked home and it was just a Cheeto. I believe that this Cheeto is a terrible thing to see on the tv. Will be deleting","title":"Absolutely terrible","userName":"Bananasandchese","date":"2020-07-09T14:22:13Z","isEdited":false,"rating":1}},{"id":"6176914587","type":"user-reviews","attributes":{"review":"Something is gravely wrong with this app. The minute I downloaded it my phone started to glitch and give me problems. Also, I wanted to see what Trump’s vision was for our future and I expected better than what the app has given me! DO NOT USE THIS APP!","title":"Disappointed","userName":"tehehe ok","date":"2020-07-09T14:21:58Z","isEdited":false,"rating":1}}]}