{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=17650","data":[{"id":"6178552998","type":"user-reviews","attributes":{"date":"2020-07-09T23:05:15Z","title":"THE WORST APP EVER!!!!","userName":"Mary Ann Rose","rating":1,"isEdited":false,"review":"I recommend if you’d like a functional app that helps your day to day life that you NOT download this app. Not only do I HATE the display and editing of the app in itself, but the designer had the WORST taste in internet design and education. Apple needs to remove this application immediately in order to save the American people their money and time!! Make America great again by DELETING THIS APP!!"}},{"id":"6178529046","type":"user-reviews","attributes":{"date":"2020-07-09T22:55:46Z","title":"absolutely terrible. DO NOT BUY!!!","userName":"1-2-15","rating":1,"isEdited":false,"review":"Considering how powerful this app could be, I was immensely disappointed when I had come to realize that it is absolute trash. This app is in no way beneficial to any trump supporter or otherwise. It has countless glitches, ads, and it was simply very difficult to do anything that it was made for. Would not recommend."}},{"id":"6178497481","type":"user-reviews","attributes":{"date":"2020-07-09T22:43:06Z","title":"BLM","userName":"_.kiki__janee._","rating":1,"isEdited":false,"review":"Wow this app really should be taken DOWN!!! Not only did all my hair fall out but an old man came up to me slapping his fish and eating his foot. But also my cat was swung from the ceiling fan and fell in my lake. But then the app spilt my soap and kissed my left knee after I ate 40 sticks of fried butter!!! Then my phone was taken by FBI agents and assaulted in the airport. Then oh hey guess what I left a Pringle chip on my front step LMAOOOOOOOOOO hopefully they delete his app"}},{"id":"6178465763","type":"user-reviews","attributes":{"date":"2020-07-09T22:30:36Z","title":"Would give 0 stars if i could","userName":"f.nniemills","rating":1,"isEdited":false,"review":"This app is absolutely awful it took 2 years to download and when it did it made my phone crash repeatedly and asked if “i wanted to play a game” which of course i said yes too. next thing i know i’m wanted in 28 different states for mans laughter??????? i’m a woman. smh my head i hope no one ever downloads this ever again."}},{"id":"6178469988","type":"user-reviews","attributes":{"date":"2020-07-09T22:32:17Z","title":"terrible app....do not download","userName":"ellakrone","rating":3,"isEdited":false,"review":"i tried to download a couple days ago, but it just wouldn’t work!! it is so frustrating bc i just want to attend trump rallies and support our president, but that cannot be done if his app won’t download:( luckily, it downloaded but immediately tried to steal my personal info. i got a call from a very nice man who said he was with the social security council and said that people were trying to steal my ss number! if you want to loose your personal info and support trump, great app for that"}},{"id":"6178440462","type":"user-reviews","attributes":{"date":"2020-07-09T22:20:43Z","title":"DO NOT DOWNLOAD THE APP","userName":"itsyaboijamie","rating":1,"isEdited":false,"review":"As soon as it started to download my phone started acting funny. My whole screen would turn black and wouldn’t turn on for a whole month. Then when my phone turned on all my accounts were hacked. So I decided to delete the app and now everything is back to normal. I will never download it again. Worse app ever."}},{"id":"6178399730","type":"user-reviews","attributes":{"date":"2020-07-09T22:04:54Z","title":"Stupid and Irrelevant, YIKES","userName":"Colepenguin101","rating":1,"isEdited":false,"review":"This be GARBAGE!!! Waste of time and space on my phone. Don’t even consider getting this, it’s trash. I think it might be a scam due to the amount of phone calls I’ve been getting after downloading this app. Not sure when the random phone calls will end, hopefully soon, but yeah, don’t download this app, it’s not worth your time!"}},{"id":"6178394932","type":"user-reviews","attributes":{"date":"2020-07-09T22:03:06Z","title":"HORRIBLE APP CRASHED MY PHONE","userName":"Panda cutie","rating":1,"isEdited":false,"review":"I downloaded this app in hopes of showing my support for our dear president of America however, immediately after downloading and opening the app for the first time my entire phone crashed and was wiped of all memory!! I lost years of photos with my dear children and all of my contacts. This app is the worst thing that has ever happened to me"}},{"id":"6178359319","type":"user-reviews","attributes":{"date":"2020-07-09T21:49:22Z","title":"From Gen Z luv 😘 (save tiktok 2020)","userName":"ahs246810","rating":1,"isEdited":false,"review":"I downloaded this app specifically to in hopes find pictures of Barron. I was so disappointed when the first thing I saw was a massive and scary orange creature on my screen. I was terrified at this sight and deleted the app right away. This app is trash!!!  We are not going down without a fight. If trump wants to take away our app we will take his career. Don’t mess with gen z 🥰"}},{"id":"6178310618","type":"user-reviews","attributes":{"date":"2020-07-09T21:30:56Z","title":"terrible","userName":"kareniscarin","rating":1,"isEdited":false,"review":"I was excited to download this app, but was horrified when an orange man popped up and scared my children. This is unacceptable, this app isn’t family friendly. I cannot have my kids going through my phone and being traumatized by these graphic images of an orange. I’m sure this app has also traumatized other kids and family."}}]}