{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=44580","data":[{"id":"6172384799","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T14:04:58Z","userName":"RayRay88888888","title":"Stinky Cheeto Bunker Boy Shrimp Dick","review":"I got this app for absolutely no reason. Actually that’s false. Tiktok told me too. Anyways I opened the app and I see what looks like a glitched orange Cheeto all over my screen. Absolutely unacceptable. All Cheetos matter except that one. 1 Star😡","rating":1}},{"id":"6172376989","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T14:02:53Z","userName":"Liberty Wood","title":"I hate it here!! Gen Z rule","review":"Who let this Oompa Loompa Cheeto looking person run for president! He is awful he is literally trying to take TikTok away from us if you think that is gonna happen just know that we WILL put up a fight. - A Gen Z kid","rating":1}},{"id":"6172369417","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T14:00:51Z","userName":"1412011285","title":"Anti racism and creep","review":"I feel like I don’t need to say why just look at a picture of him that Cheeto looking adult who finds people my age cute is not gonna be my president again he has nothing for him #styles2020","rating":1}},{"id":"6172318544","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T13:46:56Z","userName":"yomamastupidassbitch","title":"Ugly Rat🐀","review":"The app quality was horrible, the dude looks like a whole cheeto puff, his toupee is a dumb looking like him, honestly i hate the guy with his “all lives matter” he’s so annoying and idk why people would want him as a president🤷🏾‍♀️🤣","rating":1}},{"id":"6172314112","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T13:45:41Z","userName":"catlover46749145","title":"THIS IS THE WORST APP EVER","review":"This app made my phone extremely glitchy...  I think they should take it down!~ I'm afraid it will install malware onto my phone... Which is not okay! I really hope the app gets taken down ❤️","rating":1}},{"id":"6172290342","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T13:38:59Z","userName":"FloweerrChild","title":"Horrible just plain horrible","review":"I downloaded this in hopes of finding reasons to defend and vote for the president of United States. Instead I found more reasons as to why he is not perfect for America. Is as Americans need a leader not a publicity stunt.","rating":1}},{"id":"6172177930","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T13:07:54Z","userName":"Yire;)","title":"Kinda disappointed.","review":"When I first downloaded the app I expected something motivating! Instead I got constant harrasment. People telling me to drink my cat’s teeth, strangle myself with my hair, stab my grandma. It’s been quite unsettling","rating":1}},{"id":"6172175156","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T13:07:08Z","userName":"❤️its your girl","title":"TikTok lives matter and app not good","review":"I am writing this review on behalf of all the kids who have TikTok and don’t want it to be banned I’m really starting to get why like when he holds babies they cry but anyway this app is not good","rating":1}},{"id":"6172127501","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T12:53:40Z","userName":"rshusvnyankts","title":"Calls and texts","review":"I put in my number and have been reciving calls and text during the night","rating":1}},{"id":"6172099072","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-08T12:45:24Z","userName":"my.fav.vale","title":"Hispanic lives matter!","review":"Horrible app! Glitches my phone so much! Took forever to download and I have perfectly good WiFi! App is very glitchy and horrible quality!","rating":1}}]}