{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24000","data":[{"id":"6177734235","type":"user-reviews","attributes":{"rating":1,"review":"This app told me to kill myself and I really don’t appreciate it. It was also very laggy and would not run. Now I’m going to go cry because this app just ruined my life. My phone is traumatized. My children are screaming. My dog is puking everywhere. Just because this app. Thanks.","title":"This is bad and you should feel bad","date":"2020-07-09T18:20:57Z","userName":"nightlightstylinson","isEdited":false}},{"id":"6177727283","type":"user-reviews","attributes":{"rating":1,"review":"as soon as i opened the app, it informed me that it was stealing all of my data and sending it to russia. it was even signed by donald trump at the bottom of the screen. very terrifying, and i deleted it immediately. DO NOT download this app, it’s being used to steal your information!!!","title":"not user friendly! + hacked me!!","date":"2020-07-09T18:18:52Z","userName":"d i s g u s t e d .","isEdited":false}},{"id":"6177722876","type":"user-reviews","attributes":{"rating":1,"review":"This app needs to be removed as soon as possible. First of all it took me 2 weeks to download it. Second, why is there a nude picture of Melania Trump as soon as you open the app?!? So inappropriate. Trump, I think you accidentally uploaded the wrong picture. This app needs to be taken down before a child sees it.","title":"WORST AND MOST INNAPROPRIATE APP EVER","date":"2020-07-09T18:17:32Z","userName":"SnickerKitty","isEdited":false}},{"id":"6177720384","type":"user-reviews","attributes":{"rating":1,"review":"I had just downloaded it and it is making my phone crash. It is very slow. I had to restart my phone multiple times. I wouldn’t recommend downloading this. If I could I would give this a 0 start rating","title":"Horrible just horrible","date":"2020-07-09T18:16:49Z","userName":"Dr. Elliot","isEdited":false}},{"id":"6177663220","type":"user-reviews","attributes":{"rating":1,"review":"When I opened the app I was appalled to discover that there was no information section where I could clearly see what and who I'm supporting and I get spammed with texts EVERY SINGLE DAY. Also gave me cult vibes, and there wasn't any scientific evidence or real numbers behind anything anyone was saying in social section. Peace and Love ✌🏼❤️☮️BLM","title":"Boring and Tasteless","date":"2020-07-09T17:59:10Z","userName":"Kim-in-im","isEdited":false}},{"id":"6177645117","type":"user-reviews","attributes":{"rating":1,"review":"I absolutely despise this app first they filled the screen with glitter that blinds you and then it starts blasting Barbie girl even with the sounds off and THEN it fills any room with smoke and the smell of jalepenos that make you cry and after that the cops come in and say “GIVE ME ALL YOUR MONEY” so I gave them 3 dollars and they said they are rich so don’t get this app","title":"no❤️","date":"2020-07-09T17:53:18Z","userName":"makennajc","isEdited":false}},{"id":"6177640816","type":"user-reviews","attributes":{"rating":1,"review":"i downloaded this app hopeful that i could follow the re-election campaign of my favorite dictator- i mean president- Donald J. Trump. i can’t even vote, what a scam. it just spammed my phone with his ugly face and was genuinely very NOT user friendly. i do not recommend this app. it is very not good. some might even go as far as to say it’s very bad. 0/10!!!","title":"Awful 😔💅🏽","date":"2020-07-09T17:51:54Z","userName":"Ksodsisi","isEdited":false}},{"id":"6177598747","type":"user-reviews","attributes":{"rating":1,"review":"Funny how this presidential administration is all “against letting apps collect information” but the very first thing when opening the app is a screen demanding personal information. Very fishy. I do NOT consent to getting messages and emails from an app that is probably fun by fascists!! No thank you.","title":"Stealing my Information","date":"2020-07-09T17:38:26Z","userName":"antifa isnt an organization","isEdited":false}},{"id":"6177594901","type":"user-reviews","attributes":{"rating":1,"review":"Why the hell is he even president because he is doing nothing to this country and he is ruining kids fun by banning the one app that brings peace and happiness to every kid because it is fun and quirky and you are just ruining everything and why dont u go back to the bunker and stay there because NOBODY WANTS YOU HERE AND YOUR A DISGRACE TO EVERYONE ON THIS PLANET!!!!!!","title":"Awful and tiktok should not be banned!","date":"2020-07-09T17:37:09Z","userName":"Kaylee_feller202","isEdited":false}},{"id":"6177578535","type":"user-reviews","attributes":{"rating":1,"review":"I honestly got this app to learn more about trumps plan but the app just kept making my phone crash and it would freeze all the time I know it was the app cause as soon as I downloaded it all these glitches started happening 0/10 don’t recommend","title":"Tik tok ideas","date":"2020-07-09T17:31:55Z","userName":"ezmehhhhhhhhhg","isEdited":false}}]}