{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=129640","data":[{"id":"6175096513","type":"user-reviews","attributes":{"rating":1,"title":"WACK","userName":"Jamie 🙃🙃","isEdited":false,"date":"2020-07-09T04:38:03Z","review":"Yes I wanna do you want to go get home from school today I wioeiriruieiwieuturueiwiieuiriw wanna do I wanna know how it to my god the moon and is back in the corona and I love ya bro haha was a great night out here for you and your family to come back and join you and you will be back to the day of the day and you will talk in the day you have to leave me alone I love ya and you have to say that you love me me too haha was a day and you have a lot to say to him I love you and I oop was a great night I wanna know that I was gonna was the night you and me were all the day I was like I was just kidding you have a great day love ya love mom I wanna let ya go I wanna cry like I know that I wanna was the night you had to go home to my house so you know I gotta go get to the shower I love you so so sorry to miss ya night night and love you bye love you guys i was the day you got home from work today I wanna know that you guys have fun at night I wanna know that you guys have fun at night you know you wanna is it so like you can go get mad and go to die you and you will be okay so you don’t have any money for me to go get mad and I don’t know why I gotta was it so weird I was just mad tired I was like I was sleeping so much better I love you so so sorry to miss ya night love you so so much I love you too see ya tomorrow night and thank ya love you too bruh is my life is a great night out of the day and you know that you guys have a good time to talk to"}},{"id":"6175095502","type":"user-reviews","attributes":{"rating":1,"title":"BROKE MY PHONE","userName":"Spock👁👄👁","isEdited":false,"date":"2020-07-09T04:37:44Z","review":"XUE HUA PIAO PIAO BEI FUNG XIAO XIAO"}},{"id":"6175094990","type":"user-reviews","attributes":{"rating":1,"title":"Joe biden, hilary clinton or bernie sanders are not good either","userName":"Allfor20coins","isEdited":false,"date":"2020-07-09T04:37:34Z","review":"Im trying to get trump out go follow me a littlebabymercury on tik tok"}},{"id":"6175093183","type":"user-reviews","attributes":{"rating":1,"title":"Bhbgbgvyv","userName":"hvnvhvtgv","isEdited":false,"date":"2020-07-09T04:36:58Z","review":"Hvgvgvfvfv"}},{"id":"6175092323","type":"user-reviews","attributes":{"rating":1,"title":"rawr XD","userName":"B 😌✌️","isEdited":false,"date":"2020-07-09T04:36:41Z","review":"this app really tried 🧚✨💕 never do it again 😌🥴❤️\n\nthis app puts the flaw 😌💕 in flawless 🤪\n\nheart ❤️ broke 💔so many times ⏰i i don’t know 🤷‍♀️what to believe 💭\n\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, Deluga Heights (replay)\nHey over and over if I'm tipsy or sober\nI got lil' momma on rewind like the deck in my Rover\nOn my mind, shawty fine, meditate her like yoga\nSo down on the line make me want a cold soda\nHey baby be my radio\nHear you everywhere I go\nMusic in my head\nKnow your melody in every note\nGirl you incredible\nMake yourself available\nNa na na na\nThat tune so exceptional\nSexy like a piano give you my hands if you're ready\nWe can make plans get body stand if you let me\nGirl I'm a fan chasing my boss like catch me\nI ain't a fight she gon arrest me\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nSee you been all around the globe\nNot once did you leave my mind\nWe talk on the phone, from night til the morn\nGirl you really change my life\nDoin things I never do\nI'm in the kitchin cookin things she likes\nWe're real worldwide, breakin all the rules\nSomeday I wanna make you my wife\nThat girl, like somethin off a poster\nThat girl, is a dime they say\nThat girl, is the gun to my holster\nShe's runnin through my mind all day, ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nI can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, I can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, na na na na na na na\nNa na na na na na\nShawty got me singin'\nNa na na na na na na\nNa na na na na na na\nNow she got me singin'\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my iPod stuck on replay, replay-ay-ay-ay"}},{"id":"6175092248","type":"user-reviews","attributes":{"rating":1,"title":"Absolutely Garbage","userName":"Gen z user","isEdited":false,"date":"2020-07-09T04:36:40Z","review":"Downloaded this app as a news source but I regret it, it started glitching and was very slow. Then, randomly it sent me a message saying that I will get dragged by my hair and then “snatched” if I don’t vote for Trump 2020. This was a terrifying and traumatizing experience.Later on the app was sending me spams and viruses from a guy named Jason with an Indian accent. Ended going to mental therapy after this which costed me $10,000 dollars, and getting brain cancer on my left armpit. Not only that but after I started using the app more often I can hear words whispering in my left ear like “covfefe” and Gabbie Hannah’s poem. I don’t know if it’s my ear infection or my trauma from this app but it was not a pleasant experience. In conclusion I do not recommend this app from my experience. 😾😾😾"}},{"id":"6175091867","type":"user-reviews","attributes":{"rating":1,"title":"Awful","userName":"galileosghost","isEdited":false,"date":"2020-07-09T04:36:32Z","review":"This app is horrific. I hate it here I hate it here I hate it here I hate it here I hate it here I hate it here  I hate it here I hate it here I hate it here I hate it here"}},{"id":"6175091618","type":"user-reviews","attributes":{"rating":1,"title":"Changes can be made","userName":"faire enuf","isEdited":false,"date":"2020-07-09T04:36:28Z","review":"INT. MEDIEVAL TIMES THEATER - NIGHT\n\n                         \n\n          A familiar beam of light shines down. The beam of light\n\n          descends onto a stage. Lightning flashes to reveal Prince\n\n          Charming riding his valiant steed Chauncey across the open\n\n          plains. The wind blows back his golden mane.\n\n                         \n\n                          PRINCE CHARMING\n\n           Onward Chauncey, to the highest\n\n           room of the tallest tower! Where\n\n           my princess awaits rescue from her\n\n           handsome Prince Charming.\n\n                         \n\n          Lightning cracks. Thunder booms. Charming straddles a\n\n          wooden hobby horse and gallops in place. A stage hand uses a\n\n          bellow to blow air into Prince Charming's face. Another\n\n          stage hand turns a crank that creates the moving background.\n\n          In the orchestra, a man uses coconuts to create the sound\n\n          effects of a galloping horse. Two more stage hands back\n\n          stage create the cheap sound effects of thunder and\n\n          lightning. A crudely constructed castle tower sits in front\n\n          of a cheaply painted backdrop.\n\n                         \n\n          The Fairytale Creatures are sitting at a table in the\n\n          audience.\n\n                         \n\n                          GINGERBREAD MAN\n\nThis is worse than Love Letters! I\n\n           hate dinner theatre.\n\n                         \n\n                          PINOCCHIO\n\n           Me too.\n\n                         \n\n          Pinocchio's nose grows as he is caught in the lie.\n\n                         \n\n          Prince Charming rides to the base of the tower.\n\n                         \n\n                          PRINCE CHARMING\n\n           Whoa there, Chauncey!\n\n                         \n\n          He dismounts and sets his hobby horse on the ground. He\n\n          strikes a dramatic pose.\n\n                         \n\n          A Princess leans from a tower window.\n\n                         \n\n                          ACTRESS\n\n           Hark! The brave Prince Charming\n\n           approach-ith.\n\n                         \n\n          Prince Charming puffs his chest out.\n\n           Shrek the Third - Final Screening Script 2.\n\n                         \n\n                         \n\n                         \n\n                          PRINCE CHARMING\n\n           Fear not fair maiden! I shall slay\n\n           the monster that guards you and\n\n           take my place as rightful King.\n\n                         \n\n          An old couple at a table look confused.\n\n                         \n\n                          OLD LADY\n\n           (to old man)\n\n           What did she say?\n\n                         \n\n          Prince Charming glares as the bored audience largely ignores\n\n          him.\n\n                         \n\n          A man in a bad ogre costume comes onto the stage.\n\nOGRE\n\n           Grrrrrrr!\n\n                         \n\n          The crowd erupts into applause. The Fairytale Creatures\n\n          cheer.\n\n                         \n\n                          FAIRYTALE CREATURES\n\n                          (CHEERING)\n\n           Woooo hoooo!!!\n\n                         \n\n                          GINGERBREAD MAN\n\n           Yea! Shrek!\n\n                         \n\n          At first, Prince Charming is put off by the cheers for the\n\n          Shrek-like beast. He pulls his sword and confronts the\n\n          monster.\n\n                         \n\n                          PRINCE CHARMING\n\n           Prepare foul beast to enter into a\n\n           world of pain with which you are\n\n           not familiar!\n\n                         \n\n          He is cut off as a waiter enters with a birthday cake.\n\n                         \n\n                          WAITER\n\n                          (SINGING)\n\n           Happy Birthday to thee.\n\n                         \n\n                          PRINCE CHARMING\n\n           Do you mind?\n\n                         \n\n          Prince Charming hops out of the way when a chair lands on\n\n          stage. It slides past him and bumps into the tower facade.\n\n                         \n\n                          GINGERBREAD MAN\n\n           Do you mind? Bo-ring!\n\n           Shrek the Third - Final Screening Script 3.\n\n                         \n\n                         \n\n                         \n\n          The audience laughs. Prince Charming glares at them and then\n\n          tries to recover. He points his sword at the monster again.\n\n          The tower facade starts to topple.\n\n                         \n\n                          PRINCE CHARMING\n\n                          (CLEARS THROAT)\n\n           Prepare foul beast-\n\n                         \n\n          Prince Charming looks over his shoulder and sees the facade\n\n          falling. He cringes.\n\n                         \n\n          The scenery slams against the stage, but Prince Charming is\n\n          unharmed, perfectly framed in the princesses' window. The\n\n          crowd laughs at the embarrassed Prince Charming. He shakes\n\n          his mangled sword at the audience.\n\n                         \n\n                          PRINCE CHARMING\n\n           (shaking his sword again)\n\n           Someday you'll be sorry.\n\n                         \n\n                          HECKLER\n\n           (O.S.)\n\n           We already are!\n\n                         \n\n          They laugh again. Prince Charming throws down his sword,\n\n          picks up his hobby horse and exits.\n\n                         \n\n                          OGRE\n\n           Grrrrrrr!\n\n                         \n\n          The song and the laughter follow Prince Charming backstage."}},{"id":"6175091650","type":"user-reviews","attributes":{"rating":1,"title":"Ab....12345","userName":"ab...12345","isEdited":false,"date":"2020-07-09T04:36:28Z","review":"App is terrible, I tried over and over again to use it but nothing would work"}},{"id":"6175088892","type":"user-reviews","attributes":{"rating":1,"title":"Tik tak","userName":"TIK TAK2020","isEdited":false,"date":"2020-07-09T04:35:37Z","review":"Bro is this what it comes down too after all the horrible shi* we’ve been through in 2020. Trump wakes up one morning like: uhh,  I think people make fun of me on tak tok so imma ban it🥳🇺🇸.  This means that I will ban tik tak.  Like seriously bro, people go on this app to take their mind off of what’s happening and you want to rein dat.🤦‍♂️"}}]}