{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=88710","data":[{"id":"6132518273","type":"user-reviews","attributes":{"date":"2020-06-28T16:08:54Z","rating":1,"title":"Awful app!","review":"This app is absolutely horrendous and I hate it!!!","userName":"GreatBubbles67","isEdited":false}},{"id":"6129967259","type":"user-reviews","attributes":{"date":"2020-06-28T00:59:00Z","rating":1,"title":"...","review":"Genz has more power than this orange will ever have ❤️","userName":"BLM anyone but trump 2020","isEdited":false}},{"id":"6107078267","type":"user-reviews","attributes":{"date":"2020-06-22T06:21:22Z","rating":1,"title":"The worst","review":"The worst app.... the very worst app there is...in fact so bad.... it’s really really baddddd","userName":"christinalbo","isEdited":false}},{"id":"6125883127","type":"user-reviews","attributes":{"date":"2020-06-27T00:11:28Z","rating":5,"title":"Great app","review":"It’s great","userName":"firbdirb","isEdited":false}},{"id":"6093373794","type":"user-reviews","attributes":{"date":"2020-06-18T22:15:56Z","rating":1,"title":"Fake News Central","review":"App is filled with fake news.","userName":"JjustINl0813222","isEdited":false}},{"id":"6075998788","type":"user-reviews","attributes":{"date":"2020-06-14T20:07:42Z","rating":1,"title":"Waste of time","review":"Not impressed","userName":"appreviewer501","isEdited":false}},{"id":"6072379533","type":"user-reviews","attributes":{"date":"2020-06-13T22:08:52Z","rating":1,"title":"Make the App Store Great Again","review":"Remove this app","userName":"Marebear123234345","isEdited":false}},{"id":"6053826761","type":"user-reviews","attributes":{"date":"2020-06-09T07:55:53Z","rating":1,"title":"i’m scared","review":"bruh i downloaded this app with very high hopes, being a supporter since day one, until i opened it. there was this person (?) that showed up and it just looked like that pervy orangutan from part three of jojo. (coincidence? trump and that oragutan do both be child predators... chile anyways so) i decided to still give it a chance though and as i scrolled through, i was bombarded with disgusting media that i would never wish for anyone to see. the blatant bias and lies on this app were incredibly unsettling. further, the notifications it send you are so LOUD LIKE THE VOLUME ON THIS BUS IS ASTRONOMICAL, IT IS WAY TOO LOUD IN HERE. i’m not sure if this next occurrence was related but a mob of people in maga hats, some pigs wearing navy suits with gold badges, and people ghost costumes i think showed up at my door demanding to be let in. i was terrified so i obliged. when they dispersed through my home i watched the orangutan i’d seen earlier emerge from the crowd, even worse looking in person might i add, and slowly waddle up to me. i couldn’t breathe. he came close to my ear and asked me a single question. bernie or biden? i had no idea what he meant so i said bernie. he then proceeded to make an unearthly noise and his minions waltzed over to me. he asked again, bernie or biden. i, tears pouring down my face, not wanting to say biden because child predation and terrible mindset, said biden anyway cuz i didn’t want to die. this apparently angered him even more, because he proceeded to turn his face into an expression inhuman and revolting, and whispered, t o e s. his minions attacked. i couldn’t understand what i’d done wrong, was it a trick question? at the last second, i heard a comforting voice coming from the ventilation system. bernie? i asked. yes, come with me. i fled to bernie. i finally felt safe. to this day, the rotten orangutan and his minions roam my once beloved home, waiting for my return. also i really didn’t wanna give the app my number like that private info sissy","userName":"miraslim2","isEdited":false}},{"id":"6053124958","type":"user-reviews","attributes":{"date":"2020-06-09T03:20:32Z","rating":1,"title":"👎👎👎","review":"Very racist man controlling those app!! needs to be prosecuted, protesters do your thing.","userName":"NOOO MORE TRUMP","isEdited":false}},{"id":"6052977780","type":"user-reviews","attributes":{"date":"2020-06-09T02:30:01Z","rating":5,"title":"Keep America Great 2020","review":"Great App !","userName":"Jejeface","isEdited":false}}]}