{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=40310","data":[{"id":"6109133681","type":"user-reviews","attributes":{"userName":"annika.olson","review":"I do not like this app. I don’t think it should be in the app store because it includes false information. It is also in support of a man who is racist, homophobic, xenophobic, misogynistic etc. and it makes people feel unsafe.","title":"Nope","rating":1,"isEdited":false,"date":"2020-06-22T17:43:17Z"}},{"id":"6105791620","type":"user-reviews","attributes":{"userName":"🧚‍♂️✨Gen Zer","review":"The WORST app on the market. I don’t actually understand how people like this! There’s so many bugs (like it existing that’s a major bug don’t get me wrong) but honestly I just hate it","title":"Absolutely disgusting","rating":1,"isEdited":false,"date":"2020-06-21T21:21:38Z"}},{"id":"6067788257","type":"user-reviews","attributes":{"userName":"trump*but on a gravestone*","review":"I downloaded this app and it was asking for way too much personal information. Once I gave them my phone number I got so many messages from sex traffickers. Please be safe DO NOT DOWNLOAD !!","title":"1312 horrible app","rating":1,"isEdited":false,"date":"2020-06-12T18:12:57Z"}},{"id":"6101150346","type":"user-reviews","attributes":{"userName":"trytab","review":"Great app and user friendly!","title":"Wonderful app !","rating":5,"isEdited":false,"date":"2020-06-20T17:05:39Z"}},{"id":"6094304783","type":"user-reviews","attributes":{"userName":"Cowgirl Singer Belinda Gail","review":"I am an avid Trump Supporter ... I was excited about this app ...  but when I  saw the low review score it gave me pause.  I am sooooo glad I actually read the reviews!!!  Something was obviously screwy with the reviews so after reading several bother people and con, I decided to download the app and check it out for myself.  And I am so happy I did ... I love it!!!  The 1 Star reviews are so obviously waaaaaaaay off base that the only logical conclusion is that it is a concerted effort by people totally against President Trump posing as supporters trying to steer people away from a potentially powerful tool for the Trump 2020 campaign!!!   There is a ton of good as well as interesting information in this app. As well as opportunities to get involved with the campaign even if it is just from your home. Also there are social get-togethers with other Trump supporters listed.  Thank you to the people who took the time to write a legitimate review for this app, it really helped me.  I never write reviews for apps but I am doing so now to try to pay it forward and help someone else get to the truth about this app, like someone helped me.😁\nBlessing  so all and if you decide to download this app and like it,  please leave a review and share this app with all your conservative friends so we can drown out these 1 Star review ‘posers’ with honest reviews.  Blessings to you all and let’s work hard to “Keep America Great” \nBelinda","title":"I have to agree ... the 1 Star reviews are totally bogus!!!","rating":5,"isEdited":false,"date":"2020-06-19T04:04:48Z"}},{"id":"6062754648","type":"user-reviews","attributes":{"userName":"sasilke","review":"I got this app thinking it would help make me feel powerful and superior over others again, but all it does is ramble on and on about nonsense. It sounds like my drunk uncle Bubba.","title":"I think it’s got dementia","rating":1,"isEdited":false,"date":"2020-06-11T12:05:20Z"}},{"id":"6062160411","type":"user-reviews","attributes":{"userName":"Pro YouTube Viewer","review":"I downloaded this app as a way to follow our orange world destroyer in his quest to turn everyone into an orange racist. I fortunate to see that this app was a wast of money on his part. The piece of corn that invested into this app will find that it will not help him conquer the world in any way.","title":"Scam","rating":1,"isEdited":false,"date":"2020-06-11T08:48:48Z"}},{"id":"6061746754","type":"user-reviews","attributes":{"userName":"@KyleTreasure","review":"Really buggy interface that stops working once you try to login. Do not take a chance on this app! It will only disappoint you!","title":"Doesn’t Work","rating":1,"isEdited":false,"date":"2020-06-11T06:09:05Z"}},{"id":"6060551667","type":"user-reviews","attributes":{"userName":"Markbb22","review":"Horrible app it won't let me share a campaign of my oppars and noonars.\nTrump you Cheeto wannabe orange breed let my oppars and noonars make world domination come trueee. This app needs to be yeeettted away from the Universe. Trump can disappear from this world with his genderless side chick😗💅🏻","title":"thighs pics","rating":1,"isEdited":false,"date":"2020-06-10T22:07:10Z"}},{"id":"6055276648","type":"user-reviews","attributes":{"userName":"jakeshotsauce","review":"Who knew a Cheeto w an iq of -104 knows what an app is when he spends all his time trying to pass laws that kill people of color. \nCrazy how Nazis are still alive today... maybe change needs to be made.","title":"Racist Supremacy has an App","rating":1,"isEdited":false,"date":"2020-06-09T15:34:19Z"}}]}