{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=48760","data":[{"id":"6174707774","type":"user-reviews","attributes":{"date":"2020-07-09T02:39:17Z","title":"Worst app I’ve ever used","rating":1,"userName":"redsox fan 92","isEdited":false,"review":"I have never seen as worse of an app as this, for a terrible person, I would give it a negative rating if I could"}},{"id":"6174703780","type":"user-reviews","attributes":{"date":"2020-07-09T02:38:06Z","title":"Worst app ever!","rating":1,"userName":"Sophie3647282","isEdited":false,"review":"So many glitches and extremely disorganized. Had to restart my phone to even try to delete it"}},{"id":"6174703614","type":"user-reviews","attributes":{"date":"2020-07-09T02:38:03Z","title":"Worst app ever","rating":1,"userName":"jesus homedog christ","isEdited":false,"review":"This app is designed to put man babies in power and personally I don’t think the App Store should support an app designed to ruin the world. Kill this app please. It’s terrible. Thanks"}},{"id":"6174691544","type":"user-reviews","attributes":{"date":"2020-07-09T02:34:27Z","title":"TRASH","rating":1,"userName":"emjane0621","isEdited":false,"review":"Ok so this appp has taken my chicken and now the man behind it is taking tik tok im done sorry but I don’t want to eat my brother like soup because this person is taking the app tik tok so eat cheese sorry not sorry"}},{"id":"6174691386","type":"user-reviews","attributes":{"date":"2020-07-09T02:34:24Z","title":"TERRIBLE","rating":1,"userName":"kaley doi","isEdited":false,"review":"The app doesn’t even work properly and it’s very hard to navigate. i can’t even use it without my glasses. plus not much to do."}},{"id":"6174688251","type":"user-reviews","attributes":{"date":"2020-07-09T02:33:27Z","title":"trash.","rating":1,"userName":"lameeee72","isEdited":false,"review":"this app is terrible! I can’t believe It!! Literally I thought it was meant to walk my dog and now, my dog is gone. thanks a lot, obama would’ve done better sorry🥰"}},{"id":"6174685850","type":"user-reviews","attributes":{"date":"2020-07-09T02:32:44Z","title":"Bad","rating":1,"userName":"poopeaploopy","isEdited":false,"review":"This app was absolutely disgusting. I thought this was a direct link to Trumps only fans but turns out it’s not!! One star for the let down. Peepeepoopeepoopeepoopoopeepeepoopoopeepeepoopoopeepeepoopoo."}},{"id":"6174655710","type":"user-reviews","attributes":{"date":"2020-07-09T02:23:58Z","title":"This app is HORRIBLE","rating":1,"userName":"dairy dallas","isEdited":false,"review":"This app is terrible it actually caused my entire FAMILY TO BE KIDNAPPED AMD TAKEN TO GUATEMALA FOR A 6 MILLION DOLLAR RANSOM!!!! Do not get this app I hope whoever made this will pls release my dear aunt petunia, uncle Clyde, and cousin Tomathy. Anyways don’t download this app of u value ur southern Baptist red neck kin. Prayers y’all"}},{"id":"6174654351","type":"user-reviews","attributes":{"date":"2020-07-09T02:23:36Z","title":"🐸","rating":1,"userName":"laxmancool10","isEdited":false,"review":"Bug glitches, lag, data mining, overall gross incompetency...this is the WORST app known to mankind. It literally burned my eyes just looking at it. I am now blind. How am I supposed to keep an eye out for Selener? This is inexcusable.\n➖👄➖"}},{"id":"6174654200","type":"user-reviews","attributes":{"date":"2020-07-09T02:23:33Z","title":"Make this app GREAT again","rating":1,"userName":"Emily1234567890!!","isEdited":false,"review":"I downloaded this app to support MY FAVORITE PRESIDENT Donald J Trump but was so angry to find out that it was being controlled by the liberal media and wasn’t giving me the REAL NEWS that I was needing. WORSE than CNN! Delete this app!!!"}}]}