{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30420","data":[{"id":"6176788655","type":"user-reviews","attributes":{"date":"2020-07-09T13:48:49Z","rating":1,"title":"Worst App Ever","userName":"Laaaauuuur","review":"This app took way too long to download which was ridiculous. Then it drained my battery every time I would open it! Worst of all, it tried to make me feel okay supporting a racist, homophobic misogynist. I wish I could give it 0/5 stars.","isEdited":false}},{"id":"6176765152","type":"user-reviews","attributes":{"date":"2020-07-09T13:42:33Z","rating":1,"title":"TERRIBLE!!!!!","userName":"LexAlexa432","review":"When I downloaded this app it hacked into all my social media and I had to get a new phone!!! It also made a notification pop up that kept saying vote for Donald every second! So please don’t download it will hack into your iPhone also!! Not good!!🧚🏻‍♂️🧚🏻‍♂️🧚🏻‍♂️","isEdited":false}},{"id":"6176759503","type":"user-reviews","attributes":{"date":"2020-07-09T13:41:06Z","rating":1,"title":"This app is worse than Trump!","userName":"devinnunesisatraitor","review":"What’s the point of this dumb thing if it’s not even going to download??? Seven hours of waiting! Why would you put your name on something and then release such a terrible product? This app has to go!","isEdited":false}},{"id":"6176754407","type":"user-reviews","attributes":{"date":"2020-07-09T13:39:46Z","rating":1,"title":"worst app ever","userName":"Justcoz","review":"took forever to download, terrible interface, even worse ideals. after a week of having this app I became a bigoted idiot with no moral compass. I cannot believe people successfully use this app to do anything positive! wish I could rate it 0 stars.","isEdited":false}},{"id":"6176753098","type":"user-reviews","attributes":{"date":"2020-07-09T13:39:24Z","rating":1,"title":"Outrageous","userName":"jesus&tacos","review":"I downloaded this app for my son (he’s 5) and this app asked him for his PHONE NUMBER! I was very concerned as a parent seeing that, why do you need the phone number of a 5 year old? I am disgusted in your braveness to be asking children such questions RIGHT IN FRONT OF THE PARENT! It’s sickening in all honest.","isEdited":false}},{"id":"6176728235","type":"user-reviews","attributes":{"date":"2020-07-09T13:32:53Z","rating":1,"title":"This app forced it’s way on my phone.","userName":"Invising","review":"I am NOT a Trump supporter, never have and never will be, so you’d imagine my surprise when the app found it’s way on my home screen. The government is bugging our phones and gathering our data to coax us to vote for Trump. #Trump2020onaGravestone","isEdited":false}},{"id":"6176718163","type":"user-reviews","attributes":{"date":"2020-07-09T13:30:16Z","rating":1,"title":"WORST APP EVER😤😤","userName":"gsizzle_onthe_grizzle420","review":"For starters the app took DAYS to download not to mention the terrible quality when you open the app. I was hoping to gain knowledge on trump but everything on the app was just so hateful and really opened my eyes to our monstrosity hot Cheeto president if you would even DARE to call him that. THIS APP IS AWFUL.","isEdited":false}},{"id":"6176708910","type":"user-reviews","attributes":{"date":"2020-07-09T13:27:49Z","rating":1,"title":"Bad app","userName":"came get me","review":"Not only did this app take 2 weeks to download when I opened it, it kept crashing. After about three tries it bugged my phone and was stuck in a boot up loop. Please don’t  download it will ruin your mobile phone!","isEdited":false}},{"id":"6176705144","type":"user-reviews","attributes":{"date":"2020-07-09T13:26:49Z","rating":1,"title":"0/10","userName":"DonaldLTrump","review":"When I downloaded this app I wanted to see all of the wonderful things our president is doing for America but was disappointed when I came to realization that he hasn’t done any. 0/10 would download again. :(","isEdited":false}},{"id":"6176697503","type":"user-reviews","attributes":{"date":"2020-07-09T13:24:50Z","rating":1,"title":"Disgraceful","userName":"delacruz413","review":"after downloading the app many racist slurs were sent to me via text message and i didn’t like that at all. My data was also compromised and i only saw ads about trumps 2020 campaign. Terrible app will be deleting immediately.","isEdited":false}}]}