{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=73170","data":[{"id":"6179117577","type":"user-reviews","attributes":{"review":"I am from 203 BC, and this app just downloaded now. I regret it every minute.","isEdited":false,"userName":"hamiltonIheartyou","title":"Small Peen Trump","rating":1,"date":"2020-07-10T02:38:27Z"}},{"id":"6179108174","type":"user-reviews","attributes":{"review":"It hacked every thing my photos videos my air pods and more bad app","isEdited":false,"userName":"rfceuhcdry","title":"Hacked","rating":1,"date":"2020-07-10T02:34:59Z"}},{"id":"6179104830","type":"user-reviews","attributes":{"review":"this app hacked all of my information and sold it on the dark web.","isEdited":false,"userName":"pearllillyplum","title":"DONT DOWNLOAD","rating":1,"date":"2020-07-10T02:33:47Z"}},{"id":"6179070580","type":"user-reviews","attributes":{"review":"i downloaded this thinking that i would get news about our president but instead this app wouldn’t open on my phone nor my ipad","isEdited":false,"userName":"Stingypillow26","title":"do not download","rating":1,"date":"2020-07-10T02:21:16Z"}},{"id":"6179057231","type":"user-reviews","attributes":{"review":"I downloaded this app and then my screen suddenly started changing to orange!!","isEdited":false,"userName":"yburrrrr","title":"BAD APP","rating":1,"date":"2020-07-10T02:16:20Z"}},{"id":"6179033829","type":"user-reviews","attributes":{"review":"I am not here from TikTok. This app is terrible. It does not help the Election whatsoever. Anyone who thinks Donald Trump is helping America prosper can run my fade.","isEdited":false,"userName":"Student 20393","title":"Trump 2020","rating":1,"date":"2020-07-10T02:07:39Z"}},{"id":"6179029944","type":"user-reviews","attributes":{"review":"i downloaded this app to give support to Lord ORANGE MAN. but then when i opened it a naked orange appeared on the screen and scared my..uhm..dog. and then it like, died. i’m suing.🥵🍊✨🧚🏻‍♀️","isEdited":false,"userName":"Liz_biz47","title":"worst app ever😤✨🍊","rating":1,"date":"2020-07-10T02:06:16Z"}},{"id":"6178979883","type":"user-reviews","attributes":{"review":"I got the app and it took 72 hours to Download then after it downloaded I put all my info in so I can get signed in which also includes my phone number and so after I got signed in i started getting weird text messages but after that happen I had also started getting death threats and my house location being sent out to me so I was creeped out but after that happened my phone started getting viruses, after my phone had gotten a virus and after all that happen i decided to get a new phone and so I got a new phone and I downloaded the app again which also took 72 hours to download and I signed in to my old account and put my new phone number in and at first it was acting normal but I notice some weird things like my camera was on bc I have a phone that a light turns on when my phone camera is on and I also started getting voicemails of trump saying some weird things but I thought that was just some people messing around but then I realized that my phone was a brand new one and I haven’t given anyone my new phone number but after that happen my new phone started getting hot easily I thought it was no big deal since it was a phone. Also the app had keep sending me notifications and I noticed one of the notifications was of getting new trump merch so I put my credit card info and everything and I had gotten fast shipping bc I wanted it as soon as possible and it said it was going to come in two days so I waited for two days and I have never gotten the merch so I was very upset and then my bank messaged me that all my money was taken out so I got really worried bc I had no longer had money so I had to start living with my parents after that happened I was checking the trump app late at night then my phone had caught on fire and my arms started burning but luckily my mom was awake and had gotten the fire extinguisher and the fire was burned out and I was rushed to the er and till this day I don’t have my arms nor no money and i am so bless to be alive but I do find it weird that my parents never knew I got this app and so my parents don’t know that all this happened bc of this app so I am  typing this review without my parents knowing so I AM WARNING YOU BEFORE THIS HAPPENS TO YOU PLEASE STAY AWAY FROM THIS APP!!! And I would appreciate if you can write a one star review so everybody can be aware of what’s happening.","isEdited":false,"userName":"user38397720","title":"THIS APP IS HORRIBLE!! PLS READ I DONT WANT THE SAME THING TO HAPPEN TO YOU","rating":1,"date":"2020-07-10T01:47:58Z"}},{"id":"6178941786","type":"user-reviews","attributes":{"review":"This app is so bad Obama made America great not trump so if u support trump u do u but all my blm protesters step right up and review dis 1 star","isEdited":false,"userName":"trump❌","title":"This app is trash and BLACK LIVES MATTER","rating":1,"date":"2020-07-10T01:34:10Z"}},{"id":"6178940607","type":"user-reviews","attributes":{"review":"This app is so trash it doesn’t even work","isEdited":false,"userName":"Yasaliahaf","title":"Trash","rating":1,"date":"2020-07-10T01:33:45Z"}}]}