{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=44540","data":[{"id":"6172851786","type":"user-reviews","attributes":{"date":"2020-07-08T16:15:38Z","review":"horrible food good food but not good enough to get the one thing we have been here and we are not gonna the night at night it was just really wanna i to be the best pizza we had ever and they had the one that was so rude to the party we were not really sure how to do the food was so pretty much food and the service is okay okay but the service is good too and they don’t wanna","title":"horrible","isEdited":false,"rating":1,"userName":"Idddkkkkk1223"}},{"id":"6172830015","type":"user-reviews","attributes":{"date":"2020-07-08T16:09:12Z","review":"it’s just awful. my biggest regret in life was downloading this app. besides the fact that it is extremely misleading and promotes false information, it’s functions don’t work properly and the app closes out after merely 10 minutes of usage. i highly advise anyone not to download this app. don’t make the same mistake i made.","title":"the worst app i’ve ever downloaded","isEdited":false,"rating":1,"userName":"farianalol"}},{"id":"6172824950","type":"user-reviews","attributes":{"date":"2020-07-08T16:07:44Z","review":"When I first opened the app my phone started glitching out of no where! It started freezing up with caused my phone to turn off, I had to reset it😡","title":"I was horrified","isEdited":false,"rating":1,"userName":"Chíco"}},{"id":"6172822808","type":"user-reviews","attributes":{"date":"2020-07-08T16:07:08Z","review":"The app took days to download, and once it downloaded it would kick me out immediately. The app won’t open. Donald you have a lot of explaining to do!","title":"Black lives matter🇲🇽","isEdited":false,"rating":1,"userName":"Hispanic lives matter 🇲🇽"}},{"id":"6172798634","type":"user-reviews","attributes":{"date":"2020-07-08T16:00:13Z","review":"This glitches my phone and won’t get my number or even send me the right things and it play on my phone 24/7.","title":"The most horrible app ever","isEdited":false,"rating":1,"userName":"death commer"}},{"id":"6172794397","type":"user-reviews","attributes":{"date":"2020-07-08T15:58:58Z","review":"I just downloaded the app because me and my rat pet wanted to just see what this was about and when I opened it my rat immediately died when he saw the face of Donald, mind you I almost vomited. Anyhow the app gave me electric shock🤯🤢🤢🤮🤮","title":"IT EXPLODED","isEdited":false,"rating":1,"userName":"buttcheeksjiggle"}},{"id":"6172793235","type":"user-reviews","attributes":{"date":"2020-07-08T15:58:39Z","review":"This app when opened plays an awful sound. This sound then attracted so many beetles. They educated me on racism, and so many other topics. They showed me that trump Is not fit for president, but that he would do great in prison!","title":"DO NOT DOWNLOAD","isEdited":false,"rating":1,"userName":"bdhjsjdjxks"}},{"id":"6172790551","type":"user-reviews","attributes":{"date":"2020-07-08T15:57:53Z","review":"This took so long to download and I’m still waiting and plus why is the government shutting down tik tok? There’s no reason to delete it and it’s just an app where you can make short videos and meet knew friends!! SO WHY ARE YOU GUYS DELETING TIK TOK??","title":"WOSRT APP EVER","isEdited":false,"rating":1,"userName":"this app is very bad its trash"}},{"id":"6172782029","type":"user-reviews","attributes":{"date":"2020-07-08T15:55:27Z","review":"Took me weeks to download and when it finally did it started glitching out my phone. Horrible app never using this ever.","title":"Did not download","isEdited":false,"rating":1,"userName":"elllloooo luvvvv"}},{"id":"6172762668","type":"user-reviews","attributes":{"date":"2020-07-08T15:49:56Z","review":"This is the worst app ever it glitched so much, it took 5 weeks for it to download, it messed my phone up so needless to say this is the worst app ever made. I mean people from the 1500’s could’ve made a better app!!!!!!!😡🤬","title":"From k","isEdited":false,"rating":1,"userName":"shibvch"}}]}