{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=80250","data":[{"id":"6172703346","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"treybxckets","review":"Black Lives Matter","date":"2020-07-08T15:32:59Z","title":"Black Lives Matter"}},{"id":"6172669232","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"trumpisadumpsterfire123","review":"Would give zero stars if I could.","date":"2020-07-08T15:23:24Z","title":"How we got a confederate president in 2020?"}},{"id":"6172657050","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"🤗❤️❤️love the app","review":"the app made my phone glitch out for some reason??? it was really slow and it’s just not it. i do not recommend.","date":"2020-07-08T15:20:00Z","title":"horrible."}},{"id":"6172609002","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Simply Disappointed","review":"this app played music in my sleep and convinced me that i was hearing things. it attracted pelicans that kept pooping on my stuff. DONT DOWNLOAD","date":"2020-07-08T15:06:28Z","title":"DISGUSTING"}},{"id":"6172605537","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"hefhknf","review":"this app took me 4 hours for it to download and my phone were glitchy because of this app.","date":"2020-07-08T15:05:29Z","title":"my phone become glitchy"}},{"id":"6172586463","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Ur_moms_juicy_ass","review":"I got this app to sign up for his rally coming up, although I cannot make it because my fish is in the hospital cuz it tried to drown itself. Fish can be depressed too. But anyways, so before I downloaded it I looked at all the important info, for example the reviews obviously, and I read some pretty negative things but I still kept some hope. I should’ve listened to the reviews. So in the details it says it may use my location even when it isn’t open, and it could decrease my battery life. I didn’t think anything of it because most apps do that, right? Oh how wrong I was. The second the app was downloaded, a black van pulled up in my driveway and a bunch of men in snazzy black suits and sunglasses burst thru our door and broke it because they said it was red, and they hate the color red. They then preceded to take all of our toilet paper, combs, and tanning items and threw it into their van and when we asked why they said it was for the “boss man.” They then threw us in our tree and burned our house down. And when we asked them to call the fire department they said no, because what color are fire trucks? Red. And they HATE the color red. So now I am living with the rats, which are pretty chill ngl.  If it can’t get any worse, remember how it said it would decrease battery life? I didn’t think anything of it, until I got a call. Apparently the day that I downloaded the app, my grandmothers life support was randomly unplugged but no one was by it so she died. Wrong battery life dudes.","date":"2020-07-08T15:00:16Z","title":"Horrible"}},{"id":"6172585708","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"lulmarc2xx","review":"Took 2 years to download","date":"2020-07-08T15:00:03Z","title":"Trash"}},{"id":"6172563269","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"HJohhdjsba","review":"I got it then just deleted it straight away","date":"2020-07-08T14:53:50Z","title":"It’s just the WORST app in the world"}},{"id":"6172514964","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"Albert78M","review":"Theres so many bugs and I want tik tok to stay on the App Store and not to be banned in the us please MAKE THE APP STORE GREAT AGAIN!","date":"2020-07-08T14:40:15Z","title":"Worst app ever"}},{"id":"6172486577","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"userName":"john ogl","review":"I got the app but then I got corona and cancer we tested me and I’m so sick don’t download it’s dangerous","date":"2020-07-08T14:32:19Z","title":"Gave me cancer"}}]}