{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=44930","data":[{"id":"6174946463","type":"user-reviews","attributes":{"review":"this app is the worst app ever! i downloaded it to keep up with everything and it keeps glitching and it keeps exiting out the app. made my phone terrible and ruined it! would not recommend DO NOT DOWNLOAD THIS APP.","title":"WORST APP EVER!","userName":"harvest2uglu","isEdited":false,"date":"2020-07-09T03:50:44Z","rating":1}},{"id":"6174946014","type":"user-reviews","attributes":{"review":"First Trump is orange, second he is getting mad for the same privacy policy’s and information about the person who got the app. So check where your spray tan is and leave. Peace Cheeto puff ✌️ Also \nWE DONT LIKE YOU GET OUT OF HERE YOU OMPLUMPA ORANGE CHEETO PUFF AND YPUR DUMB SPRAY TAN THAT LOOKS LIKE YOU'VE BEEN IN THE SUN FOR 400 CENTURY GETTING OUT OF YOUR WEIRD CHEETO CACON. TAKE YOUR RACIST AND RAPIST SELF AND LEAVE.","title":"Bye 🦧","userName":"canyon566","isEdited":false,"date":"2020-07-09T03:50:35Z","rating":1}},{"id":"6174916842","type":"user-reviews","attributes":{"review":"This is one of the worst app I ever used this app makes my phone glitch and I don’t recommend people to download it this app is literally trash","title":"This app is so bad don’t download it","userName":"delete thos app is trash","isEdited":false,"date":"2020-07-09T03:41:39Z","rating":1}},{"id":"6174911917","type":"user-reviews","attributes":{"review":"absolutely disgusting!!!!! this app is a total security threat to me !!! i mean seriously apple why would you allow this app on here !!! do you not care about our safety !!!","title":"Horrible horrible app","userName":"Linda1976.","isEdited":false,"date":"2020-07-09T03:40:10Z","rating":1}},{"id":"6174909733","type":"user-reviews","attributes":{"review":"THIS APP WILL EAT YOUR CAT!! This app will also take your cabinet. All of your food will be taken by downloading this app. This will take your phone. My pet lion cried when he say this app. My house collapsed when I downloaded this app. 1 star.","title":"HORRIBLE APP","userName":"pizza?!?","isEdited":false,"date":"2020-07-09T03:39:31Z","rating":1}},{"id":"6174909586","type":"user-reviews","attributes":{"review":"This app crashes all the time and completely messed up my phone. I thought our amazing president would have a really good app but i was very disappointed.","title":"TRASH APP","userName":"alyssalee613","isEdited":false,"date":"2020-07-09T03:39:29Z","rating":1}},{"id":"6174909345","type":"user-reviews","attributes":{"review":"This app literally caused my phone to break! The moment I downloaded it my phone burst up in flames and Siri wouldn’t stop taking about building a wall!!!!!! I’m very disappointed in this app.","title":"IT BROKE my PHONE","userName":"gummie narwhal","isEdited":false,"date":"2020-07-09T03:39:24Z","rating":1}},{"id":"6174904906","type":"user-reviews","attributes":{"review":"HORRIBLE APP. Every time I opened the app, a creepy and fat cheeto looking man would STARE OUTSIDE MY WINDOW. this app steals all your information and gives it to this cheeto man to STALK YOU and eventually kidnap you. \nThis app is DANGEROUS. Don’t take the risk. I implore Apple to delete this app IMMEDIATELY.","title":"DON’T DOWNLOAD","userName":"Saba M :)","isEdited":false,"date":"2020-07-09T03:38:04Z","rating":1}},{"id":"6174901076","type":"user-reviews","attributes":{"review":"i got this app and as soon as i got this app my cat ran away and then my phone started glitching like crazy so this app messed up my phone!!! i DO NOT recommended this app at all it is so bad. 🤮🤮🤮🤮🤮🤮","title":"this is a HORRIBLE app🤮","userName":"bunkerboyismad","isEdited":false,"date":"2020-07-09T03:36:56Z","rating":1}},{"id":"6174898328","type":"user-reviews","attributes":{"review":"The app doesn’t even work. It keeps giving me Biden ads and telling me to vote Biden 2020! Don’t even get me started on the list of trumps accomplishments. none of the pages load up for his accomplishments. WHERE ARE THEY?!","title":"DISGUTING","userName":"RedTails415","isEdited":false,"date":"2020-07-09T03:36:08Z","rating":1}}]}