{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35940","data":[{"id":"6174196902","type":"user-reviews","attributes":{"rating":1,"title":"Nope🙄","review":"This app is so bad. I opened up the app and there was a big a Cheeto there. It was so horrifying and I just can’t believe our president would make an app like this. Jk. He is the worst person on this plant and I hope this gets it deleted from the App Store.","userName":"idk🥺","date":"2020-07-09T00:01:00Z","isEdited":false}},{"id":"6174195467","type":"user-reviews","attributes":{"rating":1,"title":"i feel disappointed","review":"i open the app and i was quite excited. when i open it there is a picture of a dead cat. i am scared and offended i can’t believe i got treated with this disrespect. i would rate ZERO stars but i am unable. I FEEL VERY HURT","userName":"kkkkklarrystylinsonforeverlmao","date":"2020-07-09T00:00:31Z","isEdited":false}},{"id":"6174187016","type":"user-reviews","attributes":{"rating":1,"title":"Ew","review":"This honestly offends me.. I opened the app and just found out that the graphics are trash and the picture of an orange, racist, homophobic, transphobic, pedo keeps appearing on my screen, If you fix this issue, I would be more than happy to use this app.","userName":"fjisbisbinfnisnosbinodno","date":"2020-07-08T23:57:19Z","isEdited":false}},{"id":"6174179831","type":"user-reviews","attributes":{"rating":1,"title":"very disappointing.","review":"i’m absolutely shocked. this “app” is the most horrendous thing i’ve ever laid eyes on. call me a “karen” all you want but wish i could give it zero stars. not only did it steal my card info, but it BOUGHT SOMETHING CALLED “HENTAI”. needless to say i will be deleting.","userName":"uwualli","date":"2020-07-08T23:54:43Z","isEdited":false}},{"id":"6174176335","type":"user-reviews","attributes":{"rating":1,"title":"this app is trash","review":"i open the app and i see the big cheeto man 🍊the app was glitching like crazy so i clicked off the app and saw big naked cheeto man as my lockscreen😱.  i immediately threw my phone out the window and ran upstairs, but i saw the cheeto man in my living room, he demanded that i gave him a foot rub.😳 i was terrified so i ran outside and grabbed my phone to delete the app. so in conclusion do not download this app it doesn’t work properly and will glitch out your phone. 🤮","userName":"lil huddys right foot","date":"2020-07-08T23:53:28Z","isEdited":false}},{"id":"6174171232","type":"user-reviews","attributes":{"rating":1,"title":"Terrible","review":"I can’t believe this...I opened the app and all of a sudden I saw this vile thing!!! I couldn’t even describe it since I threw my phone! Now I have a cracked screen!!!! Unbelievable...I’m going to delete this...1 star for this crap. See ya. Don’t recommend😒","userName":"happy13578","date":"2020-07-08T23:51:32Z","isEdited":false}},{"id":"6174161568","type":"user-reviews","attributes":{"rating":1,"title":"DONT DOWNLOAD‼️‼️","review":"After I downloaded this app my phone immediately started vibrating until Donald Trump himself, stepped out of my screen. He then proceeded to slap me and my grandma in the face repeatedly. He then pushed my grandma down the stairs, along with her pet turtle. The turtle was later pronounced dead. R.I.P Hercules🐢🙏","userName":"Kylaaa4","date":"2020-07-08T23:48:16Z","isEdited":false}},{"id":"6174156037","type":"user-reviews","attributes":{"rating":1,"title":"No","review":"Constantly gives adds and notifications horrible and hard to use","userName":"vsnwnaa","date":"2020-07-08T23:46:12Z","isEdited":false}},{"id":"6174154130","type":"user-reviews","attributes":{"rating":1,"title":"I can’t with this app","review":"This app is the worst!!! Talk about real trash and cheap apps. Upon opening the app my eyes bled from the background used. I’m not one to go out of my way to put an app down but this tops the worst things ever created for the App Store.","userName":"harina horres","date":"2020-07-08T23:45:26Z","isEdited":false}},{"id":"6174151803","type":"user-reviews","attributes":{"rating":1,"title":"this app will give you a virus","review":"DONT GET THIS APP ! IT WILL GIVE YOU A VIRUS ON YOUR DEVICES AND IT WILL STEAL EVERYTHING YOU HAVE AND OWN. IT WILL SLOWLY DELETE YOUR APPS AND PURCHASES AND STEAL ALL THE MONEY YOU HAVE IN YOUR APPLE ACCOUNT. DONT GET THIS APP IT WILL RUIN YOUR DEVICE. IT WILL GLITCH OUT YOUR PHONE AND YOU’LL NEVER GET TO USE IT AGAIN. I KNOW THIS BECAUSE MY SISTER GOT THE APP AND IT DELETED EVERYTHING SHE HAD AND IT ENDED UP SHUTTING DOWN HER PHONE AND NOW SHE CANT USE IT ANYMORE. DO NOT GET THE APP OR IT WILL GIVE YOU A VIRUS AND IT’LL SLOWLY DESTROY YOUR DEVICE. PLEASE IM BEGGING YOU DONT GET THIS APP- i had to get this app to vote and write a review 🥺😳 i’m sacrificing my phone’s life for your well being\ngoodbye forev-","userName":"Too much ads!!!","date":"2020-07-08T23:44:32Z","isEdited":false}}]}