{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=9000","data":[{"id":"6173041644","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T17:14:03Z","title":"app not working????","userName":"ipretendimacarrot","review":"I got this app to support THE BEST PRESIDENT EVER but it kept crashing 😰 Every time I opened the app the scary lizard man started to yell racial slurs at me. Now normally I can get behind some good old fashioned racism from this amazing man who practically reinvented the word, but at me??? A good white Christian??? How could he do this to me? I had my son come help me fix the app, but while he had my phone the mean cheeto man reached through the screen and punched my son in the face! Glitchiest app ever! Don’t forget to vote TRUMP so we can keep oppressing minorities!"}},{"id":"6173017854","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T17:06:40Z","title":"Do not download this app","userName":"Sha_Let","review":"This app is almost as bad a Trumps attempt at being a good president. Even if I disregarded the fact that it’s always crashing, and can’t complete a simple task correctly. It would still be one of the worst apps I’ve ever downloaded. It seems like the only thing it can do correctly is take your storage and personal data. I recommend downloading this app only so you can leave a bad review, so this abomination of an app can be deleted from the App Store."}},{"id":"6172965011","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:50:35Z","title":"Awful App","userName":"qwerasdfzxcvhju","review":"When I opened the app, a demon came crawling out of my screen and took my dog. It took me many weeks to find my dog and the demon again. When I did find them, the demon then went over to my grandmothers house and destroyed everything for revenge. Now there’s just a demon roaming around the US, and I think trump is way to lazy to fix it. And plus the app was awful. It was really slow and had pictures of a burnt Cheeto begging for attention. If I could give it 0 stars I would."}},{"id":"6172854573","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:16:28Z","title":"Period.","userName":"djjsjakaowiur","review":"This is the worst app I’ve ever downloaded. First of all it tools AGES to download, second of all when I opened it bugs starting coming inside my house and infecting the food. Then, they started to eat my baby brother! It was horrible!! I mean he was really annoying but still. It doesn’t end here. After a while of having the app opened my house got flooded! There were crocodiles and cockroach’s everywhere. I would NOT recommend this app it brings nothing but bad luck."}},{"id":"6172760338","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T15:49:16Z","title":"my pig started squealing","userName":"Loli312","review":"do not get this app. i got it and opened it and my pig started to squeal uncontrollably. she was loud and obnoxious. the neighbors came over and asked what was wrong and i told them i got the trump 2020 app. they said they had it as well and the pig started squealing more and more. soon the neighbors had to leave because their ear drums where about to burst. i had to delete the app for my own hearing sake. so please, save the pigs and your own ear drums and DONT GET THIS APP.\n\nps. GENERATION ZOOM WILL NOT GO DOWN WITHOUT A FIGHT. YOU WILL NEVER TAKE AWAY TIKTOK FROM US BUNKER CHEETO"}},{"id":"6172681352","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T15:26:50Z","title":"WORST APP IVE EVER USED","userName":"Uli(❍ᴥ❍ʋ)","review":"Once I entered it asked me for my p go me nun ver and other imformation and his orange face popped up which in fact made my sister cried cause she got scared it made me cringe how he said make America better again but the fact that’s he’s making it worse is then it wanted me to verify to receive calls from him or something for what I’m Mexican so he probably won’t even call me then my phone started going off by messages he kept sending by his CORPORATE do not download waste of time and is horrible"}},{"id":"6172496700","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T14:35:07Z","title":"Glitchy and basic","userName":"TonyaMConner","review":"This app as soon as you open it is glitchy. If you can get it to work at all it’s an app so basic, like it’s made for idiots. Bad overall app and talk about spam. Do not download this app unless you  want to be harassed hourly. I understand the Cheeto in chief needs attention but this app is worse than his twitter account. Avoid this app like you avoid the racist trolls who refuse to wear masks in stores. Much like COVID the side effects of downloading could be worse than the app itself."}},{"id":"6172448827","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T14:22:11Z","title":"Trash app","userName":"el.peace27","review":"Not only was this app glitchy and messed with my phone. The content was hard to comprehend due to the immense amount of lies. Not only did it share false information it stated that Donald trump is a good man this is false as we can tell by the global pandemic that we are in at the moment and the fact that US leads in the most cases when numerous, countries around the world are controlling the outbreak and getting better. Oh and he’s racist, sexist, xenophobic, a liar, a money guzzling dictator, and an all around disgrace to this country."}},{"id":"6172279328","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T13:35:49Z","title":"🧚✨Creepy Voices✨🧚","userName":"N0❤️","review":"Right when I opened the app, there was a voice coming from my phone. It said that only if I rated this app 5 stars the Orange Monster would be very happy. Of course, I did the exact opposite. If I could give this app a -100 I would. When this creepy app was talking to me, I got very startled from this monster! It kinda resembled the president! When this monster started coming out of my screen into my house, I knew exactly what to do. I slapped the heck out of it and it disappeared for good."}},{"id":"6172083819","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T12:40:59Z","title":"terrifying!!!😭","userName":"barbra boomer","review":"i downloaded the app to see what i could do to further support the BEST president(who’s definitely NOT a racist pedo), but when i downloaded the app i was SHOCKED. at first it was working normally, and then a picture kept flashing up on my screen. i closed the app but the picture kept coming up, i realized it was a picture of trumps nudes!!!! i was HORRIFIED to see his d!ck was TINY🙊😫. like legitimately microscopic. i cannot support a president who’s d!ck looks like a shriveled up worm. poor melania🤮🤧. this is why i will now be voting for JOE BIDEN. BIDEN 2020!!! also BLM"}}]}