{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21090","data":[{"id":"6172964410","type":"user-reviews","attributes":{"rating":1,"title":"This app is awful","date":"2020-07-08T16:50:24Z","isEdited":false,"userName":"Person16372816","review":"I let my 97 year old grandfather try out this app because he is very fond over Donald trump \nAfter he looked at the contents of the app he had a complete ANEURISM just looking at the content\nThis is what caused my paw pee to DIE\nthe content on this app is very poor including the content if I could give it zero stars I would\n✨just No✨ ✨Chair but make it electric✨"}},{"id":"6172946213","type":"user-reviews","attributes":{"rating":1,"title":"Vishnu The Destroyer of Worlds","date":"2020-07-08T16:44:43Z","isEdited":false,"userName":"The Funophile","review":"I got this app because I saw my cousin (Ganesha) on it looking for some reasons of why he created Trump. When I tell you there was nothing, there was NOTHING. The app glitches out reflecting on his sporadic and unreliable behavior. The app was poorly designed  just like trump. Not to worry though I’ll see that this app is poorly rated and Trump in 6 years. \n\n;)"}},{"id":"6172919164","type":"user-reviews","attributes":{"rating":1,"title":"THE RATS ARE EVERYWHERE","date":"2020-07-08T16:36:13Z","isEdited":false,"userName":"GEOMETRY DASH STINKS","review":"I originally downloaded this app for our great president trump, but to my dismay, once you OPEN the app it emits a frequency that attracts RATS. I just thought it was a coincidence when one showed up in my home, then another one showed up, and then another, and by the time it got to 12 hours later and there were THOUSANDS of rats on my property. Trump I hope you're happy!!!!"}},{"id":"6172869629","type":"user-reviews","attributes":{"rating":1,"title":"UGH","date":"2020-07-08T16:21:00Z","isEdited":false,"userName":"Itzz.cailin","review":"This app is absolutely horrible it took DAYS to download and even after it downloaded it just kept on glitching and showing some Cheeto puffs face🟠 Then it would play all sorts of weird music which then brought dozens of cats to my house! The cats then proceeded to sacrifice my mother and my whole family. It was absolutely horrible and would NOT download."}},{"id":"6172836120","type":"user-reviews","attributes":{"rating":1,"title":"BLM","date":"2020-07-08T16:10:58Z","isEdited":false,"userName":"Trumps a white supremacists","review":"So right when I got this app I was really excited to see what it has in store. But as I opened it the app just turned orange and froze! And all of a sudden it said Hispanics and African Americans and Natives built this land!? I mean im not sure what this is about. I thought the mighty orange built this world with his godly powers. I am very upset 10 out 10 would never support trump again"}},{"id":"6172812168","type":"user-reviews","attributes":{"rating":1,"title":"Broke my phone :(","date":"2020-07-08T16:04:07Z","isEdited":false,"userName":"itsstinky","review":"This app was so terrible DO NOT DOWNLOAD, I tried to download it, but as soon as I did, it made my phone glitch so bad that it completely turned off. I tried to restart it, but it wouldn’t turn on. I had to completely put it on the charger and try to restart it until it eventually turned on. VERY upset."}},{"id":"6172806447","type":"user-reviews","attributes":{"rating":1,"title":"Worst idea ever!","date":"2020-07-08T16:02:28Z","isEdited":false,"userName":"cd5322","review":"I downloaded this app to support MY President, and it has glitched my phone so badly! I took it to the shop and they said that this app had downloaded malware to my phone and was tracking me, and that’s only part of the problem! Ever since I got this app, it’s been causing my other apps to randomly play things! This is outrageous!"}},{"id":"6172801865","type":"user-reviews","attributes":{"rating":1,"title":"Horrible app🤮🤮","date":"2020-07-08T16:01:10Z","isEdited":false,"userName":"F*** Trump 2020","review":"I came on here to find reasons why I should vote for trump again and couldn’t find any, he has done a lot less then make America great again, he has put us in even more debt and almost cause world war three, he doesn’t know how to do this job and should stop being president, let Obama make America great again."}},{"id":"6172783619","type":"user-reviews","attributes":{"rating":1,"title":"Horrible","date":"2020-07-08T15:55:54Z","isEdited":false,"userName":"eli_periot","review":"This app is so horrible and takes forever to load, the screen always glitches and won’t even sign in, all I ever see is a orange Cheeto puff guy too. When it does even kinda work it won’t even let me see news or look at anything, probably the worst app in the market right now just horrible"}},{"id":"6172778369","type":"user-reviews","attributes":{"rating":1,"title":"DISGUSTING","date":"2020-07-08T15:54:24Z","isEdited":false,"userName":"mayoh124","review":"i rarely write reviews for apps but this was so horriable i had to. thought i would find some good news or hope for our country but its too messed up since 2017 when trump came along . i could go on and on about the wrong things about this app and our country right now which is ran by an immature \"president\" . smh . #voteblue"}}]}