{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36100","data":[{"id":"6172944873","type":"user-reviews","attributes":{"isEdited":false,"review":"The absolute second I downloaded this app my dog knew something was up. He ran over to me smelled, yes smelled my phone and hit my hand forcing me to drop it. Then proceed to delete the app with his nose. Idk about y’all but I always trust my dogs instincts, this app is not it.","rating":1,"title":"Dog attack","date":"2020-07-08T16:44:17Z","userName":"- Isaac -"}},{"id":"6172916710","type":"user-reviews","attributes":{"isEdited":false,"review":"I downloaded this app to figure out how my president will help us. But so far I see nothing! And you know what else is sad. That my grandpa had an literal heart attack after downloading this app and is at the hospital right now. This is so sad","rating":1,"title":"Slow","date":"2020-07-08T16:35:24Z","userName":"jalajrnfkdbd"}},{"id":"6172903080","type":"user-reviews","attributes":{"isEdited":false,"review":"Not only is this orange bigoted cheeto trying to take america back to the dark ages, but now he’s trying to take away and censor our social media. We have a right to FREE SPEECH as per the first amendment. He wants to take away our app, then lets take away his.","rating":1,"title":"Not My President","date":"2020-07-08T16:31:10Z","userName":"Esme Mkls"}},{"id":"6172879063","type":"user-reviews","attributes":{"isEdited":false,"review":"I actually liked Donald Trump. He a nice, hardworking, and intelligent man. However when I downloaded this app, it made me think that Donald Trump is not a good president. This app deserves about 1 star or none. (This is just constructive criticism and my opinion).","rating":1,"title":"This app is not worth your time","date":"2020-07-08T16:23:52Z","userName":"Jake the farmer"}},{"id":"6172872682","type":"user-reviews","attributes":{"isEdited":false,"review":"I downloaded this app right when I got in there were three ads and it kept telling me to press the X but it never worked and I tried to look on what he was up to and it was fake","rating":1,"title":"It was bad","date":"2020-07-08T16:21:58Z","userName":"Maggie_5478"}},{"id":"6172840566","type":"user-reviews","attributes":{"isEdited":false,"review":"This app is HORRIBLE , first off it took days maybe even WEEKS to download ,and  it was making unusual noises. Well I simply came on this app to find a reason to vote for YALL  racist president not mines 🥰✨ again , but clearly I didn’t find a reason at all 🥰🥰.","rating":1,"title":"✨🟠 Horrible App ✨🟠","date":"2020-07-08T16:12:16Z","userName":"vibesswkeyy"}},{"id":"6172821755","type":"user-reviews","attributes":{"isEdited":false,"review":"I don’t understand why we need an app for a racist rapist that doesn’t deserve to lead this country, oh and before any of you actually use the app look at the terms for all of you that care about privacy 🥱.","rating":1,"title":"Terrible App","date":"2020-07-08T16:06:49Z","userName":"GirlGMR"}},{"id":"6172814009","type":"user-reviews","attributes":{"isEdited":false,"review":"Literally the worst app on the App Store, glitched every time I went to open it, some dried up orange was frozen on the screen and caused me actual nightmares. Do not download this app unless you want insomnia and a horrid picture of a Cheeto puff engraved in your brain.","rating":1,"title":"The orange gave me nightmares","date":"2020-07-08T16:04:38Z","userName":"lovelylittlepanda"}},{"id":"6172807560","type":"user-reviews","attributes":{"isEdited":false,"review":"This app is totally not worth the download, horrible app. Huge regret once you’ve downloaded it. It’s like he got a small loan of 1 million dollars and put a penny into a crappy app. 0/10 if I could give this 0 stars I would.","rating":1,"title":"Horrible","date":"2020-07-08T16:02:47Z","userName":"chris evans 2020"}},{"id":"6172796851","type":"user-reviews","attributes":{"isEdited":false,"review":"I was hoping to get educated and understand the visions of the president, but this app is horrible. It took forever to download and made my phone glitch really bad. \nOnce I could get in and be in for at least 5 minutes I noticed how horrible of a president he was. He couldn’t even handle a pandemic. \nWhile the cases go up in the US the rest of the world is handling the virus a more effective way.\n\nHe is a horrible president and this app is crap.\n*DO NOT RECOMMEND*","rating":1,"title":"Horrible","date":"2020-07-08T15:59:41Z","userName":"k.aren890"}}]}