{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29890","data":[{"id":"6177376389","type":"user-reviews","attributes":{"review":"bro I was playing at 3 am and then a scary looking Cheeto came and said “gimmie your money” and she build a wall over me and trapped me in his basement send help plz I’m stuck and he called me step bro ahhhhhh I’m soooo scared and this app needs to be taken down he killed my brother :((((((((((((( and he said shut up black boiii","rating":1,"userName":"the black boiiiiiii","title":"SCARY","date":"2020-07-09T16:30:28Z","isEdited":false}},{"id":"6177365899","type":"user-reviews","attributes":{"review":"This app was supposed to be for me to keep up with all of trumps rallies and information, BUT IT KILLED MY PHONE! my phone is glitching horribly! The glitching began as soon as I started using it! I had just bought a new phone that I worked VERY HARD on buying! DO NOT DOWNLOAD THIS!!!!!","rating":1,"userName":"mromero2003","title":"Killed my phone","date":"2020-07-09T16:27:24Z","isEdited":false}},{"id":"6177348896","type":"user-reviews","attributes":{"review":"The design of this app is trash and I rarely ever get important updates from the administration. It’s very disappointing and honestly, I don’t even care. I just wanna see the Trump administration collapse. Gen Z is on the rise. We have the strength to do it all together.","rating":1,"userName":"Chillerful","title":"Awfully Made and Poorly Kept Up With","date":"2020-07-09T16:22:26Z","isEdited":false}},{"id":"6177346146","type":"user-reviews","attributes":{"review":"I downloaded this app to get some news of the big cheeto man and how he’s doin. but the app keeps crashing. like how am i gonna be able to measure his hands. how can plan to show up at his rally, then not go. cmon app i wanna see my spray tanned baby talk about how he drinks water pls help.","rating":1,"userName":"banandbd edjslg","title":"Crashing","date":"2020-07-09T16:21:41Z","isEdited":false}},{"id":"6177322477","type":"user-reviews","attributes":{"review":"I was very ✨excited✨ to download the the app to learn about our very manly president but it left my phone with a bunch of bugs so i had to get another one. Also i was promised that if i were to download this app i would have Jason Mamoa as my new Stepdaddy🤪✨❤️","rating":1,"userName":"hspeakman416","title":"Ur mom’s big fat juicy bussy","date":"2020-07-09T16:15:03Z","isEdited":false}},{"id":"6177302542","type":"user-reviews","attributes":{"review":"So I was interested to see what Trump had in mind. But the app kept crashing my phone. It would freeze non-stop and random pop up ads would show up. I have tried to delete it but it will not let me. This is not a good app.!!!!!","rating":1,"userName":"Anonymus 🥳","title":"Review 👏","date":"2020-07-09T16:09:33Z","isEdited":false}},{"id":"6177269691","type":"user-reviews","attributes":{"review":"seconds after downloading the app, my phone started shutting down repeatedly and lost battery in great amounts. when I finally got the chance to open the app, I disliked the set up as well as the colors. Just awful.","rating":1,"userName":"trumpsapedotrumpsapedo1976428","title":"genuinely disgusting","date":"2020-07-09T16:00:08Z","isEdited":false}},{"id":"6177269556","type":"user-reviews","attributes":{"review":"When I opened this app, my niece was looking over my shoulder. She’s 8 years old and was TERRIFIED by what she saw. This isnt what I thought it was. When I opened it, I saw a huge, wrinkled, bright orange pedophilic demon on the screen! Why would people promote an app for a rapist sex offender pedo?! Deleted immediately. Scarred for life.","rating":1,"userName":"shahsvjfhg","title":"NOT WHAT YOU THINK!","date":"2020-07-09T16:00:05Z","isEdited":false}},{"id":"6177269294","type":"user-reviews","attributes":{"review":"upon downloading this application i was expecting to get news and such from our supreme leader, barron. however the second i tapped my christian screen to enter this application, his father (donny or ronald trump? i don’t know i forget his name) appeared on my screen. i was offended, shocked, and scared. this is a bug fix that needs to be resolved immediately. i’m sure others have had the same experience as i have. barron and his team should really look into this.","rating":1,"userName":"Redsoxman115","title":"i am offended, shocked, and scared","date":"2020-07-09T16:00:00Z","isEdited":false}},{"id":"6177229796","type":"user-reviews","attributes":{"review":"Everyday without fail i get a message from this app asking about coconuts? “Anybody got coconuts?” “Can you microwave a coconut?” “Can i crack open a coconut if i knock it against my head?” I thought this was supposed to inform me about the presidential election. Very disappointed","rating":1,"userName":"saraduranf8","title":"What’s with this coconut obsession?","date":"2020-07-09T15:48:23Z","isEdited":false}}]}