{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=84960","data":[{"id":"6174640148","type":"user-reviews","attributes":{"title":"DO NOT GET.","rating":1,"isEdited":false,"review":"broke my phone. everything went orange.","userName":"Charlie3357","date":"2020-07-09T02:19:31Z"}},{"id":"6174638382","type":"user-reviews","attributes":{"title":"Horrible app","rating":1,"isEdited":false,"review":"Did not meet my standards","userName":"Frosty_Snowman_1","date":"2020-07-09T02:19:01Z"}},{"id":"6174628425","type":"user-reviews","attributes":{"title":"Cheeto on the loose","rating":1,"isEdited":false,"review":"Someone come get their Cheeto. It seems to have run for president.","userName":"DefghiJklmnopqrsT","date":"2020-07-09T02:16:11Z"}},{"id":"6174612534","type":"user-reviews","attributes":{"title":"It’s the worst","rating":1,"isEdited":false,"review":"It only shows how trash America is","userName":"Melania trump the real one","date":"2020-07-09T02:11:42Z"}},{"id":"6174608244","type":"user-reviews","attributes":{"title":"LITERALLY HORRIBLE","rating":1,"isEdited":false,"review":"I’m so sickened to my gut. This app will literally scar you, your kids, your kids kids, and so on, this app will literally scar your ancestors for even acknowledging its existence. This app DISGUSTS me. The first thing you are even greeted with even looking at the app is just UNACCEPTABLE. My phone got a virus from the one that I pushed the button to download. I’m afraid this app has made me infertile. My whole family tree may die off from this disgrace of an app. My fridge stopped working and actually got up and RAN out of my house probably out of the WHOLE state of not decided to live with the sun instead all because of this all. Actually ALL my furniture literally RAN out of fear and disgust. Even my house left me and the yard. The whole city I lived in just off the map. Gone like it was never there just like this app should be. GONE LIKE IT WAS NEVER THERE. Someone please help me get my house and furniture back. I shocked me how they could run from me when they were all so lazy before. My family doesn’t even want to associate themselves with me anymore. This app is a curse. And when you open the all up your greeted with a TERRIFYING sight. I nearly died just from witnessing the... WHAT EVER THAT THING IS. This app has caused me to be partially blind in my right eye and full blind in my left. Just clicking the download button in general has broken all the bones in both of my hands. So now I’m writing this review using my toes which is barely even moving. Expect to hear from my fridge later on about this disgrace of an app.","userName":"edaj_567","date":"2020-07-09T02:10:32Z"}},{"id":"6174604546","type":"user-reviews","attributes":{"title":"horrible app","rating":1,"isEdited":false,"review":"bad app, very mad, cannot believe this, bIG MaD","userName":"MR. HECKIN KRABS","date":"2020-07-09T02:09:26Z"}},{"id":"6174595146","type":"user-reviews","attributes":{"title":"HORRIBLE APP!","rating":1,"isEdited":false,"review":"This app will steal your information and will brainwash you!! Uninstall this app now, ornit will steal your dino nuggies!","userName":"TrumpLover1","date":"2020-07-09T02:06:48Z"}},{"id":"6174589287","type":"user-reviews","attributes":{"title":"Umm NOO 🟠🟠","rating":1,"isEdited":false,"review":"So I saw these Cheeto man in tv and I was like how orange can he be like bruh never every wanna see this ugly orange man in my life Periodddd..!!!!","userName":"sweeet101🦋","date":"2020-07-09T02:05:08Z"}},{"id":"6174588927","type":"user-reviews","attributes":{"title":"AWFUL APP","rating":1,"isEdited":false,"review":"Terrible app and also my pet hamster had a seizure and died","userName":"Mattie Thornton","date":"2020-07-09T02:05:02Z"}},{"id":"6174578966","type":"user-reviews","attributes":{"title":"Just bye","rating":1,"isEdited":false,"review":"This app is supporting someone who should be doing prison time and a racists🤡🤡","userName":"KIAHRA L","date":"2020-07-09T02:02:15Z"}}]}