{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=17850","data":[{"id":"6173769178","type":"user-reviews","attributes":{"date":"2020-07-08T21:21:34Z","title":"0 stars if I could","rating":1,"isEdited":false,"userName":"Maci Mork","review":"To start off it took too long to download (72 hours to be exact) and for what an app to reserve the circus for children’s birthday parties. As soon as I got on I only saw this clown everywhere like is that all they have!? Although the clown was very realistic. I want to give a warning to anyone wanting the app, don’t. But I guess if you like clowns and pigs this is the app for you."}},{"id":"6173759269","type":"user-reviews","attributes":{"date":"2020-07-08T21:17:56Z","title":"Only gave 1 star because I couldn’t give 0.","rating":1,"isEdited":false,"userName":"ItsNicoleYeah","review":"The app itself is so slow, took almost a full day to download when i have perfectly good wifi. Almost all the information on the app is false. I was not expecting much from the app in the first place, but was somehow still let down. I would be embarrassed to even offer this app."}},{"id":"6173754120","type":"user-reviews","attributes":{"date":"2020-07-08T21:16:03Z","title":"NEVER DOWNLOADING AGAIN","rating":1,"isEdited":false,"userName":"Whozjessica","review":"This app was absolutely terrible. I went in expecting a positive community but was instead greeted with a orange face😡. The negative energy in this app should never be shown on the app store again. It’s honestly scarring. Also, every time I try to click on the app it glitches. JUST TERRIBLE. A waste of storage honestly. All and all, i will NOT, NEVER, be downloading such a app like this one. Disgusting."}},{"id":"6173742617","type":"user-reviews","attributes":{"date":"2020-07-08T21:11:53Z","title":"This app will RUIN your phone!","rating":1,"isEdited":false,"userName":"maddieg1942","review":"Unbelievable... This app took me nearly a FULL DAY to download and took up so much space that anytime I tried to open my phone none of apps would work because they all kept crashing! I’m extremely disappointed with the developers behind this app and the Trump administration 😡. I nearly had to buy a new phone altogether!"}},{"id":"6173710532","type":"user-reviews","attributes":{"date":"2020-07-08T21:00:04Z","title":"terrible app","rating":1,"isEdited":false,"userName":"avsters","review":"this app took up so much storage on my phone! i was unable to download my movies and book for my 13 HOUR long road trip!! this took up so much storage that my phone powers off and would NOT turn back on!! this app ruined my whole phone!! don’t not get it! it will not please you, it takes up storage, and took an hour to load!!"}},{"id":"6173708087","type":"user-reviews","attributes":{"date":"2020-07-08T20:59:11Z","title":"BEE MOVIE SCRIPT","rating":1,"isEdited":false,"userName":"THICKIE NIKI","review":"According to all known laws of aviation, there is not way that a bee should be able to fly. It’s wings are too small to get its fat body off the ground.  The bee ,of course, fly’s anyways. Because bees don’t care what humans think is impossible. SEQ. 75- “INTRO TO BARRY” INT. BENSON HOUSE DAY ANGLE ON: sneakers on the ground. Camera PANS UP to reveal BARRY BENSONS BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black.....oh...black and yellow...etc."}},{"id":"6173704132","type":"user-reviews","attributes":{"date":"2020-07-08T20:57:43Z","title":"what is wrong with this app???","rating":1,"isEdited":false,"userName":"Tess Tikuls","review":"This app is the absolute WORST!!!! It took WEEKS to download and it made my phone super slow. After waiting so long for the app to download, I was excited to open it and use it, but for some reason it didn’t even work and instead BLEW UP MY PHONE with advertisements asking me to buy unhealthy amounts of spray tan and different varieties of blonde toupees. DO NOT download this app!!!"}},{"id":"6173700562","type":"user-reviews","attributes":{"date":"2020-07-08T20:56:23Z","title":"They took my cat!!😭😭","rating":1,"isEdited":false,"userName":"Every Day is Leg Day18","review":"This app is an absolute disgrace to the Apple store. The store that is the holder of Minecraft and Flappy Bird, is now infected with this awful app. It keeps sending these weird notifications of trump saying racist, homophobic, sexist, incompetent, things in the news. Not only that, but it has brought many viruses to mine and my family’s devices. And of course the cockroaches, which took my cat as well!!"}},{"id":"6173686719","type":"user-reviews","attributes":{"date":"2020-07-08T20:51:23Z","title":"Don’t download","rating":1,"isEdited":false,"userName":"Cassxsavage","review":"It’s horrible it made my phone glitch like crazy. Then it played music and made the fire nation come and burn down my home. Then took my dog and said it was Appa but it’s an English bulldog. I don’t know why it did that to my phone. My phone then had an orange on the screen for 2 days straight. It was a horrible experience I highly recommend to never download it."}},{"id":"6173666543","type":"user-reviews","attributes":{"date":"2020-07-08T20:44:06Z","title":"Terrible App","rating":1,"isEdited":false,"userName":"LaKatia98","review":"I wanted to learn about our president and his policies and basically everything on it is incoherent garbage. It took a full year to download and in that time i was watching the news like so confused about who this orange man was and why he was so angry and mean :( less than one star. would not recommend to a friend. It also made my phone explode soon as i used it"}}]}