{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=14090","data":[{"id":"6174796835","type":"user-reviews","attributes":{"date":"2020-07-09T03:06:25Z","review":"I was a girl in the village doing alright\nThen I became a princess overnight\nNow I gotta figure out how to do it right\nSo much to learn and seeUp in the castle with my new family. In a school that's just for royalty\nA whole enchanted world is waiting for me, I'm so excited to be. I'm finding out what being royal's all about. Making my way it's an adventure everyday. It's gonna be my time. To show them all that I'm Sofia the First!","title":"Worst app ever, let me tell you why","isEdited":false,"rating":1,"userName":"Sofiaxthexfirst"}},{"id":"6174742768","type":"user-reviews","attributes":{"date":"2020-07-09T02:49:54Z","review":"Trump really thinks he can ban TikTok because “China is getting Americans personal information”. That’s not what I think. I think he is trying to silence Gen Z and take away our rights. He isn’t our future. My generation is, generation Z. It should be our choice on what to do with the country that is rightfully ours. And that is why lots of people use TikTok. To communicate with other people in our generation. Gen Z will rise. The worst has yet to come.","title":"We will rise","isEdited":false,"rating":1,"userName":"gen z will rise. 124"}},{"id":"6174737384","type":"user-reviews","attributes":{"date":"2020-07-09T02:48:14Z","review":"I downloaded this app only to find that it started glitching and completely shut my phone down. This was of course after it repeatedly told me that a woman’s place is in the kitchen and if I didn’t get back in there it would grab me by my... Anyways this app is completely useless and I would give it zero stars if possible.","title":"10/10 Would not Recommend (Unless you’re a racist or sexist)","isEdited":false,"rating":1,"userName":"Harlow James13"}},{"id":"6174736512","type":"user-reviews","attributes":{"date":"2020-07-09T02:47:58Z","review":"this app is terrible!! i downloaded it and it sent racist messages to everyone on my phone!! it promotes hate speech and misogyny!! I am a woman and if told me my place is in the kitchen. it then proceeded to tell me it would sexually harass me if it had the chance. worst app ever. it even somehow managed to attack my grandma. this cheeto jumped out of the screen and threw her across the room awful service. definitely don’t download this.","title":"awful awful app!!!","isEdited":false,"rating":1,"userName":"rae cism🥰"}},{"id":"6174704056","type":"user-reviews","attributes":{"date":"2020-07-09T02:38:11Z","review":"This app was so improperly set up! Not to mention the main character in this app seems to have a lot of outdated views that are extremely oppressive and offensive to minorities and women! I’m not sure why anyone would want to download an app that supports and represents this egregious man who literally has no common sense and enjoys taking away all of life’s precious joys. Do not download this app unless you want to be hated by almost everyone on this planet!!!!!","title":"Worst app ever","isEdited":false,"rating":1,"userName":"skp11222222222"}},{"id":"6174700711","type":"user-reviews","attributes":{"date":"2020-07-09T02:37:11Z","review":"I don’t think that you should get the app because it runs very slow. When I opened the app it took 20 minutes for everything thing to pop up on the screen. I also don’t think you should get this app because it glitches your device really bad. When I exited the app my phone just froze out of no where and stayed like that for 30 minutes. DON’T WASTE YOUR TIME LIKE I DID!!","title":"Horrible Ap","isEdited":false,"rating":1,"userName":"shala willinas"}},{"id":"6174697743","type":"user-reviews","attributes":{"date":"2020-07-09T02:36:18Z","review":"I definitely don’t like it because it definitely is not that and I honestly would not recommend it because it is absolutely just that. I would never tell my friend to download this app because of how much it gives off such a vibe that I honestly most definitely think that but yeah I definitely would not get this app ever again just because of how it is.","title":"Absolutely no good","isEdited":false,"rating":1,"userName":"mr.orange31"}},{"id":"6174692535","type":"user-reviews","attributes":{"date":"2020-07-09T02:34:45Z","review":"This is a horrible app I had to get a new phone because when I download it then open then login in it leaked all my information and my phone got hacked and just because of that I got grounded for 2 whole month and 2 beating because my family don’t support Donald Trump and his hair fake his sexual hate people when are not straight and olny like white people hare black peoples evenmore and another color people","title":"Terrible app","isEdited":false,"rating":1,"userName":"persetdchh"}},{"id":"6174684761","type":"user-reviews","attributes":{"date":"2020-07-09T02:32:25Z","review":"this app kept trying to get me to eat more chicken but i prefer steak. i responded multiple times that i have a pet chicken and i would never eat chicken because they are probably related. it kept glitching out on me and sending be recipes for chicken dishes. i got pretty angry so i threw my phone across the patio but then my chicken tried  to eat it. so all in all you almost made me break my phone. very disappointed","title":"Horrible app","isEdited":false,"rating":1,"userName":"Erin Codens"}},{"id":"6174606756","type":"user-reviews","attributes":{"date":"2020-07-09T02:10:06Z","review":"This app is so garbage that when I went on it I sun orange person on a treadmill I was so disturbed that I quickly went off my phone and went through the review section and now I am traumatized for the rest of my life I was so scared that I went in my room and cried for about an hour then after that I went in my fridge and none of my food was there probably because that Fat man stole it I was traumatized.","title":"I am so traumatized","isEdited":false,"rating":1,"userName":"yeet kobe hehhrhrhrht"}}]}