{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=137910","data":[{"id":"6179830670","type":"user-reviews","attributes":{"userName":"XthedeadyXo","isEdited":false,"title":"Bad app","review":"The app is actually horrible","date":"2020-07-10T06:49:46Z","rating":1}},{"id":"6179830100","type":"user-reviews","attributes":{"userName":"sloppyjoe0113","isEdited":false,"title":"Hmm","review":"Wow I’m allowed to write ANOTHER ONE???","date":"2020-07-10T06:49:34Z","rating":1}},{"id":"6179829845","type":"user-reviews","attributes":{"userName":"bajsly","isEdited":false,"title":"Wow.","review":"I downloaded this app to get current information about our president and current statues of his campaign as well as to see if I could obtain information about his next rally. INSTEAD this app jacked my phone and is a horrible data mining app! This app not only crashed my phone everything I opened the app but when I tried to delete it, when I turned my phone on and if I went into Facebook! This app was draining my battery by the second! It hacked into my other apps like Snapchat and Facebook and Twitter and deleted all of my accounts and deleted all of my photos! This app was trying to get information about where I live, what my job is, what blood type I have, who my family is, what news sights I get information from, who I follow, who I block, where my dog went to get neutered, where I eat on Wednesdays after church, a muffin recipe so I can then put my muffins in the freezer, it stole my homemade cake recipe and sent it to all of my contacts and blocked contacts! This app is horrible and is the worse app I have ever laid eyes on and that says a lot since I downloaded an app that monitors my bowel movement schedule. This app is atrocious and should be taken down IMMEDIATELY!","date":"2020-07-10T06:49:28Z","rating":1}},{"id":"6179829831","type":"user-reviews","attributes":{"userName":"Hdjdidhhe","isEdited":false,"title":"Disgusting","review":"No","date":"2020-07-10T06:49:28Z","rating":1}},{"id":"6179829727","type":"user-reviews","attributes":{"userName":"martian074","isEdited":false,"title":"Worst app","review":"Worst app. Terrible content.","date":"2020-07-10T06:49:25Z","rating":1}},{"id":"6179829503","type":"user-reviews","attributes":{"userName":"biden's b*tch","isEdited":false,"title":"Disgusting like trump","review":"DO NOT GET THIS APP!! The first thing to pop up is bunker boy’s hideous orange face which made me throw up. It’s been 2 weeks now and I haven’t stopped throwing up since. As soon as I got it I could feel his racism, sexism, homophobia, and pedophilia shooting through my phone. Terrible experience.","date":"2020-07-10T06:49:20Z","rating":1}},{"id":"6179829365","type":"user-reviews","attributes":{"userName":"Gen Z💕","isEdited":false,"title":"THIS APP IS ABSOLUTELY TRASH 🤮","review":"I hope this app gets taken off as soon as possible no one should have to go through the pain of ever seeing this app ever again!!!!!","date":"2020-07-10T06:49:17Z","rating":1}},{"id":"6179829100","type":"user-reviews","attributes":{"userName":"I'm very uncreative","isEdited":false,"title":"I’m so lost","review":"This app gave me covid 🤯😭😪 plz don’t download if u want to stay safe🤩🧚🥵","date":"2020-07-10T06:49:10Z","rating":1}},{"id":"6179829033","type":"user-reviews","attributes":{"userName":"thomas night10","isEdited":false,"title":"Don’t get the app","review":"You have to pay for some stuff also don’t support the orange","date":"2020-07-10T06:49:09Z","rating":1}},{"id":"6179828918","type":"user-reviews","attributes":{"userName":"PIZZAHUT IN DA HOUSE","isEdited":false,"title":"booty hit diff","review":"this app made my house BLOW UP no freggin cap guys i do not recommend. the second i downloaded this app my IPHONE GOT LIT ON FIRE i don’t know how. anywho a thick ass man by the name of jeon jungkook had a BOG ass jabooty and the picture popped up on my screen AND HE FARTED ON ME omg! then someone came to my door and threatened to DEPORT ME??!.!.!.!! WHAT THE FREAK IS ICE CUBE ???? also i need a new house bc my insurance won’t cover the jabooty DAMAGE!!! ugh what a freakin struggle. i had to fly across the country to get money from some cheeto puff by sucking his toe and apparently he’s the president??? omg anyways guys i’m going to give this a generous 1/5 stars only bc jungkook blessed my eyes with his phat ass and huge thighs ;) .","date":"2020-07-10T06:49:06Z","rating":1}}]}