{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31770","data":[{"id":"6173537402","type":"user-reviews","attributes":{"title":"App hard to navigate","userName":"Changi72","rating":1,"review":"It was very difficult to navigate this app. The menus don’t make any sense and it crashes all the time! The technology is underwhelming and it’s easier to navigate a website. I don’t recommend this app at all!","isEdited":false,"date":"2020-07-08T19:58:55Z"}},{"id":"6173536900","type":"user-reviews","attributes":{"title":"Horrible App🤬","userName":"mejia_lovex3","rating":1,"review":"My phone turned off as soon as i started downloading the app! I had to take it to a shop for them to fix it and it cost a fortune. I do not recommend this app, please think twice before downloading this horrendous app.","isEdited":false,"date":"2020-07-08T19:58:44Z"}},{"id":"6173531287","type":"user-reviews","attributes":{"title":"THIS APP CAUSE CANCER TO MY PHONE","userName":"Juniorsegovia","rating":1,"review":"THANKS a lot i have to get a new iPhone now cause these people hacked on to my phone and account be careful y’all because this app is dangerous. It collects data and steals passwords. Also it makes it toward your phone doesn’t work. But basically my phone got bricked cause it","isEdited":false,"date":"2020-07-08T19:56:50Z"}},{"id":"6173519830","type":"user-reviews","attributes":{"title":"HORRIBLE!","userName":"jessi h.o.","rating":1,"review":"this app not only glitches my phone out but when i first downloaded it would open or let me open any other app. i deleted and redownloaded just to get an app that kicks me out 5 minutes in. horrible","isEdited":false,"date":"2020-07-08T19:52:49Z"}},{"id":"6173519715","type":"user-reviews","attributes":{"title":"Just stop","userName":"jesuschriist","rating":1,"review":"This app made me download its self twice and it was stupid. It’s asking for my phone number for what because the government wants it probably.... That orange 🍊 wants to ban TikTok so he’s just going to make more people hate him than they already do. #burnhisbunker2020","isEdited":false,"date":"2020-07-08T19:52:47Z"}},{"id":"6173518026","type":"user-reviews","attributes":{"title":"Horrible app","userName":"Charlie Washington","rating":1,"review":"As soon as I opened the app it started collecting all of my data and sending it directly to whoever knows. It stole my identity and credit card information. I am now in huge debt because of this app and wanted in ten different countries. :(","isEdited":false,"date":"2020-07-08T19:52:11Z"}},{"id":"6173513872","type":"user-reviews","attributes":{"title":"Horrible app","userName":"allie59p","rating":1,"review":"This is probably the worst app that ever existed. Donald trump IS the worst man that has ever existed. I am disgusted that he is our president. I just wish he would get banned from America already he is so horrible. And he’s gonna ban tik tok? Oh no he has me messed up. I know cancel culture is a bad thing but CANCEL DONALD TRUMP!!!","isEdited":false,"date":"2020-07-08T19:50:47Z"}},{"id":"6173511925","type":"user-reviews","attributes":{"title":"🚫❌ no good","userName":"aislynne mackenzie","rating":1,"review":"It took forever to download and it made my phone slow down and glitch all the time. Safari stopped working completely and cause my phone to shut down for hours","isEdited":false,"date":"2020-07-08T19:50:06Z"}},{"id":"6173510371","type":"user-reviews","attributes":{"title":"WORST APP EVER","userName":"🍊🧑‍💼","rating":1,"review":"This is possibly the worst app I have ever downloaded into my phone. First of all it took 2WEEKS to fully download. Also when it did download it made my phone glitch and sent a virus to it. I can not believe that this happened. Over all do not get this app.","isEdited":false,"date":"2020-07-08T19:49:34Z"}},{"id":"6173508858","type":"user-reviews","attributes":{"title":"Literal garbage EWWW","userName":"my boi ibj","rating":1,"review":"0/10 if there was an option for 0 stars best believe this would have it this app is garbage also if you take tik tok down we will come for your knee caps you absolute child that cries over people on social media making fun of him. You’re a clown bunker boy 🤡","isEdited":false,"date":"2020-07-08T19:49:04Z"}}]}