{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27420","data":[{"id":"6175133269","type":"user-reviews","attributes":{"title":"This app is so stupid","isEdited":false,"userName":"alienbabymother","date":"2020-07-09T04:50:06Z","review":"I tried texting trump but instead it deployed the fbi to my house and they took me to Area 51 and experimented on me. I have an alien baby out there somewhere and they still have all of my reproductive organs. This app is DANGEROUS so I advise that you don’t get the app or the same with happen to you!","rating":1}},{"id":"6175157068","type":"user-reviews","attributes":{"title":"Worst app ever.","isEdited":false,"userName":"zanihah","date":"2020-07-09T04:58:07Z","review":"If I were able to give it 0 stars I would.","rating":5}},{"id":"6175089358","type":"user-reviews","attributes":{"title":"WORST APP DO NOT DOWNLOAD!","isEdited":false,"userName":"urmom9876540","date":"2020-07-09T04:35:46Z","review":"This app hacked my contacts and I had to get a completely new phone and phone number. There are so many glitches and it is overall just poorly made! This app also hacked into my social media accounts and posted things on my accounts with you my permission! DO NOT DOWNLOAD THIS APP UNDER ANY CIRCUMSTANCES!!!!!!","rating":1}},{"id":"6175048329","type":"user-reviews","attributes":{"title":"TERRIBLE APP","isEdited":false,"userName":"Queen.Emma","date":"2020-07-09T04:22:59Z","review":"this app runs so slow and made my phone glitch! it was fine until i installed the app, and even after deleting it my phone is still glitching. serious technical problems and now i’m scared it may have put a virus on my phone!","rating":1}},{"id":"6175086405","type":"user-reviews","attributes":{"title":"Worst app ever!","isEdited":false,"userName":"Blue_Hydrangea_25","date":"2020-07-09T04:34:47Z","review":"After I downloaded this app, my phone started glitching uncontrollably!! They might as well delete the app before it happens to other people.","rating":3}},{"id":"6175028915","type":"user-reviews","attributes":{"title":"Disgusting visuals","isEdited":false,"userName":"*Zilla*","date":"2020-07-09T04:16:49Z","review":"This app literally burned a hole through my wall when I used it. The cat next door also was screaming whenever It was open. Not pet friendly. Highly suggest that this app be removed from existence, it is a hoax and can be very problematic to the human race. For the love of mankind this is not a safe app.","rating":1}},{"id":"6175008102","type":"user-reviews","attributes":{"title":"Why","isEdited":false,"userName":"SouthPrincessT","date":"2020-07-09T04:10:15Z","review":"This app flooded my whole house with alphabet soup and I wasn’t mad at first until I found out they did it on a Sunday. This not only happened once but five times. Next time I’m going to get my cat from butterfly catching to do the dishes so this app can paint in my hallway. No album release .","rating":1}},{"id":"6174992626","type":"user-reviews","attributes":{"title":"Do not get","isEdited":false,"userName":"thisappisterribledonotget","date":"2020-07-09T04:05:14Z","review":"it crashes all the time. Whenever i’d open the app it would turn to a black screen and then it would just shut down my phone, and it constantly freaks out and i have to restart my phone. 1 star","rating":1}},{"id":"6174991759","type":"user-reviews","attributes":{"title":"DO NOT GET","isEdited":false,"userName":"JumpingBean2004","date":"2020-07-09T04:04:59Z","review":"I got this app and it glitched so much i had to delete the app because it was affecting my phone. It kept crashing and is basically unusable. It was messing up my phone farther along. Don’t buy this it’s just a waste of time and will leave you unsatisfied and irritated.","rating":1}},{"id":"6174952597","type":"user-reviews","attributes":{"title":"TIKTOK BACK","isEdited":false,"userName":"trump cannceled","date":"2020-07-09T03:52:39Z","review":"I will give this app a one star because the fact that he is planning to SHUT DOWN TikTok is over the top annoying to me I will 100% with all the trust and worthy onto our country replace my rating with 5 stars until then 1 star ratting should be fine until then.","rating":1}}]}