{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=140300","data":[{"id":"6179521375","type":"user-reviews","attributes":{"review":"I downloaded this app weeks ago and it has never worked for me . Every time I open the app it is just a black screen , I wanted so badly to support Donald Jenius Trump but his app isn’t working 😭😭. I think it’s actually slowing my phone down too it takes forever to load any website when it didnt do that before . Terrible 😭😭😭","title":"Terrible","userName":"дpyrrulz","isEdited":false,"date":"2020-07-10T04:58:14Z","rating":1}},{"id":"6179521300","type":"user-reviews","attributes":{"review":"just don’t download it","title":"don’t download","userName":"muffie!!","isEdited":false,"date":"2020-07-10T04:58:12Z","rating":1}},{"id":"6179520988","type":"user-reviews","attributes":{"review":"This app is DISGUSTING. It showed me naked pictures of the chubby cheeto and now i’m scared for life! my ceiling saw it and it was so scared it ripped off my house and flew away! i demand money to pay for a new roof! Now i think God saw it and wants his innocence back he just got his innocence takin for looking at it!","title":"The Chubby Cheeto","userName":"I Like Doggos","isEdited":false,"date":"2020-07-10T04:58:06Z","rating":1}},{"id":"6179520938","type":"user-reviews","attributes":{"review":"The app took hours to download and hours to sign up for. It was also super glitchy and messed up my phone. I highly recommend that you don’t download!!!","title":"Super Glitchy","userName":"jehdhsjdndvdjsjd","isEdited":false,"date":"2020-07-10T04:58:05Z","rating":1}},{"id":"6179520732","type":"user-reviews","attributes":{"review":"ok. it all started when my pet fish died. i can now realize this app is directly tied to the death of Gideon. DO NOT DOWNLOAD. im serious. unless you’re in the mood to flush a fish. but it’s not worth it. The worst thing EVER>>>> this app 🤢","title":"no ❤️","userName":"Ram Dharam","isEdited":false,"date":"2020-07-10T04:58:02Z","rating":1}},{"id":"6179520683","type":"user-reviews","attributes":{"review":"This app caused a virus on my phone and I had to buy a completely different one. It exposed a video we’re trump was harassing his daughter and which I had kids around while I had the app open. This app is a disgrace to society. It needs to be taken down!!!!!","title":"Don’t Download!!!!","userName":"jamelahk","isEdited":false,"date":"2020-07-10T04:58:01Z","rating":1}},{"id":"6179520718","type":"user-reviews","attributes":{"review":"Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash Lol it trash","title":"Lol it trash","userName":"memerofthecentury","isEdited":false,"date":"2020-07-10T04:58:01Z","rating":1}},{"id":"6179520597","type":"user-reviews","attributes":{"review":"REPEAT AFTER ME!!!!! Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie Tank Is A Hottie, Trump Is A Thottie!!!!","title":"Tank Is A Hottie, Trump Is A Thottie","userName":"Rachel Rats","isEdited":false,"date":"2020-07-10T04:57:59Z","rating":1}},{"id":"6179520605","type":"user-reviews","attributes":{"review":"I love trump and will support him forever but this app destroyed my eyesight. it doesn’t follow apples developer requirements and the Blue UV shined right into my eyes and I now have permanent damage. To my fellow trump supporters do not make the same mistake eye did! Wait for an update","title":"Chinese Hackers","userName":"REVIEWTWINK","isEdited":false,"date":"2020-07-10T04:57:59Z","rating":1}},{"id":"6179520294","type":"user-reviews","attributes":{"review":"Throw him away please ❤️","title":"No❤️","userName":".gennnnn","isEdited":false,"date":"2020-07-10T04:57:53Z","rating":1}}]}