{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=19570","data":[{"id":"6173003062","type":"user-reviews","attributes":{"date":"2020-07-08T17:02:13Z","rating":1,"review":"If I could give it -963 stars I would. This app is cursed. I downloaded it last week and that same day I noticed my skin turning ORANGE!!! I thought it was just because I got slightly sunburnt and it was just turning into a tan so I didn’t think anything of it. Until, MY HAIR STARTED TURNING GREEN!!! I look like a full blown oompa loompa!! Trump is a dictator that is trying to turn us all into his own oompa loompas to control!! WAKE UP AMERICA","userName":"bipitty bopitty","isEdited":false,"title":"OOMPA LOOMPA"}},{"id":"6173001198","type":"user-reviews","attributes":{"date":"2020-07-08T17:01:39Z","rating":1,"review":"This app does not not even deserve a star star but a one is the lowest I can go. Why would I want to got on such a horrible person. He a child predator like really that’s what you wants to be our president again? People let’s do better this 2020 because we don’t want to do this again dealing with Trump was so tiring also save Barron trump 2020 also save melania trump 2020!","userName":"really people!!","isEdited":false,"title":"Why"}},{"id":"6172998814","type":"user-reviews","attributes":{"date":"2020-07-08T17:00:56Z","rating":1,"review":"when i was first signing my phone was glitching VERY BAD. now every time i get out of the app it still glitches. this app has ruined my phone, now i have to get a new one soon. i really do hope apple takes down this app from the app store after how bad it glitched my phone. i couldn’t even do anything on the app due to the glitch.","userName":"paulina 🤯❤️❤️","isEdited":false,"title":"NOT WORTH GETTING!!!"}},{"id":"6172976577","type":"user-reviews","attributes":{"date":"2020-07-08T16:54:06Z","rating":1,"review":"This app did nothing but advertise and promote all the violence and pain your president has done to the United States. He never had interest in “making America great again”, all he wanted was publicity and power. Whose to say that the women modeling could have been sexually assaulted during their shoot? This app symbolizes that as long as you have a title and money, you can walk free.","userName":"astaetic","isEdited":false,"title":"Disgusting"}},{"id":"6172865686","type":"user-reviews","attributes":{"date":"2020-07-08T16:19:48Z","rating":1,"review":"My cat was such a huge fan of trump. You see he was obsessed. I got this app just for him to use at night during our reading time. When i opened the app it kept glitching showing an orange face. I was truly dissatisfied and I knew  he was truly deeply hurting inside by the fact that he had to read about biden instead 😞 for shame .... for shame","userName":"thick._sishter","isEdited":false,"title":"My poor cat"}},{"id":"6172848462","type":"user-reviews","attributes":{"date":"2020-07-08T16:14:37Z","rating":1,"review":"I downloaded this app to try and find a reason to support the president but now i simply cannot his app has so many glitches and the things he said were on the app are not even here they spam your phone with text messages asking for donations and it’s just another way for him to make money off his supporters","userName":"😘💞💓","isEdited":false,"title":"Not satisfied."}},{"id":"6172835124","type":"user-reviews","attributes":{"date":"2020-07-08T16:10:40Z","rating":1,"review":"This is really The worst idea possible, with all they dumb and useless ideas the president has decided it makes the world and America bad again, also it took WEEKS to download absolute nonsense. I really wouldn't see what the point would to support such a racist and \"put bleach in our veins\" guy would think of or get my support! We need Obama back!","userName":"lilyrosas101","isEdited":false,"title":"Worthless"}},{"id":"6172814857","type":"user-reviews","attributes":{"date":"2020-07-08T16:04:52Z","rating":1,"review":"This app is the WORST app. I have never had such difficulties truing to figure out how to work an app. Everything is unorganized and many typos. I am so disappointed and i think this app needs to be taken off the store because i feel bad for anyone who has to have a seizure eveytime they try to read something. Also #tiktoklivesmatter ☺️","userName":"tiktoklivesmatter","isEdited":false,"title":"Terrible app! The worst"}},{"id":"6172752252","type":"user-reviews","attributes":{"date":"2020-07-08T15:46:55Z","rating":1,"review":"After downloading this app to show my support, I am heartbroken to find that they’ve been stealing my information. After attempting to buy merchandise through the app, my card starting getting charged random payments that I couldn’t seem to track or cancel. Not to mention the app of very glitchy and clearly in need of an update.","userName":"Kelani Esmo","isEdited":false,"title":"STEALS YOUR INFO DO NOT DOWNLOAD"}},{"id":"6172719679","type":"user-reviews","attributes":{"date":"2020-07-08T15:37:36Z","rating":1,"review":"I tried to open the app but it kicked me out and, as a republican, I just want to look at trumps beautiful face. His saggy skin really holds a ton of fascination for me. I just think this app doesn’t work. On top of kicking me out, it has a LOT of fake news that I honestly don’t know how anyone can believe. I think this app would need to be taken down in order to work properly.","userName":"beigjskkc","isEdited":false,"title":"Hi"}}]}