{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=130400","data":[{"id":"6174693506","type":"user-reviews","attributes":{"rating":1,"userName":"BTS JUNGKOOKIE AND TAETAE","title":"I did this because I’m cocky and petty","review":"i downloaded this app just so I could leave a bad review... and to piss Trump off more, in also a kpop stan. and a woman.","date":"2020-07-09T02:35:01Z","isEdited":false}},{"id":"6174693153","type":"user-reviews","attributes":{"rating":1,"userName":"alwaysitchyandalittlebitchy","title":"no!","review":"ew yuck yuck! bad app 😤","date":"2020-07-09T02:34:55Z","isEdited":false}},{"id":"6174692886","type":"user-reviews","attributes":{"rating":1,"userName":"Taylor Swift listener and lover098","title":"Annoying orange","review":"This app is broken it kept taking me to the annoying orange YouTube page","date":"2020-07-09T02:34:50Z","isEdited":false}},{"id":"6174692795","type":"user-reviews","attributes":{"rating":1,"userName":"magahahahahaha","title":"Booooo","review":"Booooooooooooo","date":"2020-07-09T02:34:49Z","isEdited":false}},{"id":"6174691978","type":"user-reviews","attributes":{"rating":1,"userName":"jaley2166","title":"F**k Trump","review":"This app will go inside your house and make you play dolls with it. The app even stole my favorite one so therefore this shouldn’t even be a app","date":"2020-07-09T02:34:35Z","isEdited":false}},{"id":"6174691784","type":"user-reviews","attributes":{"rating":1,"userName":"1849/!;9283","title":"No","review":"𝔁𝓾𝓮🥶𝓱𝓾𝓪🧚‍♀️𝓹𝓲𝓪𝓸😻𝓹𝓲𝓪𝓸🗿𝓫𝓮𝓲👺𝓯𝓮𝓷𝓰🤩𝔁𝓲𝓪𝓸😼𝔁𝓲𝓪𝓸👣","date":"2020-07-09T02:34:32Z","isEdited":false}},{"id":"6174691056","type":"user-reviews","attributes":{"rating":1,"userName":"Trump's hater >:-(","title":"WORST PRESIDENT EVER.","review":"First of all, he was the president that I HATED since 2017. He’s a sexist, racist, rapist, and a pervert. In the past, he would literally RAPE girls with his friend. He would be rude to women reporters and he doesn’t RESPECT them. In one of the recordings he said, “Grab them by the p*ssy.” Second, he doesn’t CARE about racism and he mistreats black people. BLM doesn’t mean ANYTHING to him and he would send an ARMY of officers and the SWAT team to shoot the protesters. The protesters are just protesting PEACEFULLY. They’re INNOCENT people. Third, his ugly CHEETO PUFF face is absolute DISGUSTING. His BLONDE hair does not match his forehead. Plus, TRUMP is gonna delete TIKTOK and that’s my FAVORITE app. You’re making PEOPLE already SUFFER from you TRUMP. You should KNOW that. So please go die cause NO ONE CARES about you. LEAVE TRUMP, LEAVE.","date":"2020-07-09T02:34:18Z","isEdited":false}},{"id":"6174690426","type":"user-reviews","attributes":{"rating":1,"userName":"YA FAVE HATER","title":"GURL BYE","review":"F*** Trump😘","date":"2020-07-09T02:34:07Z","isEdited":false}},{"id":"6174689856","type":"user-reviews","attributes":{"rating":1,"userName":"StatingFacts💯💯","title":"This App Is HORRIBLE ❗️❗️❗️","review":"I don’t even know why people think this is a good app to begin with.Trump is the most disgraceful,Racist,person I have ever know about.The fact that he doesn’t acknowledge that he has white power and that will be the only reason EVER that he got votes and was even a candidate to be the president is sad and disappointing.The people are really blind and they salute to this down right racist and unforgiving insect of a man.Thats all the tea that I will spill.","date":"2020-07-09T02:33:56Z","isEdited":false}},{"id":"6174689857","type":"user-reviews","attributes":{"rating":1,"userName":"F@UCK TRUMP","title":"Arrest the cops that killed Breonna Taylor","review":"Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor Arrest the cops that killed Breonna Taylor","date":"2020-07-09T02:33:56Z","isEdited":false}}]}