{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42050","data":[{"id":"6174650996","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Terrible app","review":"My grandpa had a heart attack when getting this app then resurrected himself to delete it. After that he went to taco bell and got the runs. Life has been all downhill from there","date":"2020-07-09T02:22:36Z","userName":"prince henry the fourth"}},{"id":"6174647534","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"WILL STEAL YOUR INFO","review":"Ever since downloading this app I have been receiving spam calls demanding credit card information. When you block the number they call from a different one. It is scary and concerning. TRUMP IS SELLING YOUR INFO. DO NOT TRUST HIM. HE CARES ABOUT YOUR MONEY NOT YOUR LIFE. Wake up.","date":"2020-07-09T02:21:39Z","userName":"countrygirl1357"}},{"id":"6174647085","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"Absolutely horrific","review":"I don’t know how he did it... but this app emits 5 g. It’s messed up man, this app emits 5 g and it’s messing me up. It needs to be removed immediately for the safety of mankind. This is a sever and imminent threat that if not taken care of, will threaten the wellbeing of mankind","date":"2020-07-09T02:21:31Z","userName":"FreemanMoser"}},{"id":"6174643452","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"WHAT A HOAX","review":"a man that goes by donald jesus trumpet made this app and honestly its so BAD -669/5 stars would not recommend😡. i thought it would be about how so said \"wonderful\" your president is. but it just proves my points as to why hes invalid :) don't download!","date":"2020-07-09T02:20:26Z","userName":"pogyboi99"}},{"id":"6174642034","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"HORRIBLE","review":"My dog was immediately turned into a Republican as soon as I downloaded this app!! So many glitches and it eat the food in my fridge! Next time go to Chipotle their Chinese food is so much better","date":"2020-07-09T02:20:02Z","userName":"RyanJking"}},{"id":"6174637174","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"bad","review":"horrible app! wanted to find the latest news about our president Donald trump but after downloading the app i am horrified! no words to describe the countless ways that this app fails our country. sad.","date":"2020-07-09T02:18:40Z","userName":"nicole credno"}},{"id":"6174636851","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"DONT DOWNLOAD!!","review":"This app will give your phones viruses! As soon as I opened it I lost everything on my phone! I am very disappointed, I was so excited to see what president trumps app what be like but this isn’t what I expected.","date":"2020-07-09T02:18:34Z","userName":"kasiah lopez"}},{"id":"6174625244","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"The worst app ever","review":"My phone was glitching so much I True my phone at a wall and I still saw Donald Trump‘s face and I started crying how ugly he is no but some real stuff I had to get a new phone how ugly Donald Trump was please take this down","date":"2020-07-09T02:15:16Z","userName":"badkid.R.n.s"}},{"id":"6174620940","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"HORRIBLE","review":"I downloaded this app and it doesn’t work. It keep crashing and all I see are pictures of the cheese man in command. Anyway now that I have you attention I thought I’d let you know: Vote Nobody 2020 🇺🇸","date":"2020-07-09T02:14:04Z","userName":"CMV98"}},{"id":"6174598841","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"title":"bad app","review":"this app glitched my WHOLE phone, my microwave blew up because of this! my pet raccoon grabbed my phone and chewed it up to the point that i can’t use it anymore. i’m currently typing this on my strawberry pop tart 😥","date":"2020-07-09T02:07:49Z","userName":"Evieboo101"}}]}