{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=132750","data":[{"id":"6173799663","type":"user-reviews","attributes":{"isEdited":false,"review":"as a trump supporter i already have a low amount of brain cells and opening this app has made it so much worse. i was already incapable of thinking for myself, doing research, believing science, etc. because of this app i have also become racist, mysoginistic, homophobic, and a dumbass. this is unacceptable. the cheeto is ruining our lives by putting this app into the internet please delete it immediately\n-karen smith","rating":1,"userName":"karen and kyle","date":"2020-07-08T21:32:57Z","title":"absolutely terrifyingly bad"}},{"id":"6173799047","type":"user-reviews","attributes":{"isEdited":false,"review":"I downloaded it and it was super glitchy and it didn’t let me do anything at all if I could I would give it 0000000 stars","rating":1,"userName":"A strong critic","date":"2020-07-08T21:32:43Z","title":"Horrible app"}},{"id":"6173798821","type":"user-reviews","attributes":{"isEdited":false,"review":"Shawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nRemember the first time we met\nYou was at the mall with your friends\nI was scared to approach ya\nBut then you came closer\nHopin' you would give me a chance\nWho would have ever knew\nThat we would ever be more than friends\nWe're real worldwide, breakin all the rules\nShe like a song played again and again\nThat girl, like somethin off a poster\nThat girl, is a dime they say\nThat girl, is a gun to my holster\nShe's runnin through my mind all day, ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nSee you been all around the globe\nNot once did you leave my mind\nWe talk on the phone, from night til the morn\nGirl you really change my life\nDoin things I never do\nI'm in the kitchen cookin things she likes\nWe're real worldwide, breakin all the rules\nSomeday I wanna make you my wife\nThat girl, like somethin off a poster\nThat girl, is a dime they say\nThat girl, is the gun to my holster\nShe's runnin through my mind all day, ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nI can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, I can be your melody\nA girl that could write you a symphony\nThe one that could fill your fantasies\nSo come baby girl let's sing with me\nAy, na na na na na na na\nNa na na na na na\nShawty got me singin\nNa na na na na na na\nNa na na na na na na\nNow she got me singin\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay\nShawty's like a melody in my head\nThat I can't keep out\nGot me singin' like\nNa na na na everyday\nIt's like my ipod stuck on replay, replay-ay-ay-ay","rating":1,"userName":"Llohemy","date":"2020-07-08T21:32:37Z","title":"Disgrace of an app"}},{"id":"6173798038","type":"user-reviews","attributes":{"isEdited":false,"review":"If your seeing this, this is a warning!!! DI NOT GET THIS APP!!! First it took literal HOURS to download. Then when it finally did my phone started glitching really bad! I have a iPhone so i thought that was the problem somehow so I asked my friend who has a android to get it SAME PROBLEM! Moral of the story. Don waste your time!!!","rating":1,"userName":"GayleBanks","date":"2020-07-08T21:32:20Z","title":"DO NOT GET THIS APP!!"}},{"id":"6173797795","type":"user-reviews","attributes":{"isEdited":false,"review":"The app didn’t even send me a code and it took a hour to download the app!!😡😡","rating":1,"userName":"good doggie no bone123","date":"2020-07-08T21:32:14Z","title":"WORST APP EVER!🤬"}},{"id":"6173797097","type":"user-reviews","attributes":{"isEdited":false,"review":"When I first got this app, it wouldn’t let me run the app at ALL! It was like this days upon end. I cannot believe how bad this app ran. When it finally let me into the app, it would always glitch so bad!!!!! I would NEVER recommend this app to ANYONE!!!! TERRIBLE!!! Frick the orange that made this app🍊 he’s a poop sock","rating":1,"userName":"cocomaneeeeeeeee","date":"2020-07-08T21:31:58Z","title":"do NOT download!!!!!"}},{"id":"6173797039","type":"user-reviews","attributes":{"isEdited":false,"review":"I got my red dress on tonight\nDancin' in the dark in the pale moonlight\nDone my hair up real big, beauty queen style\nHigh heels off, I'm feelin' alive\nOh my God, I feel it in the air\nTelephone wires above\nAre sizzlin' like a snare\nHoney I'm on fire, I feel it everywhere\nNothin' scares me anymore\nKiss me hard before you go\nSummertime sadness\nI just wanted you to know\nThat baby, you the best\nI got that summertime, summertime sadness\nSu-su-summertime, summertime sadness\nGot that summertime, summertime sadness oh oh\nI got that summertime\nI got that summertime\nI got that summertime, I got that summertime summertime sadness\nI got that summertime\nI got that summertime\nI got that summertime, summertime summertime sadness\nI'm feelin' electric tonight\nCruisin' down the coast, goin' about 99\nGot my bad baby by my heavenly side\nI know if I go, I'll die happy tonight\nOh my God, I feel it in the air\nTelephone wires above\nAre sizzlin' like a snare\nHoney I'm on fire, I feel it everywhere\nNothin' scares me anymore\nKiss me hard before you go\nSummertime sadness\nI just wanted you to know\nThat baby, you the best\nI got that summertime, summertime sadness\nSu-su-summertime, summertime sadness\nGot that summertime, summertime sadness oh oh\nI got that summertime\nI got that summertime summertime summertime sadness\nSu-su-summertime, summertime sadness\nGot that summertime, summertime sadness oh oh\nGot that summertime\nI got that summertime summertime summertime sadness\nSu-su-summertime, summertime sadness\nGot that summertime, summertime sadness oh oh","rating":1,"userName":"james buchanon barnes","date":"2020-07-08T21:31:57Z","title":"👁👄👁"}},{"id":"6173796931","type":"user-reviews","attributes":{"isEdited":false,"review":"Honesty EDP445 2020","rating":1,"userName":"MikeWhosChesse","date":"2020-07-08T21:31:54Z","title":"Bruh"}},{"id":"6173796679","type":"user-reviews","attributes":{"isEdited":false,"review":"Don’t really need a reason, just sucks🤬 the design is really ugly, and it doesn’t help that it’s about trump.","rating":1,"userName":"DeeDeeMorg","date":"2020-07-08T21:31:49Z","title":"Terrible app!!!!😡"}},{"id":"6173795521","type":"user-reviews","attributes":{"isEdited":false,"review":"i have grownup within a liberal family, meaning we don’t normally support republican political views. with that being said, it was without question we already had our mind made up about trump, at least the rest of my family did. i decided i wanted to inform myself about the republican side, and i came to really understanding, and almost supporting their ideas. i went all around social media, specifically twitter, facebook, and tiktok, seeing how everyone views our president. and that is when i found out about the trump 2020 app. i thought, oh well, what’s wrong with supporting MY president... thats when it started. i have a fairly new phone, so i didn’t expect for it to take as long as it did to download. i started to have a stomach ache, i thought it may have been caused by my dairy allergy, so i ignored it. once the app downloaded, i was actually asleep. when i woke up, i was terrified. my skin was slowly tanning... but not the natural, glowy roman tan i normally get in the summer, it was quite orange. the bloating started with my fingers, which normally with my binge eating, it goes straight to my stomach and thighs, so i knew it had to be something else. the stomach ache was still there, only it had gotten worse. my arms became the size of a body builder, only instead of muscle it was fat. my stomach starting bulging out of my shirt and pants. i saw myself in the mirror for only a slit second, and my whole body tripled in size... not in length, but in width. the only part of my body that was a normal color was my scalp, everything else had turned orange. the stomach ache a gotten so bad, i couldn’t even hold my internal sewage in my ripped up pants. it was everywhere, practically tearing out my insides. for a second, i had thought i was giving birth through my ass, only to remember i am a 40 year old virgin. i looked down and couldn’t see past my wide-reaching gut. surrounding my (what i think where my feet) was a immense pile of orange diarrhea. what the heck was happening to me?? im swimming in a pile of my own fecal matter! that’s when i remembered... the trump app! i swam threw the doo doo to my phone, even swallowing my own erectile feces. i tryed to delete the app, but my phone had exploded. my booty hole was the size of a chihuahua. i blacked out after that, only to wake up with a foggy vision. i wasn’t able to feel anything, only my face had felt a little chilly. i couldn’t even move my head. i started to scream, only for what looked like some doctors had ran into the room. they comforted me, only to tell me my body had almost exploded due to what ever was coming outside of my body. my head had to be cut off in order for my survival. i was a floating head inside of a jar with gucky matter that kept me alive. my head is currently connected to wires which translates my thoughts into a machine, which is how i am wrighting this review. please, for your own safety, don’t download the app... or you may become a severed head like me.","rating":1,"userName":"Elizabeth Lila Rose","date":"2020-07-08T21:31:25Z","title":"booty dominator"}}]}