{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31960","data":[{"id":"6178641347","type":"user-reviews","attributes":{"userName":"Ashleyponce","date":"2020-07-09T23:39:49Z","isEdited":false,"review":"This once I downloaded this app it was taking a long time to download (about 2-4) days it also started to glitch and my phone keeped on freezing and once it was done downloading I clicked the app and it keeped on kicking me out","title":"Bad😡","rating":1}},{"id":"6178608073","type":"user-reviews","attributes":{"userName":"1109196855241063qq","date":"2020-07-09T23:26:55Z","isEdited":false,"review":"I installed this horrible app. Just would not stop lagging. The imagery was horrific, Trump looked more orange than usual. Just how am I supposed to force my children to adopt my political beliefs when the app doesn’t even work. Very sad and disappointed","title":"No, just no","rating":1}},{"id":"6178583459","type":"user-reviews","attributes":{"userName":"maddoor","date":"2020-07-09T23:17:07Z","isEdited":false,"review":"This app took forever to download and once it did it kept glitching every time I opened it. When I got past the stage of glitching it took forever for all the information to load","title":"slow","rating":1}},{"id":"6178582282","type":"user-reviews","attributes":{"userName":"Jeremaih GC.","date":"2020-07-09T23:16:37Z","isEdited":false,"review":"I downloaded the app in order to support our President but this app is just not designed nor coded well. I feel as if it needs to be adjusted a little bit more with more features in it. Very disappointed.","title":"Bad Design","rating":1}},{"id":"6178560526","type":"user-reviews","attributes":{"userName":"evpapppps","date":"2020-07-09T23:08:17Z","isEdited":false,"review":"The design of the app is crappy way to confusing for me. It took me 30 hours to download it. And it started sending me text messages without my consent 1/10 would not recommend","title":"Crappy app","rating":1}},{"id":"6178559951","type":"user-reviews","attributes":{"userName":"basudaaaa","date":"2020-07-09T23:08:01Z","isEdited":false,"review":"This app made my phone glitch out all day took 6 hours to download and I’m getting weird messages please get rid of this before others go through the same","title":"Terrible app","rating":1}},{"id":"6178558083","type":"user-reviews","attributes":{"userName":"nislbs1","date":"2020-07-09T23:07:19Z","isEdited":false,"review":"I downloaded this app and it completely made my phone crash idk what happened but this app was horrible i gave it a 1 star because I do but suggest anyone to download this horrible app it will crash your phone ! DONT DOWNLOAD.","title":"horrible app","rating":1}},{"id":"6178511218","type":"user-reviews","attributes":{"userName":"Betty lofthouse","date":"2020-07-09T22:48:35Z","isEdited":false,"review":"After supporting the Republican Party for years I would expect a better app. This app always crashes and freezes my phone with the insistent pop up ads. This app is a disgrace towards all the supporters who use it. #MakeAppsGreatAgain","title":"Scary dangerous and saddening","rating":1}},{"id":"6178504942","type":"user-reviews","attributes":{"userName":"FelishaRates😃","date":"2020-07-09T22:46:07Z","isEdited":false,"review":"this app took FOREVER to load into, i was staring at the begging for a good 10 minutes. i really wanted to support trump ❤️ but this app was NOT it. then when i opened it i got a virus ! and now it costs extra to get rid of a virus so i recommend DO NOT GET THIS APP","title":"i’m sorry but why","rating":1}},{"id":"6178475955","type":"user-reviews","attributes":{"userName":"denice648","date":"2020-07-09T22:34:36Z","isEdited":false,"review":"As someone who is eager to find out about Trump’s new policies I downloaded this app to make it easier. Little did I know that this App will crash your phone and making it unable to turn on. Please take this app off the App Store!","title":"App is TERRIBLE","rating":1}}]}