{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=14640","data":[{"id":"6173942514","type":"user-reviews","attributes":{"userName":"thaliaperezz","date":"2020-07-08T22:26:31Z","isEdited":false,"rating":1,"title":"My phone screen blacked out after downloading","review":"This app has viruses racism being the 1st one. My phone like my brain could not longer function after seeing the disturbing content posted on here. Xenophobia, homophobia, islamophobia, transphobia and many more viruses will be downloaded in your phone. If you want your iPhone to survive never download this I cannot believe it’s legal to post this disgusting content."}},{"id":"6173922514","type":"user-reviews","attributes":{"userName":"trutlelover","date":"2020-07-08T22:19:08Z","isEdited":false,"rating":1,"title":"Horrible","review":"Do not get this app i repeat do not get this app this app will try to force you to give all of your personal information and will ask you if you are single if you say yes then it will start making fun of you for being ugly and fat and single then it will try to get you deported even if you are from America. For your safety and mine as well I hope this app gets removed immediately!!!!"}},{"id":"6173922147","type":"user-reviews","attributes":{"userName":"sadbrokeboi","date":"2020-07-08T22:19:00Z","isEdited":false,"rating":1,"title":"ADOLF HITLER (kiingjuilan)","review":"hello my name is adolf hitler and i would like to address some concerning viewpoints. i got this app to support my reincarnation as his ideas flow with mine seamlessly. i booked seats for rally’s and everything. but then i noticed i was being STALKED. some cheeto bag was blowing in the wind after me wherever i went. i fell asleep one night and woke up naked and in the process of being raped by said cheeto bag. morale of story is don’t download this app unless u want to get raped by cheeto bags."}},{"id":"6173913326","type":"user-reviews","attributes":{"userName":"JGD102938","date":"2020-07-08T22:15:48Z","isEdited":false,"rating":1,"title":"Just Tragic","review":"I downloaded the app to find out more political facts because I no longer just Fake News but I was very disappointed to see an orange caterpillar wearing an odd toupee? I don’t take politics lightly and to see this was very WRONG. If I could give a negative 5 star rating, I most certainly would. Also this app took FOREVER TO LOAD and in my unplanned free time for waiting, I just donated money to Yemen instead. This app killed my neighbor’s dog, too."}},{"id":"6173886986","type":"user-reviews","attributes":{"userName":"TasnimReza","date":"2020-07-08T22:06:08Z","isEdited":false,"rating":1,"title":"gross","review":"i go into the app and i see the most horrifying person ever and it gave me a heart attack. i’m sueing you guys. i want to kill myself now and if i die i will blame you guys. seeing that person made me want to actually want to take my kids to another country and sell ourselves to cows. also the app gave me a virus and keeps making my phone blow up into dust so each time i download it it keeps blowing up and i keep having to get a new phone. i know you guys are thinking like why don’t u stop downloading the app but i totally support the horrifying cheeto and i can not live without having this app. but this app is a bad thing and immediately needs to go or me and my kids will sue you"}},{"id":"6173881529","type":"user-reviews","attributes":{"userName":"Alexbp1123","date":"2020-07-08T22:04:10Z","isEdited":false,"rating":1,"title":"Absolute TRASH","review":"The app is just TERRIBLE. It crashes often, won’t let me open the news articles, and there’s so much misinformation. I thought I was getting a genuine news source but instead I got fake news spread by the liberal media. I will be taking my vote elsewhere. It’s just pictures of him making the same face over and over again with different prompts. If I could give it 0/5 stars, I would."}},{"id":"6173872253","type":"user-reviews","attributes":{"userName":"Babbi Jade","date":"2020-07-08T22:00:49Z","isEdited":false,"rating":1,"title":"Absolutely RIDDLED with glitches","review":"I love trump as much as the next gen zer. I heard about this app and just couldn’t wait!! Unfortunately, it was problematic from the start. It took HOURS to download, and once it did finally fully install it was filled to the brim with glitches. I wouldn’t trust this app at all, and it really pains me to say this. I just know president trump wouldn’t approve of something so riddled with problems to be made in his name, right??"}},{"id":"6173861916","type":"user-reviews","attributes":{"userName":"Brnehudkdnbe","date":"2020-07-08T21:56:58Z","isEdited":false,"rating":1,"title":"It just not ready to be on the AppStore","review":"It took about 48 hours to fully download but then it glitch my whole phone so I couldn’t do anything else until the app downloaded and I couldn’t stop the download. Please take this off the App Store it’s a waste of time and I missed a bunch of important work calls I use to be for trump2020 but this app just showed his unprofessionalism, I hope he loses the election."}},{"id":"6173806693","type":"user-reviews","attributes":{"userName":"Shiv Lock","date":"2020-07-08T21:35:40Z","isEdited":false,"rating":1,"title":"Horrible Experience!!","review":"Upon downloading this app my phone was met with a variety of different viruses- Siri started saying things like “Trump 2020” and “all lives matter”. My phone would frequently send notifications reminding me how bad safe spaces are and how they promote an oppressive agenda against The Straight White Man. -5/10 would not recommend downloading, i would say more but i keep getting emails asking me to “fight the liberal mob”."}},{"id":"6173797509","type":"user-reviews","attributes":{"userName":"Cat fishy","date":"2020-07-08T21:32:08Z","isEdited":false,"rating":1,"title":"Not user friendly!!😤✨","review":"The app took forever to download onto my phone! I have perfectly good WiFi and it took just way too long. Not only that but as soon as I started to use the app it kept crashing my phone! Now my phone is so slow. My phone has never been the same since I downloaded this app. I suspect that they are taking out information and recording us."}}]}