{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=83530","data":[{"id":"6174705029","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:38:29Z","userName":"Elliebear55","rating":1,"title":"Horrible App!!!","review":"Oh god where to start. First off, upon downloading the app, somehow it changed my home and lock screen photos to pictures of penis’s and it won’t let me change them back. Then when I opened the app, it asked me if I was a furry and upon clicking no it proceed to show me vulgar and inappropriate pictures and videos of what I assume are furry’s committing lewd and disgusting acts. After what felt like forever the app then asked if I wanted to take a “short” survey. The word short is in quotes because in actuality the survey took me 3 days and 4 hours to complete. I had to miss my daughters wedding vows just to complete it. The questions started off normal. They asked my name, age, and political party. Then they got weirder and weirder. The survey started asking things like “Are you in the Illuminati?” And “Do you believe in Crumple-Horned Snorkacks.” Once the survey was finished I heard a pounding on my door. Turns out it was the Italian mafia. They kidnapped me and brought me to a remote location and told me that they kidnapped and imprisoned me because I downloaded this app and now I have 1 year to fall in love with the dominant mafia boss 365 days style. I just hope I don’t have to recreate any of the movie scenes with him (especially the boat scene) because he’s very old and ugly. I managed to escaped after 4 weeks and now have to undergo therapy and counseling sessions. I have trauma from that experience. I then opened the app again to see if there’s anything to do on it and the app made my phone become sentient and try to kill my cat. I highly do not recommend this app and will be deleting it as soon as I find a way to destroy my phone. PS I am writing this from a friends phone. She has had a similar experience aside from the sentient phone part."}},{"id":"6174704872","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:38:26Z","userName":"Devyn0419","rating":1,"title":"Bad","review":"Worst app I’ve ever used in my entire life"}},{"id":"6174701999","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:37:34Z","userName":"@heybriajones","rating":1,"title":"Stinky","review":"App smells like white supremacy that’s afraid of the progressive generations that are about to dismantle this country and rebuild it with liberty and justice FOR ALL"}},{"id":"6174704632","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:38:22Z","userName":"zbbdbbsbsh","rating":2,"title":"terrible app","review":"i had it to know what’s going on and my phone keeps glitching i hate this app😡"}},{"id":"6174698066","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:36:24Z","userName":"nuggetzz1212","rating":1,"title":"the app was awful and gave incorrect information","review":"the app was awful and gave incorrect information"}},{"id":"6174697103","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:36:06Z","userName":"dissase","rating":1,"title":"Horrible","review":"It’s so bad and use less"}},{"id":"6174689731","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:33:54Z","userName":"dino nuggie","rating":1,"title":"Horrible:(","review":"This app is the WORST. Delete now! So dumb. Not worth my space:("}},{"id":"6174680830","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:31:14Z","userName":"nihokailan","rating":1,"title":"he is so nasty and i bet he smell like asparagus pee","review":"trump is physically disgusting and it hurts my soul when i see his face because i know that he is the type of person that pours milk before his cereal"}},{"id":"6174680492","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:31:07Z","userName":"Kjghghg","rating":1,"title":"terrible app, do not recommend","review":"i can not believe the shame this app has brought to me and my family, absolutely disgusted"}},{"id":"6174677990","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:30:25Z","userName":"Tartlet4","rating":1,"title":"Horrific","review":"Horrible app. Disgraceful. Make Apps Great Again. Take down this app. 🤮"}}]}