{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=26570","data":[{"id":"6173738779","type":"user-reviews","attributes":{"title":"Worst app everrrrr","date":"2020-07-08T21:10:26Z","isEdited":false,"review":"This is the most worst app ever. When I downloaded this app it sent me a message saying that they were going to track me and my family and prosecute us and kill us if we don’t support trump. And I can’t even start on how they came to my house and threw trash in my yard. DO NOT DOWNLOAD THIS APP!!!! They will stalk you","rating":1,"userName":"jassssperr"}},{"id":"6173735517","type":"user-reviews","attributes":{"title":"1 star 🤬","date":"2020-07-08T21:09:14Z","isEdited":false,"review":"I absolutely hate this app. First I have been trying to download this app since 400BC and when it finally downloaded MY DOG GOT STUCK IN THE TOASTER!!!!😡😤🤬 I am suing this app for animal cruelty, emotional abuse and pain and suffering. You better pay for all my dogs medical bills too, I should not have to pay for something you caused.","rating":1,"userName":"kayla_the_great"}},{"id":"6173732208","type":"user-reviews","attributes":{"title":"HORRIBLE!!!!!!!!!!!!!!!","date":"2020-07-08T21:08:01Z","isEdited":false,"review":"it was very terrible because it took so long to download and I had very good WiFi and service. the app was very glitchy and annoying. when I opened the app I saw a rotten orange very horrible experience. it takes up a lot of space on my phone. this is why I gave it a 1 Star.","rating":1,"userName":"Daysyyyy"}},{"id":"6173731349","type":"user-reviews","attributes":{"title":"I’m just confused","date":"2020-07-08T21:07:41Z","isEdited":false,"review":"how is this #2 in news? very biased information about the state of our country. also I had a very hard time using the app once it finally downloaded which took over 2 hours. overall bad app with bad vibes I do not recommend.","rating":1,"userName":"Rachel N. Kittel"}},{"id":"6173728294","type":"user-reviews","attributes":{"title":"Terrible app","date":"2020-07-08T21:06:30Z","isEdited":false,"review":"Honestly this is the most annoying and terrible app I ever gotten. Like I really hope it gets taken down please I recommend to not buy it. It is extremely slow and most of the time it crashes. If I could I would vote 0 out of 5 stars.","rating":1,"userName":"Shy Boba"}},{"id":"6173718585","type":"user-reviews","attributes":{"title":"I honestly wanted to die when I got this app","date":"2020-07-08T21:02:59Z","isEdited":false,"review":"I hate this app, worst thing I’ve ever seen. I never wanna get this app again. I don’t even know what to say because it’s so terrible. I want to throw up. don’t ever use this app. It’s going to give you nightmares. It’s worse in my depression, and that’s saying something.","rating":1,"userName":"TosomeoneIhate"}},{"id":"6173713695","type":"user-reviews","attributes":{"title":"WORST APP","date":"2020-07-08T21:01:15Z","isEdited":false,"review":"I have never seen an app so bad. Seriously, as soon as I downloaded it took forever to load which caused my whole phone to slow down and lag consistently. To make matters worse, I couldn’t do anything because to whole thing kept crashing😡","rating":1,"userName":"turtleneckcat"}},{"id":"6173713321","type":"user-reviews","attributes":{"title":"Horrible","date":"2020-07-08T21:01:06Z","isEdited":false,"review":"This app is so terrible! It takes up a lot of storage, it glitches a lot, and it makes no sense! I hate this app! Downloading it is a waste of time. Please don’t get this app, it ruined my phone. Thank you. \n\nP.s I would have put a 0 star rating but that wasn’t an option","rating":1,"userName":"GooglclassroomSucks"}},{"id":"6173680962","type":"user-reviews","attributes":{"title":"THE WORST","date":"2020-07-08T20:49:16Z","isEdited":false,"review":"I would highly recommend NOT getting the app! After downloading all I got out of it was glitches and nothing seemed to work right. I can’t even open it anymore! Needs some light updates, I would think that a removal from the app store would suffice.","rating":1,"userName":"Payton Savat"}},{"id":"6173677582","type":"user-reviews","attributes":{"title":"no❤️","date":"2020-07-08T20:48:03Z","isEdited":false,"review":"this app almost killed me, once i downloaded the app (which took weeks to download) i had the worst luck ever. black lives matter, acab, trump2020onagravestone❤️ disrespect the orange as much as possible. delete this app. this app made me break all my bones somehow while i was walking my turtle to his swimming lessons 😿ONE STAR!!!!! 😟","rating":1,"userName":"kaosbsiakeb"}}]}