{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=16330","data":[{"id":"6173748442","type":"user-reviews","attributes":{"userName":"jaydddddeeeeeen","rating":1,"review":"This app took days to download using up all of my battery over and over and let me tell you my phone is not slow it’s actually pretty fast with downloading but I wanted the app and when I got in it just showed a black screen (something that has never happened before) and I had to restart my phone Please do not get this app","date":"2020-07-08T21:13:59Z","isEdited":false,"title":"Worst thing"}},{"id":"6173747886","type":"user-reviews","attributes":{"userName":"Likesuduko","rating":1,"review":"I downloaded this app to see what all the ✨h y p e ✨was about to sUpPoRt our lovely Sebastian bail twin face. I was certainly 🤮NOT🤮 pleased with this app. About 2 minutes after downloading i looked in the mirror AND I WAS TURNING ORANGE!! I was getting fatter and I my -non existent- downstairs was getting smaller 🍤! I think I was starting to look like our ✨great✨ orange peel. All I have to say is don’t download unless you want to look like an un-evolved harambe","date":"2020-07-08T21:13:47Z","isEdited":false,"title":"Cheeto lied to us again"}},{"id":"6173727623","type":"user-reviews","attributes":{"userName":"purplerayn1","rating":1,"review":"First of all, immediately as I downloaded the app, I was mailed probably around 100 disgustingly yellow colored toupee’s. Then, when I was horrified by these wigs that showed up, our presidents face showed up on my phone screen and CRIED!! He was so devastated that I did not like the 100 wigs sent to me, almost like his ego was torn down a bit. I think he must suffer from Narcissistic Personality Disorder (NPD). He needs help! Serious medical and emotional help:(","date":"2020-07-08T21:06:15Z","isEdited":false,"title":"No!"}},{"id":"6173726394","type":"user-reviews","attributes":{"userName":"Nattles.r","rating":1,"review":"This app called me the n-word multiple times, made fun of me for being a homosexual, and was sexist. i am giving this a ONE STAR, WORST APP EVER. DO NOT DOWNLOAD. Hacks all of your bank and google accounts. never using this app again. I would give it zero stars if i could. Hopefully Apple takes this off of the app store. trump stole all of my info and gave it to the government in Area 51 so that the unknown can know all of my secrets. TAKE OFF THE APPSTORE ASAP.","date":"2020-07-08T21:05:51Z","isEdited":false,"title":"Racist"}},{"id":"6173701753","type":"user-reviews","attributes":{"userName":"zam1312","rating":1,"review":"It kept glitching for a couple of hours and wouldn’t even let me open the app. As soon as I clicked on the app it would kick me out in a couple seconds. After that stopped it just kept lagging so I just deleted it. Anyways will not be getting anything from Donald Trump again I wanted to see hear all the hype was about him and his rallies. 0/10 never again.","date":"2020-07-08T20:56:50Z","isEdited":false,"title":"It lagged so much."}},{"id":"6173677196","type":"user-reviews","attributes":{"userName":"🇮🇹🏳️‍🌈","rating":1,"review":"This app gave me a virus and literally kept shutting down for no reason. The vibes off this app were so off, this app NEEDS to be taken down. The app told me to kill myself and jump off a cliff. The app also called my family rapist and murders. They also said blacks are thugs. The app also wanted me to walk but dog and then stand in the middle of the train tracks by my house and wait there to get hit.","date":"2020-07-08T20:47:53Z","isEdited":false,"title":"To the orange Cheeto"}},{"id":"6173681298","type":"user-reviews","attributes":{"userName":"Mia Rodriguez","rating":5,"review":"This app is so badly made. It crashes every single time I use it. It makes me wanna cry and throw my phone. Please don’t get this app it’s just a waste of space on your phone, time, and life. 🤢🤮","date":"2020-07-08T20:49:23Z","isEdited":false,"title":"DO NOT GET THIS APP"}},{"id":"6173656293","type":"user-reviews","attributes":{"userName":"Siarah_r5","rating":1,"review":"This app took 6 hours to download. When it did download it was glitching and freezing my phone and i couldn’t turn off or exit out of the app for 2 hours until it finally force quit. \nMy phone now dies extremely fast even when i just charged it. I don’t know what this app did to my phone but i deleted the app immediately.","date":"2020-07-08T20:40:27Z","isEdited":false,"title":"Don’t recommend"}},{"id":"6173644441","type":"user-reviews","attributes":{"userName":"t0xic.banana","rating":1,"review":"When I texted trump I asked him one single question why are deleting tiktok snd he said that’s a stupid question but why am I surprised stupid people ask stupid questions so I kept asking him and then the men in black showed up and the tried to brainwash me but little do they know I was way ahead of them I switched it out with perfume they thought I would forget it but they thought wrong","date":"2020-07-08T20:36:14Z","isEdited":false,"title":"So rude😞"}},{"id":"6173619159","type":"user-reviews","attributes":{"userName":"alisa walkers","rating":1,"review":"It took days to download and when it finally downloaded it wouldn’t do anything and it leaked my information to the media when I didn’t allow it to. Even  when I tried to delete it, it would delete the app so now I have a app that leaks my personal information stuck on my phone forever. If I could I would give to 0 stars","date":"2020-07-08T20:27:15Z","isEdited":false,"title":"Awful app"}}]}