{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=39090","data":[{"id":"6176766429","type":"user-reviews","attributes":{"date":"2020-07-09T13:42:53Z","title":"SO BAD","rating":1,"isEdited":false,"userName":"Mjb 19","review":"this app took FOREVER to download, once it did after 4 hours my whole phone started lagging and crashing. i do not recommend at all to anyone, it was a terrible experience❤️"}},{"id":"6176753475","type":"user-reviews","attributes":{"date":"2020-07-09T13:39:31Z","title":"Asks for a lot of private information","rating":1,"isEdited":false,"userName":"amendon2456","review":"Don’t really want to give that to a political campaign. I should just be able to see what I need to. Horrible UX and does not take Privacy into consideration."}},{"id":"6176738907","type":"user-reviews","attributes":{"date":"2020-07-09T13:35:43Z","title":"HORRIBLE","rating":1,"isEdited":false,"userName":"maaaaaajdjsjsnr","review":"I downloaded this app and it took FOREVER to download. After if FINALLY downloaded it hacked my data and wiped out my phone entirely! I have no more apps or personal pictures in my own phone!! DO NOT download this app it is so bad!!"}},{"id":"6176701580","type":"user-reviews","attributes":{"date":"2020-07-09T13:25:52Z","title":"DO NOT DOWNLOAD","rating":1,"isEdited":false,"userName":"Hshsshjs","review":"This app is awful!! It constantly crashes when I’m using it, never loads anything correctly - it just doesn’t work right!! Not to mention it took FOREVER to download! Deleting it NOW!"}},{"id":"6176675071","type":"user-reviews","attributes":{"date":"2020-07-09T13:18:53Z","title":"Awful app","rating":1,"isEdited":false,"userName":"jajucnd wnakmskc","review":"This app is awful it took me several days to finish the download. This is unexeptable. And then it wiped all of my photos off off my phone which many were very precious to me"}},{"id":"6176650259","type":"user-reviews","attributes":{"date":"2020-07-09T13:12:22Z","title":"Cinnamon Hitler","rating":1,"isEdited":false,"userName":"Vanilla_Isis","review":"I was so excited to see a different perspective into our fascist agent orange “leader” but was very disappointed. Not convinced vanilla isis knows about this app since he cant read or write above a second grade level so who's app is it really?"}},{"id":"6176623924","type":"user-reviews","attributes":{"date":"2020-07-09T13:05:24Z","title":"Awful app!!!","rating":1,"isEdited":false,"userName":"Bread6","review":"This app took nearly 17 hours to download! Unbelievable!! When I finally downloaded it I had to fill out so many forms and accept a lot of stuff??? It seems very suspicious to me and I fear that trump will steal my data. USER HARASSMENT!!!"}},{"id":"6176579456","type":"user-reviews","attributes":{"date":"2020-07-09T12:53:19Z","title":"Worst app","rating":1,"isEdited":false,"userName":"trump is a b***h","review":"After downloading this app it hacked all my data and made my phone slow and I had to go and buy a new phone take this app down from the App Store it cost me 500+"}},{"id":"6176533287","type":"user-reviews","attributes":{"date":"2020-07-09T12:40:42Z","title":"This app doesn't work!!!","rating":1,"isEdited":false,"userName":"_Demmi_Logan_Ramos_","review":"Whenever I open the app, it automatically closes and won't let me use it. It's honestly a waste of time to download. What makes it even worse, is it's a Trump app🤮"}},{"id":"6176519790","type":"user-reviews","attributes":{"date":"2020-07-09T12:37:02Z","title":"0/5 horrible app","rating":1,"isEdited":false,"userName":"upset tiktoker;)","review":"i saw this app and wanted to see how it was then literally the app took FOREVER to download! also this app lags like crazy and it is just a straight horrible app. doesn’t even work!"}}]}