{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=143190","data":[{"id":"6179238842","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:56Z","userName":"stress and depress","rating":1,"review":"This app killed my pet goldfish and now I wear red and skin tone Gucci bracelets 😔","title":"READ FOR YOUR SAFETY"}},{"id":"6179238705","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:53Z","userName":"TheJapaneseCat","rating":1,"review":"pretty self explanatory","title":"0 stars.."}},{"id":"6179238627","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:51Z","userName":"melaniadump","rating":1,"review":"My phone literally exploded when I downloaded this app.","title":"Phone exploded"}},{"id":"6179238412","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:46Z","userName":"mattmaupin25","rating":1,"review":"I downloaded this app on my phone a couple of weeks ago and it immediately began spreading itself onto other apps in my phone. It started with Snapchat and instagram. Next it was my camera roll. If only I would have taken control of this situation sooner. Now my phone has 350,000 new cases of this app’s misfortune on my phone. Soon all of my apps will contract the virus and I won’t even be able to use it. Thanks Obama😑","title":"This app is terrible"}},{"id":"6179238268","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:43Z","userName":"SpiritAlbarn","rating":1,"review":"My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.\" I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because your app gave me cancer anyway.","title":"Yo girlfriend look like my mom"}},{"id":"6179238202","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:41Z","userName":"jacaeripriest","rating":1,"review":"Tried downloading and it wouldn’t even finish installing!!! After multiple tries I just gave up!! This is not worth your time!","title":"Terrible!!"}},{"id":"6179238182","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:41Z","userName":"dogeoo","rating":1,"review":"i tried to. get this all bc i mean i just looovvee trump but when i got on it wouldn’t work gave me 69 viruses and my phone literally didn’t work i took it to 5 different stores to fix and they couldn’t do ANYTHING and your probably asking your self how are you using your phone... well you see i had to buy a new one but i don’t know my password to anything so idk what to do like i don’t want to make a new tiktok acc and i don’t have tiktok i haven’t had it in forever now and tiktok is bae so now idk what to do all thanks to trump my obvious favorite president i mean like we love an orange man.  but i would like my money back for the new phone i had to buy.","title":"don’t get"}},{"id":"6179238191","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:41Z","userName":"GET TRUMP IMPEACHED","rating":1,"review":"The I downloaded the app is and it deleted all of my contacts and I just put in David Dobrik into my contact list😭😭","title":"DO NOT DOWNLOAD THE APP IS HORRIBLE"}},{"id":"6179238157","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:40Z","userName":"Trumps left pincky toe","rating":1,"review":"This app is absolutely tragic. I opened it and the first thing I see is a Cheeto waving its fist at me. It scared me half to death. I’ve never seen something so awful in my life, but it got worse. Turns out the Cheeto was trump !!! That really pushed me over the edge. I HATE this app. It nearly made me seize.","title":"Tragic"}},{"id":"6179238052","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:22:38Z","userName":"tynka21","rating":1,"review":"One star😙","title":"I just don’t like him"}}]}