{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=14070","data":[{"id":"6175640289","type":"user-reviews","attributes":{"rating":1,"userName":"h_nguyen218","review":"This app took 6 weeks to download. Once it was done downloading I opened the app and it crashed when I went to my home page all my apps were gone and so were my pictures and downloaded documents. The app even changed my lock screen and home screen to pictures of naked Donald Trump. I just feel completely violated. I had to clean my eyes out with bleach because what I saw was so horrid. DO NOT GET THIS APP.","title":"HACKED MY PHONE!!!!","isEdited":false,"date":"2020-07-09T08:01:09Z"}},{"id":"6175614481","type":"user-reviews","attributes":{"rating":1,"userName":"rm89772","review":"so i wanted to download this app because i wanted to show support to our completely perfect president. he shows full support to lgbt+ and the black lives matter movement. not to mention he’s handling covid great considering that he’s comparing our breakout to countries with like 10 cases and then blaming it on the population differences 🥰🥰🥰. i’m just so happy he’s so woke and no ignorant at all. anyways this app is terrible just like him and he always talks about our privacy with tiktok because china will use it against us... but literally america controls every other platform and in his own app i’d probably get random texts and ad promotions if i gave up my phone number to him-","title":"please take this off 🤢🤢🤢","isEdited":false,"date":"2020-07-09T07:51:44Z"}},{"id":"6175613876","type":"user-reviews","attributes":{"rating":1,"userName":"dumptrump76","review":"First, it took 2 months to download, THEN Really really weird things started happening to my phone after downloading this app. It wiped all of my apps, contacts, and pictures and replaced them with pictures of trump. I tried burning my phone but it sat in the fire for over an hour without burning. Ended up throwing it away and it was back in my house the next morning. I’m not sure what to do anymore. DONT DOWNLOAD THIS APP!!!","title":"DONT DOWNLOAD THIS APP","isEdited":false,"date":"2020-07-09T07:51:30Z"}},{"id":"6175591652","type":"user-reviews","attributes":{"rating":1,"userName":"Spider fear","review":"This app took WAY too long to download for how simple the app actually is. All the bugs and glitches it has makes me laugh and wonder how someone could’ve passed this off to be released to the public. Honesty it’s a joke. I think it says a lot about the people who this add is for. Trump. It shows he doesn’t care about what we download and just is in it for the numbers.","title":"How could you upload this?","isEdited":false,"date":"2020-07-09T07:43:28Z"}},{"id":"6175572645","type":"user-reviews","attributes":{"rating":1,"userName":"newchair","review":"so basically i had to wait a long time for it to download, then right when i opened the app my phone literally exploded. i got a newer phone so it was able to handle it. but when i got in the app, instead of things being in english it was this satanic glitchy language. i can understand any of it. i also think it gave me a malware virus to my BRAND NEW PHONE so thanks. i hate this app it’s so stinky 😾⚱️","title":"very very not good","isEdited":false,"date":"2020-07-09T07:36:19Z"}},{"id":"6175563536","type":"user-reviews","attributes":{"rating":1,"userName":"FloomFloo","review":"Every time I try to open this app it ends up crashing! And even if it does open, it’s super slow and glitches all the time. I asked my family to download the app too thinking that maybe something is just wrong with my phone but the app didn’t work on their phones either! I cant get the darn thing to work! Don’t waste your time downloading this app, it doesn’t work at. All.","title":"DONT DOWNLOAD! DOESNT WORK!","isEdited":false,"date":"2020-07-09T07:33:02Z"}},{"id":"6175556610","type":"user-reviews","attributes":{"rating":1,"userName":"antitrumo2020","review":"i downloaded this app as a way to show my appreciation for our terrible president but it was just not great. it took forever to download and when it it it was not as expected. nothing made sense and i just couldn’t stomach looking at his face in photos. a recommendation i would advise is to remove the app completely from the store as it would restore peace in humanity and make the world a better place😡😡😡","title":"HORRIBLE☹️😡🤮","isEdited":false,"date":"2020-07-09T07:30:29Z"}},{"id":"6175508309","type":"user-reviews","attributes":{"rating":1,"userName":"trumps miserable son","review":"wow! right when i opened the app it kicked me out with a message saying “sorry for the inconvenience, but only white males are allowed to use this app. it appears that you are an asian🤢woman🤢. maybe try in another life, best regards, the annoying orange” now whenever i try to open the app a leaked picture of donald’s “😳” shows up. would NOT recommend. the mcdonald’s app works better. #allappsmatter.","title":"horrible experience","isEdited":false,"date":"2020-07-09T07:12:08Z"}},{"id":"6175356466","type":"user-reviews","attributes":{"rating":1,"userName":".+*Maddy*+.","review":"So, like the loving Donald Trump supporter that i am, i downloaded the app. But then i open the app and it straight up asks for my phone number. Like why would you even need that for??! To send the information straight to China so they can figure out my address? Then peel my skin off & boil me alive like they do to the poor animals?? UMMM i feel like very unsafe rn, i feel like something bad might happen to me, please pray for me 😢","title":"Asks for classified informations!!","isEdited":false,"date":"2020-07-09T06:12:33Z"}},{"id":"6175210324","type":"user-reviews","attributes":{"rating":1,"userName":"hzushsgsu","review":"So tbh no one likes trump BC THE APP TOLD ME TO FEED MY DOG CHOCLATE so I did and now my dogs dead so I went to go get some food for it but when I did the trump app told me that they were TRACKING ME!!! SO I QUICKLY ROTE THEM A NOTE ASKING WHY THEY TRACKED ME AND THEY TOKD ME DONT WORY ABOUT IT??? LIKE WHAT THEN THEY ASKED ME I I WANTED GO SEE TRUMOS FEET SO I SAID NO BUT DOING THIS I FORGOT ABOUT MY PET FRIDGE SO WHEN I GOT HOME MY CHOPOTELE WAS GONE😡😡😡 SO THEN I WENT TO GO FEED MY FRIDGE BUT IT WAS GONE TO SO I WENT BACK TO THE STORE AND GOT A FRIDGE AND I SAW A WHITE FRIDGE AND I WAS LIKE EWW SO I GOT A BLACK ONE AND WHEN I GOT HOME I FORGOT TO FEED MY DOG SO I FEED MY DOG and tbh it’s not worth the space","title":"This app is ✨horrible ✨","isEdited":false,"date":"2020-07-09T05:16:57Z"}}]}