{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=34600","data":[{"id":"6174881478","type":"user-reviews","attributes":{"userName":"Jumpman201","rating":1,"isEdited":false,"title":"Anyone but Trump 2020","date":"2020-07-09T03:31:13Z","review":"This app is thrash metal so you don’t have a lot ya know how you feel about your own story but it’s ok but it’s okay to play it and then get to it and get to the game you won’t be playing the way with you. Yeah so this app I terrible I recommend tik tok!!!"}},{"id":"6174879458","type":"user-reviews","attributes":{"userName":"gigi daina","rating":1,"isEdited":false,"title":"Worst app ever","date":"2020-07-09T03:30:38Z","review":"This is the worst app I’ve ever seen it’s so glitchy and there is really no point in this app it is very badly made the people that have designed this app are useless and should learn how to rightfully design a good app I suggest this app to be deleted forever"}},{"id":"6174876640","type":"user-reviews","attributes":{"userName":"mAdDiEm3737","rating":1,"isEdited":false,"title":"Horrible App","date":"2020-07-09T03:29:49Z","review":"This app stole my dog and put it in a refrigerator after attempting to steal all 47 of my oranges and all 302 of my watermelons that I got from the grocery store and was going to split among 28 of my friends. Please do not download this app unless you won’t your oranges watermelons and pets stolen!🤬🤬🤬"}},{"id":"6174874235","type":"user-reviews","attributes":{"userName":"trump=a**hole","rating":1,"isEdited":false,"title":"Unimpressed","date":"2020-07-09T03:29:08Z","review":"This app is the worst thing in the App Store. I find it ironic that it is rated #1 in news for it is filled with fake news as our president would say. It was very glitchy and overall a waste of time and phone storage."}},{"id":"6174869019","type":"user-reviews","attributes":{"userName":"oliviajjohnsonn","rating":1,"isEdited":false,"title":"TERRIBLE TERRIBLE TERRIBLE","date":"2020-07-09T03:27:37Z","review":"This is the worst app I’ve ever downloaded. It’s tacky and I hate it, not to mention the amount of viruses it gave my devices. My iPhone and iPad won’t stop crashing after I downloaded this app. DO NOT GIVE THIS APP THE TIME OF DAY! I will not EVER support Donald trump or anything he stands for. This app is the worst."}},{"id":"6174860612","type":"user-reviews","attributes":{"userName":"\"Chicken is amazing\" -Vegan","rating":1,"isEdited":false,"title":"Horrible App","date":"2020-07-09T03:25:09Z","review":"Makes my phone super slow and it glitches out every time I open the app. Now I can’t see what the best president in US history is up to and what new problems he is going to create for us. Oh well."}},{"id":"6174857002","type":"user-reviews","attributes":{"userName":"anacondamissing","rating":1,"isEdited":false,"title":"HORRIBLE","date":"2020-07-09T03:24:05Z","review":"THis app is the definition of horrible. Don’t get it. My anaconda has been missing for 3 days. After it used this app it ran away. I haven’t seen mouse since :( I am now very depressed. Trump if you see this I want a replaced anaconda. And a mansion. Plus super nice cars."}},{"id":"6174843210","type":"user-reviews","attributes":{"userName":"hehdhxgdgdhd","rating":1,"isEdited":false,"title":"this app is terrible","date":"2020-07-09T03:20:00Z","review":"hey what did you say about your dad i was the time you get your phone taken care haha was the last one of my streaks i is that the warm weather was so pretty omg is it a great time for ya guys so i was a time for a tik was the one who had to put it on your mind to make sure that we had the time of you and you can do not have to go back and get your phone back to your school counselors and then say it was just for a long day. 😤"}},{"id":"6174842830","type":"user-reviews","attributes":{"userName":"Mystergirl1","rating":1,"isEdited":false,"title":"My review","date":"2020-07-09T03:19:54Z","review":"I got this app to get some news about our president and etc once I open the app GLITCHES I couldn’t click the buttons to see the news trump and your team please fix the glitches"}},{"id":"6174832507","type":"user-reviews","attributes":{"userName":"JHarrison87","rating":5,"isEdited":false,"title":"Trash","date":"2020-07-09T03:16:50Z","review":"Made my phone crash constantly and made me get explosive diarrhea. Not sure how long it will take to get my poops back in order but my phone isn’t crashing anymore since I deleted the app so that’s nice."}}]}