{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=1760","data":[{"id":"6174847558","type":"user-reviews","attributes":{"userName":"dysfunctional jellyfish","isEdited":false,"title":"Why?","rating":1,"review":"I downloaded this app to see the work that cheeto has been putting out but it hasn’t been working out of all of the orange dust wafting through the screen. I thought that maybe something would pass through but the sea of cheddar remains just keeps flooding through!! Honestly i can’t even taste anything anymore i am desensitized to the cheese. This is the last time i’ll be getting chips from the chum bucket next time i’ll just go to McDonalds. Every time i opened the app i left with so much orange dust that it turned my pet bonsai turned orange and he can no longer go on drives to the dmv with me anymore. I blame this app for the complaints coming from my him as he would rather return to his natural complexion. While all colors do matter, it is important to bring attention to those that might be actively covered or targeted by cheeto dust.","date":"2020-07-09T03:21:18Z"}},{"id":"6174562733","type":"user-reviews","attributes":{"userName":"liv.d2006","isEdited":false,"title":"I’m disgusted by this app.","rating":1,"review":"after opening the app, i was greeted with an old, crusty, rancid cheeto. after browsing the app trying to distract my mind from the horrific image, i found out that the cheeto is also a racist pedofile. i tried to exit the app, but it wouldn’t let me. i started to get worried when i heard a knock at the door. it was the cheeto himself. he barged into the house with several police officers, kidnapped my dog, (but i don’t have a dog) ate my brother, took all of the raw meat out of my freezer then proceeded to shove it down his throat in front of my face. he and his army of officers clogged all the toilets in my house. i began to wonder how they even got to my house. while i was cleaning up the massive 💩 that he left on my floor, it clicked. the app uses my location. no one is safe. \nanyways, stream drag me down, fine line, walls, heartbreak weather, LP1, and mind of mine.","date":"2020-07-09T01:57:36Z"}},{"id":"6174522699","type":"user-reviews","attributes":{"userName":"bdjehskkd","isEdited":false,"title":"I am very disappointed with my purchase 😕","rating":1,"review":"So I was looking for food for my pet Tyrannosaurus rex 🦖 and he naturally really loves Cheetos so I downloaded this app thinking it was going to help me find the best Cheetos to buy in my area but when I opened it I saw this gross mistake of a Cheeto I looked and looked through the app and it is just this gross Cheeto over and over again so I ordered some of the product and tasted it OMG it tastes like somebody microwaved steel I was so sad for Laser (my Tyrannosaurus rex of course) I sent back the product and will not be buying this ever again my refrigerator, stove/oven, and microwave have also gone missing sense I downloaded this food app I’m very sad I will never buy this product again I demand this be taken off the App Store immediately thank you and have a great day. 🦖😌\n\n                          \n                      Sincerely, Lonely Cowboy And Laser","date":"2020-07-09T01:46:07Z"}},{"id":"6174434187","type":"user-reviews","attributes":{"userName":"wëii","isEdited":false,"title":"CHEETO💖🙈🧚🏻‍♀️BUT IN A DUMPSTER","rating":1,"review":"Bee Movie Script - Dialogue Transcript\n\n  \nAccording to all known laws\nof aviation,\n\n  \nthere is no way a bee\nshould be able to fly.\n\n  \nIts wings are too small to get\nits fat little body off the ground.\n\n  \nThe bee, of course, flies anyway\n\n  \nbecause bees don't care\nwhat humans think is impossible.\n\n  \nYellow, black. Yellow, black.\nYellow, black. Yellow, black.\n\n  \nOoh, black and yellow!\nLet's shake it up a little.\n\n  \nBarry! Breakfast is ready!\n\n  \nOoming!\n\n  \nHang on a second.\n\n  \nHello?\n\n  \n- Barry?\n- Adam?\n\n  \n- Oan you believe this is happening?\n- I can't. I'll pick you up.\n\n  \nLooking sharp.\n\n  \nUse the stairs. Your father\npaid good money for those.\n\n  \nSorry. I'm excited.\n\n  \nHere's the graduate.\nWe're very proud of you, son.\n\n  \nA perfect report card, all B's.\n\n  \nVery proud.\n\n  \nMa! I got a thing going here.\n\n  \n- You got lint on your fuzz.\n- Ow! That's me!\n\n  \n- Wave to us! We'll be in row 118,000.\n- Bye!\n\n  \nBarry, I told you,\nstop flying in the house!\n\n  \n- Hey, Adam.\n- Hey, Barry.\n\n  \n- Is that fuzz gel?\n- A little. Special day, graduation.\n\n  \nNever thought I'd make it.\n\n  \nThree days grade school,\nthree days high school.\n\n  \nThose were awkward.\n\n  \nThree days college. I'm glad I took\na day and hitchhiked around the hive.\n\n  \nYou did come back different.\n\n  \n- Hi, Barry.\n- Artie, growing a mustache? Looks good.","date":"2020-07-09T01:20:26Z"}},{"id":"6174268153","type":"user-reviews","attributes":{"userName":"Chip the cookie","isEdited":false,"title":"I’m just shocked.","rating":1,"review":"I am at an ABSOLUTE LOSS FOR WORDS! I know yes, we all collectively ADORE mr dementia himself ! ly donnie<3 but when I opened this app with the mission to sign up and do whatever I can to annihilate this god forsaken app, I was RUDELY met with the utter most disturbing, ghoulish, most gruesomely ugly face I have ever seen in my whole (obviously above 17) years of living!! I’m now terrified to even look at this app, let alone write a review, for that face has given me ptsd. And yes, I have already contacted a therapist about this issue, and yes we are now going to be meeting 3 times a week to discuss my trauma. so what I’m getting at is- I downloaded this FREE app, only for it to come right back and bite me in the brain, because now I need therapy, which IS NOT CHEAP. $100 each appointment...I don’t think I can even express my pure hatred of this app through words donnie. thank you for hearing my voice<3","date":"2020-07-09T00:26:46Z"}},{"id":"6174227369","type":"user-reviews","attributes":{"userName":"alexis ¥","isEdited":false,"title":"Trump’s demon attacked me(emotional) do not recommend 😟","rating":1,"review":"I thought this was an app that’s sells new 2020 trumpets, musical instruments, but it wasn’t and little did I know it would change my life FOREVER . As I opened the app I see a man holding his fist up and then I realized that THE DONALD TRUMP sells trumpets😱BUT WAIT..so I decide to close the app and sign up tomorrow. But as I fell asleep I felt something grab my foot..and then I see Donald trumps spirt or some type of demonic figure aggressively punch me with the same fist in the picture when you first open the app..THEN chokes me until I grasp my Gucci belt with holy water and defeat him. And it was Indeed a demonTrump..I may never recover from this but it was horrible and I almost died. Plz avoid from getting this app I feel as it brings negative demonic energy into your life.😟🥺😫😱or maybe I was just dreaming either way just to be safe don’t get it❤️","date":"2020-07-09T00:12:25Z"}},{"id":"6174170785","type":"user-reviews","attributes":{"userName":"acab😻🔥","isEdited":false,"title":"trump’s rotten piece of rice (a short story)😻🔫","rating":1,"review":"😿it all started one day when mr. donald duck asked his humble wife, penisman to cook him some rice❤️ now you may be confused as to why this story is abt a bowl of rice penisman is making, but this is no normal story, no no, it’s much more then that in fact it may be the most entertaining💯, amazing👍, super cool🙈 story anyone has ever told🙀. while penisman was making her disappointment of a husband’s rice🍚 she noticed a moldy piece👁👁 she simply just threw it away & didn’t give it a second thought🙄. minutes later when she served mr. donald duck the rice she had made he started choking🤓✨,,, she didn’t know what to do, should she call 911? 🤬should she hit him on the back until he spit it out?🧐no. no, she decided to let mr. rotten duck man choke on the moldy rice she had secretly given him😈❤️ he deserved it anyway oh well the worlds better w/ out him😊. END OF STORY😛.","date":"2020-07-08T23:51:22Z"}},{"id":"6174098572","type":"user-reviews","attributes":{"userName":"I want robux NOW","isEdited":false,"title":"Nasty Orange","rating":1,"review":"This app is horrible and let me tell you why... Once i opened the app the Orange with really bad aging lines all over it showed up on my screen!!! I puked from disgust and then i went to ask my mom what it was but before i made it to her there were a bunch of little oranges like the ones on the screen, but they were chasing me!! I honestly do not understand why there were at MY house so, i talked to them and the BIT ME and then they threatened to throw me in the pacific ocean to drown with all the trash there. I stomped on every single one of them and then i had to clean it up before the respawned. but once i did that MORE CAME! so i went to my room and grabbed my lightsaber and started wracking them! once i got them all i needed to go to the E.R because i had all the toxic fumes inside of me. And that is why you should never get this app. Thank you!","date":"2020-07-08T23:24:54Z"}},{"id":"6174056080","type":"user-reviews","attributes":{"userName":"trump=pedo","isEdited":false,"title":"BAD APP DON’T BUY 😡😤🤬","rating":1,"review":"This app is so outrageously bad first of all this app has so many glitches like every time I open it up I see this big orange Cheeto looking at me that is not something people wanna see when they open up an app it is absolutely horrifying and disgusting that, that is there. Second of all my mom got this app to learn more on how to train her dragon but it won’t even show her how to tame first and because of this my mom lost two of her legs and her right arm she is in critical condition and I don’t know if she’ll make 😢 and this is all your fault Cheeto man all you had to do was teach my mom how to train her dragon. Now last but not least this app is just hands down terrible it’s made for big racist stupid people and it’s sad that people actually take their time to download this crap it’s literal trash and I rather have it be deleted NOWWWWWWWW!!!!!!!!","date":"2020-07-08T23:09:26Z"}},{"id":"6173980613","type":"user-reviews","attributes":{"userName":"Mar...Mar","isEdited":false,"title":"Please Do Not Download","rating":1,"review":"Hello all my fellow trump supporters! So i downloaded this app to be up to date with our AMAZING,ORANGE CHEETO president. I want to be able to be on top of my game when arguing with STUPID LEFTIST and GENERATION Z. I proceeded to download the app and sign up for the texts and then it happened... my phone started blowing up with text messages and not even from Trump but from SCAMMERSSS, but i just blocked all of them and continued on with my life as a great american Trump supporter. But a few days later, my phone started typing by itself and my instagram started following and liking all AOC’s posts and unfollowing Donald Trump! Can you believe that?! I thought it would end there with a quick restart on my phone...oh no. I got a phone call the next day and it was from a random number and obviously I answered it, that was when hell started. FOR PART 2 LIKE AND MARK THIS REVIEW AS HELPFUL!!","date":"2020-07-08T22:40:52Z"}}]}