{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=78280","data":[{"id":"6176183240","type":"user-reviews","attributes":{"review":"this app took the longest amount of time to download! it took approximately 69 weeks. 4 days, 22 hours, 56 minutes, and 15 seconds!!!! i times it myself as any rational person would do. after waiting forever i finally managed to open the app. but when i did, my phone started filling up with pop up ads. that was not even the worst part because next thing i knew, it recorded all the data and information in my phone!!!! since the app knew all my information, it proceeded to send a virus (not corona virus) to all of my contacts!!!! the same thing started happening to them and more and more people started receiving the same virus. due to all the ads, viruses, and data recording going on, my phone started overheating. i could see as my phone started expanding, the screen cracking more and more. it was ready to burst! the lithium battery exploded, causing flames to erupt from it. it started spreading throughout my room, engulfing it with flames. i rushed out of my room away from the fire only to realize that the same exact thing had happened to my family. there was fire everywhere, and there was no way to escape except for a window. there was just one problem, it was a 281 foot drop since i lived in a 16 floor house, and we were on the top floor. since we would rather die from falling than fire, one by one we jumped out of the window. i was falling, waiting for the sudden impact of the ground to come... it hit me like a ton of bricks, literally. i fell on a pile of bricks. the next thing i knew, i woke up in the hospital. i slowly got up and realized something was different. i looked down at my legs, horrified at what i saw, my leg was now backwards!!!!! my memory was hazy, but i could remember phones exploding and flames. i had a sudden thought. the virus was still going!!!! that’s when i heard a thundering boom coming from the floor below me. i tried sprinting toward the door to escape, but legs didn’t work like they used to before. i fell on the ground and thought to myself, if i can’t walk, i’ll crawl. i managed to make it onto an elevator with others and we proceeded to go down to the first floor. surprisingly, we managed to make it. i crawled through the exit and made my way out. i let out a sigh of relief, only to remember that my family was probably still in there!!! it was too late... i watched in anguish as more explosions stated to occur in the hospital. the booms finally stopped, but it wasn’t over yet. THE EXPLODING PHONE APOCALYPSE HAD JUST BEGUN!!!!!!!","userName":"angellama27","date":"2020-07-09T11:00:17Z","isEdited":false,"title":"THIS APP IS THE WORST!!!!! 😡","rating":1}},{"id":"6176173339","type":"user-reviews","attributes":{"review":"i’m so tired of sleepy joe biden and the radical left sneaking their way into everything. i just wanted to serve and give respect to my president 🥰 and come to find out this is left wing propaganda! i hate it here 😡","userName":"lilokatumbe","date":"2020-07-09T10:57:17Z","isEdited":false,"title":"this wasn’t it 💗","rating":1}},{"id":"6176173244","type":"user-reviews","attributes":{"review":"honestly hands down the worst app on the appstore like.. u did that💗 NEVER do it again✨💜💞","userName":"RenadAhmed","date":"2020-07-09T10:57:15Z","isEdited":false,"title":"HORRIBLE APP!!","rating":1}},{"id":"6176091349","type":"user-reviews","attributes":{"review":"Did not provide meaningful information","userName":"YAGAGAHAJSHDJANAN","date":"2020-07-09T10:31:41Z","isEdited":false,"title":"HORRIBLE","rating":1}},{"id":"6176017188","type":"user-reviews","attributes":{"review":"Idk what was going thru mans head when he made this garbage","userName":"ksjshdfld","date":"2020-07-09T10:07:51Z","isEdited":false,"title":"Terrible app man","rating":1}},{"id":"6175986009","type":"user-reviews","attributes":{"review":"So starting up the app I looked then closed","userName":"hattchet","date":"2020-07-09T09:57:52Z","isEdited":false,"title":"Trash app","rating":1}},{"id":"6175960970","type":"user-reviews","attributes":{"review":"It filled with fake news and just pure lies no thanks","userName":"keshon A","date":"2020-07-09T09:49:35Z","isEdited":false,"title":"Just why","rating":1}},{"id":"6175937742","type":"user-reviews","attributes":{"review":"This app is disgusting. So gross. How does Apple allow this? My eyes fell out of my face because of how ugly Cheeto man was","userName":"ddy issuez","date":"2020-07-09T09:42:04Z","isEdited":false,"title":"Hurt my eyes","rating":1}},{"id":"6175934135","type":"user-reviews","attributes":{"review":"DONT DOWNLOAD! They will hack you and steal everything you have.","userName":"lolololooolollolloll","date":"2020-07-09T09:40:53Z","isEdited":false,"title":"This app is horrible!","rating":1}},{"id":"6175865312","type":"user-reviews","attributes":{"review":"This app made my phone freak out!!!! Terrible app, doesn’t do anything.","userName":"Hunger Games(:","date":"2020-07-09T09:17:45Z","isEdited":false,"title":"TERRIBLE","rating":1}}]}