{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42030","data":[{"id":"6174779429","type":"user-reviews","attributes":{"userName":"Gabriel's Angel","rating":1,"date":"2020-07-09T03:01:05Z","review":"It wiped everything off my phone, set the phone on fire, gave my computer a horrible virus and is a completely racist bigot. Put this in the trash where it belongs!","title":"This app will destroy your phone","isEdited":false}},{"id":"6174778687","type":"user-reviews","attributes":{"userName":"VeryAngryParent","rating":1,"date":"2020-07-09T03:00:51Z","review":"This app ruined me. It’s terrible. My son accidentally downloaded this. And he saw trumps face and had a heart attack. Poor kid... now I can say trump is the worst person on the planet. My kid couldn’t even stand looking at trumps glistening orange skin.","title":"This app ruined me","isEdited":false}},{"id":"6174775964","type":"user-reviews","attributes":{"userName":"thats a no from me dawg","rating":1,"date":"2020-07-09T02:59:59Z","review":"I had to get a new phone after downloading this app.. I had my credit accounts hacked and have been receiving calls and texts all day long. DO NOT download.","title":"dont donload","isEdited":false}},{"id":"6174774331","type":"user-reviews","attributes":{"userName":"Sofi449373","rating":1,"date":"2020-07-09T02:59:30Z","review":"the lag is so bad and they stole all my card\ninformation. i do not recommend getting this app at all its so FAKE they couldnt have made something worse to put in the app store please dont make the same mistake i made DO NOT DOWNLOAD THE APP !","title":"WORST APP EVER DO NOT DOWNLOAD","isEdited":false}},{"id":"6174771361","type":"user-reviews","attributes":{"userName":"1:2;24)3","rating":1,"date":"2020-07-09T02:58:35Z","review":"I was watering my pool and then this app just walked in I’m like can this not be private then I put my jackuisie in the freezer since it started to feel to hot and I found this apps long lost twin!! THE GARBAGE  next to my pet disonausr","title":"I was watering my pool","isEdited":false}},{"id":"6174743745","type":"user-reviews","attributes":{"userName":"ernestmoe008","rating":1,"date":"2020-07-09T02:50:12Z","review":"So I was using the app and out of know where some dinosour came up to me and was like wanna go for a walk and I said sure. So we where dancing under water since we where walking","title":"Bad App","isEdited":false}},{"id":"6174742594","type":"user-reviews","attributes":{"userName":"Reviewer CF","rating":1,"date":"2020-07-09T02:49:51Z","review":"The second I downloaded the app my cat attacked me and I lost all my limbs! This app is so dangerous please don’t get it! Ugh they should remove it from the App Store! I’m writing this from the hospital this app is a curse!","title":"Don’t get this app!!!","isEdited":false}},{"id":"6174736337","type":"user-reviews","attributes":{"userName":"tiktok ontheclock","rating":1,"date":"2020-07-09T02:47:55Z","review":"THIS APP IS HORRIBLE!!! It convinced the egg I was egg-sitting to commit eggiside. RIP egg. For those reasons I was fired and am now unemployed and living on Mars. It’s a little dry up here and the internet connection is horrible.","title":"You know where all of these reviews came from☺️🧚","isEdited":false}},{"id":"6174735754","type":"user-reviews","attributes":{"userName":"#fdt!!!!","rating":1,"date":"2020-07-09T02:47:43Z","review":"this app is terrible. i was so excited to download it because #trump2020 and it promised that i would meet kanye west! however , i was lied to and i feel betrayed. i can no longer support a president who lies to his people (SHOCKER). BLM!!!!🤩","title":"absolutely not ✨🧚🏻‍♂️","isEdited":false}},{"id":"6174734294","type":"user-reviews","attributes":{"userName":"very very very angryyyyyyy","rating":1,"date":"2020-07-09T02:47:19Z","review":"I had it up to here with the horrid things this app provides and glitches it has it is boring so don’t wast your time honestly why is this even an app?!?!!","title":"Horrible do not get this app","isEdited":false}}]}