{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29990","data":[{"id":"6174983223","type":"user-reviews","attributes":{"rating":1,"userName":"@ unknown:)","isEdited":false,"review":"I went to the store to but some meat for my fish then went to Walmart then went to more stores then to got home went to the tv and watched it and then I downloaded this app right before I was about to feed my fish they were dead right after I got this app. THIS APP IS IS HORRIBLE GET IT OFF THE APP STORE:)","date":"2020-07-09T04:02:17Z","title":"THIS IS A HORRIBLE APP IT KILLED MY PET FISH"}},{"id":"6174963211","type":"user-reviews","attributes":{"rating":1,"userName":"dtcsma","isEdited":false,"review":"I downloaded this app because I want make America great again but the minute I download it, it gave me diarrhea to the point I could get off my toilet then had to rush to ER it was a crazy night. Definitely not worth downloading it. I DO NOT RECOMMEND unless you want to end up in the ER.","date":"2020-07-09T03:55:55Z","title":"VERY DISAPPOINTED😢"}},{"id":"6174945490","type":"user-reviews","attributes":{"rating":1,"userName":"karen Erie","isEdited":false,"review":"THIS APP IS AWFUL, do not get it ! It made my phone worse ever since I have gotten it and overall the worst app I have ever gotten or seen. I can’t even think of a review that can explain the TERRIBLENESS this app is. I hate it and it should definitely leave the apple game store IMMEDIATELY! Thank you","date":"2020-07-09T03:50:24Z","title":"DO NOT GET THIS"}},{"id":"6174939851","type":"user-reviews","attributes":{"rating":1,"userName":"TrUmP Is DuMd","isEdited":false,"review":"You are a great friend to you too and I will be there tomorrow morning and y’all have fun with us eyeing and also if you get this app trump will come to your house and make you delete TikTok and throw your phone out a window then jump out the window and not die","date":"2020-07-09T03:48:39Z","title":"Die trump"}},{"id":"6174935844","type":"user-reviews","attributes":{"rating":1,"userName":"bunny-kitten","isEdited":false,"review":"I opened it up and this and it looked like he was crying it was so so slow and the notifications are allways buzzing and j did not even rally do anything I downloaded this app for info about our state and it is so slow and I had just got it this should not be on the App Store.","date":"2020-07-09T03:47:24Z","title":"THE WORST APP EVER TO EXIST!!"}},{"id":"6174935189","type":"user-reviews","attributes":{"rating":1,"userName":"Essentiuel","isEdited":false,"review":"This app is a wast of space and it is pointless. It takes so such space 🙄😡. When I downloaded the app there was so much spamming and my phone was blowing up and I was really angry 😡. I HATE it when it blows up my phone and I think the app should get deleted.!!!!!?!!!!!!!","date":"2020-07-09T03:47:13Z","title":"Worst app ever!!"}},{"id":"6174923930","type":"user-reviews","attributes":{"rating":1,"userName":"IT US A NO FROM ME","isEdited":false,"review":"I thought this app would change my skin😔 highly disappointing when I figured out that not only did it not change my skin color but I Also didn’t get direct content coming from the boss man..., very poorly executed😌🐮","date":"2020-07-09T03:43:46Z","title":"😾 🍊"}},{"id":"6174918551","type":"user-reviews","attributes":{"rating":1,"userName":"vote for blue no matter who✨✨✨","isEdited":false,"review":"worst app i have ever downloaded, i am very disappointed! it made my phone glitch to the point where it just turned off completely. delete this from the apple store immediately","date":"2020-07-09T03:42:10Z","title":"This app broke my phone"}},{"id":"6174916247","type":"user-reviews","attributes":{"rating":1,"userName":"Jenna_side_","isEdited":false,"review":"I downloaded this app and I’m very disappointed. It’s very slow and things don’t load, it just shouldn’t exist at all! I think what we should do instead of register to vote and kick this Cheeto out of office! I mean this app is so horrible it made me blind! Haiaouvb bfuch bm ioshqn!!1!27","date":"2020-07-09T03:41:28Z","title":"Disappointed"}},{"id":"6174898777","type":"user-reviews","attributes":{"rating":1,"userName":"gary philipy","isEdited":false,"review":"After installing this app my phone started glitching non stop and ended up shutting down I then had to get a new phone because my old one stopped working. All of this happened immediately after I installed and opened the app.","date":"2020-07-09T03:36:16Z","title":"TERRIBLE APP"}}]}