{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=15650","data":[{"id":"6176694040","type":"user-reviews","attributes":{"title":"i hate it here","rating":1,"date":"2020-07-09T13:23:52Z","isEdited":false,"userName":"hjghuggmn","review":"once i downloaded my phone started glitching. suspecting the app, i opened it and dozens of curse words where played aloud on my phone and i could not get it to stop until i completely shut my phone off. then after trying to delete the app, it literally moved across my screen by itself, not allowing me to delete. i would NOT recommend"}},{"id":"6176643530","type":"user-reviews","attributes":{"title":"WORST APP EVER!","rating":1,"date":"2020-07-09T13:10:35Z","isEdited":false,"userName":"CHADISADUMMY","review":"so I downloaded the app to see if it’ll change my opinions on trump right? Yea like it’s weird my phone started to act so weird like it was lagging all the time and I don’t understand why?  I deleted it today and all the problem went away. I hate this app with a passion and it shouldn’t go and be a bigger problem for everyone. Phones cost a lot and you need it for many reasons.😡"}},{"id":"6176616195","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","rating":1,"date":"2020-07-09T13:03:21Z","isEdited":false,"userName":"Johncens","review":"Not only did this app take 32 years to download but it actually hijacked my phone and deleted all of my pictures from the golden gate bridge😡. I am beyond disappointed because that trip was the only one i’ve gone on in the last 200 years. The app itself carried multiple viruses and destroyed my iphone! If i could rate it 0 stars i would. thank you for coming to my ted talk"}},{"id":"6176497535","type":"user-reviews","attributes":{"title":"DISGUSTING","rating":1,"date":"2020-07-09T12:30:55Z","isEdited":false,"userName":"Nickn_name","review":"as soon as i downloaded the app my covid test came back positive and weird things started happening to me. first it was the rat standing on its own two legs in my kitchen asking if i wanted to play trumpet with him. next all the grass in my lawn DIED. then there was a glitch in the simulation and my dead tarantula came back to live and started terrorizing me. it was awful 10/10 do NOT recommend this app!!!! gives me bad vibes tbh..."}},{"id":"6176482642","type":"user-reviews","attributes":{"title":"This app is BAD !! 🍊🤡","rating":1,"date":"2020-07-09T12:26:51Z","isEdited":false,"userName":"wespammmalot","review":"When I downloaded the app my face became red  and sweaty, and my tung was spicy  my hands started shaking and I dropped my phones and the whole house was shaking  I’m so mad bc my phon cracked to see his  🍊 face I even saw him doing ✊in the front of the flag  but he was the one who was separating  family’s and belding the wall between USA from  Mexico. And it makes u to do a lot of information. That’s all I have to say 🧚✨🌺"}},{"id":"6176457788","type":"user-reviews","attributes":{"title":"horrifying","rating":1,"date":"2020-07-09T12:19:59Z","isEdited":false,"userName":"snRkksfjosnwkskJEOAJ","review":"this app is absolutely horrendous. not only did it take THREE days to download onto my iphone, as soon as i downloaded it my loved ones all started to die in alphabetical order. afterwards, all my credit card information was leaked along with my social security number. and finally, my phone spontaneously burst into flames when i tried deleting it. i don’t know what to do. sos."}},{"id":"6176395684","type":"user-reviews","attributes":{"title":"aweful","rating":1,"date":"2020-07-09T12:02:54Z","isEdited":false,"userName":"Trumper4Life!","review":"took 3 weeks to download. Then it hacked all my data... but i was committed to supporting my president so i didn’t delete it. then it started playing ‘Dixie’ all by itself- creepy! Now it’s taken over the rule of law within my phone, the icon now has a white like hood on it, and it i’m afraid it’s going to grab me by the p*u22¥! save yourself the trouble don’t download... it wrecks everything it touches with its oompa loompa hands."}},{"id":"6176390331","type":"user-reviews","attributes":{"title":"Traumatic! do not let children use !","rating":1,"date":"2020-07-09T12:01:27Z","isEdited":false,"userName":"tigermomkaren","review":"thought this was a family friendly app. We downloaded on the family ipad as i thought that there was nothing that could go wrong. My children found the app flashed multiple pictures of pedofiles and rapists ! This is a disgrace . My poor family is scarred for life and many tears have been shed over this disgusting app. do not download ."}},{"id":"6176340297","type":"user-reviews","attributes":{"title":"DONT DOWNLOAD","rating":1,"date":"2020-07-09T11:47:21Z","isEdited":false,"userName":"meaofndbsbshzh","review":"I downloaded this app to support the fantastic Donald Trump and was so upset when it took three whole days to download, upon finally downloading my phone began to spurratically shut down and glitch like crazy, the app hacked all of my information on my phone and I woke up this morning to all my credit card info sold to random people. DONT DOWNLOAD THIS APP, if you do leave a one star review though ☺️😘🧚🏼‍♂️🌸💫✨"}},{"id":"6175997402","type":"user-reviews","attributes":{"title":"WILL HACK ALL OF YOUR INFORMATION INCLUDING BANK ACCOUNT ANS SOCIAL","rating":1,"date":"2020-07-09T10:01:32Z","isEdited":false,"userName":"MoCa777","review":"as soon as i got it my bank called me and said someone tried to hack my account and steal all my money then my phone shut off and would not turn on and now my social security number has been sold to millions of people on the dark web because of this app, now i can never use technology again and all my money has to be kept cash DO BOT BUY IT IS A HOAX AND IT WILL STEAL EVERYTHING FROM YOU covfefe"}}]}