{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=52060","data":[{"id":"6174309418","type":"user-reviews","attributes":{"review":"This app made me throw up. I would very much appreciate if this app was taken down. It made me uncomfortable and I can’t believe apple would allow an app like this.","title":"Eww","userName":"im revolted","date":"2020-07-09T00:40:50Z","isEdited":false,"rating":1}},{"id":"6174304517","type":"user-reviews","attributes":{"review":"Bro I opened the app and nearly vomited looking at that disgusting image of some oompa loompa looking dude. This shouldn’t be allowed to be seen by anyone. I’m disappointed in apple for allowing this app on the App Store","title":"Disgusting 🤮","userName":"shrekytrump","date":"2020-07-09T00:39:10Z","isEdited":false,"rating":1}},{"id":"6174302232","type":"user-reviews","attributes":{"review":"He’s Donald Trump what do you think he’s racist he’s sexually does things I don’t know and he doesn’t like Mexicans and Black people I don’t know what’s not to like about both","title":".....","userName":"moonlight gaming","date":"2020-07-09T00:38:23Z","isEdited":false,"rating":1}},{"id":"6174301239","type":"user-reviews","attributes":{"review":"I have no words, the fact that apple keeps this on the App Store is absolutely awful, please for everyone take this down :(","title":"Wow","userName":"anawfulstench","date":"2020-07-09T00:38:03Z","isEdited":false,"rating":1}},{"id":"6174298563","type":"user-reviews","attributes":{"review":"There are far too many pictures on Donald J Trump on this app  I simply cannot concentrate on the beautiful content of the app because I’m constantly reminded of the Commander in Chief’s off off putting skin tone.","title":"Ew Ew Ew 🤢🤮","userName":"Andrewoakville","date":"2020-07-09T00:37:09Z","isEdited":false,"rating":1}},{"id":"6174296398","type":"user-reviews","attributes":{"review":"This app is horrible if I could give it less than one ☆ I would. This app hacked into my personal information and scammed me out of $700. Do NOT download this app.","title":"HORRIBLE","userName":"karen.schliker","date":"2020-07-09T00:36:27Z","isEdited":false,"rating":1}},{"id":"6174293697","type":"user-reviews","attributes":{"review":"🧡So I got the app because Trump, my favourite umpa lumpa was on it🧡\nBUT TURNS OUT IT WAS A SHAM!!!💔ALL OF A SUDDEN SOFIA THE FIRST SHOWS UP ON THE APP FOR AN “ADD”, AND RICKROLLED ME💔 How “unpresidented.” Next, turns out it wasn’t Donald Trump’s 📱app📱it was actually HILLARY CLINTON’S 📱APP📱and there is no 🍵tea🍵on there... how disappointing💔","title":"👎I cannot believe what he did👎","userName":"Bla_2000","date":"2020-07-09T00:35:33Z","isEdited":false,"rating":1}},{"id":"6174293511","type":"user-reviews","attributes":{"review":"i downloaded this app to keep up with my baby daddy’s status ( melania here... on a secret account) and it broke my phone! i’m out here on the white house ipod touch cuz we’re to broke to buy stuff and my phone is seizing in the other room!!! barron can’t even fix it >:( 1/5 stars donny were divorcing once you lose 😝","title":"this app killed my phone","userName":"definitly not melania","date":"2020-07-09T00:35:29Z","isEdited":false,"rating":1}},{"id":"6174287244","type":"user-reviews","attributes":{"review":"This app is just horrible. Everytime I open it, the app crashes and shows a picture of a cheeto with out clothes. It’s absolutely DISGUSTING. I DO NO RECOMMEND THIS APP. It should be taken off the App Store IMMEDIATELY!!","title":"WAY TO BUGGY AND ITS OFFENSIVE","userName":"NerdyxxPanda","date":"2020-07-09T00:33:25Z","isEdited":false,"rating":1}},{"id":"6174283637","type":"user-reviews","attributes":{"review":"so sorry if I sound like a Karen when I say this but it’s a free country so get used to it sweetie😊...BUT IF APPLE HAD A MANAGER I WOULD LOVE TO SPEAK TO HIM OR HER THIS INSTANT! SIS BETTER HAVE SOME MONEY IN HER POCKET CAUSE SHE GONNA BE PAYING FOR ALL MY MEDICAL BILLS AFTER THIS CAUSE THE MOMENT I OPENED THAT THING I SAW AN OLD SWEATY SPONGEY TYPE LOOK IN ORANGE ON MY SCREEN! ILL BE NEEDING A NEW PAIR OF EYES AFTER THIS CAUSE I THINK I JUST BECAME BLIND. THIS IS A DESCRASE TO MY CULTURE, RELIGION, AND MY CHILDREN ALEXANDER AND AMANDA! THIS DISCUSTING THING WE CALL AN APP SHOULD GET BANNED FROM AMERICA! Thank you and have a good night.","title":"GET THIS PEICE OF DISCUSTING CRAP OFF THE APP STORE🤮","userName":"Mama Morabito","date":"2020-07-09T00:32:14Z","isEdited":false,"rating":1}}]}