{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=139430","data":[{"id":"6179612089","type":"user-reviews","attributes":{"title":"Such a horrible app definitely a let down","isEdited":false,"rating":1,"userName":"straight disappointment","review":"This app had so many promises and said that it would fix my phone’s problems well guess what now my problems are worse and in-fact it almost offer heated my phone and caused it to shut down. I had such high expectations and it has been nothing but disappointment after disappointment. I have never been so unsatisfied with an app even the movement of my finger to download this app was a waste of time and energy. 10/10 would never recommend to anyone EVER.","date":"2020-07-10T05:29:02Z"}},{"id":"6179612094","type":"user-reviews","attributes":{"title":"THIS APP IS HORRIBLE","isEdited":false,"rating":1,"userName":"deela✨🙃","review":"I downloaded this app to learn my shapes but the second I downloaded it, it started glitching my phone out. I opened the app to find my phone frozen with pink and green lines going crazy on my screen. Then I tried to go out of the app but it my phone started vibrating until my phone screen shattered. THIS IS ABSOLUTELY UNACCEPTABLE. I completely shut my phone down and restarted it to have it working slow and lagging a lot. I went back to the app which asked for my credit card info to use it, which I couldn’t get around (there was no remind me later button), then demanded that I share my microphone, camera, photos, contacts, and location. When I pressed the deny button, a black liquid started spilling out of my speakers so I put my phone in rice only to have the “temperature is too hot” icon go crazy on my screen even when I put my phone in the freezer. I took my phone to get the screen fixed which cost me a lot by the way. Whatever back to the app, as I was going through my settings I saw that the app had access to my location, camera, and microphone as well as access and permission to edit my photos and contacts even though I already denied the app access to these things. Turns out the app sent all my contacts adds saying how much I loved the app and that they should download it too. And to the people who didn’t, viruses got sent to their phones and their phones exploded. I had to buy all 500 of them new phones to replace the old ones, I HAD TO SEEL MY HOUSE. I had to delete the app but when I did, it deleted all my photos and contacts. Also when I went back to the to get my phone fixed again by a better and more pricey car mechanic he said that the app has been AND STILL IS watching and listening to me through my phone. After a week of deleting the app my phone exploded so I am now writing this review on a kind stranger’s phone to warn everyone NOT TO GET THE APP. So now I’m homeless, bankrupt, and have no friends or family, I LOST EVERYTHING BECAUSE OF THIS APP, all because I wanted to be educated like everyone else and learn my shapes. THIS SHOULD NOT BE ALLOWED, I’m surprised that Apple is even letting such an abomination be on the App Store. ABSOLUTELY UNACCEPTABLE, GET THIS APP OFF THE APP STORE.","date":"2020-07-10T05:29:02Z"}},{"id":"6179611981","type":"user-reviews","attributes":{"title":"Terrible","isEdited":false,"rating":1,"userName":"whats new ?¿","review":"This app made my phone glitch terribly. it put lines through my phone it wouldn’t let me answer any of my calls, it was even glitching when I texted people but as soon as I deleted the app it went away I tried downloading the app again but it is all started back to my fellow Trump supporters this app is a scam DO NOT I REPEAT DO NOT GET THIS APP","date":"2020-07-10T05:29:00Z"}},{"id":"6179612056","type":"user-reviews","attributes":{"title":"OML DONT DOWN LOAD IT","isEdited":false,"rating":5,"userName":"Huskeylover123456","review":"THIS IS THE WORST APP EVER IT TOOK MY PHOTOS AND MADE THEM LOOK LIK RATS  DONT DOWNLOAD","date":"2020-07-10T05:29:01Z"}},{"id":"6179611950","type":"user-reviews","attributes":{"title":"is mayonnaise an instrument?","isEdited":false,"rating":1,"userName":"my iq is 35","review":"this app doesn’t give any important answers","date":"2020-07-10T05:28:59Z"}},{"id":"6179611911","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","isEdited":false,"rating":1,"userName":"moonshade2007","review":"The app was full of child molesters and rapist 🤢","date":"2020-07-10T05:28:58Z"}},{"id":"6179611389","type":"user-reviews","attributes":{"title":"Poor, not user friendly","isEdited":false,"rating":1,"userName":"Shannieleya","review":"Hypocrite, narcissistic, racist, liar, worst app ever.","date":"2020-07-10T05:28:46Z"}},{"id":"6179611249","type":"user-reviews","attributes":{"title":"Isn’t worth it","isEdited":false,"rating":1,"userName":"daddy 4riel","review":"I only downloaded it to see what it was but it told me to sign up for it so I just let it be then my FBI agent who watches me send me my nudes from my gallery so now I’m risking it telling you guys it isnt worth it :(","date":"2020-07-10T05:28:43Z"}},{"id":"6179611219","type":"user-reviews","attributes":{"title":"gave me a headache.","isEdited":false,"rating":1,"userName":"brianna4499","review":"Sorry I thought it was Joe Biden’s app. My bad.🥳👩‍🦯🥱","date":"2020-07-10T05:28:43Z"}},{"id":"6179610999","type":"user-reviews","attributes":{"title":"Sit right back and you’ll hear a tale","isEdited":false,"rating":1,"userName":"Rifftvc15","review":"The tale of a worthless app. That started from this tropic port within this worthless app. The mate was a mighty Cheeto man, the porn star brave and sure. The country all set sail that day For a three hour term, a three hour term. The weather started getting rough, Impeachment trial was lost, if not for the lies of Misguided crew, the office would be lost, Presidency lost. The app downloads on the shore of this horrible typeface With silliness And Flipper too, A billionaire and his wife, reality star, Epstein didn’t kill himself, This is a horrible app.","date":"2020-07-10T05:28:38Z"}}]}