{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=139710","data":[{"id":"6179582270","type":"user-reviews","attributes":{"title":"Gen Z Gang Strong","review":"We know u cheated on the election bro and people not finna vote for u......\n#Worst President Ever","rating":1,"isEdited":false,"userName":"Kyle2422","date":"2020-07-10T05:18:38Z"}},{"id":"6179582204","type":"user-reviews","attributes":{"title":"don't download this app","review":"I got the app and the app glitch my phone so my phone doesn't work that good now DONT DOWNLOAD THIS APP IT WELL GLITCH YOUR PHONE","rating":1,"isEdited":false,"userName":"♡︎Melissa","date":"2020-07-10T05:18:37Z"}},{"id":"6179581873","type":"user-reviews","attributes":{"title":"Too hard","review":"This app is extremely difficult to use and my miniscule trump supporting brain cant fathom how to function this thing. We must make this app user friendly(suitable for people with IQ of 99 and below) seeing as most of my fellow trump enthusiasts are not quite as quick witted as the users this app was designed for.","rating":1,"isEdited":false,"userName":"tuckerb453","date":"2020-07-10T05:18:30Z"}},{"id":"6179581630","type":"user-reviews","attributes":{"title":"HORRIBLE APP DONT DOWNLOAD","review":"i’m infuriated with the onslaught of injustices since i downloaded this app. every time i click on it my phone freezes for 40 minutes and then turns off and restarts. i’ve been getting dozens of texts, calls and emails saying my personal information has been hacked and that it will be used unless i vote for trump in the upcoming election. i’ve received threats of all sorts and fake biden supporting accounts have begun popping up all over social media using my photos and claiming to be me. this has to be illegal or something!!! this app is absolutely awful and also made my phone overheat to the point of STEAMING. DO NOT DOWNLOAD THIS APP!!","rating":1,"isEdited":false,"userName":"trumphasnorights","date":"2020-07-10T05:18:25Z"}},{"id":"6179581550","type":"user-reviews","attributes":{"title":"Blasphemy","review":"Completely messed up my phone. Been a trump supporter since day 1 but now I see they really are trying to hack us. This is blasphemy.","rating":1,"isEdited":false,"userName":"hahdic","date":"2020-07-10T05:18:24Z"}},{"id":"6179581484","type":"user-reviews","attributes":{"title":"CHEETO MAN CHEATED ON ME AND FAKED DEATH","review":"One horrible afternoon I meant Cheeto man, Cheeto man was the ugliest man on this planet but I still fell in love with him. At the time I thought Cheeto man was single, but Cheeto man was living a double life and had a WIFE!\nCheeto man proceeded to seduce me with all of his fats... I had a type. Then on our honeymoon he threw me to the bed and [censored] just when I was about to catch my breath he [censored]! I STILL WENT FOR ROUND 4!\nI was naive and young but Cheeto man didn’t talk to me after that, I was left with the wedding ring, a honeymoon, and a million dollars but no Chito man... I turned on the news to see Cheeto man running for president! I was so stupid! There he was with his wife and his son AND my heart ❤️!\nI felt betrayed so I used the million to get myself a better life for four years. Only seeing Cheeto man on screen. Then I heard all of these rumors of Cheeto man dead and the flag been turned black and yellow! I couldn’t believe it Cheeto man was dead!\nThen I wasted my time trying to find him, his tombstone anything left of him instead I found out that he was still alive!\nFinally I decided to visit him and getting an explanation of why he left me, Cheeto man never love me so to that I say eat the rich ‼️😜","rating":1,"isEdited":false,"userName":"gynfgn","date":"2020-07-10T05:18:23Z"}},{"id":"6179581434","type":"user-reviews","attributes":{"title":"APP DOESN’T WORK","review":"This app freezes my phone and tried to delete tik tok:(","rating":1,"isEdited":false,"userName":"hahdhansba","date":"2020-07-10T05:18:21Z"}},{"id":"6179581340","type":"user-reviews","attributes":{"title":"The worst thing ever","review":"The worst I hate it","rating":1,"isEdited":false,"userName":"yathatgurlyouhate","date":"2020-07-10T05:18:19Z"}},{"id":"6179580934","type":"user-reviews","attributes":{"title":"don’t download","review":"horrible picture when you first download, if i could rate 0 stars i would. can’t stand the racism that’s on this app. it’s a waste of time, and patience. 🙈❤️","rating":1,"isEdited":false,"userName":"👑🐝QúèéñBéè👑🐝","date":"2020-07-10T05:18:11Z"}},{"id":"6179580946","type":"user-reviews","attributes":{"title":"The worst app on the planet!!!","review":"I downloaded this app and my phone crashed immediately I had to go get my phone fixed.","rating":1,"isEdited":false,"userName":"Aaliyah s dyer","date":"2020-07-10T05:18:11Z"}}]}