{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30200","data":[{"id":"6172949978","type":"user-reviews","attributes":{"userName":"🤰FDT","date":"2020-07-08T16:45:54Z","rating":1,"title":"This App was horrible the layout is confusing","review":"If u think u can delete tiktok for political gain then you have another thing coming. I really don’t understand why u think u can surpass gen z and their efforts to take you down. We will not stand for suppression of expression.","isEdited":false}},{"id":"6172941419","type":"user-reviews","attributes":{"userName":"MrBlueSkyDoesHeroin","date":"2020-07-08T16:43:14Z","rating":1,"title":"Worthless","review":"This app sucked. After downloading, my cat started freaking out. And you know how cats are, they sense demons and stuff. Plus she’s been sitting on my Ouija recently so you know she knows what’s going on. Last night she whispered in my ear “don’t do it, don’t vote trump”. Now if that’s not a sign idk what is.","isEdited":false}},{"id":"6172847805","type":"user-reviews","attributes":{"userName":"JohnK1315","date":"2020-07-08T16:14:25Z","rating":1,"title":"Worst App to Ever Exist","review":"This app is crap. This app needs to be taken down. Trump is an awful Person. This is just a fact. He shouldn’t be supported at all. I and no one i know will ever consider him to be a decent person and we will never think of him as a good leader or even a decent one.","isEdited":false}},{"id":"6172847479","type":"user-reviews","attributes":{"userName":"basic common sense","date":"2020-07-08T16:14:19Z","rating":1,"title":"VOMIT INDUCING","review":"this app is ABSOLUTE trash I downloaded to maybe find a reason to like trump. However I am now more sure then ever I do not want him as president again. Usually don’t go passed two stars for all apps just because but I’d give this zero if I could. I wasted precious time downloading this.","isEdited":false}},{"id":"6172829418","type":"user-reviews","attributes":{"userName":"Trump 2020, but in jail","date":"2020-07-08T16:09:02Z","rating":1,"title":"Trump Should Die Periodt","review":"As soon as I opened the app roaches crawled out of the screen. I tried my hardest not to scream as trump and his men entered my house with their first amendment protected guns. They fed my youngest child to Ivanka and threw the rest of my family in jail. Trump is a horrible person and if I can’t have tik tok you can’t have this.","isEdited":false}},{"id":"6172828026","type":"user-reviews","attributes":{"userName":"jin zee","date":"2020-07-08T16:08:37Z","rating":1,"title":"the worst app ever!!","review":"the app is actually terrible and it’s so hard to navigate!! also it has a bunch of dumb features that it won’t let you use unless you have physical proof youre white... a lot like today’s america 🤔honestly this app needs to be removed ASAP","isEdited":false}},{"id":"6172799659","type":"user-reviews","attributes":{"userName":"I MCullen |","date":"2020-07-08T16:00:30Z","rating":1,"title":"Jermey will be avenged.","review":"Extremely bad app. Delete it, i was walking my pet carrot when all of a sudden the app decided to distract me and i stepped on my pet. Jermey the carrot is no longer with us💔 Everytime i see this app it reminds me of his gruesome death. I will have justice, this was an act of war against all carrots. Surrender now.","isEdited":false}},{"id":"6172784854","type":"user-reviews","attributes":{"userName":"javnl","date":"2020-07-08T15:56:14Z","rating":1,"title":"Cannot believe it","review":"When showing everyone including my goldfish this something tragic has happened. My goldfish has passed away and I blame this app, it should be taken downs immediately if this can happen to other living creatures.","isEdited":false}},{"id":"6172782049","type":"user-reviews","attributes":{"userName":"sxwxuthx","date":"2020-07-08T15:55:27Z","rating":1,"title":"Worst app","review":"First of all the app takes way too much time to download. The content in this app is offensive, discriminatory and just plain trash. Do not download this app. I am greatly disappointed in this content things like this should be removed from the App Store.","isEdited":false}},{"id":"6172732407","type":"user-reviews","attributes":{"userName":"bzbxbf","date":"2020-07-08T15:41:12Z","rating":1,"title":"Donald Duck but make him orange 🍊 ✨","review":"The app is horrible it’s a extremely glitchy which is disappointing considering that Donald paid for this crap I expect better since he’s rich and all anyway it didn’t give me any real info it was just orange face talking so I’m sorry but imma have to say no ❤️","isEdited":false}}]}