{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25250","data":[{"id":"6172330660","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T13:50:15Z","review":"this app bullied me. this app caused my phone to shut down for three days than it blew up. i’m on my new phone writing this review. i’d like to speak to donald’s manager and file a complaint. the next step for trumps team is to write  trump 2020 but on a tomb stone. it’s every fitting for any occasion. i personally believe a cheeto puff is not fit nor will ever be fit to run a country. personally cheetos is the last snack i’d choose. they are less than a snack. most of the time they are stale and moldy. now we don’t want a stale, moldy cheeto telling us how to live. bunker boy for cemetery 2020!!","title":"ftrump","userName":"peaches.38","isEdited":false}},{"id":"6172329653","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T13:49:58Z","review":"I have had TikTok for so long and I’m that time I have learned things and laughed so many hilarious things and by you taking that away what will I have to do then it’s quarantine it’s boring the main I do in the morning is go straight to TikTok and try to learn the crazy dances that these creative people have made up","title":"TikTok","userName":"DaddyF._","isEdited":false}},{"id":"6172329091","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T13:49:49Z","review":"As soon as i downloaded the official Trump 2020 app the was the only thing i used. I began to disregard my own personal health and hygiene just so i could support daddy Trump more. Unfortunately this lead to me smelling god awful because i hadn’t showered in months and my family disowned me. I would give 0 stars if i could","title":"My family hates me","userName":"imsorrypleaseletmecomehome","isEdited":false}},{"id":"6172231583","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T13:22:41Z","review":"Tiktok is not going down billions of people love that app so plz don’t take it away from us and we did not learn a lot of dances for no reason and we’ve worked so hard to get we’re we r now and so many ppl will have no income bc there jobs are to be on tiktok so don’t take it away from all of us plz","title":"Tiktok","userName":"kindly Henson flunk","isEdited":false}},{"id":"6172220665","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T13:19:38Z","review":"Everything about this app is foul. The ambiance is horrific, and the quality is lacking. You would think the amount of money this administration has, they’d be able to put together a somewhat decent application. I’m highly disappointed. Do better.","title":"The worst app I’ve ever used","userName":"Belaa15","isEdited":false}},{"id":"6172173197","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T13:06:35Z","review":"I downloaded this app in an attempt to see reasons to vote for Trump, but it just kept sending me alerts asking for p***y pics. I’m so offended! Who approved this?? It’s so disgusting and degrading! Not only that but it keeps changing my name to Stormy Daniels! Who the hell is that?? It’s not my name! This app must’ve been made by Trump himself because it’s useless!!","title":"Pu**y pics","userName":"Babeziedoll","isEdited":false}},{"id":"6172129288","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T12:54:12Z","review":"i downloaded this app to further educate myself on current politics. the app took hours to download even though i have very good wifi, and then began glitching the moment i opened it. it repeatedly kicked me off the app, shut my phone off, or froze my phone all together. very concerned that my phone now has a virus from this app as my phone’s been acting funny in general since i downloaded this app. would not recommend.\n\nHOLD ON HOLD ON HOLD ON \n\nHER SISTER WAS A WITCH RIGHT?\n\nAND WHAT WAS HER SISTER?\n\nA PRINCESS\n\nTHE WICKED WITCH OF THE EAST BRO\n\nYOURE GONNA LOOK AT ME- \n\nAND YOURE GONNA LOOK AT ME AND TELL ME THAT IM WRONG?\n\nAM I WRONG?\n\nSHE WORE A CROWN\n\nAND SHE CAME DOWN IN A BUBBLE DAWG \n\nGROW UP BRO\n\nGROW UP","title":"DO NOT DOWNLOAD","userName":"slxmjsjsjs","isEdited":false}},{"id":"6172117452","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T12:50:45Z","review":"I downloaded this app bc I wanted to be able to educate my cat about our country’s current “leader” but now my cat has fleas:/ deleted the app right away for fear that I myself may also get fleas... or worse. Too many glitches and notifications. Slow download and drained my battery.","title":"My cat now has fleas","userName":"sfheibcjvf","isEdited":false}},{"id":"6171897217","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T11:45:54Z","review":"the ui is very poor, some of the worst I’ve seen, the news information is not updated correctly and can often be misleading, one might call it fake. I would recommend tiktok as a source of future information, it’s not just people dancing on there","title":"Review for the trump app","userName":"proud trump supporter","isEdited":false}},{"id":"6171889158","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T11:43:22Z","review":"immediately asks for my phone number which if you ask me sounds like it’s trying to get my information. which i don’t understand because my grate racist president said that’s why we’re deleting that clock noise app but he’s doing the same thing as “china” if you ask me.","title":"absolute TRASH","userName":"Dest2012","isEdited":false}}]}