{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=81350","data":[{"id":"6175097351","type":"user-reviews","attributes":{"title":"worst app EVER","isEdited":false,"userName":"nennehsbbajsjjsj","date":"2020-07-09T04:38:20Z","review":"took everything from me, including my pet inch worm","rating":1}},{"id":"6175088914","type":"user-reviews","attributes":{"title":"Horrible","isEdited":false,"userName":"good game stu","date":"2020-07-09T04:35:37Z","review":"My iPhone was hacked and my wallpaper was turned onto vote trump 2020","rating":1}},{"id":"6175076302","type":"user-reviews","attributes":{"title":"Bad app","isEdited":false,"userName":"hdhcjcovi","date":"2020-07-09T04:31:38Z","review":"Do not download it well make ur phone glitch!!!!","rating":1}},{"id":"6175071975","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","isEdited":false,"userName":"raycism","date":"2020-07-09T04:30:16Z","review":"This app literally gave me an STD. This is the worst app ever omg. I can’t believe Apple still keeps on the app store.","rating":1}},{"id":"6175062438","type":"user-reviews","attributes":{"title":"TRASHHHHH","isEdited":false,"userName":"Trumpothin","date":"2020-07-09T04:27:19Z","review":"HORRIBLE APP :( I opened the app only to be greeted by my biggest nightmare. I cried for days and I’m still crying as I wrote this! TAKE THIS APP DOWN ;( SAVE LIVES!","rating":1}},{"id":"6175052711","type":"user-reviews","attributes":{"title":"Bad","isEdited":false,"userName":"dgdhhsbanasn","date":"2020-07-09T04:24:18Z","review":"Horrible person and app","rating":1}},{"id":"6175046773","type":"user-reviews","attributes":{"title":"FAKE NEWS","isEdited":false,"userName":"nah♥️","date":"2020-07-09T04:22:29Z","review":"This app is a waste of time, it’s full of political agendas and run by snowflakes trying to spread FAKE NEWS!!!!!!!","rating":1}},{"id":"6175039858","type":"user-reviews","attributes":{"title":"😗","isEdited":false,"userName":"SHUT UP....YYeeESSSss","date":"2020-07-09T04:20:19Z","review":"When I opened the app my lactose intolerance immediately began to flare up 👎🏽👎🏽","rating":1}},{"id":"6175004135","type":"user-reviews","attributes":{"title":"WORST APP EVER","isEdited":false,"userName":"1525 abc 1234","date":"2020-07-09T04:08:58Z","review":"DO NOT HMGET THIS APP. I honestly wish it didn’t exist it is so horrible and so bad I just cannot describe how bad it is. It is so LOW QUALITY but it tries to run so much my phone actually CRASHED. I couldn’t get it back for 20 MINUTES! I have never heard of this happening to a phone before but this app did it to my phone. And yes, my phone was FULLY CHARGED when this happened. Now I bet you thought this story was over and quite frankly I did too but OH NO, it’s FAR. From over my friends. After I managed to get my phone open again I noticed the app was gone. I thought it must have deleted itself so I decided to try and open one of my other apps when I noticed something poking out of the corner of my other app’s icon. I tried to click on it and when I did this app appeared next to it, the app was playing hide and seek on my home page! I couldn’t believe what I was seeing, I quickly selected the app and deleted it forever, and now I’m here, sitting on my kitchen room toilet writing this review. That’s the end of the story, though I have noticed that there are a lot more cockroaches around than usual...anyway WORST APP EVERE. DO NOT DOWNLOAD. EVER. Also this app will not be a good idea but I gotta was the way I was going on the way home to the fish house I had a good job I had a good day I love you so I’ll talk tomorrow night love ya see y’all soon I’ll see y’all soon I wanna is a way I can see ya next time you get here I’ll be sure y’all can come get me your car is there I’ll probably get there and then I wanna go to the mountain bike I’ll be there and I can do that I would love to you see ya soon and I’ll see ya next week I’ll be there.","rating":1}},{"id":"6174981418","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD","isEdited":false,"userName":"LeedleLeedleLeedleLeee","date":"2020-07-09T04:01:44Z","review":"This app is a joke right? Trump is a president not a ducking rockstar.... stop acting like a cult. Also this app operates like crap too!","rating":1}}]}