{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=129680","data":[{"id":"6175066929","type":"user-reviews","attributes":{"date":"2020-07-09T04:28:42Z","isEdited":false,"title":"POOP😫🥬","review":"THIS APP IS HORRIBLE!!!! AND. I. MEAN. IT. THEY WELCOME YOU BY THREATENING TO SEND SOMEONE TO S.N.A.T.C.H THE WEAVE OUT YOUR HEAD- I AM CURRENTLY CURLED UP IN MY BATHROOM HOLDING ONTO MY WEAVE FOR DEAR LIFE. UNACCEPTABLE!","userName":"madddeeeelineeeee","rating":1}},{"id":"6175066378","type":"user-reviews","attributes":{"date":"2020-07-09T04:28:31Z","isEdited":false,"title":"It’s horrible omg","review":"Donald Trump told me that we need to vote for Biden he dosent like the mean Gen Z wahh wahhh wahhh!!! We need to elect Biden because DoNalD JeNiUs TrUmP wants to live back in his 8292929 mansions that was all made from his dad","userName":"Beetlejuice_lover","rating":1}},{"id":"6175066198","type":"user-reviews","attributes":{"date":"2020-07-09T04:28:28Z","isEdited":false,"title":"STUPID F*CKING DINOSAUR!😹","review":"This is a horrible app, I got my address leaked and a flying monkey came and fought me and ransacked my home. There was also a dinosaur who helped in this crime and I will not rest until these CRIMINALS are out behind bars. I downloaded this to support our amazing cheeto and in return I get attacked and traumatized. This behavior is very much unacceptable.","userName":"shushhhhhhhh","rating":1}},{"id":"6175064315","type":"user-reviews","attributes":{"date":"2020-07-09T04:27:53Z","isEdited":false,"title":"Ew","review":"Literally ass cheeks🤢","userName":"asscrack234","rating":1}},{"id":"6175063466","type":"user-reviews","attributes":{"date":"2020-07-09T04:27:37Z","isEdited":false,"title":"BIGGEST CATFISH OF MY LIFE","review":"So I don't usually like to get political but in this case, i'll make an exception. the way my day started was with me scrolling through instagram. i came across this post where i saw a really, really, REALLY fat cheeto on a insta post and ye it was kinda ugly but it's a cheeto, how bad could it really be? so i did some research on google.com and it turned out that this cheeto was called Donald Shrimp! which i thought was pretty funny i mean they named a cheeto donald SHRIMP not even donald DUCK! anyways i found this app and was like YOOoOoO free shrimp AND cheetos. I mean i thought this would be like Uber Eats+ but nooooooo this...this... MONSTER turned out to be a CATFISH which is like the worst kinda seafood out there it turns out this extra large cheeto puff is actually just a rather large orange man with an unhealthy obsession with walls","userName":"Marez Y.","rating":1}},{"id":"6175063109","type":"user-reviews","attributes":{"date":"2020-07-09T04:27:32Z","isEdited":false,"title":"Truly the worst","review":"I downloaded this app to be informed on our president, however the moment I downloaded the app my phone started to glitch and I heard trumps  voice calling me stupid and ugly... I truly am confused to what happened. It asked for my number and now i get messages telling me I am fat and should go back to my country. I really do not recommend this app, also the layout is not aesthetically pleasing! -173784692748/10","userName":"kelly137","rating":1}},{"id":"6175062854","type":"user-reviews","attributes":{"date":"2020-07-09T04:27:27Z","isEdited":false,"title":"WORST APP(c\" ತ,_ತ)","review":"I got this app to see why I should vote for him buuuuuuuuuuuuttttttttttt it doesn’t.","userName":"OootakuChildd","rating":1}},{"id":"6175061932","type":"user-reviews","attributes":{"date":"2020-07-09T04:27:10Z","isEdited":false,"title":"This app is trash","review":"This app ate my mom and and had intercourse with my cat do not download.","userName":"QueenLenay","rating":1}},{"id":"6175060995","type":"user-reviews","attributes":{"date":"2020-07-09T04:26:52Z","isEdited":false,"title":"ew......just ew","review":"ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew es ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew ew\noh and it’s disgusting and made me go EW","userName":"💕DiAnNa💕","rating":1}},{"id":"6175060386","type":"user-reviews","attributes":{"date":"2020-07-09T04:26:40Z","isEdited":false,"title":"the lowest is what? 0 bars","review":"this app is hot garbage and it stinks like as* 🤢🤢","userName":"wheretheBaRbzZat","rating":1}}]}