{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25180","data":[{"id":"6173472545","type":"user-reviews","attributes":{"review":"I am 51 years old. I have managed to keep my inner Demons push down, squashed, squelched, and under control until this app. This app has brought up my inner demons and now I’m out of control. I warn you, this app may do horrible, terrible, and nasty things to you. Things you don’t even expect.","title":"Scum app summoned my inner demon","userName":"ibeecrazie","rating":1,"date":"2020-07-08T19:36:37Z","isEdited":false}},{"id":"6173472405","type":"user-reviews","attributes":{"review":"as soon as i downloaded the app (which took a total of 16 hours) i was bombarded with pictures of bunker babies photos that all had meme text saying i had hurt the babies feelings and as soon as i got all of the gone a swarm of orange flys with wigs began to start humming “trump is goo goo gaga great” this was very traumatizing and i now i am starting to have the symptoms of becoming a mini trump, my skin it turning orange and my hair is falling out also i can’t get off of twitter and saying everything that comes into my head😤😤😡 -10/10 would not recommend","title":"horrible app","userName":"shawty's melody✨","rating":1,"date":"2020-07-08T19:36:33Z","isEdited":false}},{"id":"6173450788","type":"user-reviews","attributes":{"review":"I came to this app expecting so much more than what I got. It has cheap quality and bad customer service. I purchased 2 hats approximately 2 months ago AND THEY CAME IN TODAY WRINKLED. I reached out to them and they haven’t gotten back to me so that should show what this app really is. \nDownload at your own risk","title":"Such a disappointment :(","userName":"sarahmariewilson","rating":1,"date":"2020-07-08T19:29:11Z","isEdited":false}},{"id":"6173444710","type":"user-reviews","attributes":{"review":"donald trump is my lord and savior but once i downloaded this app my phone would NOT stop glitching and worms started leaking from my phone 10/10 would never get again! i lost vision in my left eye and every time i look at trump he looks like a naked baby painted ORANGE! please help save others from danger and do not download!!!!","title":"DO NOT DOWNLOAD!!!","userName":"Fbbfcbhxhvg gvcvvvvvnnj","rating":1,"date":"2020-07-08T19:27:03Z","isEdited":false}},{"id":"6173440135","type":"user-reviews","attributes":{"review":"This app just ruined my day and wasted my time and space for my I phone a can’t believe people actually like this app, it’s terrible. And do you know what trump is trying to do?! He’s trying to take away our rights as Americans. This will not blow us by. This is only the first stage, this means WAR.","title":"This is the worst app ever","userName":"Cool boy black cop","rating":1,"date":"2020-07-08T19:25:31Z","isEdited":false}},{"id":"6173417236","type":"user-reviews","attributes":{"review":"I expected for this app to be just like our president a big waste and it was it took several weeks for the app to download when I barley got my phone. The so called news were just racist comments and I will forever regret put this horrible app on my phone","title":"Horrible app","userName":"trump 2020 is a waste of time","rating":1,"date":"2020-07-08T19:17:50Z","isEdited":false}},{"id":"6173392873","type":"user-reviews","attributes":{"review":"Took absolutely forever to download! Once it did I got dozens of pop ups and my phone immediately started glitching out. I had to take it to a professional and it took HUNDREDS of dollars to fix. That’s money I could’ve donated to the campaign, but not anymore.","title":"If I could rate zero stars I would","userName":"Ace Of Gleannloch","rating":1,"date":"2020-07-08T19:09:20Z","isEdited":false}},{"id":"6173391686","type":"user-reviews","attributes":{"review":"it literally took 4 hours to download, which is ridiculous! and the app has made my phone crash several times and it’s only shows an orange screen when i try to open it. i would rate this app 0 stars if i could. unbelievable. Somebody else for 2020 please.","title":"worst app EVER","userName":"Dani_00","rating":1,"date":"2020-07-08T19:08:53Z","isEdited":false}},{"id":"6173369185","type":"user-reviews","attributes":{"review":"So I downloaded this app and I guess it’s just horrible. The graphics the everything done done done. You would expect more from the president... actually nvm wow I overestimated him. Anyways my dog is currently talking to me about how bad this app is I wish I could give it less than a one.","title":"No no no crying children","userName":"kitsycatsmeow","rating":1,"date":"2020-07-08T19:00:52Z","isEdited":false}},{"id":"6173354368","type":"user-reviews","attributes":{"review":"This app runs slow on almost every device I tried, extremely bad service anywhere even though all my other apps worked perfectly. Gave it only one star cause there was nothing lower.","title":"Horrible quality","userName":"black people 4 trump","rating":1,"date":"2020-07-08T18:55:46Z","isEdited":false}}]}