{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=5260","data":[{"id":"6177061659","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded this app because I thought Harry styles would appear by my bedside to sing me to sleep. Unfortunately, the opposite happened. Last night, I was just hitting my REM cycle when satan himself walked into my room in the form of an orange man who walked at a 45° angle. Needless to say, I was shocked. He came up to me and spoke in incoherent sentences trying to convince me that he was, in fact, Harry styles. In other words, he was impersonating god (!!!!). Eventually I was able to outrun him, but I had to spend the night in the rug isle of home depot. Overall, I do not recommend this app, unless you want this to happen to you.","title":"👁👄👁","date":"2020-07-09T15:01:21Z","userName":"cowgirl katie 🤠","isEdited":false}},{"id":"6177023206","type":"user-reviews","attributes":{"rating":1,"review":"This app literally works horribly. Whenever I first downloaded it WHICH TOOK A MONTH, I saw what I thought was annoying orange pop up but it turned out to just be Trump. The app hacked into all my other apps and everytime I tried to open another app “Vote Trump the rapist, sexist, homophobic, xenophobic, wanting us to inject bleach to cure corona, racist and most disrespectful president we’ve had yet back into office!!” I think that catchphrase hit right on point! Anyways don’t download it because after I did a white van pulled up in front of my house and I walked outside and down the street and it started following me.","title":"DO NOT DOWNLOAD","date":"2020-07-09T14:50:53Z","userName":"flowerzandheartz","isEdited":false}},{"id":"6176985052","type":"user-reviews","attributes":{"rating":1,"review":"if i could give this a 0 i would! don’t even deserve a 1 that’s too much! very scary app y’all i do not recommend i opened it to see an oompa loompa on my screen i haven’t been able to sleep in 3 days guys. if you like getting scared and like scary things then yeah sure go ahead but i wouldn’t y’all.... VERY SCARY. 😣it took about 4 and a half hours to download way too long! that’s a no for me. i just downloaded it to see what all the hype was abt but was very disappointed. i also think it gave me a virus...? my phone has been acting odd. anyways yeah 1 star if i could go any lower i would. ❤️","title":"TRASH🙄","date":"2020-07-09T14:40:36Z","userName":"briana___2004_","isEdited":false}},{"id":"6176973060","type":"user-reviews","attributes":{"rating":1,"review":"i do not support donald trump at all, or anyone who supports him; as they say, “donald trump is a white supremacist, it you vote for him again, you’re a white supremacist.” knowing of this, i was reluctant to download this app. however, i am one who likes to do research before coming up with conclusions. hence, downloading his app. From what i saw, this app is just a symbol of hate. you can not support this man without supporting racism and hate. how are we letting this be the fate of our country? this has to end. please get rid of this horrid app to show your support for getting this man out of our lives.","title":"An app as worse as the man","date":"2020-07-09T14:37:21Z","userName":"Kaykaytips","isEdited":false}},{"id":"6176946934","type":"user-reviews","attributes":{"rating":1,"review":"First of all, when I opened the app I saw a very shriveled red raisin. Disgusting. My little sister was in the room with me and almost started crying. So these people want to torture all children, young and old, with such a horrific picture? Second, the app crashes constantly before I could even sign up. That is not an app I would want to be on. Third, why would I want to give my personal information to an app the could potentially be scamming me for a vote? He’s a known sex trafficker, as a girl, I’m scared to give my information away to this app. Disappointed and disgusted with what I got out of this app.","title":"Disgusting","date":"2020-07-09T14:30:24Z","userName":"Kayne West for president","isEdited":false}},{"id":"6176745008","type":"user-reviews","attributes":{"rating":1,"review":"for one, the app took soo long to download. i was seriously sitting here waiting for over five minutes. then when attempting to open the app, it would crash every. single. time. after having to COMPLETELY restart my phone to get it open, the app glitched. it was like it was hacking my phone. my screen would swipe on its own, open random apps and then on and off out of NOWHERE. i honestly thought my phone was going to break. i finally deleted the app and all my problems stopped. do not get this app, it’s a hoax to spy on you.","title":"do NOT download this app under any circumstance","date":"2020-07-09T13:37:20Z","userName":"osheena:)","isEdited":false}},{"id":"6176609661","type":"user-reviews","attributes":{"rating":1,"review":"i had such high expectations for this app as a straight, cis, white man who loves america and also chicken but it RUINED my LIFE. DO NOT DOWNLOAD!!!! as soon as it downloaded my phone CRASHED 12 and a half times and when i finally got it to work there was simply a giant button that said RATS. when i clicked the button a swarm of 37,658 rats RAIDED my HOUSE!!!! THEY ATE ALL MY CHEESE!!!!!!!!! then they knawed off my wife’s perfect beautiful round bouncy breasts and KILLED HER RIGHT IN FRONT OF ME!!!!! then they killed me took💀 the doctors managed to bring us both back to life but her boobs are gone forever😩😩 now i have to find a NEW WIFE and NEW CHEESE. DO NOT GET THIS APP IT WILL RUIN YOUR LIFE!!!!!!!","title":"worst app EVER!!!!!‼️‼️","date":"2020-07-09T13:01:34Z","userName":"Hxjsnancjsjaicc","isEdited":false}},{"id":"6176557547","type":"user-reviews","attributes":{"rating":1,"review":"Despite the fact that this application took hour upon hour to download, they believe they can track me with this app. Every so often throughout my day my phone will start beeping very loudly without my permission. only to send me notifications that because I am in a certain area I should start shopping at certain stores. THIS IS NOT ALLOWED! I will not have anyone track my location onlyI am allowed to know my location. This is unconstitutional! I will no longer put up with this applications tactics to enslave me to the US government, NO MORE will I stand for this trickery!","title":"Invasion of privacy","date":"2020-07-09T12:47:24Z","userName":"Kendalltaco","isEdited":false}},{"id":"6176348552","type":"user-reviews","attributes":{"rating":1,"review":"i downloaded this app to see how i could help vote for him, but this app is SO BAD!!! i tried deleting it many times and it wouldn’t!! it also took a week to download??? then i had no more space, and i was about to freak out!! i was so scared i’d broken my phone, but i was determined to see it on, so i asked a couple of my friends to get it too. they got it, and it was even worse!!! i’m very mad 😡😡😡 how could he do this to his supporters?!?!?! my friends and i had to go get new phones, because our phones were glitching beyond use. keep in mind, we all had fairly new and good phones","title":"TERRIBLE","date":"2020-07-09T11:49:45Z","userName":"simplypissed","isEdited":false}},{"id":"6176336191","type":"user-reviews","attributes":{"rating":1,"review":"If I could rate an app zero stars I would this one with zero. I downloaded this app to ✨kEeP aMeRiCa GrEaT✨and hopefully find a way to buy trump merchandise‼️ for all the rallies I need to attend‼️ however, after the 1,460 days it took to download, a mysterious orange ☢️ Cheeto orangutan has sabotaged my phone, causing it to glitch out and have spasms every day! I absolutely cannot handle the way it has broken down my phone after the four years it’s been downloading and it coincidentally coincides with our GrEaT pReSiDeNt’S term and our broken country it must be sacrilegious and I will be deleting it at once!","title":"Worst app ever!!!","date":"2020-07-09T11:46:12Z","userName":"jli946","isEdited":false}}]}