{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=47990","data":[{"id":"6174846175","type":"user-reviews","attributes":{"title":"Worst app ever","userName":"gaghatha","isEdited":false,"date":"2020-07-09T03:20:53Z","rating":1,"review":"This app didn’t change the color of my skin. It didn’t take away my pride, and didn’t stop me from being me. Truly you lost."}},{"id":"6174846075","type":"user-reviews","attributes":{"title":"WORST APP EVER","userName":"livvyy69","isEdited":false,"date":"2020-07-09T03:20:52Z","rating":1,"review":"this app gave me such bad glitches!! my phone is completely broken and it sold all my private information to russia. don’t download this app it will ruin your life."}},{"id":"6174838699","type":"user-reviews","attributes":{"title":"Broken... ?","userName":"marg00002","isEdited":false,"date":"2020-07-09T03:18:40Z","rating":1,"review":"Unfortunately, the app contains support for someone who is racist, a rapist, xenophobic, homophobic, a bigot, misogynistic, and treats those with disabilities like they are less than. Basically anti everyone who isn’t a white, straight male? Disgusting."}},{"id":"6174830302","type":"user-reviews","attributes":{"title":"Dangerous!!!","userName":"uncle.saucey","isEdited":false,"date":"2020-07-09T03:16:12Z","rating":1,"review":"I was scrolling through this app and I kept seeing pedophiles, my child uses this app!!!.  Zombie Epstein won’t stop climbing through my phone screen like the Ring. This app is traaash!!"}},{"id":"6174822767","type":"user-reviews","attributes":{"title":"Bad","userName":"kirnino","isEdited":false,"date":"2020-07-09T03:14:01Z","rating":1,"review":"Absolutely terrible. I heard great things but not so. Reminds me of communist China. Not good. I told my friends and they also didn’t like. Maybe snowflake liberals like this stuff but not stable jeniuses. Disappointed."}},{"id":"6174821523","type":"user-reviews","attributes":{"title":"I Can’t believe this","userName":"7484874","isEdited":false,"date":"2020-07-09T03:13:40Z","rating":1,"review":"This app made my parents get a divorce. They were arguing over it for so long that the split. And now no one want me so I have to live in an orphanage it literally bull"}},{"id":"6174814395","type":"user-reviews","attributes":{"title":"UGH","userName":"claracoconut","isEdited":false,"date":"2020-07-09T03:11:33Z","rating":1,"review":"This app was so difficult to navigate and was super glitchy. I saw an add that said a holographic Trump was going come out of my phone and tell me the news himself??? Where is he????"}},{"id":"6174797399","type":"user-reviews","attributes":{"title":"Horrible","userName":"Nicoletjo","isEdited":false,"date":"2020-07-09T03:06:34Z","rating":1,"review":"This app could not only sense I was a woman, it sensed that I was an ethnic minority and told me to become a Democrat. Which I will gladly become. App glitches. Horrible waste of space on my phone. Hated this."}},{"id":"6174790071","type":"user-reviews","attributes":{"title":"Killed my fish","userName":"gebehebjdnsusbd","isEdited":false,"date":"2020-07-09T03:04:20Z","rating":1,"review":"So I’m not saying this app killed my fish but when I downloaded my fish drowned and I after walking my pool it also drowned so like if u don’t want ur fish or pool to drown don’t download this app"}},{"id":"6174778866","type":"user-reviews","attributes":{"title":"Find my house","userName":"Sk91774338","isEdited":false,"date":"2020-07-09T03:00:54Z","rating":1,"review":"This app is the worst it stole my house, \n So I came back from the store and the house was gone I was about to take it on a walk, Please find my house"}}]}