{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33230","data":[{"id":"6177657630","type":"user-reviews","attributes":{"isEdited":false,"review":"I downloaded this app to see what trump was up to, but ever since it’s been on my phone I’ve had explosive diarrhea. I am a very healthy person and have never in my life had diarrhea until I downloaded this app. What a shame:(","date":"2020-07-09T17:57:19Z","rating":1,"title":"This app gave me diarrhea","userName":"bêanīn"}},{"id":"6177652356","type":"user-reviews","attributes":{"isEdited":false,"review":"Worst app ever!! Causes my phone to crash a bazillion times a day. Miserable content, had to delete it after a few days because my eyes were burning from the overload of stupidity. Would not recommend this app to anyone.","date":"2020-07-09T17:55:36Z","rating":1,"title":"WORST","userName":"rose155"}},{"id":"6177651099","type":"user-reviews","attributes":{"isEdited":false,"review":"0/10. It made me get 7 stds, 2 parasites, malaria, cancer, a tumor, diabetes and i’m on a ventilator. It threw me out the car, drowned me and shot me in the spine all while telling me to go back to my country. Worst app ever, I’m haunting this when I die. The app went Chris Breezy on me. DO NOT GET THIS APP. Worst experience ever.","date":"2020-07-09T17:55:12Z","rating":1,"title":"Absolutely DISGUSTING 🤢","userName":"Rihanna on 2/8/09"}},{"id":"6177634855","type":"user-reviews","attributes":{"isEdited":false,"review":"This was absurd and disappointing!! This app deleted all of pictures, and they were good ones too! Apple this is ridiculous you should consider this as a warning. Make America great again by deleting this.\nThis app has NO meaning whatsoever.","date":"2020-07-09T17:49:59Z","rating":1,"title":"I WANTED TO MAKE AMERICA GREAT AGAIN.","userName":"person that lives and breathes"}},{"id":"6177632684","type":"user-reviews","attributes":{"isEdited":false,"review":"After spending a gargantuas amount of time on this app my spherical organs had a burning sensation. After consulting a physician I was prescribed a pill called trumpisawhitesuprimest it has the side effect of seeing clearly. I now understand the truth and can not go back.","date":"2020-07-09T17:49:18Z","rating":1,"title":"Rude","userName":"✨bunker boy✨"}},{"id":"6177622169","type":"user-reviews","attributes":{"isEdited":false,"review":"So I took days to download. Didn’t work properly. Blocked any and all good changes I tried to make. It kept trying to sell me something. And it’s developed in China. Horrible. I hope they come up with a better app in November.","date":"2020-07-09T17:45:54Z","rating":1,"title":"Do not get!","userName":"Huniand3"}},{"id":"6177616952","type":"user-reviews","attributes":{"isEdited":false,"review":"This app has caused me nothing but problems. I was hoping to show support but I can’t even get past the homepage. The mechanisms of the app were poorly thought out. Don’t waste your time with this app.","date":"2020-07-09T17:44:14Z","rating":1,"title":"Constant glitches, a headache","userName":"Helloisitmeyourlookingfor20783"}},{"id":"6177613497","type":"user-reviews","attributes":{"isEdited":false,"review":"This app is so slow and glitchy, and it also contains lots of content which is not suitable for the human eye. Such as this weird Oompah Loompah looking thing. I almost crapped myself it’s to frightening! This app is not suitable to be on the App Store. It is very inappropriate!","date":"2020-07-09T17:43:07Z","rating":1,"title":"Glitchy and inappropriate","userName":"RobynCageFan"}},{"id":"6177611689","type":"user-reviews","attributes":{"isEdited":false,"review":"This app with the worst! Every time I tried to open it my phone would back out of it. The app itself wouldn’t even work! What a waste of my time, please get rid of this disappointing app.","date":"2020-07-09T17:42:33Z","rating":1,"title":"Horrible","userName":"Legendary_Marie"}},{"id":"6177610873","type":"user-reviews","attributes":{"isEdited":false,"review":"I was so excited to be able to support Donald Duck in the 2020 election by downloading his app. However after opening, I only saw pictures of a racist, homophobic, little bunker boy with skin like a ripe orange. I’m very disappointed.","date":"2020-07-09T17:42:17Z","rating":1,"title":"glitchy and takes forever","userName":"larisha643"}}]}