{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=20320","data":[{"id":"6133625065","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-28T23:07:52Z","userName":"Brooklynn1038472","review":"I downloaded it and as soon as I got it, my phone powered off. I brushed it off and thought it was just my phone being dumb but then when I went into the app it was so slow and glitchy. Definitely recommend not getting this unless you want a slow and laggy phone.","isEdited":false,"title":"What’s up with this app?"}},{"id":"6125110541","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-26T18:42:49Z","userName":"DONNY LOVER❤️","review":"I downloaded this app because i’m absolutely in love with my president Donny J. Trump. I wanted to support his campaign! Turns out it’s run by horrific LIBTARDS!🤬 They are spreading FAKE NEWS and trying to STEAL all of my information! This FAKE NEWS is only contributing to the DESTRUCTION done by the terrorist organization ANTIFA. The RADICAL LEFT wants to see the downfall of Mr. Donny but the TRUMP ARMY will NOT let that happen. The Do-Nothing Democrats DESPISE this country. WE WILL NOT LET THEM KEEP SPREADING THIS HATRED! TRUMP 2020!🇺🇸","isEdited":false,"title":"WORST APP IN THE ENTIRE WORLD🤬"}},{"id":"6089299606","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-18T00:06:26Z","userName":"Love u Joe","review":"Hi I am a real smart person. The second I got on the most hideous and smallest penis in the world president it redirected me to pornhub. I was soooooo traumatized. I saw a Cheeto dust man having sex with Melania. #FreeMelania \nIt then downloaded a virus on my phone. Then Cheeto face showed his PP at my face. If there was a negative 5 ratting that’s what I give. If you want to see Kim jong un stick his dick into trumps mouth come here. If you don’t run for your god dam life.","isEdited":false,"title":"Eww"}},{"id":"6109645487","type":"user-reviews","attributes":{"rating":5,"date":"2020-06-22T20:46:08Z","userName":"finallywifi","review":"So far the app has everything I need. Don’t have to rely on big tech/ MSM for their fake news. Thank you Mr President and your team for blazing yet another trail.","isEdited":false,"title":"Great app"}},{"id":"6077047283","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-15T02:27:03Z","userName":"randomperson09871","review":"If ur here looking for a good president or why ever you would be downloading this trash, don’t, huge waste of time and Donald Duck will steal everything in your house once you give him ur info  and even though you might like being a loyal duck follower I promise it’s not worth it and you will get a virus asking you to download Fox News every 1 second.","isEdited":false,"title":"terrible"}},{"id":"6072024777","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-13T19:39:24Z","userName":"Vnizzle42","review":"After downloading this app I started getting phone calls and web advertisements for donations to support The President. I don’t like that this app stole my information and spies on me. I just wanted to be informed but the app informed on me instead. I hope the president will realize what his campaign office is doing and stop them. Not safe!","isEdited":false,"title":"Steals personal information"}},{"id":"6065837698","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-12T07:01:17Z","userName":"Victoria Paige","review":"I was really looking forward to fair unbalanced information after downloading this app. However after doing so I noticed I started calling my boyfriend a snowflake, and have developed a deep seated support of confederate memorials that I never knew existed until now. I also developed syphilis I think it could be related. Horrible experience.","isEdited":false,"title":"Hopeful turn to horror"}},{"id":"6064823299","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-11T23:50:22Z","userName":"Anonymous2020✨🧚🏾🌈💗","review":"Once I saw how poorly rated this app was I decided to try it myself. Surely Trump’s app couldn’t be that bad, could it??? Wrong. I was deeply disappointed and frankly disgusted in the way this app was made. There were so many glitches throughout and I couldn’t seem to find a way to give this 0 stars. Overall, wouldn’t recommend downloading.","isEdited":false,"title":"Bad App"}},{"id":"6061126887","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-11T02:01:41Z","userName":"MountainMamma.","review":"This app is a scam!! This is NOT ACTUALLY TRUMP’S CAMPAIGN, this is Hillary trying to take advantage of Trump supporters. The app is advertised as Trump 2020 but once you download it, that changes!!! It’s fake news DO NOT DOWNLOAD or the Hillary campaign will have full access to your personal information. STOP NOW BEFORE IT’S TOO LATE!! Don’t let the Democrats get the best of you. If you download many viruses will infect your device!!","isEdited":false,"title":"THIS IS HILLARY CLINTON!"}},{"id":"6057930770","type":"user-reviews","attributes":{"rating":1,"date":"2020-06-10T08:09:40Z","userName":"audrey000000009","review":"This app is horrible and anyone who thinks it’s good… sorry losers and haters, but my IQ is one of the highest— and you all know it! I know everything about apps and this one is terrible, absolutely terrible, the WORST. Please don’t feel so stupid or insecure if you think it’s a good app, it’s not your fault, but it is horrible.","isEdited":false,"title":"I would give it 0 stars if that was an option"}}]}