{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=128170","data":[{"id":"6177142376","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:23:40Z","rating":1,"title":"Glitchy","userName":"shawoo2000","review":"This app promotes treason, racism, anti-science rhetoric, murder, pedophilia, child imprisonment, ignorance, violence, and hatred. It’s also a little glitchy."}},{"id":"6177142308","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:23:39Z","rating":1,"title":"no🥢","userName":"Delilah Clark","review":"i opened the app and saw mr 🍊pee pee"}},{"id":"6177142101","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:23:35Z","rating":1,"title":"This app is trash","userName":"djffdjrjcncjsksjfdjd","review":"This app is crazy. THE moment I opened it my eyes went blind.I saw an UGLY ORANGE THINGOne of the worst app I have ever came across.Is there really any reasons or benefits you can get from it. I mean if you want the world to suffer than yeah I get you and why you have this app.why is this even an app???? Really."}},{"id":"6177140709","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:23:13Z","rating":1,"title":"Horrible app don’t get it","userName":"Tula518","review":"I got this app and while using it, it gave my grandmother a heart attack and then she died. This app is very dangerous and poorly designed. -1738328/10 would not recommend to a friend."}},{"id":"6177140441","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:23:08Z","rating":1,"title":"✨die✨","userName":"Idiekdi","review":"dear trump, i hope you ch0ke on a pp and di3 a slow and painful d3ath. since you’re a little crybaby you will probably de1ete my review, but i don’t care. in fact, it’s just further proof that when you’re rich and famous you can do anything. anyways i could go off but i’m already fight1ng the urge to thr0w my phone down to the ground out of my pure hatr3d for you and everything you do and stand for. wish you a life of pa1n and suff3ring. ✨ toodaloo ✨\n\nps if ur from t1kt0k add me @lila.nabizad or on insta it’s the sane handle"}},{"id":"6177140267","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:23:05Z","rating":1,"title":"woah","userName":"bro skit","review":"this app sucks❤️\nkermit for president"}},{"id":"6177139428","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:22:51Z","rating":1,"title":"i am DISGUSTED","userName":"impeachdonaldtrump","review":"as soon as i opened the app, which took A MONTH to download, i saw a ✨disgusting✨ rotten orange that made me THROW UP! then after a while everything in my room turned into Trump 2020 stuff and then i started turning ORANGE! MY SKIN TURNED ORANGE! anyways after a couple of minutes i heard these voices that told me to do racist and sexist things EVEN THO I AM A HISPANIC WOMEN but i was being MIND CONTROLLED by this app. my brain was mush so i started yelling at my mother and saying ‘GO BACK TO YOUR COUNTRY’ so i got slapped 😖 i expect trump to pay my medical bills because I NEEDED STITCHES. I eventually snapped out of the mind control and deleted the app, which made me go back to normal and now i need extensive therapy for the TRAUMA i went through and it costs $10000 an hour AND I NEED A NEW PHONE because mine is also traumatized and i cant use it. I expect Trump to pay for all of these expenses because he is the reason i have these bills w his possessed app."}},{"id":"6177138585","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:22:37Z","rating":1,"title":"Trash","userName":"dkjdjdnfjjfjhjh","review":"HORRIBLE MY MOM POOP"}},{"id":"6177135137","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:21:40Z","rating":1,"title":"awful","userName":"Croatforses","review":"ftjbddthbvfsssrvhugdf"}},{"id":"6177134976","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T15:21:37Z","rating":1,"title":"11228","userName":"DUMPTRUMP2020🤢","review":"Its not fair that he can take down apps he wants. People enjoy the apps and trump does not like them cause we talk about how bad he is. I hate trump"}}]}