{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=45620","data":[{"id":"6175659114","type":"user-reviews","attributes":{"title":"Worst app ever","userName":"ubvcff","isEdited":false,"rating":1,"date":"2020-07-09T08:07:52Z","review":"Worst app ever it almost deleted all my data but I was able to make it to the phone store in time the app took 3hours to download than asked me to download spyware please rate 1star"}},{"id":"6175653925","type":"user-reviews","attributes":{"title":"The most slowest app ever","userName":"alycat🥺🥺","isEdited":false,"rating":1,"date":"2020-07-09T08:06:01Z","review":"🤢 y’all don’t get this app it is slow and it will put a virus on your phone they just need to delete this slow and terrible app"}},{"id":"6175650845","type":"user-reviews","attributes":{"title":"DON’T EVEN BOTHER","userName":"Yolopity","isEdited":false,"rating":1,"date":"2020-07-09T08:04:57Z","review":"Worst app ever, makes Trump look like a fool, which is so very hard to do. Poorly designed, not representative of the well oiled machine that is the Trump administration, there was Cheeto dust and spray tan everywhere. Terrible app, don’t even bother."}},{"id":"6175641913","type":"user-reviews","attributes":{"title":"worst app!","userName":"hailestorrm","isEdited":false,"rating":1,"date":"2020-07-09T08:01:44Z","review":"my pictures are disappearing?! i can’t believe our POTUS is using this type of technology. should’ve never even downloaded this app."}},{"id":"6175637189","type":"user-reviews","attributes":{"title":"worst app ever","userName":"dont take my tiktok","isEdited":false,"rating":1,"date":"2020-07-09T08:00:02Z","review":"not only did this app take several hours to load it basically took all my data and information and i even got many spam mail and text i find this app completely inappropriate and i think the problem is that the one who's app this is, is a complete moron with no regards to human rights and is a racist homophobic sexist rapist who deserves to rot in hell"}},{"id":"6175625637","type":"user-reviews","attributes":{"title":"Very disappointed.","userName":"2umato","isEdited":false,"rating":1,"date":"2020-07-09T07:55:46Z","review":"I am very disappointed. I expected my white cloak to arrive after downloading this, I mean how else was I supposed to fit in at the next klan meeting?"}},{"id":"6175617051","type":"user-reviews","attributes":{"title":"No good very bad","userName":"trump ate my cat 6969","isEdited":false,"rating":1,"date":"2020-07-09T07:52:37Z","review":"I downloaded this app and the boom my cat started to eat my leg and shoot lasers out of its eyes. And then my house caught \nOn fire and my priceless collection of collectible toe nail clippings was all burnt to a crisp. This a bad app and should not be downloaded."}},{"id":"6175603429","type":"user-reviews","attributes":{"title":"Worst app ever","userName":"smelly020@","isEdited":false,"rating":1,"date":"2020-07-09T07:47:45Z","review":"This app completely broke my phone and I had to get a whole new one it crashed and never worked again"}},{"id":"6175600251","type":"user-reviews","attributes":{"title":"Terrible app 😤😡🤬","userName":"2jtyk","isEdited":false,"rating":1,"date":"2020-07-09T07:46:32Z","review":"One of the worst app ever. I had order like 3 Trump hats and they never came😞. I would not recommend getting this app. It’s also a waste of time and storage.😡I will NEVER NEVER In my life get this app agin....!!😖"}},{"id":"6175577093","type":"user-reviews","attributes":{"title":"💕💖🤡","userName":"madhattermadyson","isEdited":false,"rating":1,"date":"2020-07-09T07:37:57Z","review":"I would literally give a one star took all my personal information and gave it to the dark web and then it took my jar of tonail clippings like come on"}}]}