{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=126810","data":[{"id":"6178095000","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This app is not good service at all!","review":"First of all this app was very glitching and was crashing my phone and I figured out that he was racist to all the lives accept for his.He also is trying to delete tic tok like for what. This actually made me mad because Donald from McDonalds litterlayy does nothing even care about us so why in the world would he make a app. I really don’t understand this. This made me really mad and did not make my day good! 😡","userName":"bunble bee neezy bee","date":"2020-07-09T20:15:12Z"}},{"id":"6178094954","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"gen z no approve 😾","review":"GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST GEN Z DOES NOT APPROVE A ORANGE RACIST RAPIST 😻😻😻","userName":"stop it dud","date":"2020-07-09T20:15:11Z"}},{"id":"6178093267","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Worst thing I’ve ever downloaded","review":"Took four days to even install, wouldn’t open no matter how many times I restarted my phone....deleted it to re-download, and when it FINALLY opened, it kept sending pop up ads to redirect me to “fatjuicyass.com”. I couldn’t even see the app menu screen through all the spammed images of “fat juicy ass”. Very unprofessional. I had been hoping for better access to info on the 2020 campaign, but I guess nobody can vote Trump now since his app is garbage and there is no other reliable way of knowing his policies...","userName":"lil_zard","date":"2020-07-09T20:14:39Z"}},{"id":"6178092766","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"💅🧚‍♀️🦋Donald Duck 2020 🦆 💫🧚🏻🙈","review":"chicken🐔wing🌍chicken🐽wing🙃hotdog🥱baloney🧙‍♂️chicken🐔and🥺macaroni😌chilling😂with👏my✊homie🧶","userName":"Vally Void 🐸","date":"2020-07-09T20:14:30Z"}},{"id":"6178091731","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Trump is a booty butt","review":"Why are you an orange? I DONT UNDERSTAND. Bye bye president...","userName":"Ruqaya Ali","date":"2020-07-09T20:14:10Z"}},{"id":"6178090011","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Gen Z","review":"Yes I’m apart of the Gen Z thing. Trump got butt hurt because we let people know who he truly is over tiktok and now he is trying to remove it🙄. Trump go somewhere else please. Gen Z is going to bring this country together not you.","userName":"#neveragainyousuck","date":"2020-07-09T20:13:35Z"}},{"id":"6178089774","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Worst app ever","review":"This sucks😐✌🏾","userName":"jena carlson","date":"2020-07-09T20:13:30Z"}},{"id":"6178089158","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"A one star rating for a -10000000 star president","review":"This is god awful wow I cant even imagine anyone downloading this horrendous app","userName":"🩸♟","date":"2020-07-09T20:13:17Z"}},{"id":"6178088654","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"#dumptrump2020","review":"trump🍊, being our very angry😡 orange president👨🏽‍🦳, has been very ✨ rude ✨ to our country🇺🇸. i just don’t want things to get worse💥 cuz all he does is make fun of people and it needs to stop🛑 right now. i was hoping that i could open the app to something less negative🧼, but instead i open it to trumps face which is most definitely not what i wanted to see after he tried to poop 💩on me. it’s not very much 𝒶𝒹𝑒𝓆𝓊𝒶𝓉𝑒 of him to do. he also likes to try to “make america great again” he doesnt even like to be called daddy🎃 and i don’t get what the problem is. also his son is probably one of the best things that are alive because he actually isn’t ugly and \n🍊 orange 🍊unlike his father who has forced girls to 69 with him. also new hashtag #dumptrump2020","userName":"shamiraquia","date":"2020-07-09T20:13:06Z"}},{"id":"6178088495","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Horrible app","review":"This is the most disgusting app ever made. When I opened the app it was so laggy and hard to navigate. I could not find anything I needed and it was spreading fake news. Not to mention the disgusting picture I saw as soon as I opened this app. Young kids with moldable minds can download this app. It needs to be removed from the App Store😡. I am scarred from the sight i saw when I opened this app. This app promised to send me $1000000 when I downloaded it I did not receive $1000000. This app is a scam and needs to be removed. Overall this app spreads fake news and is disgusting.","userName":"👁;👁👁👄👁👁👄👁","date":"2020-07-09T20:13:03Z"}}]}