{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=126490","data":[{"id":"6178281697","type":"user-reviews","attributes":{"userName":"icky stinky","date":"2020-07-09T21:20:22Z","isEdited":false,"rating":1,"title":"Poop","review":"Icky"}},{"id":"6178281223","type":"user-reviews","attributes":{"userName":"dr.fucktrump","date":"2020-07-09T21:20:11Z","isEdited":false,"rating":1,"title":"TOLD ME TO KILL MY NEIGHBOR AND SENT ME TO THE HOSPITAL","review":"TERRIBLE! I downloaded the app to see the *amazing* things our *president* is doing, and the app worked fine for a few days. However, on about day 3 I noticed a blinking blue light on my phone, and it only happened when I used the app. A few days later, and the same thing happened on my laptop, and I realized it was Morse code attempting to subliminally message me into pushing my African American neighbor off of a bridge. I was APPALLED, and deleted the app at once, but when I went to get a drink of water  a few minutes later something or SOMEONE grabbed my ankle, and dragged me around the room! The lights started flashing in the same Morse code pattern, and I was WHIPPED into a wall so hard that I broke my neck and ended up the hospital. I have lost my love for *president* trump, and DO NOT DOWNLOAD THIS APP UNLESS YOU WANT TO BE SENT TO THE HOSPITAL AND TOLD TO KILL YOUR NEIGHBOR OF 10 YEARS!! I think whoever made this app had serious brain damage because who thought that sending subliminal messages and sending something to hurt me was a good idea!? -6473929192/10 recommend ✨😬✌️"}},{"id":"6178279260","type":"user-reviews","attributes":{"userName":"loaf 🥖 loaf 🥖 BYYY LOAFFF🥖","date":"2020-07-09T21:19:28Z","isEdited":false,"rating":1,"title":"i would rather pay for spotify premium","review":"hello friends, foes, and toes. it has come to my attention that there has been some MAJOR issues with this app. at least, i know i've definitely encountered some. before i made the choice to download this app, i was informed that it would provide me with unlimited listening access to my FAVORITE song. (a.k.a, loav lauv loaf, by: aidan gallagher). with this knowledge in mind, i of course downloaded the app. however, my expectations were not met in the SLIGHTEST. not only was LOAF not available, but my favorite gabbie hannah song was not available either. i was told that this was going to be an app with QUALITY MUSIC. however, i am greatly disappointed and astronomically confused with the outcome i have been presented with. you have no idea what i've been through. I CANT AFFORD SPOTIFY PREMIUM. I CANT LISTEN TO THESE SONGS ON REPEAT WITHOUT THE UNBEARABLE MONOTONE VOICE OF SPOTIFY TELLING ME, \"wAnT a bReAk fRoM tHe aDdS? tAp nOw tO wAtCh a sHoRt ViDeO tO gEt 30 MinUtes oF aDd fReE LiStEniNg\". when i downloaded this app, i had hope. but now? all i can feel is pain. ALL I CAN FEEL IS THE EMPTINESS INSIDE OF ME LONGING TO LISTEN TO LŒÄF🍞 ŁŒÄF🍞 ŁŒÄF🍞BŶ🍞 ŁŒÄF🍞 ŁŒÄF🍞ŴHÆT🍞ÆBŒÜT🍞 ŁŒÄF. i will no longer be using this app. all i wanted was a safe space to finally listen to music in peace. but, no. what i was presented with was detestable, and disgraceful. it was truly a disappointment to the music community. i don't even know who donald j duck is, but his music is horrible. i don't care about ORANGE DUCK 2020. I CARE ABOUT GABBIE HANNAH AND AIDAN GALLAGHER. once again, i do not recommend this app. i would rather listen to music on youtube, like a loser, than use this app. i think it's safe to say, i will not be attending any orange donald quackity concerts anytime soon. thank you for your time."}},{"id":"6178279187","type":"user-reviews","attributes":{"userName":"AstrallyPlain","date":"2020-07-09T21:19:26Z","isEdited":false,"rating":1,"title":"Okay at best","review":"I got this app to see what Trump is doing for the upcoming election and the app itself is just terrible. Aside from Trump himself, and his insane policies, the app is just bland and boring. You have to sign up with a phone number, email, and zip code just to use the app in the first place. The app itself is designed terribly and is so difficult to even use. It’s not worth the download."}},{"id":"6178279033","type":"user-reviews","attributes":{"userName":"Tina Choche","date":"2020-07-09T21:19:23Z","isEdited":false,"rating":1,"title":"STREAM SAWAYAMA💖💖😏😏😏😏✨✨😍😍🧚‍♀️","review":"More\nHey, I want it all, don't have to choose\nAnd when the heart wants what it wants, what can I do?\nSo I'll take that one, that one, yeah, that one too\nLuxury and opulence, Cartiers and Tesla X's\nCalabasas, I deserve it\nCall me crazy, call me selfish\nI'm the baddest and I'm worth it\nGimme just a little bit more, little bit of excess\nOh, me, oh, my\nI don't wanna hear \"No, no\"\nOnly want a \"Yes, yes\"\nOh, me, oh, my\nGimme just a little bit of (excess, excess)\nOh, me, oh, my\nGimme just a little bit more, little bit of excess\nGimme just a little bit more, little bit of excess\nOh, me, oh, my\nI don't wanna hear \"No, no\"\nOnly want a \"Yes, yes\"\nOh, me, oh, my\nGimme just a little bit of (excess, excess)\nOh, me, oh, my\nGimme just a little bit more, little bit of excess\nFlex\nWhen all that's left is immaterial\nAnd the price we paid is unbelievable\nAnd I'm takin' in as much as I can hold\nHere are the things you'll never know\nMake me less, so, I want more\nBought a zip-code, at the mall\nCall me crazy, call me selfish\nSay I'm neither, would you believe her?\nGimme just a little bit more, little bit of excess\nOh, me, oh, my\nI don't wanna hear \"No, no\"\nOnly want a \"Yes, yes\"\nOh, me, oh, my\nGimme just a little bit of (excess, excess)\nOh, me, oh, my\nGimme just a little bit more, little bit of excess\nOh, me, oh, my\nWhere did it go awry?\nWhen all this time, Heaven was in our eyes\nSo, say goodnight, forget about it 'til the end of time\nYeah, I want more, more, more, more\nMore, more, more, more, more\nGimme just a little bit more, little bit of excess\nOh, me, oh, my\nI don't wanna hear \"No, no\"\nOnly want a \"Yes, yes\"\nOh, me, oh, my\nGimme just a little bit\nOh, me, oh, my\nGimme just a little bit more, I need it now\nGimme just a little bit more, little bit of excess\nOh, me, oh, my\nI don't wanna hear \"No, no\"\nOnly want a \"Yes, yes\"\nOh, me, oh, my\nGimme just a little bit\nOh, me, oh, my\nGimme just a little bit, little bit of\nA little more (excess, excess)\nA little bit more (excess, excess)\nA little bit more (excess, excess)"}},{"id":"6178278860","type":"user-reviews","attributes":{"userName":"Gabrielle Bennett","date":"2020-07-09T21:19:19Z","isEdited":false,"rating":1,"title":"How is he even a rapist?","review":"I saw his shrimp, and my question is, how is he a rapist? How did he even butt rape? The little fella can’t even move past them buttcheeks"}},{"id":"6178278837","type":"user-reviews","attributes":{"userName":"tooty matt","date":"2020-07-09T21:19:18Z","isEdited":false,"rating":1,"title":"Poo","review":"I see poop everywhere"}},{"id":"6178278341","type":"user-reviews","attributes":{"userName":"texasboi2006","date":"2020-07-09T21:19:07Z","isEdited":false,"rating":1,"title":"this app ✨sucks✨","review":"oh i didn't realize oranges could make apps"}},{"id":"6178277964","type":"user-reviews","attributes":{"userName":"Cool Chick3401","date":"2020-07-09T21:18:59Z","isEdited":false,"rating":1,"title":"Terrible app","review":"I was so excited to get this app, but it seems that it is almost as piss poor as trump is! I hate this app and I hate Donald trump🧚🏻‍♀️🧚🏻‍♀️✨✨"}},{"id":"6178276987","type":"user-reviews","attributes":{"userName":"antifa isnt a party","date":"2020-07-09T21:18:40Z","isEdited":false,"rating":1,"title":"app","review":"there honestly couldn’t possibly be a worse app inside of the app store. how on earth could apple allow such a pedo, rapist. homophobe, transphobe, etc. man to have his own app?? disgusting. anyways the app itself is horrible and holds the bumbler b!tch on a platform showing him as a king, where he’s more of a dictator."}}]}