{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28100","data":[{"id":"6173779299","type":"user-reviews","attributes":{"review":"This is THE WORST app ever! I thought iFunny was bad, but this just TRUMPS it! Not only is this a joke, but this shows how terrible this nation has become since 2016. I can’t believe we have a Cheeto puff for a President. 0/10 do not recommend, 10/10 would get rid of political parties.","date":"2020-07-08T21:25:18Z","title":"Make the App Store Great Again","userName":"Ban President Cheeto Puff","isEdited":false,"rating":1}},{"id":"6173776314","type":"user-reviews","attributes":{"review":"I wanted to download this app because TIKTOK recommended it to me! So as a normal kid I downloaded it but it 3 days to download!!! As soon as it FINALLY finished downloading, MY BAG OF CHEETOS STARTED TALKING!!! They were doing UNGODLY THINGS IN FRONT OF ME😭😭this app made my eyes fall!! I hate this app. DO NOT BUY!! This app will give you cancer and make you loose your hands Turing you into a NUB! THIS APP IS CURSED!! DO NOT BUY!!!🧚‍♂️✨","date":"2020-07-08T21:24:12Z","title":"I TURNED INTO MIRANDA COOPER CAUSE OF IT😭","userName":"suckmybootyholetrump","isEdited":false,"rating":1}},{"id":"6173775274","type":"user-reviews","attributes":{"review":"My phone started glitching and my phone crashed. Started it back up and tried deleting the app but it wouldn’t delete. Finally after hours of trying to get rid of it, I got it off and my phone actually congratulated me.","date":"2020-07-08T21:23:48Z","title":"Terrible app","userName":"helppleasethissucks","isEdited":false,"rating":1}},{"id":"6173769830","type":"user-reviews","attributes":{"review":"The app is glitchy and I don’t know why, it has multiple glitches and bugs to the point that I can’t move around the apps I tried checking my WiFi I restarted. I don’t have a bad phone and it never acts up like this have a great day - GZ","date":"2020-07-08T21:21:49Z","title":"I’m sorry but","userName":"StephEstoraYeYe","isEdited":false,"rating":1}},{"id":"6173762804","type":"user-reviews","attributes":{"review":"First of all the app took days to officially download and every time it opens it would call me a fat cow. And one day while I was driving my family to church the app went out of control and shocked to me. I almost died.","date":"2020-07-08T21:19:14Z","title":"This app almost took my life. And the life of my family","userName":"2022Ahmed","isEdited":false,"rating":1}},{"id":"6173751431","type":"user-reviews","attributes":{"review":"For this app to be owned by a millionaire you would think that it would run smoothly, but it doesn’t! It’s like it’s ran by a child! I could make a better app myself! Not only that but it took hours to download! And the glitches were insane.","date":"2020-07-08T21:15:05Z","title":"Horrible","userName":"Johnmulany4president","isEdited":false,"rating":1}},{"id":"6173748676","type":"user-reviews","attributes":{"review":"this app is absolutely TERRIBLE. it took about 7 weeks to download it took up tons of my storage. and as soon as it finally downloaded, the app started glitching it’s self along with my whole phone. 1/5 rating, and i most definitely do NOT recommend.","date":"2020-07-08T21:14:04Z","title":"lol i hate it","userName":"merrick amankwa","isEdited":false,"rating":1}},{"id":"6173743556","type":"user-reviews","attributes":{"review":"This is the worst app ever you can possibly find it needs to get deleted ASAP I do not recommend this app for any of those who is trying to get it DONT almost died just by trying to open it it disgusting me from everything and anything 😗 k DO NOT get the app it’s horrible","date":"2020-07-08T21:12:13Z","title":"Ghetto","userName":"babaymomam","isEdited":false,"rating":1}},{"id":"6173729286","type":"user-reviews","attributes":{"review":"I used the app and hated everything about it. The blackmailing, child trafficking use, bugs, lag, and abusive and hateful planning against a group of people. I would not recommend ANYONE to get this app. By downloading this app you have a possibility to get your information leaked by the government.","date":"2020-07-08T21:06:53Z","title":"HORRIBLE EXPERIENCE!!😡😡😡😡","userName":"Momin J Khan 2000","isEdited":false,"rating":1}},{"id":"6173726093","type":"user-reviews","attributes":{"review":"I absolutely hate this app I support trump but when I got this app it kept on glitching and not working it took FOREVER to download and every time i get on the app it takes me off and says not installed which is so weird because apps don’t do that so this app is the worst !","date":"2020-07-08T21:05:44Z","title":"Worst app ever","userName":"Slinky!!!!9840","isEdited":false,"rating":1}}]}