{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=2360","data":[{"id":"6175593421","type":"user-reviews","attributes":{"date":"2020-07-09T07:44:06Z","review":"if I could give this app a zero I could it literarily ruined my my life first it took a while six months to download then when the app finally finish downloading I tried to open it and it would glitch and close right back out and go back to my home screen at first I thought something was wrong with my phone so I tried to power my phone off to see if it would properly work but when I did it messed my whole whine up it was glitching and everything so I ended up having to go to a place to get my phone fix and it cost me 1,000 dollars to get it fixed this app need to be deleted of the App Store it has done nothing but make me spend a thousand dollars to get my phone fixed this app is horrible DO NOT DOWNLOAD BEWARE OF THIS APP IT IS HORRIBLE THE WORRST APP EVER","title":"MOST REPULSIVE APP EVER 🤮🤮🤮","isEdited":false,"rating":1,"userName":"Anonymousghostleader"}},{"id":"6175117906","type":"user-reviews","attributes":{"date":"2020-07-09T04:45:03Z","review":"I downloaded the app to keep up with the campaign and then right when I opened it all the animals in my house just stared at me then they look at each other ran out the front door to the backyard into the ocean then back inside through the basement doors up the stairs by then I had made it up to the master bedroom I heard them running up the grand staircase to the bedroom so I ran into the bathroom I forgot to lock the door so Chameleon opened it they continued to make there way in I was in the clear shower by then they yelled at me to get out I refused so the armadillo broke the glass they all took me to my car and made me drive them to the closest airport and then the giraffe put me on the next flight to Saturn.  yea so I wouldn’t recommend this app to people with pets but go for it if you want","title":"I AM OUTRAGED","isEdited":false,"rating":1,"userName":"jimgm20"}},{"id":"6175023498","type":"user-reviews","attributes":{"date":"2020-07-09T04:15:07Z","review":"I downloaded this app and as soon as I opened it my phone started lagging. I then started getting a ton of text messages from Trump Administration. After exiting out of it and reopening it my phone screen completely turns black and started glitching out like crazy. I spent $150 to get my phone fixed and get all of my photos and messages rebooted. I have had phone problems ever since, my battery is constantly drained my phone is full of viruses and it has now used my phone number and texted all of my family and friends Messages from me based as trump as if they signed up for it. I’m not even typing this on my phone because it’s completely ruined now my iCloud has been hacked and none of my apps will even open. This app is terrible!","title":"CAUSES VIRUSES!!","isEdited":false,"rating":1,"userName":"C🥀"}},{"id":"6174940805","type":"user-reviews","attributes":{"date":"2020-07-09T03:48:56Z","review":"My phone was fine before this app but after I downloaded it, all of my contacts started to get random texts telling them not only to download this app, but to send all they own to gina. It then caused my phone to morph into a cockroach human morph and take my dogs on walks. The cockroach then cleaned the entire house but somehow everything ended up on the ceiling. I tried deleting the app but the cockroach began following me around and peeing everywhere. The app then downloaded itself onto my computer and my iPad as well as started playing all of Donald trumps speeches while the cockroach peed in my corner. Because of this app, my phone is now a cockroach who stares at me from the corner of my room. The app developers might want to fix this bug in the app. Horrible!","title":"Stole all my information","isEdited":false,"rating":1,"userName":"Bobinna 🙊"}},{"id":"6174874774","type":"user-reviews","attributes":{"date":"2020-07-09T03:29:17Z","review":"First of all I wanna start by saying that this app is terrible it took 3 weeks to download idk how that's possible, as I was finally opening the app it made my phone glitch then an orange face with corn hair popped up in the screen I got super scared and also my dog got scared he ran away. This app made my phone break it has cost me a lot of money this app is trying to terrorize people. I almost forgot it also has ads with horrible music playing racial slurs that's unacceptable. Before my phone broke because of this app the app would always last 3 seconds opened then it closed and when I opened it again an orange face with a double chin popped up and winked at me that orange face was always eating McDonald's with Karen and Karen looked at me with a ugly face","title":"Made my dog get scared and ran away bc of this app","isEdited":false,"rating":1,"userName":"AntiKarenAntiTrump"}},{"id":"6174852353","type":"user-reviews","attributes":{"date":"2020-07-09T03:22:42Z","review":"How unbelievable. When I downloaded this app, I expected nothing less than my racist, homophobic, xenophobic, and bigotry personality traits to be treated with respect. After I downloaded this, however, I was recommended other apps that show me facts backed by professionals in their field of expertise that disprove my beliefs, and some that even denounce the idea that Trump is anything but the perfect embodiment of what a democratic presidency should be. All He (yes with a capital H) should have to see is perfect submission from those who call themselves Americans. How is my great, holy, and perfect president supposed to lead us with other people telling me this app only gratified my negative and degrading behaviors? I’m in disbelief. One day, I pray, that this will be the only app available to the great people of this amazing and perfect nation.","title":"Unbelievable","isEdited":false,"rating":1,"userName":"cowgirl lover"}},{"id":"6174826465","type":"user-reviews","attributes":{"date":"2020-07-09T03:15:06Z","review":"My rhino left for the store to go pick him out for a little bit of the time I will let go of it all over again I just don’t know how much it will get him back in time for y’all lol lol I’m sorry but I’m not going back and I wanna watch is it gonna was the night and I wanna do ya think ya know what I mean for ya sure lol lol omg was a great time for ya to go be back at wuwiquwuqqowu this is a horrible app for ya ya know ya girl lol ya ya girl lol omg omg is a time of time for y’all lol omg was my time for ya girl in the world and then I’m in tueiruworuwir this world to hell I love y’all and I can’t get enough people for ya girl ya know wieuwyeoeyw ya know what you mean lol lol omg was a great night and I love y’all sleeping and I wanna watch it was a good day for y’all to be a great person to me omg is a great night for ya girl and Kayden and ya ya girl and ya ya boy ya ya know lol lol omg was a omg","title":"WORST APP TO EVER EXIST","isEdited":false,"rating":1,"userName":"Dhotfvbhfscbjfd256799731"}},{"id":"6174822792","type":"user-reviews","attributes":{"date":"2020-07-09T03:14:02Z","review":"This app took weeks to download and it started playing this awful music and me and my family’s ears starting bleeding and we had to take my mother and grandmother to the hospital and grandmother died because of your terrible music this app should be deleted! Then Trump broke in and stole my grandma’s corpse!!! Then I passed out because the blood was rushing out of my nose and ears! Then I woke up to be laying down in the star of Saten with candles around me. Then Shrek and Thanos were singing Sophia the First while trump watches and starts giving me a foot massage then he took off his pants and all I saw was 🍤 and started rubbing it on my foot and I was tied up so I obviously couldn’t escape then Barron Trump freed me and we were running and the secret service got him... he sacrificed him self for me DELETE THIS APP!","title":"TERRIBLE APP IT RUINED MY LIFE","isEdited":false,"rating":1,"userName":"Marisa Hanson"}},{"id":"6174780928","type":"user-reviews","attributes":{"date":"2020-07-09T03:01:32Z","review":"So I had gotten this app 2 days ago after I saw an add for it and weird stuff had started to happen the first day it wasn’t that bad my toaster broke and my light bulbs 💡 started flickering and I didn’t think much of it. but then just today my hedgehog 🦔 had crawled on my phone while I had the app open and exploded and I am traumatized my hedgehog 🦔 fluffers remains were all over my phone 📱 and then on top of it all I got a phone call from my mom and had to answer it before I could clear the remains of fluffers 🦔 and she said my grandma had died. I don’t normally believe in curses but I swear this app has a curse and beg 🙏 u not to get it I would not want anyone else to endure the trauma I have suffered after downloading this app. Rest In Peace fluffers 🦔😢","title":"This app killed my hedgehog 🦔 fluffers 😭","isEdited":false,"rating":1,"userName":"fluffers owner"}},{"id":"6174535923","type":"user-reviews","attributes":{"date":"2020-07-09T01:49:49Z","review":"what. a. heep. of. garbage. Let me tell you, this app makes the corona virus look like a blessing. His mother should have thrown him away and kept the stork. The first thing that popped up was just a photo of a Cheeto. You know, I thought, that’s fine, nothing weird about that! THEN the Cheeto started talking. It told me it’s name was “Wyatt S. Premicy”. No red flags there, but just you wait. THE CHEETO STARTS TO STRIP OFF ITS CLOTHING, AND STARTS TO TWERK. WHAT IS HAPPENING. Then, fortunately, the app glitched out, and I couldn’t get back in; giving me no option but to delete it. Then a man showed up at my door and shoved me in his trunk, and he told me he worked for the president. He took me to the White House, and that’s when it all fell into place. The man running our country isn’t a man at all. It’s just a Cheeto in a man costume. I wish I was joking. DO NOT DOWNLOAD 😭🧡","title":"oh my god","isEdited":false,"rating":1,"userName":"mintjello"}}]}