{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30630","data":[{"id":"6173890410","type":"user-reviews","attributes":{"title":"THE APP SUCKED 🤢🤢🤢🤢","userName":"bagofcheetos","rating":1,"review":"As soon as I opened the app I saw a orange in a suit it really disturbed me and I didn’t like it not a bit 🤮🤮 it felt like I was an app that brand you to hell !!!! And another bad thing about this horrible app is that it had a big FATT orange on the screen and all I’m gonna say is don’t download this absolute SHATT 💩💩 🤡🤡🤡","isEdited":false,"date":"2020-07-08T22:07:26Z"}},{"id":"6173889926","type":"user-reviews","attributes":{"title":"this app makes me wish i didn’t have a phone","userName":"Everleigh1010","rating":1,"review":"the UI on this app is just HORRIFIC. i couldn’t navigate through anything!!! i came face to face with all these ugly pictures of an orange man i just couldn’t take it anymore!! i wish i didn’t download this 😳😳","isEdited":false,"date":"2020-07-08T22:07:15Z"}},{"id":"6173888684","type":"user-reviews","attributes":{"title":"THIS APP IS THE WORST","userName":"Bperson1970","rating":1,"review":"This app made my phone glitch so much. And I had to see a hot Cheeto and I almost threw up. I have a big phobia of hot orange Cheetos so to see that without a trigger warning before entering this app is unacceptable!!!! This app is just the absolute worse and hopefully some things get fixed in this App Store.","isEdited":false,"date":"2020-07-08T22:06:47Z"}},{"id":"6173874687","type":"user-reviews","attributes":{"title":"Unreliable","userName":"Judy93748392748393","rating":1,"review":"This app is full of bugs and problems. I come here for the latest in Trump news, and am finding it constantly crashes. Very disappointed in my president. Maybe this isn’t his official app. MAYBE ITS THE EVIL DEMOCRAT TRICK. It keeps saying the nickname is taken and won’t let me write a review.","isEdited":false,"date":"2020-07-08T22:01:43Z"}},{"id":"6173873836","type":"user-reviews","attributes":{"title":"Waste of storage","userName":"blmblmblm...","rating":1,"review":"This app is terribly unorganized and cluttered. I can barely understand how to work it. It also uses way too much data, and gets really glitchy. Overall, hated the app and do not recommend getting it. It is a waste of storage.","isEdited":false,"date":"2020-07-08T22:01:24Z"}},{"id":"6173865565","type":"user-reviews","attributes":{"title":"This app glitches too much 😡😡😡","userName":"supersupersmartperson","rating":1,"review":"As you can tell from the amount of angry emojis I put in maddd 😡. I’m not sure if it’s just my WiFi but for some reason the app glitches and there’s a guy with a bad spray tan that just shows up on my screen. Please..fix..this..issue.","isEdited":false,"date":"2020-07-08T21:58:19Z"}},{"id":"6173858093","type":"user-reviews","attributes":{"title":"WORST APP EVER🤬","userName":"ftbhiarsoabtcs","rating":1,"review":"First when I downloaded the app it took HOURS to download and I have good WiFi one I opened the app it started to glitch so I deleted the app once I did it birds started attacking me and picked me up and put me into my trampoline all just because I didn’t want the app anymore shame ON YOU","isEdited":false,"date":"2020-07-08T21:55:31Z"}},{"id":"6173843928","type":"user-reviews","attributes":{"title":"App is dangerous","userName":"esternoclaidomastoideo","rating":1,"review":"After I downloaded this some guys tried to kidnap me they said that I should never have downloaded the app because that’s were they tricked everything and got all my information so do not download for your safety","isEdited":false,"date":"2020-07-08T21:50:08Z"}},{"id":"6173799534","type":"user-reviews","attributes":{"title":"Too Draining","userName":"Hihihihihi .. Idk don't sue me","rating":1,"review":"I love America, I really do, but this app is horrible. It drained my battery!!! I’m very active online so I can not be dealing with those sort of things. 10/10 would not download ever again. It makes the time that I spend advocation for my fellow peers longer. Boo!","isEdited":false,"date":"2020-07-08T21:32:54Z"}},{"id":"6173790170","type":"user-reviews","attributes":{"title":"Really buggy","userName":"DumDum 😜","rating":1,"review":"I have an iPhone 8 and the app runs horribly. It has a tendency to freeze every time I click an article. They also send really annoying messages?? Not to mention, the news feed is pure propaganda. Gross app. Ruined my day.","isEdited":false,"date":"2020-07-08T21:29:24Z"}}]}