{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=3080","data":[{"id":"6173715538","type":"user-reviews","attributes":{"userName":"Brenda Sheild","isEdited":false,"date":"2020-07-08T21:01:52Z","review":"This app is absolutely terrible. It doesn’t give me the information I want and it has way too many bugs that must be fixed. Every update claims it has fixed errors and bugs in the app, however, it does not. This app makes my phone glitch and stop working all the time. I’ve had it for about 6 months and I’ve had to restart my phone because of the freezing screens and bugs that come from this app too many times I’ve lost count. This app is a disgrace and I don’t understand why Trump has his own app in the first place. There is no need for it I could look up everything that is in this app on the web and find better answers than in this app. DISGUISTING.","rating":1,"title":"Absolutely terrible"}},{"id":"6173683686","type":"user-reviews","attributes":{"userName":"a_tomato8","isEdited":false,"date":"2020-07-08T20:50:17Z","review":"So I downloaded this app because I’m a liberal and all my friends are trump supporters. I don’t want to lose my friends so I got this app in the hope that it would make me like trump. the app downloaded, and I’m just sitting there. It’s telling me all this news about how trump is the best, but suddenly a bullet pierced my screen. I closed the app and it was still there. I had to turn off and on my phone again to fix it. Then when I went back on, 18 more bullet holes pierced my screen. Every time there were more. My friends don’t have this happen to them. It won’t let me read anything because of the bullet holes. I came to the conclusion that this is a racist app. I don’t recommend if you aren’t a straight, cis, white male.","rating":1,"title":"Racist"}},{"id":"6173670430","type":"user-reviews","attributes":{"userName":"queef queef doo doo phart","isEdited":false,"date":"2020-07-08T20:45:27Z","review":"this app took weeks to download. it ask when i made an account my phone glitched out so bad that i have to buy another phone and do re download them app. this happened three times so i have 5 phones now. a friend of mine downloaded the app and spread false information such as the end of the world which was supposed to be on January 23. the app also said that she would be tracked for the rest of her life. after an hour of having the app on her phone EVERY PICTURE ON HER CAMERA ROLL WAS A PICTURE OF TRUMP. even her app faces were trump. her wall paper was trump. the app did this completely on its own. and GURL i don’t think anyone wants that face every time u open ur phone. 🎃👹🤡 TRUMP 2020✨🥰❤️but on a grave stone 🤡\n\nlove, \n\nALL of gen z ❤️✨💅🏼🙈🥰😍","rating":1,"title":"ABSOLUTELY HORRIBLE"}},{"id":"6173660359","type":"user-reviews","attributes":{"userName":"kamya queen","isEdited":false,"date":"2020-07-08T20:41:55Z","review":"Soon as I open the app the app made my phone glitch and freeze which never happens on my phone everything is great on my phone and this I’m just completely ruined my phone and I had to go get it fixed at a shop and they said to never download this app again and I will never download this app again because it doesn’t make sense that this makes my phone glitched so horribly bad that I had to go to the shop to get it looked at because the freeze was so bad it doesn’t make any sense this app is the worse app I ever had This app should never be allowed they need to take it down it makes people phone glitches and freeze so I highly recommend to NOT NOT NOT NOT  get this app ever","rating":1,"title":"App is horrible"}},{"id":"6173647718","type":"user-reviews","attributes":{"userName":"wpwojwhshhshdhsosp","isEdited":false,"date":"2020-07-08T20:37:26Z","review":"Since trump is a “great” president i decided to download the app to see what the fuss was all about. But ever since I’ve downloaded the app, my phone has started to glitch or just completely shut down. When i open the app, my phone immediately exits out of the trump app and opens my other apps without me having to touch anything. There might be something wrong with this app and i highly recommend Apple to take down this app and try to improve it or maybe just get rid of it period. I was scrolling through the other reviews for this app and they’re also just horrible. Please understand that I’m simply just trying to help other people and prevent them from getting hacked as well.","rating":1,"title":"glitching"}},{"id":"6173548661","type":"user-reviews","attributes":{"userName":"bootylicked","isEdited":false,"date":"2020-07-08T20:02:42Z","review":"WORST EVER right when I downloaded the app my phone turned off FOR 9 MONTHS, after those 9 months of waiting I was on the app, I was just on this app and SOME BUG 🐜 CRAWLED OUT OF MY PHONE. I threw my phone across the street in fear, when I went to pick it up IT STARTED BLASTING MY LITTLE PONY THEME SONG WHILE STILL ON THE APP. WE CALLED THE POLICE DEPARTMENT AND THEY SAID “ we can’t help you right now because we are killing black people lol” and they WERE WEARING SKIRTS. I am a white privileged person and I am mortified. AFTER SLL OF THIS NONSENSE I TRIED LOOKING FOR A DELETE BUTTON and when I clicked it MY DOG STARTED THROWING UP TRUMP FLAGS. AND MY WHOLE NEIGHBORHOOD BURNED INTO FLAMES, it’s been 3 months and nothing has hap- OMG ITS A WOLF IN MY ROOM AHHH HELP ME HELP MEEEEEEEEEEEEEEEE- well something just happened I’m in a hospital bed right now because of that wolf the app warned me but I didn’t listen.","rating":1,"title":"No✨"}},{"id":"6173074892","type":"user-reviews","attributes":{"userName":"hdrzrktx","isEdited":false,"date":"2020-07-08T17:24:40Z","review":"I originally downloaded this app to support our current president, Donald Trump but that soon changed. I saw comments from other people saying that trump was racist and sexualized women so of course I searched it up. It ended up being proved true on multiple occasions. I am extremely disappointed in our president we currently have and the things he’s done. I pray that he doesn’t win the next election and ends up paying for what he’s done. I would not recommend this app because it is biased and uninformative. It leaves out any possible cons and just focuses on the “good” things he’s done. I’m a proud republican but I will vote for Biden in the next election without hesitation. Please don’t believe what everyone says on this app.","rating":1,"title":"Very disappointed"}},{"id":"6173022118","type":"user-reviews","attributes":{"userName":"F- trump","isEdited":false,"date":"2020-07-08T17:08:01Z","review":"I HATE THIS APP, ITS COMPLETE GARBAGE. I was trying to find things that can help me think the president is a “good” guy, BUT the only thing I found was that he was a hypocrite, rapist, rude, idiot, racist, human being. HES LITERALLY JUST LIKE HITLER!!!! WAKE UP PEOPLE!! Whoever does want trump to win their just like trump but with no power. Seriously, hating on black people and Mexicans, for what for not being American, AND I’m going to remind all Americans THAT MOST LAND YOUR ON WAS MEXICO’S. You guys stole the land. The education in America is terrible as well. The president hasn’t even done anything to help the coronavirus problem, he just wants to help with his own problems, and leave. Well that’s all (I can write WAY more but yk I’m tired) BLACK, HISPANIC, TIKTOK LIVES MATTER! REMEMBER THAT!! (But most importantly black and Hispanic)","rating":1,"title":"HISPANIC LIVES MATTER AND TIKTOK LIVES MATTER"}},{"id":"6172875904","type":"user-reviews","attributes":{"userName":"lickmycooter","isEdited":false,"date":"2020-07-08T16:22:56Z","review":"I decide to try out this amazing app that tiktok showed me 🥰 but I was completely disappointed in the function of the app I was called fat and ugly and I still decided to give to donations but they hacked my credit card and pulled up all my criminal charges 🤚🏽😔 they took up to 2,000 DOLLARS and made me reflect on my past 😭 I am a changed person now and no longer kidnap children and lock them in my basement and give them grapes nor go nude to the police station (even thought I’m sure they liked the view ) this is a bad app and will no longer be using anymore .will not be sharing this family and friends even thought they are locked in my basement since I don’t do kids anymore 😌","rating":1,"title":"Very disappointed 😔"}},{"id":"6172825907","type":"user-reviews","attributes":{"userName":"a girl who loves tiktok","isEdited":false,"date":"2020-07-08T16:08:00Z","review":"When I first opened the app it turned of my phone! Then I saw a green screen so I had to restart my phone. Then I tried deleting the app but it kept downloading its self back. So i was just going to leave the app alone then it got my Email some how and started signing me up for things I didn’t sign up for. I had to completely reset my phone and lost all my pictures. I tried to do a back up but the app would let me open other apps till I signed up. Do not download! It WILL GET YOU PRIVATE INFORMATION! and you will lose all you pictures. My friend said he signed up with google and the government is using all you google saved passwords to look through your stuff to spy on you! DONT DOWNLOAD","rating":1,"title":"Worst app ever! Should get deleted"}}]}