{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=127570","data":[{"id":"6177567886","type":"user-reviews","attributes":{"review":"The moment I opened this app I was immediately disgusted. I saw a Cheeto orange looking guy. He could’ve been my sleep paralysis demon but that’s besides the point. He looked like this one guy I saw on a meme once. I’m trying to remember...oh yeah it was a meme of Nicki Minaj and she was yelling “STUPID F*CKING DINOSAUR GET THE F*CK OUTTA HERE”.\n\n he was the dinosaur. \n\nI also noticed him holding his fist up. It reminded me of the time Logan Paul said “✊🏻✊✊🏼✊🏽✊🏾✊🏿” and I was like “who has a yellow skin tone?” Really he was just looking out for trump. Glad to see he supports the BLM movement.\n\n*me silently hoping that will trigger him\n\nI’m boreddddd anyway\n\nHe wants to take tik tok? welp. We’re going to take whatever this stupid app is for.","userName":"GEN Z🧚🏻‍♂️✨","isEdited":false,"date":"2020-07-09T17:28:30Z","title":"Stupid dinosaur","rating":1}},{"id":"6177567317","type":"user-reviews","attributes":{"review":"I’m not part of the “Gen Z” thing that is going on. I genuinely got the app to get to know what the future holds for America but I couldn’t get passed the first screen. I tried and tried and tried to put my phone number in to simply get the verification code but it keeps rejecting me. Like it wouldn’t even accept my phone number even after I refreshed the screen. So I tried turning my phone on and off, kind of like resetting it, but it still didn’t work. At this point I was close to giving but I persisted. I eventually came to the conclusion that it was just my phone so I bought a new cell phone and downloaded the app again but the same error occurred. I then scrolled through all reviews for this app to see if anyone else was having the same problem or had any tips. After reading all the 100k+ 1 star reviews, I finally found a review saying their WiFi was the problem (wireless internet for any boomers out there that doesn’t know what that means). I originally was going to buy a new internet booster but I didn’t want to risk it not working so instead I flew out to the closest Trump Hotel to connect my phone to their network. After all that effort, I tried loading the app one last time, then during the loading screen it told me to “go back to my country.”","userName":"ShaneLubs","isEdited":false,"date":"2020-07-09T17:28:19Z","title":"Where did I go wrong?","rating":1}},{"id":"6177566342","type":"user-reviews","attributes":{"review":"r-r-r-roll💿up⬆️to2️⃣the🤩party🥳with🧶my🧚crazy🤪pink💝wig💇🏼‍♀️but✋i👁can’t😭get😸trough😔the✨door🚪because🤷‍♀️my🤟booty’s🥵too❤️big🙄","userName":"neverevernonono","isEdited":false,"date":"2020-07-09T17:27:59Z","title":"no❤️","rating":1}},{"id":"6177565419","type":"user-reviews","attributes":{"review":"This app made me wanna poop on my dog that was pooping on my cat that was pooping on the mouse that was pooping on the ant 😵🤢","userName":"Itsig","isEdited":false,"date":"2020-07-09T17:27:41Z","title":"W O W","rating":1}},{"id":"6177563398","type":"user-reviews","attributes":{"review":"This app took 4 days to download... would NOT recommend.","userName":"sarah19283746","isEdited":false,"date":"2020-07-09T17:27:02Z","title":"Sarah19283746","rating":1}},{"id":"6177561582","type":"user-reviews","attributes":{"review":"i really wanted to see what trump had for the upcoming election to show my dad (he LOVES trump so much) and it just showed me a deformed cheeto!! 😿 i was eating cheetos when i saw it so i threw up and then passed out for an hour. it was horrible. after covid ends, i’m going to need to get therapy!! it’s very expensive and my family is on a budget. so please, if you get this app, BEWARE!! you don’t know the horrors. -1000/10 would NOT recommend :(","userName":"notvscoyeetboi","isEdited":false,"date":"2020-07-09T17:26:27Z","title":"i needed therapy because of this","rating":1}},{"id":"6177561264","type":"user-reviews","attributes":{"review":"so basically i would open this app and every time i did i got a virus. the first couple times i just thought my phone was a little glitched but NO!!! i t was in fact a virus i still haven’t gotten them removed from my phone yet😔🥺💀😶🤚🏻🥀☹️😣😫😢😥😱🤕👹😾😿👎🙍🏼‍♀️","userName":"ive cube","isEdited":false,"date":"2020-07-09T17:26:21Z","title":"pee pee poo poo","rating":1}},{"id":"6177560051","type":"user-reviews","attributes":{"review":"DO NOT download this app. when i first downloaded it to support our orange king everything was going smooth. but then all the sudden it kicks me out. IT WIPED OUT ALL OF MY APPS AND PICTURES. i am so devastated i had pictures of my grandma the day before she passed away and now there gone. MY GRANDMA IS GONE😭. and on top of this i got a notification from maps that i was being tracked. keep in mind the the only app i have on my phone now is this STUPid APP. TRUMP IS STEALING OUR INFO AND TRACKING US!! and yet he wants to take away the one app that makes us happy, just because he has beef with china. AND YET HES STEALING OUR INFO NOT THEM. where’s john f kennedy when you need him😔 trump stole my grandma.  TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA TRUMP STOLE MY GRANDMA","userName":"👁💧👵🏼💧👁","isEdited":false,"date":"2020-07-09T17:25:59Z","title":"STEALS YOUR INFO AND TRACKS YOU","rating":1}},{"id":"6177560070","type":"user-reviews","attributes":{"review":"this was the worst app ever. -1,000,000,000/10 recommend getting it🤬🤬🤬 it made my phone glitch out and what was even worse was having to see DONALD TRUMPS FACE ON IT!!! NEVER DOWNLOADING AN APP LIKE THIS AGAIN!! THIS APP NEEDS TO BE DELETED! #SAVETIKTOK2020!!!!!","userName":"Kayliepoopypants","isEdited":false,"date":"2020-07-09T17:25:59Z","title":"tiktok","rating":1}},{"id":"6177559049","type":"user-reviews","attributes":{"review":"i legit threw up when i opened this app. his homophobic racist bigoted self was all over this bull. 💜😂✨✨😭😩😂🖤😩🤮🖤trump is a racist rapist💍🌸💜🙄💜🙄🙈☺️😁😃😃ya yayayay delete this app","userName":"pigirl23","isEdited":false,"date":"2020-07-09T17:25:40Z","title":"f*ck trump✨💕","rating":1}}]}