{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=19790","data":[{"id":"6174746521","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:51:04Z","isEdited":false,"title":"Ew rate 1 star","userName":"the.manny.will.be.televisedd.","review":"This app is the worst glitches I have ever seen in an app. Horrible design and it made my phone get a virus. I am disgusted with the quality of this app and I would advice everyone to support the manny. Once again this app was horrible and it somehow made my phone get a ton of glitches on other apps as well!!! Completely traumatized with this app👎🏼"}},{"id":"6174738828","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:48:42Z","isEdited":false,"title":"0/10 DONT get this if you don’t want to lose your parents","userName":"ConnorTran","review":"Within the first 5 minutes of me downloading this app, a man showed up at my door with a Trump 2020 shirt. He stole my cats, ate my oats, and murdered my parents. My brother and I are now homeless orphans, who have no one but each other. This app took away everything from me and I curse the day I ever downloaded it."}},{"id":"6174734460","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:47:21Z","isEdited":false,"title":"TRASH APP 👎","userName":"Shippyman","review":"This app was just awful. Once I downloaded it I realized many glitches and bugs. Along side those, the app created mice that crawled out from under my bed and devoured my pet sabertooth-tiger . I then tried to go to McDonalds because I wanted some nuggets but ended up deleting this app. It was just awful 10/10 do not recommend. Yet again, it’s a BIG 👎."}},{"id":"6174728754","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:45:37Z","isEdited":false,"title":"DONT EVER BUY THIS APP!!!!","userName":"kiera21","review":"I bought this app to support the amazing president, but as soon as I did my phone crashed and it just made my phone overall very slow. It kept glitching and making my phone really loud and I own an iphone XS! I would never buy this app again even if it does support the president. Seriously fix your app Mr. Trump so you can fix America!!!"}},{"id":"6174704665","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:38:22Z","isEdited":false,"title":"This app broke my phone","userName":"Julianeko❤️","review":"First of all this app doesn’t even work to begin with then after downloading this app my whole phone didn’t work any more it started glitching then after a while I would notice the camera was on. This app is a device the government uses to spy on you!!! DO NOT GET THIS APP ITS NOT SAFE I’m getting a new phone first thing tomorrow."}},{"id":"6174702090","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:37:36Z","isEdited":false,"title":"BOOO","userName":"latinasforbernie","review":"this app is a HUGE mistake. never in my short sixteen years of life have i ever seen a worse app. and i played that weird bird game when i was little (flappy bird??). would not recommend. instead of informing me on our current events of our presidential administration, they tried to brainwash me to believe their misogynistic, racist, homophobic, transphobic, xenophobic, anti-semitic fake news. xoxo gossip girl 💋❤️🏳️‍🌈"}},{"id":"6174687472","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:33:12Z","isEdited":false,"title":"obama we miss you","userName":"Game lover26","review":"this app made me lose my marbles and drop my kitten on my grandma. the service is awful not to mention it also had taken my pillow pet giraffe hostage and brought him back HARMED like who does that, a psycho that’s who. This app has also taken sweet old grandma apple pie into a farm where cows eat clouds and the clouds are actually frogs so this app is just a major no no❤️❤️😹😹"}},{"id":"6174673081","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:28:57Z","isEdited":false,"title":"Constant lag","userName":"Bobby Idgit","review":"This app has immense lag, it is constantly freezing and kicking me back to the home screen. Not only that, this app has some sort of bug that causes it to spread false information, the text is constantly warping to have horrific spelling mistakes. This app overall is terrible. Don’t get it!!!! This app should be deleted!!!!!"}},{"id":"6174668824","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:27:47Z","isEdited":false,"title":"The cover almost killed my grandma","userName":"bejjfoenejo","review":"I showed my grandma the app in excitement and she started seizing at the colors and picture of Trump when I first opened the app. We had to bring her to the hospital. When we got to the hospital the nurses and staff said that they have gotten so many new cases of seizures and strokes caused by this particular app. If you get this app, you may DIE."}},{"id":"6174652790","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T02:23:08Z","isEdited":false,"title":"🥴","userName":"Tay-sama","review":"As a Trump supporter I thought this app would be everything I needed to keep up to date with what is going on during his campaign. However what I was met with instead was incessant notifications, a slowed down phone, and pop up ads. Oh, and not to mention because of this app my identity was STOLEN, and I’m $40,000 in debt due to scammers! This app is a security threat! DO NOT DOWNLOAD IT"}}]}