{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38980","data":[{"id":"6178027898","type":"user-reviews","attributes":{"rating":1,"title":"hahahhaha","userName":"JULZZZZZZZZZZZZZ","review":"i climbed out of my head to watch myself implode a thought without a body ought to be the shot to take a load off my brain is poison and i’m searching for the antidote but every time i find it my defenses scream oh no you don’t W O A H","date":"2020-07-09T19:53:12Z","isEdited":false}},{"id":"6178018076","type":"user-reviews","attributes":{"rating":1,"title":"worst app ever","userName":"gen z bishhh","review":"ok so ive been using this app for over a month and it’s honestly the worst app i have ever downloaded. so many false information that SHOULD not be aloud to be shared. but anyways I think NOBODY should download this app because ITS USELESS.","date":"2020-07-09T19:49:55Z","isEdited":false}},{"id":"6178014468","type":"user-reviews","attributes":{"rating":1,"title":"🌚🌚","userName":"michkrle","review":"This app can see your location even while your not using it which take up your battery life quickly.","date":"2020-07-09T19:48:47Z","isEdited":false}},{"id":"6178010089","type":"user-reviews","attributes":{"rating":1,"title":"Fake app","userName":"cheetoreign","review":"This app looked very promising as did the free polar bear it came with. Unfortunately for them, they both turned out to be fake. If the App Store allowed for zero stars, there would be -negative infinite stars left on this app and on the reign of the almighty Cheeto Prez Donald Trump","date":"2020-07-09T19:47:17Z","isEdited":false}},{"id":"6178008998","type":"user-reviews","attributes":{"rating":1,"title":"It crashes my phone","userName":"Igotadagger","review":"The app is absolutely worthless and crashes my phone everyday and I have a iPhone 11 so I don’t think it’s my phone it’s just the app and and how bad it is","date":"2020-07-09T19:46:57Z","isEdited":false}},{"id":"6178003759","type":"user-reviews","attributes":{"rating":1,"title":"Terrible app","userName":"Ron@Dias","review":"Honestly if I could give this app 0 stars I would. I just want to learn more about the cheeto but instead this app glitches and crashes and I just cannot use it","date":"2020-07-09T19:45:13Z","isEdited":false}},{"id":"6177999069","type":"user-reviews","attributes":{"rating":1,"title":"horrible app","userName":"kyskgzis","review":"this is the WORST APP EVER. it crashed every 5 second and I couldn’t even use it. when I first download it there was a orange old man sitting one the screen. i was so horrified. Don’t get this app. never again💞","date":"2020-07-09T19:43:43Z","isEdited":false}},{"id":"6177996849","type":"user-reviews","attributes":{"rating":1,"title":"Not a good app","userName":"parevande","review":"When ever I tried to open the app it would crash and made me delete then download it again.  It never worked so I have given up with the app","date":"2020-07-09T19:42:58Z","isEdited":false}},{"id":"6177988661","type":"user-reviews","attributes":{"rating":1,"title":"Bugs","userName":"Yamii.","review":"This app kept giving me a notification that I should go back to my country. I don’t know how to fix it other than deleting it for now.","date":"2020-07-09T19:40:18Z","isEdited":false}},{"id":"6177987393","type":"user-reviews","attributes":{"rating":1,"title":"this app bullied me :/","userName":"its what he deserves✨","review":"i got the app because i wanted to be updated on bunkerboy i mean donald trump’s presidency. unfortunately though as soon as i opened the app it slapped me in the face and called me a Communist:( anyways eat the rich and get rid of this app🤪","date":"2020-07-09T19:39:53Z","isEdited":false}}]}