{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=38490","data":[{"id":"6174887060","type":"user-reviews","attributes":{"date":"2020-07-09T03:32:49Z","isEdited":false,"userName":"donaldtrumpisapedo2020","rating":1,"review":"this app will steal everything from you. donald trump was texting me saying he loves being a racist/rapist. I AM TRULY DISGUSTED. as a mcdonald’s employee i will never ever use this app again. they called me several rude names like a fat bird, monkey, and a big fat rock. DONT TGINK ABOUT USING THIS APP UNLESS YOU LIKE GETTING VIRUS’S ON YOUR PHONE. I WILL NOW VOTE FOR NICKI2020","title":"THIS APP IS SO RUDE"}},{"id":"6174886819","type":"user-reviews","attributes":{"date":"2020-07-09T03:32:45Z","isEdited":false,"userName":"Maddie Beghein","rating":1,"review":"This app is mega doo doo. It took too long to download and when the app finally opened I saw the face of a scary orange man. I did not have a pleasant time on this app. It was very confusing and I didn’t like the point system. Also trump is a weirdo.","title":"This app is mega doo doo"}},{"id":"6174880864","type":"user-reviews","attributes":{"date":"2020-07-09T03:31:03Z","isEdited":false,"userName":"captain sullenberger","rating":1,"review":"I let it run for a day and it made my phone go so slow, I had 100 notifications in under an hour not to mention it made my phone overheat","title":"Horrible App"}},{"id":"6174877529","type":"user-reviews","attributes":{"date":"2020-07-09T03:30:04Z","isEdited":false,"userName":"Hotchbaby","rating":1,"review":"this app was AWFUL it glitched so bad a cheeto popped up on my screen then i would see dinosaurs outside my windows. then two minutes later melania came into my room and said hello 🧿👄🧿 i was scared do not downloaded this app.","title":"Do not download🥱🥱"}},{"id":"6174865936","type":"user-reviews","attributes":{"date":"2020-07-09T03:26:42Z","isEdited":false,"userName":"milemarker82","rating":1,"review":"This is absolutely disgusting, the coding of the app is just atrocious, the actual app doesn’t even really do anything. I say it needs to be deleted. Get this trash off of the App Store","title":"Worst app that has been made"}},{"id":"6174864712","type":"user-reviews","attributes":{"date":"2020-07-09T03:26:21Z","isEdited":false,"userName":"AMala985","rating":1,"review":"I downloaded this app because well I’m sure you know and it’s a glitchy hot mess. Also now my eyes have herpes and I can’t drink water without using both hands and I’ve suddenly became fluent in Russian.","title":"Failed bigly"}},{"id":"6174850780","type":"user-reviews","attributes":{"date":"2020-07-09T03:22:14Z","isEdited":false,"userName":"Bloopbooopbeep","rating":1,"review":"App is poorly designed and not secure. Every time I try to open the app, it crashes immediately!!!!!!! Then my account was hacked and all of my information was sold.","title":"Crashes"}},{"id":"6174843839","type":"user-reviews","attributes":{"date":"2020-07-09T03:20:11Z","isEdited":false,"userName":"horrible a","rating":1,"review":"This app has been failing and glitching I can’t believe it’s even on the App Store still it should be deleted immediately this app is clearly not working correctly and is also supporting a Cheeto as president.","title":"Worst app ever!!"}},{"id":"6174843527","type":"user-reviews","attributes":{"date":"2020-07-09T03:20:06Z","isEdited":false,"userName":"Vsgahvajahs","rating":1,"review":"Honestly I thought this was gonna be a professional platform. But I realize my daughters 3rd grades graduation parties clown was more professional than this thing of an it. Awful app. Keeps showing this Cheeto mascot... I think it’s a glitch.","title":"Clown"}},{"id":"6174823364","type":"user-reviews","attributes":{"date":"2020-07-09T03:14:11Z","isEdited":false,"userName":"ttyugtoons","rating":1,"review":"I downloaded the app thinking I can vote for Trump but then something weird happened Bob the builder came to my house and built a wall around it now I can’t leave my house would not recommend this app.","title":"I CAN’T LEAVE MY HOUSE NOW!!!!!! 😫 🧚‍♀️"}}]}