{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30570","data":[{"id":"6174385267","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T01:05:41Z","review":"Here me out! If you download this app, give it bad review and then uninstall it immediately! If this app goes below 1 star in ratings, it will be deleted from the app store. If you hate Trump, it will surely make you happy when you know his own app has this much hate. 😈","userName":"Gamerdude3609","title":"DON’T USE THIS APP"}},{"id":"6174381787","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T01:04:37Z","review":"I opened the app and then a fried Cheeto puff was looking at me. I was sooooo scared I couldn’t sleep for days after seeing it, it was HORRIFIC I can’t even put into words how bad it was. I’m currently hiding cause wherever I look the Cheeto puff man is staring at me. I don’t know how much time I have left before he gets me","userName":"Namibia haruka","title":"DISGUSTING"}},{"id":"6174378862","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T01:03:43Z","review":"I was trying to vote for our great Cheeto president again but this app was the worst experience I’ve ever had, there’d where bugs and I just over all hated the experience, do not download this app! I wish I could rate it zero stars and I think I’m a democrat now","userName":"OwOz UwUz","title":"The worst app!"}},{"id":"6174377948","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T01:03:26Z","review":"Downloaded the app hoping for a great interactive app to get into the campaign and was severely disappointed with its overall setup, functions, and look. I hope they come up with something better!","userName":"eerickson126","title":"Disappointed"}},{"id":"6174374397","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T01:02:23Z","review":"holy hellberries,\ni never thought i would be leaving a negative review on any application before, but this, this application is NO BUENO. dear peoples, please save yourself the time and do not even download this application on any of your devicees. sincerely, your friend looking out for you, honey bunches.","userName":"anonymous15567","title":"this app is grosser than my 6th toe"}},{"id":"6174370538","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T01:01:09Z","review":"I can’t believe this man is our president. The amount of porn hub ads I got is baffling. My two year old child rat had a heart attack due to graphic pictures shown on my screen causing it to convulse In agony. Along with the outrageous amounts of Chester cheetah merch this app needs to be shut down.","userName":"Gofluffyourself","title":"Ew"}},{"id":"6174355865","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T00:56:23Z","review":"This is honestly not even worthy of one star. The app caused my phone to crash multiple times after I downloaded it. This app ended up completely totaling my phone and left me with whiplash and various other injuries. Sickening.","userName":"Anonymous User 63527","title":"Awful"}},{"id":"6174323226","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T00:45:31Z","review":"You know, when downloading this app I had high expectations! However I was quickly disappointed. The app must use a lot of saturation or something?! I thought our President was your average all American guy, but he’s orange?! I’m in absolute shock I feel betrayed. One star so sad","userName":"Red,white and blue","title":"Uh oh"}},{"id":"6174308922","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T00:40:39Z","review":"I opened the app, ready to register for a rally, but right when it opened I was flashed with a horrid picture of a Cheeto with a 🍤! I don’t know how that happened, maybe it’s a bug??? Anyways, as much as I would like to attend a rally, I unfortunately have to walk my pet piano. Very sad😭 Anyways, stan LOONA.","userName":"stanLOONAxoxo","title":"im scarred for life😔"}},{"id":"6174292932","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T00:35:19Z","review":"Why does the app automatically charge me 100 to the trump administration?? That money was for my children who I was forced to have. Not only that but I saw a naked picture of Donald. I hate him. I wanted so badly to like him but I’m disgusted. I thought he’d do so good for another term but he’s messed up.","userName":"Momo2519","title":"Hate"}}]}