{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=20920","data":[{"id":"6174862912","type":"user-reviews","attributes":{"date":"2020-07-09T03:25:50Z","review":"this app will delete every single thing on ur phone and also curse every electronic thing in ur home to come alive and try to kill u. i had to battle my toaster oven for like 3 hours- it was so tiring. it happened to me & my cousin Shannon. they didn’t show our story on the news cuz of all the pro trump propaganda. so sad.","title":"wish i could give 0 star","isEdited":false,"rating":1,"userName":"Hoezoe"}},{"id":"6174856842","type":"user-reviews","attributes":{"date":"2020-07-09T03:24:02Z","review":"I legitimately downloaded the app to receive notifications if Trump would be in my area. However I am disappointed by constant crashes. I don’t believe Apple supports this app, I have the most recent update and still experience random freezing. Fix the app and try again!!","title":"App crashes","isEdited":false,"rating":1,"userName":"O. Rey"}},{"id":"6174837184","type":"user-reviews","attributes":{"date":"2020-07-09T03:18:13Z","review":"I thought it was going to help me find my lost dog he has been lost for 30 days and now I think I can find the broken ice cream machine but it was at target but then it got closed because if was 4 July and I got banned for my dog because he was to big it has a green tail a fat neck and a lot more and I have heard a thing about TikTok","title":"Don’t like the app","isEdited":false,"rating":1,"userName":"ncjfhdbebenhdbej"}},{"id":"6174809282","type":"user-reviews","attributes":{"date":"2020-07-09T03:10:03Z","review":"i’ve seen some non trump supporters post about this app but i am a trump supporter so you can trust me on this. The app was awful and it kept glitching my phone up my phone was perfectly fine before this but now it is glitching on this app and other apps !!! do not get this app it is awful","title":"so slow and glitches my phone","isEdited":false,"rating":1,"userName":"oliviashea"}},{"id":"6174795995","type":"user-reviews","attributes":{"date":"2020-07-09T03:06:09Z","review":"this app is horrible. i thought because all trump does for is that this was going to go down in app history. but i was unfortunately let down. the second i downloaded it i got AIDS. i can’t tell you how much pain i am in. i am so disappointed in trump. he has let the whole nation down with this app. it is a national disgrace. ⚠️DOWNLOAD AT YOUR OWN RISK ⚠️","title":"HORRIBLE🧚🏻✨💖","isEdited":false,"rating":1,"userName":"converned us citizen"}},{"id":"6174795822","type":"user-reviews","attributes":{"date":"2020-07-09T03:06:06Z","review":"So I was at Walmart to get a giraffe and i had downloaded this app and my Gorilla was in a cat harness and then mrs. Monkey (My gorilla) disappeared! So I looked under the trees because that was his favorite place to hide and mrs. Monkey wasn’t there then I opened the Trump app and Mrs. Monkey was eating a chocolate bar in the app! Donald Trump stole my Gorilla and I want Mrs. Monkey back before her daily popcorn bath because she goes bananas without her popcorn baths!","title":"APP STOLE MY PET GORILLA","isEdited":false,"rating":1,"userName":"Sarahgonzalez2007"}},{"id":"6174786213","type":"user-reviews","attributes":{"date":"2020-07-09T03:03:10Z","review":"I downloaded this app to educate myself on the elections and understand who our president is and why we should re elect him. There is no actual information on this app. Plus... all the other reviews mentioned a dragon that judges you if you waste your time. Definitely happened. It just watches me and shakes it’s head at me all the time.","title":"WASTE OF TIME","isEdited":false,"rating":1,"userName":"Alexandria331BC"}},{"id":"6174767455","type":"user-reviews","attributes":{"date":"2020-07-09T02:57:24Z","review":"Went on this app and it knew I was Puerto Rican. A notification piped up saying they would change my birth certificate to say I was Mexican and they would deport me and my family.  After this I went to chic-fil-a and they took forever to give me my food and by then it was all cold and soggy. 10/10 would not recommend.","title":"Absolutely Horrible","isEdited":false,"rating":1,"userName":"Caledonia High School"}},{"id":"6174760702","type":"user-reviews","attributes":{"date":"2020-07-09T02:55:22Z","review":"This app is SO BAD OMG. IT HAS TERRIBLE GLITCHES anddddd it has misleading information. I HAD TO LEAVE the app and restart it so it could work. IM SO AGGRAVATED. This app literally shoots out taco bell and it makes a mess you have to then go to starbucks and struggle to fix your drink even though america runs on dunkin. Sometimes i wonder why people HAVE SUCH BAD APPS. HOLY GEEZ LOUISE FIX YOUR APP but first the president AND THEN CONTINUE. THIS APP FREEZES SO MUCH AND IS MESSY AND I JUST DONR LIKE IT WHAT SO EVER!!!!","title":"TERRIBLE APP","isEdited":false,"rating":1,"userName":"Donald Trumps son Barron 467"}},{"id":"6174749226","type":"user-reviews","attributes":{"date":"2020-07-09T02:51:52Z","review":"Oh lord! Where do I start with this app? First of all, it’s so laggy. My grandma runs faster than this disgraceful app. Second, it is triggering!!! I used it and the energy in the room just automatically STOPPED passing the vibe check. For example, my puppy started puking and my younger sister got migraines. Third of all, the colors in this app are disgusting. Be more creative!!!!","title":"DO NOT WASTE YOUR TIME","isEdited":false,"rating":1,"userName":"S.S.R 15"}}]}