{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=90060","data":[{"id":"6178153881","type":"user-reviews","attributes":{"userName":"stef_627","rating":1,"isEdited":false,"title":"WORST APP EVER","date":"2020-07-09T20:34:55Z","review":"worst app to exist! it somehow stole 20 dollars from me and i can’t get them back! HORRIBLE APP."}},{"id":"6178121465","type":"user-reviews","attributes":{"userName":"Sarahjadda","rating":1,"isEdited":false,"title":"Seriously 🙄","date":"2020-07-09T20:23:59Z","review":"terrible app. he has no lips 😳 how will he get a kiss kiss 😜 very ugly no kiss for him 🙈🥰"}},{"id":"6178104849","type":"user-reviews","attributes":{"userName":"this app is bad!!!!!","rating":1,"isEdited":false,"title":"🍊😙😍🍊","date":"2020-07-09T20:18:29Z","review":"So I got this app to obvi support are president orange 🍊❤️ and well DONT GET THIS ew ew ew ew I’m literally going to barf tik tok needs to stay"}},{"id":"6178093350","type":"user-reviews","attributes":{"userName":"ernie mayen","rating":1,"isEdited":false,"title":"would not recommend","date":"2020-07-09T20:14:40Z","review":"this apps is disgusting"}},{"id":"6178088974","type":"user-reviews","attributes":{"userName":"kanye202","rating":1,"isEdited":false,"title":"Honestly","date":"2020-07-09T20:13:13Z","review":"I don’t like it"}},{"id":"6178070224","type":"user-reviews","attributes":{"userName":"hiimfromtiktok","rating":1,"isEdited":false,"title":"No❤️","date":"2020-07-09T20:07:04Z","review":"SCAM this does not work cause when I put a vote it vote for a STUPID CHEETO WHO WANT TO TAKE DOWN TIKTOK oops I said too much🙀-(aesthetic_asmr_vibe5)"}},{"id":"6178065902","type":"user-reviews","attributes":{"userName":"CoolCoolVibin","rating":1,"isEdited":false,"title":"Gen Z","date":"2020-07-09T20:05:40Z","review":"Im apart of gen z and if trump wants to delete tiktok  will delete his app to then too"}},{"id":"6178063269","type":"user-reviews","attributes":{"userName":"Owlish248","rating":1,"isEdited":false,"title":"took forever to download and crashed when opened","date":"2020-07-09T20:04:44Z","review":"According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don't care what humans think is impossible. Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let's shake it up a little. Barry! Breakfast is ready! Ooming! Hang on a second. Hello? Barry? Adam? Oan you believe this is happening? I can't. I'll pick you up. Looking sharp. Use the stairs. Your father paid good money for those. Sorry. I'm excited. Here's the graduate. We're very proud of you, son. A perfect report card, all B's. Very proud. Ma! I got a thing going here. You got lint on your fuzz. Ow! That's me! Wave to us! We'll be in row 118,000. Bye! Barry, I told you, stop flying in the house! Hey, Adam. Hey, Barry. Is that fuzz gel? A little. Special day, graduation. Never thought I'd make it. Three days grade school, three days high school. Those were awkward. Three days college. I'm glad I took a day and hitchhiked around the hive. You did come back different. Hi, Barry. Artie, growing a mustache? Looks good. Hear about Frankie? Yeah. You going to the funeral? No, I'm not going. Everybody knows, sting someone, you die. Don't waste it on a squirrel. Such a hothead. I guess he could have just gotten out of the way. I love this incorporating an amusement park into our day. That's why we don't need vacations. Boy, quite a bit of pomp... under the circumstances. Well, Adam, today we are men. We are! Bee-men. Amen! Hallelujah! Students, faculty, distinguished bees, please welcome Dean Buzzwell. Welcome, New Hive Oity graduating class of... ...9:15. That concludes our ceremonies. And begins your career at Honex Industries! Will we pick ourjob today? I heard it's just orientation. Heads up! Here we go. Keep your hands and antennas inside the tram at all times. Wonder what it'll be like? A little scary. Welcome to Honex, a division of Honesco and a part of the Hexagon Group. This is it! Wow. Wow. We know that you, as a bee, have worked your whole life to get to the point where you can work for your whole life. Honey begins when our valiant Pollen Jocks bring the nectar to the hive. Our top-secret formula is automatically color-corrected, scent-adjusted and bubble-contoured into this soothing sweet syrup with its distinctive golden glow you know as... Honey! That girl was hot. She's my cousin! She is? Yes, we're all cousins. Right. You're right. At Honex, we constantly strive to improve every aspect of bee existence. These bees are stress-testing a new helmet technology. What do you think he makes? Not enough. Here we have our latest advancement, the Krelman. What does that do? Oatches that little strand of honey that hangs after you pour it. Saves us millions. Oan anyone work on the Krelman? Of course. Most bee jobs are small ones. But bees know that every small job, if it's done well, means a lot. But choose carefully because you'll stay in the job you pick for the rest of your life."}},{"id":"6178061440","type":"user-reviews","attributes":{"userName":"knd420","rating":1,"isEdited":false,"title":"Fake news","date":"2020-07-09T20:04:10Z","review":"Donald ate my baby therefore, 1 star."}},{"id":"6178052034","type":"user-reviews","attributes":{"userName":"janiah j","rating":1,"isEdited":false,"title":"We coming for the kill","date":"2020-07-09T20:01:06Z","review":"Trump wanna delete TikTok"}}]}