{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22710","data":[{"id":"6178588692","type":"user-reviews","attributes":{"title":"BROKE MY PHONE","rating":1,"review":"I got this app in hopes of staying informed with our nation, but the minute I downloaded the app my phone crashed. I had to buy a brand new phone and still there were problems due to this app. I am so TREMENDOUSLY disappointed and hurt by the lack of respect to all supporters who just wanted to stay updated and informed.","isEdited":false,"userName":"postcastlistener","date":"2020-07-09T23:19:08Z"}},{"id":"6178559423","type":"user-reviews","attributes":{"title":"Worst app ever","rating":1,"review":"This app has the worst service I have ever experienced, it is so complicated and it took 5 hours to download, the sign in is so inefficient and and overall layout is so awful. \nIt takes up so much storage. If I could give it negative ratings, it would be a negative 10 no cap","isEdited":false,"userName":"Narwals Swiming in the ocean","date":"2020-07-09T23:07:48Z"}},{"id":"6178538863","type":"user-reviews","attributes":{"title":"I don’t have words.","rating":1,"review":"As soon as I pressed the download button this app put me through a traumatic experience. The design and word choice are absolutely revolting, just the name of the app symbolizes themes of racism, sexism, xenophobia, transphobia, the list goes on and on. It is incredibly offensive, and NOT the message that I know Apple is trying to send.","isEdited":false,"userName":"the.c0och","date":"2020-07-09T22:59:37Z"}},{"id":"6178494510","type":"user-reviews","attributes":{"title":"Whats with the wait!?","rating":1,"review":"The time it takes to download this app is insane, not to mention the time it takes to get the app running! How can i support my dearest president when i cant even access this app! I paid good money for this phone just to be wasted on long loading time.","isEdited":false,"userName":"nerowonda","date":"2020-07-09T22:41:54Z"}},{"id":"6178467257","type":"user-reviews","attributes":{"title":"Just terrible","rating":1,"review":"As a VERY patriotic American I was so incredibly disappointed in this app. It was slow and took almost an hour to create a profile I am disappointed in Donald and his team if he wants to take other apps down he should at least have the decency to make his own app usable.","isEdited":false,"userName":"a patriodic american","date":"2020-07-09T22:31:12Z"}},{"id":"6178449916","type":"user-reviews","attributes":{"title":"Trash","rating":1,"review":"it’s sad how it only one language and im not surprised too bc we was being very controversial to people who didn’t speak english.. literally straight up English. is she dumb? does he not know that there are people all over the world- AND ALSO HIS WIFE-... you know this app is straight up disrespectful and disgusting. Apple store delete this.","isEdited":false,"userName":"sckmyahh","date":"2020-07-09T22:24:23Z"}},{"id":"6178426599","type":"user-reviews","attributes":{"title":"Seizure Warnings!!","rating":1,"review":"Anyone with a heart condition should know that this app immediately causes seizures upon opening. The logo flashes when it loads and caused two of my friends with epilepsy to go into shock. I recommend either closing the app when it starts, or covering the phone with a soft cloth which deters the damaging effects of the flashing lights. Please be safe.","isEdited":false,"userName":"raynalollasmith","date":"2020-07-09T22:15:19Z"}},{"id":"6178365871","type":"user-reviews","attributes":{"title":"Don’t get its has lots of problems","rating":1,"review":"Being a Trump supporter I thought to get this help to help out with election but no it’s awful it’s swarmed with tons of bugs it’s so laggyNot only that it’s spams you constantly About dumb stuff do not get this that awful instead go support Biden because after this app I sure do you","isEdited":false,"userName":"🖤Lily❤️","date":"2020-07-09T21:51:54Z"}},{"id":"6178348496","type":"user-reviews","attributes":{"title":"I have no food","rating":1,"review":"I was expecting this app to be of our lord and savior Donald Jenius Trump but all I found we’re some carrots and Cheetos which reminded me that I wanted food so I went to check and hade no food but I went to get food like a month ago so I was sure I hade no food but as this app was installed previous to this I have to blame the app.😘😘🥰","isEdited":false,"userName":"So not wattermelon","date":"2020-07-09T21:45:12Z"}},{"id":"6178297945","type":"user-reviews","attributes":{"title":"Horrible","rating":1,"review":"This app is not useful. There are no facts. I was hoping it would be coherent and helpful for the upcoming election but it is anything but helpful. It is time to stand together and let our message be of love. In a place where everyone is truly equal. Anything associated with this person is horrible and will treat you very unfairly.","isEdited":false,"userName":"vgj!","date":"2020-07-09T21:26:18Z"}}]}