{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=39300","data":[{"id":"6174139751","type":"user-reviews","attributes":{"date":"2020-07-08T23:40:04Z","rating":1,"isEdited":false,"userName":"SHREKS LOVER","review":"As i was baithing in swamp water next to my daddy shreks house😍, i saw an app that had a giant cheeto on it so i thought i would download it. When i opened the app a really bad odor came out of it and made me gag. I am appalled and absolutely mortified at what i smelled. \n\nSincerely,\nShreks lover❤️","title":"no ❤️"}},{"id":"6174129734","type":"user-reviews","attributes":{"date":"2020-07-08T23:36:17Z","rating":1,"isEdited":false,"userName":"ratty patty pa tat rat","review":"so here’s what happened, i opened the app and my cat jumped off the ceiling (that usually doesnt happen) and then i kept hearing this disgusting sound \"bobby’s burgees” for 3 DAYS i don’t know what you’ve done but i raised my house as a trump stan😔✊also BLM✊🏽✊🏾✊🏿 yeah❤️","title":"i’m scared..."}},{"id":"6174122841","type":"user-reviews","attributes":{"date":"2020-07-08T23:33:42Z","rating":1,"isEdited":false,"userName":"tik tok ( no trump 2020)","review":"Trump 2020 no it had inappropriate picture of trump and he is a Cheeto he takes your information and he ask for pictures 👁👄👁 he want slavery back and I’m black and proud he wants you credit information","title":"Haha haha no trump 2020"}},{"id":"6174121953","type":"user-reviews","attributes":{"date":"2020-07-08T23:33:22Z","rating":1,"isEdited":false,"userName":"sarac120","review":"donald trump doesn’t know how to make a quality app cause all he knows how to do is be racist, sexist, misogynistic, xenophobic, ableist, be a sociopath, and hide in a bunker.  he also assaulted children with the help of Jeffrey Epstein.  vote blue to save our country and vote the trader out","title":"donald trump is a little bunker boy"}},{"id":"6174121440","type":"user-reviews","attributes":{"date":"2020-07-08T23:33:13Z","rating":1,"isEdited":false,"userName":"wotor sheep","review":"I opened the app and was shown a very horrible and graphic photo of a skinned pig..the app also buffers every two seconds and it’s incredibly aggravating and I will advise anyone who’s looking in the reviews of this app to AVOID THIS APP AT ALL COSTS!!","title":"Horrible app"}},{"id":"6174090870","type":"user-reviews","attributes":{"date":"2020-07-08T23:22:02Z","rating":1,"isEdited":false,"userName":"all tea all shade💅🏽","review":"So at first I’m like “okay cool the president has an app, let’s see what’s it’s about!” So not even 10 seconds of me opening the app, I literally see a Cheeto smiling, or frowning... I couldn’t tell. Like is this app supposed to be a joke!? Trump has officially lost my vote😡","title":"!!!!!!!!ITS A SCAM!!!!!!!!"}},{"id":"6174086682","type":"user-reviews","attributes":{"date":"2020-07-08T23:20:29Z","rating":1,"isEdited":false,"userName":"thisgameisfun21","review":"Absolutely disgusting. I open the app and see a disgusting fake Cheeto in my screen give a thumbs up!!🤮🤮🤮🤮🤮🤮🤮like that’s gonna help. Then I see that it has an actual face with a orange spray tan on his skin!!!! He’s being soooo racist to orange people!! Orange lives matter !🤪","title":"Inappropriate app!"}},{"id":"6174084917","type":"user-reviews","attributes":{"date":"2020-07-08T23:19:48Z","rating":1,"isEdited":false,"userName":"A1WAZPAXXIN NEVVASLAXXIN","review":"It has a lot of bugs and issues with it, it hasn’t been fixed in a while so it should be taken down","title":"This app doesn’t work"}},{"id":"6174065745","type":"user-reviews","attributes":{"date":"2020-07-08T23:12:54Z","rating":1,"isEdited":false,"userName":"GoldenKittyPurrPurr","review":"This app is completely disGUSTING!!! I can’t  believe this app would have the audacity to show such grotesque and offensive photos of Cheetos like this!! 😡 I am completely furious and this app needs to be taken down immediately!!!!!!!","title":"HORRIBLE"}},{"id":"6174062635","type":"user-reviews","attributes":{"date":"2020-07-08T23:11:48Z","rating":1,"isEdited":false,"userName":"The Twice Stan","review":"Horrible. This app tracked down my location and stole my mom and took the cat with them. One of the guys winked at me while leaving and he was kinda cute though 😳. But screw him. That orange Cheeto puff stole my mom and I want her back! 😡😡 I need my daily source of creamy breast milk >:((","title":"No bueno. 𝓯𝓾𝓬𝓴 𝓽𝓻𝓾𝓶𝓹"}}]}