{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28870","data":[{"id":"6177134620","type":"user-reviews","attributes":{"review":"I downloaded this app because someone told me it would make Jung Hoseok show up at my door. It never worked all I got was opening the app and seeing a gross stale orange peel. I feel absolutely traumatized, this app is absolutely disgusting. Please do NOT download unless you want to be traumatized for life.","title":"HORRIBLE APP","userName":"Zee ;-;","date":"2020-07-09T15:21:31Z","isEdited":false,"rating":1}},{"id":"6177132138","type":"user-reviews","attributes":{"review":"Not part of the gen-z thing but honestly we need a better president. These past four years have been horrible and it’s time for a change. The app also isn’t the best as I find it boring as there is nothing to do on the app","title":"Terrible","userName":"ayopierreuwannacomeouthere","date":"2020-07-09T15:20:50Z","isEdited":false,"rating":1}},{"id":"6177131148","type":"user-reviews","attributes":{"review":"This app took days to download and when it finally did it shut down my entire phone. The app wouldn’t fully open and kept glitching out, then it started happening to my other apps. This app will break your phone. Get rid of it.","title":"TERRIBLE APP","userName":"down with the bloody big head","date":"2020-07-09T15:20:35Z","isEdited":false,"rating":1}},{"id":"6177129106","type":"user-reviews","attributes":{"review":"If I could rate a 0 star review I would!! Aside from the app taking forever to download this app is completely outdated!! It kept crashing every 5 seconds and it made my phone overheat and explode!! I’m expecting a new phone through the mail mr trump!!! Horrible!!!","title":"Horrible!","userName":"Hdueiebdbd","date":"2020-07-09T15:20:00Z","isEdited":false,"rating":1}},{"id":"6177120498","type":"user-reviews","attributes":{"review":"i opened them app & saw ✨orange✨man, the fact that i had 2 look @ his face 4 more than 2 seconds just- 🤢🤢🤮 but anyways the app promised me that it would make sure i would get everything i wanted in life 🤩 but then it just said NO🤬🤬😡so now i’m sad","title":"made my life a living HELL","userName":"omygodkarina","date":"2020-07-09T15:17:38Z","isEdited":false,"rating":1}},{"id":"6177101193","type":"user-reviews","attributes":{"review":"I got the app thinking that I would be able to see all of Donald Trumps plans. The app took four weeks to download and then proceeded to wipe my phone when I refused to type in my phone number. Don’t know what’s going on with this campaign, Trump has lost my vote.","title":"Worst App","userName":"Big Boi 22","date":"2020-07-09T15:12:14Z","isEdited":false,"rating":1}},{"id":"6177093851","type":"user-reviews","attributes":{"review":"Trump's app is just the worst he shouldn't even have an app on here. He is scared of gen z's power we have done the Ally things and he doesn't even deserve to be president again after everything he didn't supposed he is making America not great amazing. He is an orange","title":"Worst app ever","userName":"Mandi Patel.","date":"2020-07-09T15:10:16Z","isEdited":false,"rating":1}},{"id":"6177082370","type":"user-reviews","attributes":{"review":"i downloaded this app not too long ago so i could keep up with the news on our president and quickly i realized how bad it was. it’s very confusing to navigate, doesnt give you good information, etc. so if you want to save your time DO NOT DOWNLOAD!!!","title":"not very good","userName":"Leeli._.Bird","date":"2020-07-09T15:07:03Z","isEdited":false,"rating":1}},{"id":"6177081218","type":"user-reviews","attributes":{"review":"So I downloaded this app to try and support our annoying orange president but this app is just all around so bad. I feel it should be more up to date and it is very slow and it glitches and kicks me out every time I open it.","title":"🌺tiktok🌺","userName":"ojskpgjsfigj","date":"2020-07-09T15:06:44Z","isEdited":false,"rating":1}},{"id":"6177022230","type":"user-reviews","attributes":{"review":"genuinely looked forward to keeping up to date with our POTUS’s 2020 campaign, but this app is atrocious. It was like it was designed by toddlers. Navigating through it is harder than running through a corn field maze. If I could give it zero stars, I would.","title":"republican disappointment","userName":"laynecatherinep","date":"2020-07-09T14:50:38Z","isEdited":false,"rating":1}}]}