{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24040","data":[{"id":"6177024698","type":"user-reviews","attributes":{"title":"SPAM!","isEdited":false,"review":"Gen z  ruined this app! They spammed it and all used it so much that now it’s crashing and even sending me spam messages. I am scared for the security of the device. Why must they ruin everything! This app needs to be taken down ASAP!! I would give it zero stars if I could. DOES NOT pass the vibe check!","userName":"lilli009102","date":"2020-07-09T14:51:17Z","rating":1}},{"id":"6177023336","type":"user-reviews","attributes":{"title":"The worst app","isEdited":false,"review":"This is the worst app I couldn’t even sleep for a day cuz I would have nightmares of trump the plans he has are horrendous I can’t believe it we need a new president now trump is a 🍊 head u are the dumbest person in life I hate u !!!!!!!!!!!!!! Don’t delete Tik Tok or I will delete ur face no one even likes u, ur the best on being the worst president","userName":"Pamela the best","date":"2020-07-09T14:50:55Z","rating":1}},{"id":"6176998766","type":"user-reviews","attributes":{"title":"This app is horrible","isEdited":false,"review":"So first I wanted to start off by saying that my app deleted itself randomly. It also took me days to even get the app to download. Not to mention when I opened it I was bombarded by FAKE NEWS. This app definitely needs to be taken down. It’s just down right awful!!","userName":"Into star","date":"2020-07-09T14:44:21Z","rating":1}},{"id":"6176971507","type":"user-reviews","attributes":{"title":"Yuh","isEdited":false,"review":"Hey everybody\nDo you know what time it is (yeah)\nIt's Ice Cream time (wooo)\nLet's go\nI got the Cookie Dough\nI wanna say hello\nChocolate or Vanilla\nTydus is your fella\nScooping it cold\nCoolest 4 year old\nCookies and Cream\nThat's my dream\nIce Cream Ice Cream\nI be selling Ice Cream\nI be making Ice Cream\nIcey Icey Ice Cream\nIce Cream Ice Cream\nI be selling Ice Cream\nI be making Ice Cream\nIcey Icey Ice Cream\nI scream (Wooo)\nYou scream (Ahhh)\nI scream (Wooo)\nYou scream (Ahhh)\nMint Chocolate Chip\nWatch me do the dip\nLet's get Strawberry\nI love it with a cherry\nTaste Buds explode\nWhen I eat the Rocky Road\nMy day is looking up\nAfter Peanut Butter Cup\nI want a Waffle Cone\nWatching Game of Thrones\nWhen I need a Snack\nGimme Moose Tracks!\nSnow cones, Gelato's\nOreo's I got those\nDouble Scoop…","userName":"beeeeaaaaannnnssss","date":"2020-07-09T14:36:55Z","rating":1}},{"id":"6176965738","type":"user-reviews","attributes":{"title":"Glitches and crashes","isEdited":false,"review":"If I could I would give this zero stars, as soon as I opened the app it made me choose my ethnicity and immediately after called me a n****r 🤬🤬 I was outraged!!! It kept crashing and glitching. The notifications were excessive and each one called me a “filthy worthless minority” 😢😔","userName":"QueenLulu295","date":"2020-07-09T14:35:24Z","rating":1}},{"id":"6176962845","type":"user-reviews","attributes":{"title":"Terrible and truly disappointing","isEdited":false,"review":"This app is just not it. Kept crashing and never loaded properly. I would be on the screen for hours and it still wouldn’t load. But it couldn’t possibly be good anyway cause it’s not like people show up to his rallies or anything.😗","userName":"genma zethrow","date":"2020-07-09T14:34:38Z","rating":1}},{"id":"6176949400","type":"user-reviews","attributes":{"title":"absolutely TERRIBLE","isEdited":false,"review":"i was checking out the app when i got this notification saying “ trump without spray tan in purple boxers “ and i just HAD to click on the link!! turns out i got hacked from this app and all my photos were deleted! the overall quality of the app is very bad and glitchy! PLEASE DO NOT GET!!","userName":"please dont get this app! 😬😬","date":"2020-07-09T14:31:03Z","rating":1}},{"id":"6176936237","type":"user-reviews","attributes":{"title":"WORST APP EVER *broke my phone*","isEdited":false,"review":"This app is awful. I gave bugs to my phone and it constantly glitches. I then gave my phone number out to a number of spam callers and now thanks to Trump and his app my phone does not lower properly. The virus that it gave my phone was so bad that my whole family got COVID from it.","userName":"beoeb","date":"2020-07-09T14:27:34Z","rating":1}},{"id":"6176929186","type":"user-reviews","attributes":{"title":"I ALMOST DIED BECAUSE OF THIS APP!","isEdited":false,"review":"Also to clarify, I am not part of this whole gen z thing . First, when I went on the app I got a bunch of weird notifications and then I saw the DEVILLL!!! Then, it tried to kill me with its red scaly hands. The devil then unmasked itself and I saw TRUMP!!! I was so terrified I tried to delete the app but then I started choking and had to go to the ER. DO NOT DOWNLOAD THIS APP!","userName":"chni05","date":"2020-07-09T14:25:42Z","rating":1}},{"id":"6176919990","type":"user-reviews","attributes":{"title":"live laugh love","isEdited":false,"review":"if I could give zero starts I would. disgusting, horrible, awful, atrocious, absolutely devastating to my eyes. at this point, it’s not about what side you are on, if you’re a republican or a democrat, it’s about who is actually educated and who’s now. hello I firmly believe trump is the devil incarnate and all of his followers are walking piles of uneducated poo 💖","userName":"mugs122345","date":"2020-07-09T14:23:20Z","rating":1}}]}