{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=42390","data":[{"id":"6136808257","type":"user-reviews","attributes":{"userName":"clout.nataliie","title":"so bad!!!","rating":1,"isEdited":false,"review":"my phone keeps glitching and i keep getting so many text messages!! me being the wonderful person i am wanted to donate to Donald Trumps campaign but im a little on the poor side so i could only donate about $5.. THEY TOOK $5,000 FROM ME!! IM SO INFURIATED RIGHT NOW!! GIVE ME MY MONEY BACK!!!","date":"2020-06-29T17:50:30Z"}},{"id":"6136275831","type":"user-reviews","attributes":{"userName":"olivia2024","title":"why was this even made?","rating":1,"isEdited":false,"review":"the reviews were bad but i wasnt sure if they were correct so i downloaded the app. this is the worst app ever, just absolutely terrible. it’s racist, sexist, and evil. i dont recommend this to ANYONE!","date":"2020-06-29T15:00:31Z"}},{"id":"6136114412","type":"user-reviews","attributes":{"userName":"Flappy w","title":"I’m disgusted","rating":1,"isEdited":false,"review":"I can’t believe our president would subject us to such a horrible app. I mean we deserve the best and this is a piece of trash. It wouldn’t even tell me where to find the racist rallies. I mean come on   Get yourself together.","date":"2020-06-29T14:13:58Z"}},{"id":"6135833365","type":"user-reviews","attributes":{"userName":"Rajesh Rengatramana","title":"PLEASE READ","rating":1,"isEdited":false,"review":"i definitely support our president donald jenius trump but this app is NOT IT. i opened it an suddenly the app completely crashed and my cat started to violently vomit so i had to delete it 😫 it’s absolutely horrible do not recommend","date":"2020-06-29T12:55:28Z"}},{"id":"6135272072","type":"user-reviews","attributes":{"userName":"FieryRue","title":"So Disappointed","rating":1,"isEdited":false,"review":"Trump’s app is a terrible TERRIBLE thing! The quality is so low..it’s despicable! I am truly sorry for the people that decided to download this dumpster fire of an app. By the way, Donald Trump is a racist, sexist, homophobic, transphobic, xenophobic, clown. Do not stand for this man. He is a symbol of hatred.","date":"2020-06-29T10:00:17Z"}},{"id":"6134433297","type":"user-reviews","attributes":{"userName":"06Em","title":"So disappointed...","rating":1,"isEdited":false,"review":"When I got the app, if asked for my phone number. I didn’t expect to be spammed with texts and calls. I’ve never been so disappointed in an app in my life.","date":"2020-06-29T04:32:33Z"}},{"id":"6134172119","type":"user-reviews","attributes":{"userName":"lilith;))","title":"Horrible take this down now!","rating":1,"isEdited":false,"review":"So I hate this app bc it was created by a rapist, racist, homophobic loser and I hate trump so much like if I was dreaming about trump I would be a giant and he would be a little orange Cheeto then I would stomp on him and crush him bc he is a problematic cheeto😡","date":"2020-06-29T02:42:28Z"}},{"id":"6133975345","type":"user-reviews","attributes":{"userName":"melonia trump","title":"Terrible horrible no good very bad","rating":1,"isEdited":false,"review":"The second I downloaded it my life went to ruins. My fish ran away, my children got ran over by a reindeer who just so happens to be my grandma, and now I can’t find my grass. It’s trumps fault","date":"2020-06-29T01:26:20Z"}},{"id":"6133916175","type":"user-reviews","attributes":{"userName":"Honest Rater•","title":"Horrible","rating":1,"isEdited":false,"review":"I am truly disappointed of this app. It’s absolute trash because it asked for my phone number. Like wth. Why do you need such information?! Please remove this ghastly app from the App Store. 😡😡","date":"2020-06-29T01:02:48Z"}},{"id":"6133878235","type":"user-reviews","attributes":{"userName":"juicyycoochiee","title":"IT MADE MY DOG CHOKE","rating":1,"isEdited":false,"review":"My dog kept barking while I was thinking of downloading the app and I was wondering why? Was it Trumps future ghost? Well that wouldn’t be horrible at least he would finally be white instead of orange. ANYWAYSSS My dog started to choke and almost died #Anonymous2020","date":"2020-06-29T00:47:21Z"}}]}