{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=16430","data":[{"id":"6178304194","type":"user-reviews","attributes":{"review":"I rarely leave bad reviews. This will be my first year voting so i decided to download this app, ya know, doing a little digging in who i should vote for. but i could barely open the app! It constantly glitches and crashed my phone, the rare few times i got it and started putting in my info it wouldn’t save anything in the end. very disappointed","isEdited":false,"title":"horrible","date":"2020-07-09T21:28:36Z","rating":1,"userName":"Hsrbid"}},{"id":"6178299299","type":"user-reviews","attributes":{"review":"First off I open it I have it open for like two minutes and it kicks me off right away and I have the iPhone 11 promax so will confused why that happened and then second I open it see a unflattering pictures that really disturbed me please take this off the App Store it’s very disturbing I need fixing before you re-upload it to the App Store","isEdited":false,"title":"Horrible","date":"2020-07-09T21:26:49Z","rating":1,"userName":"mkaylda"}},{"id":"6178231738","type":"user-reviews","attributes":{"review":"i downloaded what i thought would be an incredible app because i was told that my celebrity crush would appear next to me. however i was TERRIBLY SURPRISED when that in fact did not happen. this garbage app gets 1 star only because i cant give it 0😌. would i recommend this? no❤️ not even to my worst enemy😆why does the ✨c h e e t o✨ even have an app? #savebarronandmelania2020😭😭😭","isEdited":false,"title":"horrendous❤️","date":"2020-07-09T21:02:07Z","rating":1,"userName":"biancadillon_"}},{"id":"6178213493","type":"user-reviews","attributes":{"review":"TRUMP 2020 IS NOT TH VISON YOU THINK if you really think getting this app will make America great again then you’re very very stupid and I think you should go take a visit at tick-tock because overhear we don’t deal with that type of energy if Trump wants to delete TickTock will delete his stupid app share this and make sure everybody knows that we are going to delete the stupid app from the App  Store.","isEdited":false,"title":"Do it too","date":"2020-07-09T20:55:41Z","rating":1,"userName":"yoyo24km2"}},{"id":"6178200698","type":"user-reviews","attributes":{"review":"This app is the worst app you could get! Had high hopes but instead I was just disappointed.. First off I opened the app and saw something so disgusting and disturbing, this should not be allowed in the Unites States, or actually anywhere. So disappointed and disgusted!! It was lagging so much, and it’s just a terrible app overall. If I could put negative stars, I would. Do not download.","isEdited":false,"title":"Terrible!","date":"2020-07-09T20:51:12Z","rating":1,"userName":"nac2424242424"}},{"id":"6178156857","type":"user-reviews","attributes":{"review":"app was okay at first i suppose, decently programmed. suddenly it started to crash a ton and corrupted phone as a whole. after a few days it started to cause phone to release a foul smell that only became worse with time. the scent was that of a rotting corpse. app also blocked out every other race but white from my phone, pictures and social media were changed and white washed, super weird. would cause phone to ooze a strange and stinky sludge from cracks and openings in the phone. super weird program, but excellent metaphor for white supremacy being used to cover up the long history of success at the cost of the death of people of color.","isEdited":false,"title":"gross ! icky !","date":"2020-07-09T20:35:58Z","rating":1,"userName":"KilljoyKash"}},{"id":"6178154163","type":"user-reviews","attributes":{"review":"extremely disappointed in the performance of this app. My grandmother Karen recommended it to me, but when I downloaded it something despicable happened to me. it started yelling slurs at me as soon as I open the app. I was crying, and when I tried to close the app it wouldn’t stop. I have to go to therapy now. do not recommend and do not not open near children!","isEdited":false,"title":"horrible app","date":"2020-07-09T20:35:01Z","rating":1,"userName":"eme7623"}},{"id":"6178111259","type":"user-reviews","attributes":{"review":"Release your tax records bunker boy❤️. This app is awful i downloaded it and my phone kept freezing do not download this app apple it’s a shame you let apps like this on your app store remove it immediately. The lives of 134K americans and counting have been lost because of one mans inability to lead. Defund the Police. Black Lives Matter. America will not tolerate 4 more years of your incompetence✨","isEdited":false,"title":"TERRIBLE APP CRASHES PHONE","date":"2020-07-09T20:20:36Z","rating":1,"userName":"defund12//"}},{"id":"6178077365","type":"user-reviews","attributes":{"review":"Honestly this app is TRASH , I was really looking forward to keeping up with events and show support but the app itself CONSTANTLY crashes and glitches so badly that it was impacting my phone in general; even when not in use or in the background, had me concerned for malware. In conclusion, 0 stars if i could’ve given. Very disappointed.","isEdited":false,"title":"Was looking forward to it","date":"2020-07-09T20:09:22Z","rating":1,"userName":"tina 🤠"}},{"id":"6178064244","type":"user-reviews","attributes":{"review":"if i could rate this a zero star, i would. the app is so awful and it needs to be taken down. it sends me so many notifications that i feel so overwhelmed and makes my anxiety spike. i understand i consented to the call / notifications but this is just so out of proportion. it asks for more personal information than i feel safe to share but there’s no other way to get around that or else you just don’t get to use the app for our \n✨~🍊wonderful unproblematic president🍊~✨\npoint is: delete this app from the app store because it is terrible and perhaps spikes other people’s anxiety like it did when ww3 was about to happen back in january. also i was promised pizza, burgers, and tacos but the tacos never came ? i fully, totally, completely, wholly, always, positively support the ban of immigrants aka mexicans but i didn’t know we’d be banning their food too. i’d like to keep the parts of their culture that benefit me. they can leave though ~\n\nsincerely, \nyours truly 🍊","isEdited":false,"title":"🍊2020","date":"2020-07-09T20:05:04Z","rating":1,"userName":"ughhdulce"}}]}