{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27920","data":[{"id":"6176402578","type":"user-reviews","attributes":{"userName":"🖕🏻🇺🇸","date":"2020-07-09T12:04:50Z","isEdited":false,"rating":1,"title":"DO NOT DOWNLOAD it will brake your phone","review":"Worst app I have EVER downloaded this app gave my phone 15 different viruses so\nI now need a new one, I am hoping Trump plans to pay for my new phone because he is the one who broke it! Do not get this app unless you want your phone to TOTALLY BREAK! WORST APP EVER broke my phone and is so so horrible!"}},{"id":"6176374341","type":"user-reviews","attributes":{"userName":"FelicityF19","date":"2020-07-09T11:57:01Z","isEdited":false,"rating":1,"title":"The review","review":"The only reason why I’m giving this app a bad review is \n1. the Trump administration is trying to take a way TikTok \n2. I don’t support a man who has sexually assaulted women \n3. we have become a laughing stalk to the entire world by how he presents himself( basically he acts like a bafoon)\n4. He has no political insight and has made enemies with other countries that should be our allies. \n\nI am not democrat nor republican . For the reason that both sides corrupt . But in this moment in time I would rather have Nixon or anybody as a President than Mr Trump."}},{"id":"6176367962","type":"user-reviews","attributes":{"userName":"idhd rnksjdbfbf","date":"2020-07-09T11:55:14Z","isEdited":false,"rating":1,"title":"Oompa Loompa","review":"This app is terrible. It was very slow in loading the pages and once it did, a really loud siren sound was coming from my phone. It made my guinea pigs start flying around my room. Then they escaped my house and met up with their other guinea pig friends. Also, it has Donald Trump in it.🤢"}},{"id":"6176288696","type":"user-reviews","attributes":{"userName":"1047285728liz","date":"2020-07-09T11:32:23Z","isEdited":false,"rating":1,"title":"Horrible app 🧡","review":"ok but tell me why in order to download the app it literally took a week for it to download. Like what???? Also when every they showed pictures it was just Orange slices. Like OK!!! And??? Oh wait that’s not all, you know the rainbow right, well how about a rainbow with just one color, you guessed it ORANGE!!!"}},{"id":"6176266400","type":"user-reviews","attributes":{"userName":"alyisstrash","date":"2020-07-09T11:25:42Z","isEdited":false,"rating":1,"title":"absolutely horrible if i could give zero stars i would","review":"this app is the absolute worst app imaginable. it took up way more storage then it said with “patch files” and then next thing i know all of my information is wiped and gone . and within opening the app is makes you agree to vote for trump no matter your political party to continue. and the amount of virus’s i got on my phone and the constant pop up ads is unreal . please please please do not download this app . it’s absolutely horrible ."}},{"id":"6176214111","type":"user-reviews","attributes":{"userName":"SchoolShooterBoi","date":"2020-07-09T11:09:45Z","isEdited":false,"rating":1,"title":"Dissapointing","review":"Everytime i try to load into the app it would freak out and kick me off the app and ive tried redownloading it and shutting off my phone but nothing works app doesnt even work dont even waste your time getting this absolute dissapointment"}},{"id":"6176126711","type":"user-reviews","attributes":{"userName":"KKKofficial","date":"2020-07-09T10:42:56Z","isEdited":false,"rating":1,"title":"absolutely atrocious","review":"first of all, this app took forever to download. second, as soon as I opened the app, it gave my phone a virus and I had to get a new one. the layout is not visually appealing or easy to use; whoever designed it must be a product of generations upon generations of inbreeding."}},{"id":"6175914768","type":"user-reviews","attributes":{"userName":"Me22thaextreme","date":"2020-07-09T09:34:23Z","isEdited":false,"rating":1,"title":"China virus","review":"when i opened the app, a big alert came up and trump began chanting “China Virus.” The app kicked me off and told me I wasn’t white enough to be on the app and told me to go back to where i came from! Unacceptable, I can’t believe someone would have an app that doesn’t even work"}},{"id":"6175907632","type":"user-reviews","attributes":{"userName":"Plesicjfbdkxnq","date":"2020-07-09T09:31:59Z","isEdited":false,"rating":1,"title":"WORST APP EVER!!","review":"The navigation thru the app is all\nmessy. Also my phone kept glitching after i downloaded and it was effecting my facetime call and internet connection. Did not like the app at all. Also downloading this app did not change my perspective on donald trump. Yes it made me aware of his intentions but nah man. not my man."}},{"id":"6175894897","type":"user-reviews","attributes":{"userName":"donotdown/oad","date":"2020-07-09T09:27:39Z","isEdited":false,"rating":1,"title":"DO NOT DOWNLOAD!","review":"If i could give 0 stars i would. The app took 2 days to load, my phone got hacked after signing up and my number got leaked! all of my contacts got changed so i don’t know who is who and i had to get a new phone because it got hacked. Do NOT download this app!"}}]}