{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=143350","data":[{"id":"6179219380","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:16:00Z","userName":"dvthncsttyvc","rating":1,"title":"WORST APP EVER🧚‍♂️","review":"This app is horrible 100% would not recommend when I downloaded it crazy things happens first the was my messages were all gone the there was the whole alien thing and I had to pay $1,000 to get the alien exterminator down here but in the meanwhile I had to do something with the aliens while the exterminator got here so I gave them a little cup of tea  and they drank all my good tea so I had to drink coffee and then they shot my mom with lasers it was just a big mess and I had to clean the blood of the white carpet then when the aliens were finally gone they their ufo ruined my dads perfect lawn"}},{"id":"6179218819","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:15:48Z","userName":"Roxreyrenee","rating":1,"title":"This app was super slow and boring","review":"I couldn’t open the app, it basically took five days, maybe six. I tried really hard to stay awake but I got super blared waiting for it to open. According to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway. Because bees don’t care what humans think is impossible.” SEQ. 75 - “INTRO TO BARRY” INT. BENSON HOUSE - DAY ANGLE ON: Sneakers on the ground. Camera PANS UP to reveal BARRY BENSON’S BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black...oohh, black and yellow... ANGLE ON: Barry wearing the sweater he picked, looking in the mirror. BARRY (CONT’D) Yeah, let’s shake it up a little. He picks the black and yellow one. He then goes to the sink, takes the top off a CONTAINER OF HONEY, and puts some honey into his hair. He squirts some in his mouth and gargles. Then he takes the lid off the bottle, and rolls some on like deodorant. CUT TO: INT. BENSON HOUSE KITCHEN - CONTINUOUS Barry’s mother, JANET BENSON, yells up at Barry. JANET BENSON Barry, breakfast is ready! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 1. INT. BARRY’S ROOM - CONTINUOUS BARRY Coming! SFX: Phone RINGING. Barry’s antennae vibrate as they RING like a phone. Barry’s hands are wet. He looks around for a towel. BARRY (CONT’D) Hang on a second! He wipes his hands on his sweater, and pulls his antennae down to his ear and mouth. BARRY (CONT'D) Hello? His best friend, ADAM FLAYMAN, is on the other end. ADAM Barry? BARRY Adam? ADAM Can you believe this is happening? BARRY Can’t believe it. I’ll pick you up. Barry sticks his stinger in a sharpener. SFX: BUZZING AS HIS STINGER IS SHARPENED. He tests the sharpness with his finger. SFX: Bing. BARRY (CONT’D) Looking sharp. ANGLE ON: Barry hovering down the hall, sliding down the staircase bannister. Barry’s mother, JANET BENSON, is in the kitchen. JANET BENSON Barry, why don’t you use the stairs? Your father paid good money for those. \"Bee Movie\" - JS REVISIONS 8/13/07 2. BARRY Sorry, I’m excited. Barry’s father, MARTIN BENSON, ENTERS. He’s reading a NEWSPAPER with the HEADLINE, “Queen gives birth to thousandtuplets: Resting Comfortably.” MARTIN BENSON Here’s the graduate. We’re very proud of you, Son. And a perfect repo"}},{"id":"6179218786","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:15:47Z","userName":"uhhhhhhhhhhhhhhhh bad","rating":1,"title":"DO NOT DOWNLOAD","review":"This app is terrible I tried to down load it but it would not work when it finally downloaded they took all of my information and hacked my phone they saw me watching a movie now I got a new phone all because of this app 365 days later my account got hacked again DO NOT DOWNLOAD"}},{"id":"6179218757","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:15:46Z","userName":"Xxx_FuCKBoi_xxX","rating":1,"title":"Please read","review":"I was using the app and almost had a seizure and also there where a lot of racist things. this app should be banned"}},{"id":"6179218622","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:15:44Z","userName":"Alex Larkins","rating":1,"title":"Bad","review":"I cannot believe how bad this app is. It made my phone run slow, usually it beats me in a foot race but now I feel like I run super fast compared to my phone. It’s sad."}},{"id":"6179218629","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:15:44Z","userName":"Kaleb Meier","rating":1,"title":"Yup","review":"I just downloaded this and it works amazing. It downloaded so fast! But I want money so for me to up the rating you have to give me a small loan of a million dollars"}},{"id":"6179218528","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:15:42Z","userName":"jcthefarmer","rating":1,"title":"AWFULL!!!","review":"Tried to download this app and I was having issues, then finally downloaded and it was asking for my personal information. I just agree with this! If could I would give ZERO stars."}},{"id":"6179218537","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:15:42Z","userName":"linds1208","rating":1,"title":"TERRIBLE APP","review":"Do NOT download this app it can hack your data and share things from your personal storage on iCloud!!!! It’s a truly terrible app and I’m sorry I ever downloaded it. It doesn’t even work that well and has a confusing layout. It’s NOT WORTH IT DONT DOWNLOAD IT!!!!!!"}},{"id":"6179217929","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:15:28Z","userName":"Watermelon Wonder","rating":1,"title":"App is a complete disgrace to the App Store","review":"I downloaded this app in hopes of doing my part to help and support our magnificent president in his campaign for his second term in office. The minute I downloaded this app, however, I was plagued with many physical and emotional ailments. I began experiencing diarrhea, my twin goldfish died, and all of my tv channels turned into Fox News. In hopes of preventing anybody else from experiencing these ailments, I feel it is my duty as a law abiding citizen to write a 1 star review for this atrocious app. Best wishes to Trump though 🥰✨🧚"}},{"id":"6179217612","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-10T03:15:21Z","userName":"GageFortnite","rating":1,"title":"TikTok","review":"You will not take down TikTok"}}]}