{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21290","data":[{"id":"6175096799","type":"user-reviews","attributes":{"title":"i got hacked😿🙀","review":"i downloaded this app so i could be updated on these things and it STOLE MY LOCATION🤬😡 next thing I know this guy shows up on my door 🚪 step and steals my grandma 👵 and my hamster in exchange for 3 billion dollars 💵 and just LEAVES and the last thing he said was HAIL THE ORANGE 🍊 PRESIDENT and i just CANNOT believe how BAD this app is. DO NOT DOWNLOAD!!! i haven’t seen my hamster 🐹 and grandma 👵 in years now 🤬😿😿","date":"2020-07-09T04:38:09Z","userName":"24violets_","rating":1,"isEdited":false}},{"id":"6175095808","type":"user-reviews","attributes":{"title":"Terrible horrible app","review":"This app is horrendous!!! Once I go on the app it make my phone really hot and it shuts down in less than 2 minutes! And this ONLY happens when I use this app. I thought Trump would have enough money to make a better app, instead he’s probably using the money to buy more guns for the army. NEVER AGAIN!!!","date":"2020-07-09T04:37:50Z","userName":"Pam-a-lama Ding-dong","rating":1,"isEdited":false}},{"id":"6175094212","type":"user-reviews","attributes":{"title":"a horrible app that murders many","review":"😭yesterday 🥰at 4:20 pm i opened my lovely cheeto fluff app but what concerned me was my dog started choking😋 on his bag of cheetos. 🔫😡you might be thinking this must be a coincidence but no next thing my dog starts 😭screaming trump 2020🙊❌ unfortunately after that remark i had my dog put down.✅ i’m very upset that my life long friend had to end up this way📵. the way this app completely tortured martha the talking dog is unacceptable... 🤨i am in disbelief of all that this❇️ horrible app is capable of and i 🚼hope it is shut down immediately or i must speak to the manager🛍 xoxo- karen 🚻from trader joe’s.🙊","date":"2020-07-09T04:37:19Z","userName":"bobby long john swans","rating":1,"isEdited":false}},{"id":"6175085885","type":"user-reviews","attributes":{"title":"AWFUL APP","review":"This app caused my phone all sorts of problems! Right after I downloaded this app all of my photos went missing and my phone played a high pitched noise!!! >:( This app is definitely a hacker website. DO NOT DOWNLOAD. A monkey could’ve made a better app. I would never think about downloading a Trump app after this bad experience!","date":"2020-07-09T04:34:38Z","userName":"jizzfart2020","rating":1,"isEdited":false}},{"id":"6175066389","type":"user-reviews","attributes":{"title":"this app killed my entire family!!","review":"i’m an avid trump supporter and trump is my whole life i love the sexy cheeto bunker boy. however, once i downloaded this app my phone got super glitchy and it stole all of my info and then got my ip address and then came to my house and killed my family. however i do not blame my lord and savior trump for this occurrence, but i do blame this app. there’s no point of fixing it, you should just delete it off the appstore. anyways, my family were stupid libtards so honestly i don’t care, but i would hate for a maga family to be killed. #trump2020 #cheetoboy #bunkerboy","date":"2020-07-09T04:28:32Z","userName":"tiktokthotttt","rating":1,"isEdited":false}},{"id":"6175061469","type":"user-reviews","attributes":{"title":"Has anyone seen my phone?","review":"I downloaded this app and then my phone immediately disappeared I have no idea where it’s gone and normally when I lose it I wind up finding it under my pillow inside my refrigerator and as soon as I checked there for it I died. So if you see my phone will you let me know? Thanks.","date":"2020-07-09T04:27:01Z","userName":"VannaGames","rating":1,"isEdited":false}},{"id":"6175039999","type":"user-reviews","attributes":{"title":"WORST APP EVER DO NOT DOWNLOAD","review":"This app has been bad for my iPhone but it does not even have the time of my money or anything. I don’t want to go get any closer than that I’m gonna is the day that you can still be like that omg. If you download this app you will have trouble getting friends. Nobody cares about you if you get this app. It stole my shirt that says “I love Obama” too!!!","date":"2020-07-09T04:20:21Z","userName":"yikes_oh_no","rating":1,"isEdited":false}},{"id":"6175032762","type":"user-reviews","attributes":{"title":"Did a piece of kfc chicken make this app?","review":"I’ve never seen such a flaming pile of dump for an app.  At no point did any of this app work properly or make any sense at all.  I’m now dumber for having tried to navigate this app.  Everyone who has used this has lost valuable time in there life and regressed.  Peace be with you and may god have mercy on your soul.","date":"2020-07-09T04:18:03Z","userName":"orangebigmac","rating":1,"isEdited":false}},{"id":"6174892131","type":"user-reviews","attributes":{"title":"Trump 2020","review":"Got the app for updates on my fav prez but it broke my phone. I had to get a new one. I was using the app and it froze & wouldn’t let me exit as random number went across the screen. My phone eventually shut off and never turned back on no matter what I tried, even took it to the Apple store:/","date":"2020-07-09T03:34:19Z","userName":"nina583738","rating":1,"isEdited":false}},{"id":"6174891280","type":"user-reviews","attributes":{"title":"Worst app in the world","review":"I saw this app and then I decided to see what trash stuff is on it and then all my stuff on Minecraft disappeared like I didn’t delete my world and last time I played I pressed save and quit so it proves that you shouldn’t download this app it would ruin all  you Minecraft worlds ☹️😭 this app needs to be taken of apple","date":"2020-07-09T03:34:04Z","userName":"Canned Chikan Nugget Man","rating":1,"isEdited":false}}]}