{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30510","data":[{"id":"6174792506","type":"user-reviews","attributes":{"title":"Awful","review":"Horrible.  It was supposed to be a perfect app.  It is perfect.  Perfectly stupid.    It is very very terrible. People are saying it is a Democrat hoax and not a real app. Maybe it would be a good app if people stop using it.  I think the ratings will go up if people stop using it.","date":"2020-07-09T03:05:05Z","userName":"iloveprojects","rating":1,"isEdited":false}},{"id":"6174770842","type":"user-reviews","attributes":{"title":"I want to talk to the manager","review":"To my complete and utter disappointment, this app was very glitchy. It caused my phone to completely shut down several times. I can’t even begin to express how mad and disappointed I am. I will be calling the manager.","date":"2020-07-09T02:58:25Z","userName":"Karen Jessica Smith","rating":1,"isEdited":false}},{"id":"6174761037","type":"user-reviews","attributes":{"title":"Male Supervision","review":"One of the first apps I was given permission to download but it won’t let me use it without my husband’s supervision :/ I know women shouldn’t have this much freedom but i was excited to use it while my husband worked and when I finished my cleaning duties :(","date":"2020-07-09T02:55:28Z","userName":"Miss Ogyny","rating":1,"isEdited":false}},{"id":"6174750207","type":"user-reviews","attributes":{"title":"Worst App to Exist","review":"Completely ruined my life and caused irreparable change. It ate my dog and burned my fridge down 😭 it gave me some serious anxiety and caused some weight gain 👀 Caused my fish to drown, my dog to turn to feces and obliterated my fridge 😭this app also holds the power of a ra(c,p)ist (interchangeable) and completely spread a virus throughout its users 😭✨","date":"2020-07-09T02:52:10Z","userName":"katiexoxo___❤️","rating":1,"isEdited":false}},{"id":"6174743094","type":"user-reviews","attributes":{"title":"Didn’t fit!","review":"This runs big so when u consider buying go a size down so it will fit better. It’s also see thru so very disfunctional in a public setting. Not high waisted either. Would recommend something else.","date":"2020-07-09T02:50:00Z","userName":"skdjsbdisjxbab","rating":1,"isEdited":false}},{"id":"6174734833","type":"user-reviews","attributes":{"title":"Disgusted","review":"This app MADE ME SICK I cannot believe you decided to make me look at those things! Children  use these phones!! I thought this was about to be about our wonderful leader, but I am very disappointed. Would never recommend getting","date":"2020-07-09T02:47:27Z","userName":"Morganks","rating":1,"isEdited":false}},{"id":"6174732182","type":"user-reviews","attributes":{"title":"Horrible!!","review":"This app was suggested to me by a friend on tik tok. He claimed this app could solve all problems in the world. Boy was he wrong. Just like the rate of unemployment, funding for public schools, and human rights in this country, the app kept CRASHING!! SO SAD! I feel harassed, violated, and lied to. The same emotions that are associated with the man in charge of it!","date":"2020-07-09T02:46:41Z","userName":"HannahBanana112","rating":1,"isEdited":false}},{"id":"6174727493","type":"user-reviews","attributes":{"title":"Trash","review":"I was on the app just now thought it was going to be good but it didn’t work because they knew I was Mexican and restricted Mexicans from using. Highly disappointed and hate this app. Hope they just delete it at this point.","date":"2020-07-09T02:45:15Z","userName":"holy ch","rating":1,"isEdited":false}},{"id":"6174721584","type":"user-reviews","attributes":{"title":"Horrible app","review":"This app made my house haunted by demons. Last night, one of the demons (I named him fluffy) tried to grab me by my toes and pull me off my bed and down to h*ll. Another demon tried to kill my pet pterodactyl named peaches. I didn’t appreciate it. Don’t get this app unless you want demons to haunt your house.","date":"2020-07-09T02:43:29Z","userName":"ZneG❤️","rating":1,"isEdited":false}},{"id":"6174716762","type":"user-reviews","attributes":{"title":"Trash of an App","review":"I swear this app gave my phone a virus. Everything was fine until I downloaded this!! Now my phone won’t stop glitching and won’t even let me use half of my apps!! Extremely disappointing. I do not recommend. At. All.","date":"2020-07-09T02:42:01Z","userName":"Concerned!2020","rating":1,"isEdited":false}}]}