{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21680","data":[{"id":"6174751231","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"Oh my gosh I have so many issues by looking at this horrible man’s face he’s so orange an ugly he’s like a freaking clownHow are you supposed to make America great again looking likeThatI do not like Donald Trump because he’s about to delete Tik Tok I came out here for Tik tok  just nowNobody like you Donald Trump fat bozo please delete this app immediate","date":"2020-07-09T02:52:29Z","title":"Worst app ever make the App Store right again","userName":"choice.t"}},{"id":"6174749292","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This app is disgusting it personally made me cheat on my non existent husband 😭😭😭 I’m only -69 I’m not that old this app is horrible do not download it!! My cat also got lifted from heaven back to earth because no one wanted him WHY MR PRESIDENT WHY. My new boyfriend;) um his name is nonexistent cheated on me after I got this app I wish you could do 0 stars smh 🙄🙄 dumb app delete it. It’s a waste of space..","date":"2020-07-09T02:51:54Z","title":"HORRIBLE","userName":"yeah 😘😘"}},{"id":"6174746613","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I downloaded this app right when I woke up. It started off like any other morning. I got dressed and went to work, came home and had dinner. As I took off my shoes, all of my toes began falling off and turned into Cheetos. I stared at my now snack-like extremities and began to lose my vision. Donald Trump’s app is the reason I am now blind and toeless.","date":"2020-07-09T02:51:05Z","title":"This app ruined my life","userName":"Ermalrr"}},{"id":"6174725343","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I downloaded this app and immediately started to projectile vomit. It was some serious Exorcist stuff honestly I think a demon actually possessed me when I downloaded this app I really do not recommend whatsoever at all enough to stay in the ER because no doctors can figure out what’s happening to me. Help","date":"2020-07-09T02:44:38Z","title":"0 stars but that's not possible","userName":"kelp_shake44"}},{"id":"6174720612","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"The moment I downloaded this app my life ceased to have any joy in it. Everyday I’m plagued by the darkness surrounding this app. No food can come of this app. It gave my iPhone a virus? How is that even possible? Filled with hateful messages, misinformation, nightmarish imagines or an orange man. This app keeps me up at night. Please do what is right and get rid of this app.","date":"2020-07-09T02:43:12Z","title":"Disappointed","userName":"Alivia Lind"}},{"id":"6174719974","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I just got home and i is a fun night to go get some stuff to go get food for dinner and maybe get lunch with you and then i go hang with you guys I don’t want you too much but it’s so much better then yeah I don’t want you too much to do say anything you don’t wanna hang up in my bed and I wanna hang in the shower you know what you wanna get you.","date":"2020-07-09T02:42:59Z","title":"Yeah I get to go","userName":"Sidbid447"}},{"id":"6174717355","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This app gave me NIGHTMARES when I opened it!!? NOTHING has ever given me so many nightmares as this app has. THAT SHOULD SAY SOMETHING!!! Then this happened: I opened the app and all I see is this extra large Cheeto puff... not a nice sight especially when it doesn’t have any clothes on... why would a Cheeto puff need to get a spray tan? I’m pretty sure it’s always been a natural orange color?💀🗑🗑🗑🗑","date":"2020-07-09T02:42:12Z","title":"🗑🗑🗑🗑🗑","userName":"Galileuhh"}},{"id":"6174715803","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"Okay so this app told me I was gonna get Cheetos and instead I got a really sad bag of doritos and I don’t like Doritos but also the Doritos smell like an old rapist and racism. DONT DOWNLOAD THIS APP. IT IS LITERALLY THE WORST APP EVER. Also, someone else said that the app broke their microwave, this app also broke my freezer. All of my ice cream is melted and now I have to throw it all away like I had to throw away the Doritos. This app is just sad.","date":"2020-07-09T02:41:43Z","title":"Worst App EVER","userName":"CandiceJoy218"}},{"id":"6174711762","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"In all honesty I came here just to mess with the trump administration. However I tried my hardest to use the app regularly. It is buggy as hell. This app crashed on me three times before I could even signup properly.  I just decided to delete the app. If the big T can’t even make an app, then get out of office.","date":"2020-07-09T02:40:31Z","title":"Kinda buggy","userName":"bighomie2"}},{"id":"6174706109","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"Soon after I downloaded this my phone, I realized that it was TAPPED. I would leave my phone turned off and find it open to this app. I began receiving spam calls, texts, emails, and mail all about Trump. I realized my phone calls and videos were tapped. MY PRIVACY WAS GONE and every single device connected to my Apple ID. AWFUL APP PRESIDENT TRUMP!! 0 STARS IN MY BOOK","date":"2020-07-09T02:38:47Z","title":"HACKED MY PHONE","userName":"kenenennenenene"}}]}