{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=24050","data":[{"id":"6176907096","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T14:20:00Z","isEdited":false,"title":"Made my phone crash","userName":"nipplenippynipsnipple","review":"I tried opening it up and after five minutes it made my phone glitch for about 10 seconds then took me off the app. I tried doing it again and the same exact thing had happened."}},{"id":"6176905441","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T14:19:35Z","isEdited":false,"title":"It wasn’t the greatest experience...","userName":"LisyLovesComics","review":"I went on and it was very slow and I just didn’t have the best overall experience when I got it I tripped and fell down the stairs my mom came running to check me and tripped and fell on top of me and broke my rib cage so yeah I’m possibly dead from this app. I’m too young to die..."}},{"id":"6176842706","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T14:03:05Z","isEdited":false,"title":"Horrible App 🤢🤢","userName":"oufkiryussef","review":"I downloaded this app with high hopes of a great user experience. Unfortunately, it took 23 hours to download! When it finally opened, I discovered it contained a virus and it made my phone very buggy. I am very disappointed in the quality of this app. Such trash. I am shook by the trashiness. Oh, and BLACK LIVES MATTER!!!!"}},{"id":"6176842220","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T14:02:58Z","isEdited":false,"title":"DO NOT DOWNLOAD","userName":"Hollok","review":"No matter how many times restarted my phone the app kept crashing!! After about a week of having it I started noticing my other apps CRASHING as well. This has never, EVER happened to me before. We need to hold president Trump accountable for this abomination of an app and make the app store great again!"}},{"id":"6176841067","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T14:02:39Z","isEdited":false,"title":"Terrible","userName":"🌺☺","review":"The audacity that this man had to release this app is ridiculous. It’s terrible, slow, crashes constantly, and above it all it was made by a racist, homophobic, sexist pig who thinks he’s actually making a good impact on America. Overall disgusting, both the app and said man, and I’d give both 0 stars if I could."}},{"id":"6176837511","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T14:01:43Z","isEdited":false,"title":"Scared for my Life","userName":"Erica Zingone","review":"I was using this app to support the great and almighty Cheeto when all of a sudden I got a text from someone. So I obviously go check and it says that it was a moderator from the app and they were saying how cute I was because they can see me through my camera! I was very disturbed. DONT GET THIS APP BECAUSE THEY CAN SEE YOU AND HEAR YOUR CONVERSATIONS."}},{"id":"6176743395","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T13:36:54Z","isEdited":false,"title":"Worst app I’ve ever experience","userName":"hgowowiviwwjwkg","review":"Every aspect about this app is horrible. The graphics are repulsive and the name “Trump” sounds like nails on a chalkboard. The moment I opened it for the first time I was nauseous INSTANTLY and ended up being hospitalized for a few days. Please avoid this app if you care about your physical and mental well being!"}},{"id":"6176716291","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T13:29:46Z","isEdited":false,"title":"phone glitchy?","userName":"tori🥰👄","review":"after this app took TWELVE HOURS to download, i started seeing weird things happening. \n\nmy phone usually works super well and it started glitching? my camera turns on and off... my apps started deleting. tiktok deleted off my phone?\n\ni wish i could give 0 stars..."}},{"id":"6176683331","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T13:21:05Z","isEdited":false,"title":"HORRIBLE APP!!","userName":"moonmermaidx","review":"It immediately asked for my PERSONAL PHONE NUMBER??? Why does the president want this type of information? Doesn’t he want to PROTECT his citizens from DATA BREACHING??? I am disgusted that he would even think of asking me to give out PERSONAL private information for his campaign. He’s worse than Facebook! 0/10 do not download this app!"}},{"id":"6176675491","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-09T13:19:01Z","isEdited":false,"title":"THE WORST APP EVER😡","userName":"berry b besnsent","review":"This app should not even be here. You can’t even open it all it does is glitch. I’m not sure why no one has fixed this. The cover of the app is very offensive and I am not even sure what the app does because I haven’t been able to get into it. Please save yourself and don’t use this app."}}]}