{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=33300","data":[{"id":"6176778884","type":"user-reviews","attributes":{"userName":"ava bo vava","date":"2020-07-09T13:46:15Z","isEdited":false,"rating":1,"title":"my grandma had a heart attack","review":"so my entire family is democratic and hates trump. i hate trump too but i wanted to see if there was actually some good in him. so i downloaded the app to look through it. the app is poorly made btw. would not recommend. so one day my grandma was looking through my phone cause she’s weird and saw the trump app! she was so shocked and upset she had a heart attack and died. i’m writing this at her funeral today. thanks a lot trump, you killed my grandma."}},{"id":"6176778508","type":"user-reviews","attributes":{"userName":"natg6729","date":"2020-07-09T13:46:09Z","isEdited":false,"rating":1,"title":"HORRIBLE!!","review":"this app is the WORST. to start it took days to download and once it did download my phone started GLITCHING. i could hardly click on anything without my phone oddly glitching and then the screen would blackout. NEVER EVER DOWNLOAD THIS APP. and to think trump was a “good” person."}},{"id":"6176774471","type":"user-reviews","attributes":{"userName":"Ava😤","date":"2020-07-09T13:45:03Z","isEdited":false,"rating":1,"title":"Worst app ever","review":"First of all this app took multiple hours to download and then when I finally got on it they asked for my phone number what are going to do with my phone number probably sell it 😡🤬"}},{"id":"6176772945","type":"user-reviews","attributes":{"userName":"LGBTQ+ Rights","date":"2020-07-09T13:44:39Z","isEdited":false,"rating":1,"title":"Horrible app","review":"This app made my phone glitch so bad.  I couldn’t use my phone correctly for a few hours and it’s just a terrible app.  It doesn’t even have any good content!!!  If I could rate it negative stars I would!!!"}},{"id":"6176765375","type":"user-reviews","attributes":{"userName":"trumps leg","date":"2020-07-09T13:42:36Z","isEdited":false,"rating":1,"title":"This app was hurting my brain","review":"I was thrilled to download this app and ready to finally use it but once I opened the icon, I saw a big orange racist, sexist, homophobic.. (the list goes on) man demanding my number for extra notifications. I want nothing to do with this crybaby."}},{"id":"6176754936","type":"user-reviews","attributes":{"userName":"Will Extreme","date":"2020-07-09T13:39:54Z","isEdited":false,"rating":1,"title":"It’s just bad","review":"The app is just plain bad. It’s a waste of space and all you do is look at a wrinkly Cheeto. It takes so long to download and when it finally downloads it won’t even open up the app. It’s just terrible."}},{"id":"6176754308","type":"user-reviews","attributes":{"userName":"celaenacortland1","date":"2020-07-09T13:39:44Z","isEdited":false,"rating":1,"title":"bad.","review":"absolutely horrible and useless. gave me negative vibes and made me feel upset. lagged a lot and didn’t let me do anything. in fact it kicked me out when i tried to open it up and called me an idiot. i feel very harassed and oppressed TAKE THIS APP OFF"}},{"id":"6176753081","type":"user-reviews","attributes":{"userName":"A Roblox Player:)","date":"2020-07-09T13:39:24Z","isEdited":false,"rating":1,"title":"HORRIBLE!!!","review":"i downloaded it and everything was fine. then i started noticing i was a getting a bunch of trump things/advertisements EVERYWHERE. tv, phone, computer, tablet etc. the app hacks your phone and tracks you!!! don't download!!!"}},{"id":"6176745541","type":"user-reviews","attributes":{"userName":"str.6.7","date":"2020-07-09T13:37:28Z","isEdited":false,"rating":1,"title":"Could have done better","review":"My phone crashed several times downloading my storage is nearly maxed out and the app it’s self could have been way more intuitive"}},{"id":"6176737326","type":"user-reviews","attributes":{"userName":"jejsbbsjssn","date":"2020-07-09T13:35:18Z","isEdited":false,"rating":1,"title":"never again 💗","review":"i honestly had high hopes for this app but it took 1 year to actually download onto my phone and every time i try to access the app my phone starts burning. This app is a terrible mistake :)"}}]}