{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=9490","data":[{"id":"6176958878","type":"user-reviews","attributes":{"userName":"Davin54321867","review":"I was so excited to support Mr orange by downloading this app. This is one of the worse apps ever because it took several hours to download this crap and once I got into the app my phone started to over heat and my phone crashed. Now whenever I log into my phone it starts to crash every minute which made it so difficult to talk with my employees in my business. My stocks have going down and now my life is ruined. Thanks to this app!","rating":1,"date":"2020-07-09T14:33:35Z","title":"Ruined my life","isEdited":false}},{"id":"6176957259","type":"user-reviews","attributes":{"userName":"mr. cornnelious grenorny","review":"This app is bonkers!!! When I opened it after downloading, I immediately was notified by an outside source that my phone was hacked and that if I didn’t pay 100,000 phat dollars, I would be sent all of Mr. President’s nudes. My golly gee!!! I didn’t believe them so I just went on with my day, even though the app is super glitchy and useless. However, I did infact receive Mr. President’s nudes 3 days later. Disgusting!!! His chode sure ain’t going to make this country great again!!! #anyonebuttrump2020","rating":1,"date":"2020-07-09T14:33:09Z","title":"😡","isEdited":false}},{"id":"6176938808","type":"user-reviews","attributes":{"userName":"gummybear1427","review":"I am a very loyal supporter of our president and love getting more insight about him and his actions as president. However this app is awful, made my phone crash several times. When i would go on the app it was very slow and my phone would over heat to the point i couldn’t even hold it. Not only was the app damaging my phone it also did not function properly, it was slow and hard to work.","rating":1,"date":"2020-07-09T14:28:15Z","title":"The worst app i’ve ever downloaded","isEdited":false}},{"id":"6176934877","type":"user-reviews","attributes":{"userName":"PostmanCLT","review":"i downloaded this app to show support for MY president. in return i got bombarded with spam emails from china saying that they have all my private information! my phone then shut down, my alexa exploded, and my lights shut off. i then got a knock on my door from three men in suits saying that my phone number was now on the fbi watch list. absolutely disgusting. not only to mention this app shows disgusting images of Trump curb stomping my grandma and throwing babies into the ocean.","rating":1,"date":"2020-07-09T14:27:13Z","title":"TRUMP 2020","isEdited":false}},{"id":"6176933608","type":"user-reviews","attributes":{"userName":"@DESTINY_MORRISSEY","review":"I downloaded this app to see what trumps plans were and it did not work. I thought he promised Spencer Reid would show up in my bedroom and it failed I tried multiple times. Please fix the bugs. P.S. next time you try to take something away from us that gives us some kind of human reaction think again. We make up a lot of the new voters. I’m a trump supporter but if my human interaction gets taken away so will your presidency 😊","rating":1,"date":"2020-07-09T14:26:54Z","title":"🧚🏼✨you tried✨🧚🏼","isEdited":false}},{"id":"6176862548","type":"user-reviews","attributes":{"userName":"Justinsgirl:)","review":"I have had this app only for a day but it keeps crashing and when it lets me in it glitches a lot. I borrowed my friends phone to see if it was the same as mine and it was! Also all this positive feedback about trump was so incorrect! Most of the stuff he didn’t even do. Please tell me you are going to get rid of this app. If you don’t you will get kicked out of the App Store because your reviews are terrible. #DumpTrump","rating":1,"date":"2020-07-09T14:08:19Z","title":"This app is terrible!","isEdited":false}},{"id":"6176833141","type":"user-reviews","attributes":{"userName":"The weldon","review":"This app took forever to download and when it did went through my phone and hacked it. Please do not buy this or support someone as hurtful and racist and Trump! Stand up for your rights bc this is bs. Not to mention that the advice here gave my food poisoning and athletes foot and more. Trump is a liar and OMG he reminds me of feet and crust! He is truly horrible he is a weirdo that is way to obsessed with self tanner, a fried chicken addict, a little bit of a self obsessed crocheter, a salt lamp licker and overall crazy","rating":1,"date":"2020-07-09T14:00:35Z","title":"No just no 🧚✨","isEdited":false}},{"id":"6176777355","type":"user-reviews","attributes":{"userName":"SwagerMcjager","review":"As a Trump supporter because he’s totally not racist and not homophobic and all of that, I am completely and utterly disgusted with this app. I had the highest expectations for this app but when I got it, it was glitchy and hacked my phone. My phone got hacked and I spent a week getting it fixed. The app is also tracking me and can see data from my phone and a bunch of personal stuff of mine. I feel violated and I think this app needs to be shut down.","rating":1,"date":"2020-07-09T13:45:50Z","title":"HORRIBLE DO NOT DOWNLOAD RUINED MY LIFE","isEdited":false}},{"id":"6176774298","type":"user-reviews","attributes":{"userName":"Purple LeeAnn","review":"I gave this app my mobile phone number because I trust our beloved president. I was wrong to do this. Worst Campaign app ever!! 😤 It spammed my phone for inappropriate reasons such as telling me to appreciate myself and be proud of my gender. As a beautiful, blond, white republican woman this was very upsetting to me! Everyone knows that our only purpose as women is to produce crotch gremlins. I know our darling president would never condone of this app. This app is FAKE NEWS! I will be eagerly awaiting improvements.","rating":1,"date":"2020-07-09T13:45:01Z","title":"Needs Improvements","isEdited":false}},{"id":"6176672621","type":"user-reviews","attributes":{"userName":"brittnay fitzgerald","review":"Took forever to download, constantly my phone was vibrating from the app, and the app got hacked. this is the worst app ever i kept trying to fix it but all it did was get worse. all i was trying to do was get in the app put it kept kicking me out. the app makes no sense i suggest deleting the app or your phone will vibrate like crazy, get hacked, you won’t be able to go in the app at all, and you will have to delete the app.","rating":1,"date":"2020-07-09T13:18:13Z","title":"The worst ever","isEdited":false}}]}