{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21500","data":[{"id":"6178757724","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Horrible just horrible 😤","userName":"Violet_♡","review":"You know I was expecting something amazing and more exiting when opening this app for the first time. But instead I just feel very disappointed, I just see an orange, an annoying orange no less, and nothing more than an annoying orange. Truly disappointed.😠","date":"2020-07-10T00:24:55Z"}},{"id":"6178682318","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Trump 2020","userName":"ᗪㄖ尺卂","review":"I am so sorry this app is soo SCARY I would first off like to point that I started to get creepy messages sayin that I need to vote for trump or they will hurt me soo I WOULD LIKE TO SAY THAT THIS APP IS THE MOST DANGEROUS APP IT THREATENS ME AND MY FAMILY SECOND SOMEONE WAS SENDING ME THEIR NUDES AND I DO NOT LIKE THAT 3 SOMEONE WAS ALWAYS BANGING ON MY DOOR WHEN I DIDNT DO WHAT THEY WANTED ME TO DO STAY SAFE PEOPLE AND PLEASE GIVE THIS APP A 1 STAR FOR PUTTING MY LIFE AND MY FAMILIES LIFE IN DANGER STAY AWAY FROM THIS APP PLEASE MY KIDS LIFE ARE IN DANGER TO JUST WARNING YOU AND TELLING YOU THE EFFECTS OF THIS APP","date":"2020-07-09T23:55:52Z"}},{"id":"6178644130","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Gave me a virus","userName":"Omar Diagne","review":"Any app I would open would close immediately and after a while my phone wouldn’t turn on anymore. I had to spend £75 just to get my phone back but I lost precious pictures that held sentimental value. This app took away the last video I have of my late father. 1 Star.","date":"2020-07-09T23:40:57Z"}},{"id":"6178641948","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"😭😭😭","userName":"*ssh*le","review":"I decided to download the app and I totally regret it now. It took me at least a week to download, then I put my number and other stuff. Soon after I started to get creepy messages and yesterday it said I got a virus. I quickly powered off my phone and turned it on today but I’m still scared 😱","date":"2020-07-09T23:40:02Z"}},{"id":"6178634757","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Don’t download","userName":"12::3-avax","review":"Not only did everything in my room turn orange my bed is now stuck in the wall I have a orange man stuck to my roof and the app told me Obama would come to my house it’s been 4 days and still no Obama I am appalled by the lies that I have been told also my eyeballs burst into flames as I opened it I am now blind and still a Virgin","date":"2020-07-09T23:37:19Z"}},{"id":"6178599103","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"It grabbed me!","userName":"LovelyLeeT","review":"This app is promising.  Like a cup of hot covfefe, it is steamy and sweet. Yet... it leaves me wanting more. Specifically: a competent and moral leader.  Someone who loves his fellow citizens -all of them- more than his economy or his shot at re-election.  Someone who is not a division-sowing, anti-science fascist hoping we ignore our climbing death toll and his increasing tendencies towards authoritarianism.  Someone who doesn’t rule via executive tweet.","date":"2020-07-09T23:23:17Z"}},{"id":"6178411779","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Waste of storage","userName":"Dullcee","review":"This app wastes a ton of storage. My phone started working badly because of it. Additionally, it constantly glitches, making it hard to use! I just got a brand new phone too! I’m glad sprint offer a 1 month window to return your phone!  Wasn’t expecting this to happen tho. 😤😡","date":"2020-07-09T22:09:34Z"}},{"id":"6178405733","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"It freezes up too much","userName":"Murazi163","review":"Using this app I tried going in. All it kept doing was freezing up and taking me out of the app. I know it’s not my phone cause it’s new. Even when I shut my phone off it does the same thing. If I could give this negative stars I would. I’m going to delete","date":"2020-07-09T22:07:14Z"}},{"id":"6178319274","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This app is horrible","userName":"what ever stuped app","review":"Just trying to see some plans of Trump and you know what happens it crashes kicks me off just saying no one get this app rate it one star like what the heck people like people want a good app that actually tells the truth and doesn’t crash it and doesn’t kick you off like what the heck","date":"2020-07-09T21:34:10Z"}},{"id":"6178278374","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"No","userName":"Tristan_3674","review":"This app could definitely be more than what it is. The president being THE PRESIDENT obviously has access to the best professional tech people, but somehow made the most trash app.  The president doesn’t show any consideration concerning his citizens and its truly childish and annoying.  Let me know when we get a good worthy, leading, unselfish, educated president.","date":"2020-07-09T21:19:08Z"}}]}