{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31460","data":[{"id":"6177393431","type":"user-reviews","attributes":{"review":"As soon as I opened this app I saw a peló de elote man 😐I was scared and my phone had hella virus as soon his nudes popped up🤮 I was traumatized anyways don’t download this app and give it a 1 star review pls I’m sure he didn’t mean all this🥺 I almost died please I’m telling you no not vote for peló de elote man he is a rapist, sexist, racist ext.","title":"Horrible 🥺✨","userName":"privet again","rating":1,"date":"2020-07-09T16:35:37Z","isEdited":false}},{"id":"6177389167","type":"user-reviews","attributes":{"review":"This app crashes almost every single time I try to open it and is extremely difficult to navigate when I actually can get the app open.","title":"Disappointing","userName":"DeeDee97","rating":1,"date":"2020-07-09T16:34:22Z","isEdited":false}},{"id":"6177376066","type":"user-reviews","attributes":{"review":"This app keeps crashing my phone and when I actually get to open it it looks like a child slapped together some clip art as a fake news story. I can’t help but feel this app does not give me the best news ✨","title":"Unprofessional","userName":"republicans against trump","rating":1,"date":"2020-07-09T16:30:22Z","isEdited":false}},{"id":"6177366979","type":"user-reviews","attributes":{"review":"this app is the most disgusting thing i’ve ever seen, i actually cant stop throwing up every time i look at it, it’s gotten so bad that the doctors said my throat is permanently lost from how bad it’s burned from throwing up so much. donald trumps actually TOOK MY VOICE FROM ME.","title":"horrible","userName":"{izzy37294739}","rating":1,"date":"2020-07-09T16:27:43Z","isEdited":false}},{"id":"6177345429","type":"user-reviews","attributes":{"review":"I was told that when I download the app, spencer reed from criminal minds and Damon Salvatore from tvd were going to show up at my house and spend the day with me well THAT WAS FALSE AND IM EXTREMELY UPSET SO ONE STAR NO BODY CAME AND THE APP TOOK WEEKS TO DOWNLOAD ABSOLUTELY HORRIBLE AND ZERO STAR WORTH BUT THERES BO OPTION SO I PUT A ONE STAR REVIEW thank you for your time although I’m completely unsatisfied 😡😡","title":"FALSE ADVERTISING","userName":"Lily May Rose","rating":1,"date":"2020-07-09T16:21:29Z","isEdited":false}},{"id":"6177313162","type":"user-reviews","attributes":{"review":"I decide that get this app to help my amazing presendent win the election. To my surprise their was concrete evidence of 22 rapes when I first opened the app. I am in utter shock and am terrified of my presendent. I decided not to vote for trump this coming election and become a better person than all these dumb thumpies.","title":"Horrible","userName":"emo pagemo","rating":1,"date":"2020-07-09T16:12:33Z","isEdited":false}},{"id":"6177306597","type":"user-reviews","attributes":{"review":"It makes my phone crash 24/7, and overall takes too much space in my phone. The quality is not 5 stars, and it does not deliver news correctly","title":"This is Wack","userName":"youarelazy","rating":1,"date":"2020-07-09T16:10:45Z","isEdited":false}},{"id":"6177287536","type":"user-reviews","attributes":{"review":"I got this app as a joke, but all it does it crash. I cant even open it to see what is in it without it shutting the whole phone down. I then have to restart my phone and it just wastes my time.","title":"Horrible","userName":"Future_Mrs.Bieber","rating":1,"date":"2020-07-09T16:05:14Z","isEdited":false}},{"id":"6177285227","type":"user-reviews","attributes":{"review":"I was hoping that this app would help me find something good in trump, but it turns out you can’t find that no matter how hard you try so it was useless and the app is awful and it should be deleted","title":"really bad app","userName":"ecs1818","rating":1,"date":"2020-07-09T16:04:34Z","isEdited":false}},{"id":"6177282373","type":"user-reviews","attributes":{"review":"Well I can on here to support our oompa lumpa president and the app was working very good at first but then weird stuff started to happen the app started to freeze up and then on my walls explicit language started to pop up I felt very much uncomfortable with this app I DO NOT RECOMMEND","title":"Tik tok 🧚🏼✨","userName":"glo 🌝","rating":1,"date":"2020-07-09T16:03:45Z","isEdited":false}}]}