{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=126860","data":[{"id":"6178071740","type":"user-reviews","attributes":{"date":"2020-07-09T20:07:34Z","rating":1,"isEdited":false,"title":"Piss rights!","userName":"piss, yum!","review":"I am very disappointed in this app because Donald Trump refuses to legalize piss."}},{"id":"6178071672","type":"user-reviews","attributes":{"date":"2020-07-09T20:07:33Z","rating":1,"isEdited":false,"title":"From tik tok💗","userName":"Karseey😜😋","review":"This app is ass. :) delete this and don’t ban tik tok u orange peace of s-"}},{"id":"6178071651","type":"user-reviews","attributes":{"date":"2020-07-09T20:07:32Z","rating":1,"isEdited":false,"title":"downloaded russian virus to my phone","userName":"reya p","review":"i got kidnapped after downloading it and am now being held for a ransom of 69.420 billion this is all trumps fault so i had to give it one star :)"}},{"id":"6178071601","type":"user-reviews","attributes":{"date":"2020-07-09T20:07:32Z","rating":1,"isEdited":false,"title":"I liek Dino","userName":"angel hello kitty","review":"When I got app I got app and threw phone at wall becuz it mean so it horrible trashy doo fart app don’t download it bad for u dyno the bot on discord said so ok tim to eat me mcnugget and play roblock add me my name is iliketoofart jk no noobs adding me good bye noob"}},{"id":"6178071585","type":"user-reviews","attributes":{"date":"2020-07-09T20:07:31Z","rating":1,"isEdited":false,"title":"Ew","userName":"AXEWWWWWEEEEEEEE","review":"Ewwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww"}},{"id":"6178071014","type":"user-reviews","attributes":{"date":"2020-07-09T20:07:20Z","rating":1,"isEdited":false,"title":"Seriously god awful 🤮🤮🤮","userName":"👁👄👁 gotta kee","review":"Tastes like strawberries on a summer evenin'. And it sounds just like a song. Iwant more berries and that summer feelin'. It's so wonderful and warm. Breathe me in, breathe me out. I don't know if I could ever go without. I'm just thinking out loud. I don't know if I could ever go without. Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. Watermelon sugar. Strawberries on a summer evenin'. Baby, you're the end of June. I want your belly and that summer feelin'. Getting washed away in you. Breathe me in, breathe me out. I don't know if I could ever go without. Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. I just wanna taste it, I just wanna taste it. Watermelon sugar high. Tastes like strawberries on a summer evenin'. And it sounds just like a song. I want your belly and that summer feelin'. I don't know if I could ever go without. Watermelon sugar high. Watermelon sugar high. Watermelon sugar (sugar) high. Watermelon sugar high (sugar). Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. Watermelon sugar high. I just wanna taste it, I just wanna taste it. Watermelon sugar high. I just wanna taste it, I just wanna taste it. Watermelon sugar high. Watermelon sugar"}},{"id":"6178070060","type":"user-reviews","attributes":{"date":"2020-07-09T20:07:00Z","rating":1,"isEdited":false,"title":"Horrible","userName":"FAIRLYYEEMO","review":"I decided to get this app to support the pedo in office, as soon as I opened it I was met with weird photos of an orange dude. It made me very very uncomfortable! I was also under the assumption that it wouldn’t freeze every goddamn second! It took up all my storage, definitely would not recommend this trash app! Plus it keeps tryin to promote a racist rapist to me and I don’t f with that!"}},{"id":"6178069582","type":"user-reviews","attributes":{"date":"2020-07-09T20:06:50Z","rating":1,"isEdited":false,"title":"Look","userName":"pouej","review":"TRUMP IS SH*T"}},{"id":"6178069564","type":"user-reviews","attributes":{"date":"2020-07-09T20:06:50Z","rating":1,"isEdited":false,"title":"f*cked my phone up","userName":"🌺Live_The_Life_You_Love🌺","review":"i downloaded this app and it took me 3 tries to open it. once i finally got it open, it crashed before i could even put my phone number in it to sign up or whatever. keep in mind i have a brand new iphone, and now half my apps are crashing. ever since i got this app. i called apple support and it said that my phone had some virus. coincidence that i got it right after downloading this app? nope."}},{"id":"6178068891","type":"user-reviews","attributes":{"date":"2020-07-09T20:06:36Z","rating":1,"isEdited":false,"title":"Horrible","userName":"emmah018","review":"I downloaded the app to see what his plans were and I couldn’t see anything all I saw was rasistniss and homophobia, and they only had one dissed opinions and it was even talking about  pedophilia like what the heck, I’m sorry but this is a bad app and it’s only for bad people!"}}]}