{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=79100","data":[{"id":"6174860500","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:25:07Z","title":"Not Functional","userName":"mnmsmall","review":"Simply non functional!! Can’t trust it at all"}},{"id":"6174855191","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:23:32Z","title":"Horrible","userName":"Werewolfj","review":"just no get rid of it"}},{"id":"6174854237","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:23:15Z","title":"Worst app ever","userName":"ht14bunny","review":"The app makes my phone glitch so badly and it racist."}},{"id":"6174851657","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:22:30Z","title":"VERY BAD CONTENT","userName":"marconinis","review":"I am very disappointed in this app and what it had to offer! Nothing good!"}},{"id":"6174846054","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:20:51Z","title":"Terrible app","userName":"tony5561","review":"This app glitches like crazy!! It is not worth it."}},{"id":"6174835153","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:17:37Z","title":"AWFUL","userName":"lukieee_123","review":"the worst app i have ever downloaded. and that means a lot."}},{"id":"6174815999","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:12:02Z","title":"Sad.","userName":"ajhebtvnsoci","review":"WORST EVER app, I have better apps, the BEST. People ask how I know this app is bad, and I say, I know best. Very UNCOOL app! THE WORST - and people who have this app are losers. VERY Sad."}},{"id":"6174813155","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T03:11:11Z","title":"horrible","userName":"kimberlytt","review":"this app is horrible. i didn't get pizza what so ever. gives me notifications so much and reading them, they're so unprofessional that it sounds like a 7th grader writing them!"}},{"id":"6174763520","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T02:56:11Z","title":"Worst app ever","userName":"hayitsmindy","review":"This app killed my gold fish!!! I can’t believe it!! Do not download this app!!!"}},{"id":"6174760302","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T02:55:15Z","title":"Horrible glitches... needs to be fixed","userName":"just--meee","review":"DO NOT DOWNLOAD!! I downloaded this app only to find that it completely messed up my phone. Not only did it glitch out every 2 seconds, but I think it may have actually messed with my phone itself. All my other apps started glitching afterwards. I figured it was a phone issue, but once I deleted the app, I noticed that the glitches kept happening. I am an avid republican and supporter of his administration, and have even bought my NH rally ticket, but I simply cannot with this app. I would not be surprised to hear it’s been tracking my location, that it is a security threat, or that it is leaking my private information to the U.S. Republican Party. After all, the U.S. already has the right to my metadata anyways. Would it matter if the Trump app, or any app then, had it as well?\nHear us: We joke about school shooters when our government will do nothing to help us, we joke about the extreme anxiety and depression that affects an unprecedented percentage of our generation. We wear our masks while calling it “Miss Rona.” We may be scared to order at a restaurant, but we will put our lives on the line in a protest for ourselves, and for our brothers and sisters. Your use of fear tactics will not scare us into submission. We will not feed into your faulty logic. When you up your game, we will up ours. There are more apps for us to use to effectively resist you. You take our app, we take yours. We are well-educated, we are innovative, we are fearless. We are Gen Z."}}]}