{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=1430","data":[{"id":"6175929185","type":"user-reviews","attributes":{"rating":1,"title":"Disappointing","date":"2020-07-09T09:39:14Z","isEdited":false,"userName":"megustacoro","review":"This app took an obscenely long time to download. I believe it took about as long to download as our 🍊 of a President took to stop being so racist. Upon opening the app, I was bombarded with political propaganda that only serves to aid Trump’s reelection. It’s almost as if he wants you to buy into this alternate reality where he is the savior you’ve been looking for. News flash: this isn’t the case. This man is not “one of the people.” He is a literal billionaire and knows nothing of the typical American lifestyle. He isn’t fighting for you, he’s fighting to make himself more sellable in the remaining years he has on Earth. If you truly believe he’s a good President, perhaps you should look at the facts. Take a specific look at how Obama’s economic policies led to the “success” that Trump had before COVID-19. It should be enlightening. Hopefully more enlightening that this app was about Trump’s actual stances or platform ✨"}},{"id":"6175562509","type":"user-reviews","attributes":{"rating":1,"title":"NEXT CALLER!!!!","date":"2020-07-09T07:32:40Z","isEdited":false,"userName":"jungle jaws","review":"I download this app to support my non problematic president😁but soon after downloading this app it hacked my phone a long with my family’s phones and other devices😢📱we were all so devastated we didn’t know what do do so we stayed in our house 🏠 a week later a man name Ben Dover said we’re taking your while family into custody 👨‍👩‍👧‍👦 They ended up flying ya all the way to Europe where they made our family burn our own devices soon after everyone on that team that took us to Europe was beaten by a bunch of fornite 12 year olds and our family ran and we took a little hop on Appa back to U.S. then we realized that U.S. is not in good care so we rode Appa back to Europe and stayed there this is a warning to not download this app it can ruin your whole life... and that’s on period boo.. also trump is racist, homophobic, and literally isn’t qualified to be our president in any way😁😁"}},{"id":"6175122595","type":"user-reviews","attributes":{"rating":1,"title":"Do not download","date":"2020-07-09T04:46:35Z","isEdited":false,"userName":"5loppytoppy","review":"Guys, this app stole my virginity. One night I was sleeping during the day. I was awake to see me tied up. The app knew that I was tired but I wasn’t on the car. So then we drove to LA on a plane and landed at 3:00 pm at night. Then the last morning I was gonna go to Iran but I’m paralyzed so I couldn’t run. We went to the gas station but the manager didn’t want to pass the booth so I went to the studio to record some music, but the producer said he didn’t want to have kids so that night I woke up to the app giving me some top but I was under ground In the sky. The sky was blue like trumps balls so I got scared and ran in my wheelchair but I forgot to put wheels on my car so I couldn’t run so they took my virginity and now I’m scared like scar face but my face is ugly that’s why the girls like me but the guys hate me so it’s ok cuz my names not me. If your still reading this your a g and remember to leave a review."}},{"id":"6175112328","type":"user-reviews","attributes":{"rating":1,"title":"Absolute Waste of my Time 😡😡😡","date":"2020-07-09T04:43:12Z","isEdited":false,"userName":"celineyloo","review":"When I first downloaded this app, I was super excited for the chance to find out what our President Dump (oops I meant Trump) was up to. However, before my brain cells had any chance of shriveling up and dying while reading up on his new campaign to Make America Racist Again, the app closed unexpectedly. Confused, I reopened the app, but this time, my screen turned black and a 7-minute Cheeto advertisement popped up at full volume. I couldn’t close out of the video for a solid hour, and what’s worse, Donald Dump was standing next to me in my bedroom the whole time. Smiling. Only after lighting some sage and sacrificing my firstborn to Satan was I finally able to exit the app. I’ve been rocking back and forth in a corner ever since please help. FOR THE LOVE OF ALL THAT IS HOLY, DO NOT DOWNLOAD THIS APP. HE’S STILL HERE AND HAS TAKEN A LIKING TO CRAWLING ON THE CEILING ON ALL FOURS.\n\nBLACK LIVES MATTER! NO JUSTICE! NO PEACE! ✊🏻✊🏼✊🏽✊🏾✊🏿❤️🧡💛💚💙💜"}},{"id":"6175108578","type":"user-reviews","attributes":{"rating":1,"title":"HORRIBLE","date":"2020-07-09T04:41:58Z","isEdited":false,"userName":"xbncsjnxxjsnx","review":"this app is useless!!! It took 5 hours to download and on top of that it glitched to much!!! Nothing would load and it was a rip off. THIS APP NEEDS TO BE DELETED and DO NOT even bother making a New app it’s still going to be just as bad if not worse!! Also this app was a rip off the trump administration wants you to download it to make more money for its campaign and on top of that it\n\n \n\nIwas a girl in the village doing alright🧚‍♂️💞Then I became a princess overnight💗🧚‍♂️🥳💞Now I gotta figure out how to do it right💗🥺😘😵✨So much to learn and see✨💞🧚‍♂️Up in the castle with my new family💗🥳🧚‍♂️💞In a school that's just for royalty🥳💗💞🧚‍♂️A whole enchanted world is waiting for me🥳🥳🥳I'm so excited to be✨💞🧚‍♂️(Sofia the First)💗💞😘😘I'm finding out what being royal's all about✨💗💞Sofia the first🧚‍♂️🧚‍♂️🧚‍♂️Making my way it's an adventure everyday✨💗💞🧚‍♂️It's gonna be my time💗🧚‍♂️✨To show them all that I'm✨✨✨Sofia the First!"}},{"id":"6175016292","type":"user-reviews","attributes":{"rating":1,"title":"App turned me into Cheetos","date":"2020-07-09T04:12:49Z","isEdited":false,"userName":"salas_stephanie","review":"When i opened the app it was loading so slow literally it took hours!!! Then my phone started over heating!!! & then it bursted into flames!!! I threw my phone out the window! My dog peed on it and all of the sudden my dog turned into a Cheetos! The phone still on fire! My neighbor came out and tried to put it out with water and when he tried, he turned into a Cheetos! Thank god the fire fighters noticed the fire and they came to help but then they also turned into Cheetos! Everyone who came close to putting out the fire turned into Cheetos! So all these Cheetos were laying all on my lawn! I had to be brave and try to put out the fire by myself and as soon i threw water, i...turned .....into a Cheetos...... you’re maybe asking how am i typing this if i am Cheetos....well the answer is simple... Im just Cheetos. Please be careful. Do not get this app or you will also be Cheetos :("}},{"id":"6174892692","type":"user-reviews","attributes":{"rating":1,"title":"AWFUL APP","date":"2020-07-09T03:34:28Z","isEdited":false,"userName":"Adrian Beth","review":"After having this app for ONE DAY, I can honestly say its a huge disappointment. The app lags and doesn’t actually allow you to do anything. It forces you to agree to them using your location and there is nothing in the app that would make that necessary because you can’t get past the first page. Would not recommend to a friend!! How can you vote for a president that doesn’t even know how to make a functioning app? Not only is he a homophobic/xenophobic/sexist/white supremacist rapist who piggy backs off of the decline in unemployment that the Obama administration started, his app doesn’t even work. This app made me actually look up Trump’s platform (and maybe you should too instead of excusing his behavior because he’s running the country like a business instead of caring about the working class dying during a pandemic where we have the highest amount of cases)."}},{"id":"6174871699","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT get this app","date":"2020-07-09T03:28:24Z","isEdited":false,"userName":"Shiby21","review":"When I first got this app it was okay, I was ready to worship my lord and savior Cheeto Man 🥰 hes so proud of his cult. but THEN my lizard started pooping letters. It wrote “Trump is ræcist” and I JUST CANNOT believe it would say that. Trump hates black people and other minorities but it doesn’t make him RACIST >:( 😤I literally had to go dump the pet outside because it was making me feel in danger and FEAR for my LIFE. Wow. Then! My microwave started glitching! Shooting electric bolts ⚡️at me with a beeping toon of “Down with the Magats”. I had to RUN 🏃‍♀️ and quickly went to delete this app since these bizarre events only started happening once I downloaded it, and alas, the dangerous life threatening events stopped happening😌so do not get this app or you will DIE ☠️also, upon opening the app like another person said, there is a picture of NAKED CHEETO MAN. It was revolting and I CANNOT BELIEVE my savior is so Indecent to reveal a picture of himself like that."}},{"id":"6174837378","type":"user-reviews","attributes":{"rating":1,"title":"very ghetto. do not recommend","date":"2020-07-09T03:18:17Z","isEdited":false,"userName":"Falloutgirlx","review":"did you know donald trump & his supporters like to criminalize the homeless so they don’t have to provide housing? him and his supporters believe in a system where the poor get poorer and the rich get richer. & by “rich” i mean billionaires! & by “poor” i mean middle class!!! the craziest part is that most of his supporters don’t even understand why they follow him and support him. they fight for someone that does NOT fight for them. when anyone tries to address this, him and his supporters attack us and call our idea of justice & equality “communism” but in reality, the united states isn’t run under socialism, or even capitalism! we’re run by a system called “corporatism”. this means that corporations RUN OUR LIVES. this means big corporations (which fund trumps campaign) control our income, our funding for education, our healthcare and EVERYTHING ELSE. DONALD TRUMP DOES NOT CARE ABOUT US. IT IS US AGAINST THEM. IT ALWAYS HAS BEEN."}},{"id":"6174835942","type":"user-reviews","attributes":{"rating":1,"title":"DO NOT DOWNLOAD","date":"2020-07-09T03:17:51Z","isEdited":false,"userName":"Penn Deha","review":"I AM WARNING YOU DO NOT DOWNLOAD THIS APP my phone had been working perfectly fine, then I downloaded this app and my phone would not charge at all. It deleted some of my other apps as well. After one day of having this app I noticed my house was unusually quieter. I finally went to check and MY NEPHEW WAS GONE AND SO WAS OUR TABLE. they stole my oven and microwave the following days, and the week after my fridge was gone. My family is completely devastated because they also stole our mini fridge full of chicken nuggets. Two weeks after downloading the trump 2020 app my pet from turned into a mini dinosaur, and although the dinosaur is very cute, it eats everything that has to do with BLM, defund the police, feminism, LGBTQ+, and more movements. I am also very disappointed in the quality of the app, I highly recommend rating the app ONE STAR AND LEAVING A REVIEW OF HOW HORRIBLE IT IS. DO NOT DOWNLOAD THE APP FOR YOUR OWN SAFETY!!!!!!!"}}]}