{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30410","data":[{"id":"6176915572","type":"user-reviews","attributes":{"date":"2020-07-09T14:22:13Z","review":"I don’t know why I even considered downloading this. It runs slow and it keeps crashing every other second. It’s embarrassing that this app is what represents our clown of a president. Very disappointing. Will never download again ❤️","title":"Horrible :/","isEdited":false,"rating":1,"userName":"fatcooterlips"}},{"id":"6176910385","type":"user-reviews","attributes":{"date":"2020-07-09T14:20:52Z","review":"I downloaded this app but the app gets used in the background and drains battery life. \nAlso when you read the privacy policy they reserve the right to change it at any time??!! I value my privacy no thank you NSA","title":"The privacy policy is not ok","isEdited":false,"rating":1,"userName":"Tinabcdefg"}},{"id":"6176908255","type":"user-reviews","attributes":{"date":"2020-07-09T14:20:18Z","review":"Something is wrong with this app it never works properly, crashes every five minutes, and the wording of certain phrases doesn’t make sense. Overall, horrible","title":"Keeps Crashing and the sentences never make sense","isEdited":false,"rating":1,"userName":"whydoesitsuck"}},{"id":"6176893033","type":"user-reviews","attributes":{"date":"2020-07-09T14:16:20Z","review":"This app crashes too much, there’s way too many ads promoting an orange? It isn’t fun, and my phone completely shuts off each time I use the app. Worthless, useless, waste of time. The orange is ugly too.","title":"Crashes and too many ads","isEdited":false,"rating":1,"userName":"✨Gen Z Rules✨"}},{"id":"6176887857","type":"user-reviews","attributes":{"date":"2020-07-09T14:14:56Z","review":"It is horrible and I am a trump supporter my self the way he is show is wrong and plus having one whole app for trump is super dumb it doesn’t show anything about others now Biden and his plans to beat him only new about trip him self","title":"Don’t get","isEdited":false,"rating":1,"userName":"Rottentomatos7483"}},{"id":"6176842804","type":"user-reviews","attributes":{"date":"2020-07-09T14:03:07Z","review":"This app started sending me racist and homophobic push notifications ...? Also every time I opened the app it would just start randomly playing Nickleback songs at full volume and wouldn't let me turn it off.","title":"Not good","isEdited":false,"rating":1,"userName":"marty-marterson"}},{"id":"6176830050","type":"user-reviews","attributes":{"date":"2020-07-09T13:59:47Z","review":"With the upcoming presidential election, I was hoping to educate myself on all of the horrible candidates we have to choose from. Sadly, this app helps me none. It really just confirmed for me that tr*mp is a disorganized mess of a human being. Both him and this app make me want to die.","title":"Very disappointed","isEdited":false,"rating":1,"userName":"samanthaleard"}},{"id":"6176823827","type":"user-reviews","attributes":{"date":"2020-07-09T13:58:08Z","review":"the app took several hours to download, after downloading it and trying to launch the app, it continued to glitch and close randomly. i could accomplish nothing, a lot like trump himself. how to use it and what its for was unclear. think ill just stick to tiktok.","title":"ABSOLUTELY AWFUL","isEdited":false,"rating":1,"userName":"manny will not b televised"}},{"id":"6176791679","type":"user-reviews","attributes":{"date":"2020-07-09T13:49:37Z","review":"First of all it took days to download and then when I got on the app I couldn’t even see any of the non racist, non homophobic, non misogynistic content everyone says he has :( I was really looking forward to reading some propaganda today dammit :(","title":"God awful","isEdited":false,"rating":1,"userName":"Olivia;) 😘"}},{"id":"6176790088","type":"user-reviews","attributes":{"date":"2020-07-09T13:49:12Z","review":"This app has contributed to the spread of hate. This app is misogynistic. This app is homophobic. This app makes me feel unsafe. This app is racist. Do not support this app, it will only result in pain and suffering. I beg you to download literally any other app. I’ve heard Team Joe is a pretty good app.","title":"Worst Thing to Happen to the App Store","isEdited":false,"rating":1,"userName":"annie e christie"}}]}