{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30010","data":[{"id":"6174826086","type":"user-reviews","attributes":{"review":"Worst mistake ever was downloading this app. Filled with incorrect information, and tons of hateful content. If you download this app be prepared because you are signing up for false information. Dumbest app on the market.","title":"i can’t believe i downloaded this app","userName":"paulblartthemallcoo","date":"2020-07-09T03:15:00Z","isEdited":false,"rating":1}},{"id":"6174824557","type":"user-reviews","attributes":{"review":"This app glitches 3 times a day and especially when eating donuts. I mean I like my jelly soft but why does it have to be refrigerated? I can’t believe the content on this app as well. It gave me COVID and it has a horrid looking creature that scares away everyone. I do not recommend.","title":"TERRIBLE QUALITY","userName":"THE VOLUMEE ON THIS BUS","date":"2020-07-09T03:14:32Z","isEdited":false,"rating":1}},{"id":"6174815956","type":"user-reviews","attributes":{"review":"This app coused my dad to go missing and my pp grow 4x smaller do not recommend and I thought 1 inch pp was small after downloading this app I changed my mind also this apps makes a dinosaur come to your house and eat you 0/10 would not recommend","title":"🤢","userName":"pp loser","date":"2020-07-09T03:12:01Z","isEdited":false,"rating":1}},{"id":"6174812828","type":"user-reviews","attributes":{"review":"This app represents our racist president who INFACT wants to open schools during the WORST times possible in this pandemic. He does not deserve an app for his bad doings. This app is also trash and benefits nothing, and has extreme bad reviews ( including mine! ). So in the end, DONT DOWNLOAD THIS APPP!!!!!!!!","title":"This app is extremely terrible. Terrible quality.","userName":"yingyboii","date":"2020-07-09T03:11:06Z","isEdited":false,"rating":1}},{"id":"6174792404","type":"user-reviews","attributes":{"review":"I downloaded this app, and immediately had glitches. It would flash a bit and then started to show what appeared to be a menu... of young girls. I closed the app and relaunched but apparently you have to be one sick sack of s@*t to be able to use it.","title":"Dangerous app","userName":"sickofdon","date":"2020-07-09T03:05:03Z","isEdited":false,"rating":1}},{"id":"6174791604","type":"user-reviews","attributes":{"review":"Downloaded this app to keep up with the President. However this app causes my phone to glitch and fill with racist messages about whites power. Not what I was expecting at all. Avoid this app as much as possible it’s awful.","title":"Do not recommend!!","userName":"Rgdvv","date":"2020-07-09T03:04:48Z","isEdited":false,"rating":1}},{"id":"6174773539","type":"user-reviews","attributes":{"review":"Sometimes my dog is destructive, and our trainer told us we should play games with him. We got scrabble and a couple apps, including this one. Well, to say the least, it did NOT go over well. I do NOT recommend this app for doggo entertainment.","title":"Worst thing I’ve ever seen.","userName":"hanbanan437","date":"2020-07-09T02:59:16Z","isEdited":false,"rating":1}},{"id":"6174762456","type":"user-reviews","attributes":{"review":"The minute I downloaded this app my phone started running ridiculously slow!!!! Not to mention the app itself is incredibly slow and honestly almost outdated? It’s like a 3 year old came up with it or something.","title":"HORRIBLE","userName":"Felixlefae","date":"2020-07-09T02:55:53Z","isEdited":false,"rating":1}},{"id":"6174761546","type":"user-reviews","attributes":{"review":"As soon as this downloaded to my phone my screen wouldn’t stop glitching. One of the worst apps ever to be created I’m honestly surprised that Apple still hasn’t deleted this app yet. Deleting the app would be a huge favor for everyone.","title":"Horrible App","userName":"Ilmk2tm&b","date":"2020-07-09T02:55:37Z","isEdited":false,"rating":1}},{"id":"6174732204","type":"user-reviews","attributes":{"review":"if i could name a worse app i would, and i CANT. i get hundreds of notifications a day and it wastes all my battery so quickly! it also started downloading random applications onto my device! i want to see this scam of an app REMOVED and soon.","title":"HORRIBLE","userName":"Kitty90870","date":"2020-07-09T02:46:41Z","isEdited":false,"rating":1}}]}