{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=110750","data":[{"id":"6174779539","type":"user-reviews","attributes":{"review":"this app screams ignorance!!","title":"awful!","userName":"ur fav stormy","date":"2020-07-09T03:01:07Z","isEdited":false,"rating":1}},{"id":"6174748232","type":"user-reviews","attributes":{"review":"ThiS IS GARBASE BC I WAS WALKING AND I SAW A BABY CRYING THEN IT OPENED THIS APP ON MY PHONE AND A RANDOM BURGER POPED UP AND THE BABY ATE IT SO THEN IT WAS VOMITING AND I FOUND ITS MOUTHER AND I CLIMED A DINO FOR MY TRAVEL TO DISNEY AND THEN EVERY HUMAN TURN BABY AND I WAS DEAF BC OF THE CRYING! The end!","title":"🤢🤢🤢🤮🤮🤮","userName":"isathedino","date":"2020-07-09T02:51:33Z","isEdited":false,"rating":1}},{"id":"6174672357","type":"user-reviews","attributes":{"review":"do not 🚫download! does not grant eternal cheeto life 🤧🤧","title":"SAD CHEETO :(((","userName":"Kreuzberg007","date":"2020-07-09T02:28:45Z","isEdited":false,"rating":1}},{"id":"6174656665","type":"user-reviews","attributes":{"review":"Es da wast ov time","title":"Don’t get it","userName":"idiotio","date":"2020-07-09T02:24:14Z","isEdited":false,"rating":1}},{"id":"6174633085","type":"user-reviews","attributes":{"review":"u take our app we take urs🤬🤬🤬🤬😡😡😡😡😡 grrrrrrr","title":"awful","userName":"KARENS ENEMY","date":"2020-07-09T02:17:29Z","isEdited":false,"rating":1}},{"id":"6174632524","type":"user-reviews","attributes":{"review":"literally the worst app ever. made me cry","title":"ew","userName":"trumpssmalldick","date":"2020-07-09T02:17:20Z","isEdited":false,"rating":1}},{"id":"6174627652","type":"user-reviews","attributes":{"review":"it’s truly the worst app ever.","title":"WORST APP EVER","userName":"evrefe","date":"2020-07-09T02:15:57Z","isEdited":false,"rating":1}},{"id":"6174605216","type":"user-reviews","attributes":{"review":"This app is just like communism","title":"COMMUNISM","userName":"strawberry popsicles rock","date":"2020-07-09T02:09:38Z","isEdited":false,"rating":1}},{"id":"6174589405","type":"user-reviews","attributes":{"review":"ORang looked at the warped kettle in his hands and felt jumpy.\n\nHe walked over to the window and reflected on his duckly surroundings. He had always loved ugly Your backyard with its yucky, yarbelicious your mom. It was a place that encouraged his tendency to feel jumpy.\n\nThen he saw something in the distance, or rather someone. It was the figure of Dorito . Dorito was a hungry queen with grubby elbows and greasy feet.\n\nORang gulped. He glanced at his own reflection. He was an arrogant, peculiar, cocoa drinker with moist elbows and squat feet. His friends saw him as a motionless, modern muppet. Once, he had even helped a putrid old man recover from a flying accident.\n\nBut not even an arrogant person who had once helped a putrid old man recover from a flying accident, was prepared for what Dorito had in store today.\n\nThe moon shone like thinking pigeons, making ORang unstable.\n\nAs ORang stepped outside and Dorito came closer, he could see the deadly glint in his eye.\n\n\"I am here because I want get blasted,\" Dorito bellowed, in a ruthless tone. He slammed his fist against ORang's chest, with the force of 8456 frogs. \"I frigging hate you, ORang .\"\n\nORang looked back, even more unstable and still fingering the warped kettle. \"Dorito, skiddly bop do wop wop,\" he replied.\n\nThey looked at each other with calm feelings, like two glorious, gigantic guppies gyrating at a very forgetful dinner party, which had jazz music playing in the background and two tight-fisted uncles hopping to the beat.\n\nORang regarded Dorito's grubby elbows and greasy feet. He held out his hand. \"Let's not fight,\" he whispered, gently.\n\n\"Hmph,\" pondered Dorito.\n\n\"Please?\" begged ORang with puppy dog eyes.\n\nDorito looked active, his body blushing like a smoggy, slow sausage.\n\nThen Dorito came inside for a nice mug of cocoa.","title":"Drumpf","userName":"Djdojo11","date":"2020-07-09T02:05:10Z","isEdited":false,"rating":1}},{"id":"6174588428","type":"user-reviews","attributes":{"review":"It literally KILLS ppl. Fr","title":"So wrong","userName":"hhcgewtttggy","date":"2020-07-09T02:04:54Z","isEdited":false,"rating":1}}]}