{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=23470","data":[{"id":"6134104370","type":"user-reviews","attributes":{"date":"2020-06-29T02:15:46Z","review":"It’s glitches a lot, and I got this app to show my support to our wonderful president. But this app does not meet my satisfaction and whenever I open the app it kicks me out and when I try to go back, my phone completely blacks out. I thought it was hacked but it’s not. The app seems to not work","title":"Horrible app","isEdited":false,"userName":"grizz.06","rating":1}},{"id":"6133907591","type":"user-reviews","attributes":{"date":"2020-06-29T00:59:18Z","review":"When I first downloaded this app I was excited to support our president. But when I opened the app my phone started glitching and I’m pretty sure I have a virus now and my fruit bowl ran away idk where but it’s gone. Pretty sure it’s hiding so Donald won’t put his orange lookin head in it, I will not be downloading this disgrace of an app EVER again","title":"Awful 🤮","isEdited":false,"userName":"yes me again","rating":1}},{"id":"6133887263","type":"user-reviews","attributes":{"date":"2020-06-29T00:51:01Z","review":"I simply wanted to support my beloved president but the stupid app refuses to work! I open it and it only presents a plain white screen so I delete and redownload and open the app to CHILDREN PORN!!! I can’t believe this was allowed I am absolutely disgusted. Take the app down it has been corrupted and needs MANY repairs!!","title":"Can’t believe this is still up...","isEdited":false,"userName":"hixtape!!","rating":1}},{"id":"6133759843","type":"user-reviews","attributes":{"date":"2020-06-29T00:00:05Z","review":"This app requires too much of my PERSONAL INFORMATION. My generation believes that the government should not control the citizens. Too many notifications, hard to read, fake news even on the TRUMP APP. TERRIBLE TERRIBLE. He should be ashamed of making a faulty app that has failed the U.S. just like he has failed us in other ways- former Trump supporter.","title":"Inconvenient","isEdited":false,"userName":"Karen56782020","rating":1}},{"id":"6125142326","type":"user-reviews","attributes":{"date":"2020-06-26T18:55:22Z","review":"This app was horrible. As soon as I downloaded I started to receive monthly deliveries of Cheeto puffs with Trump’s face on them. I did not sign up for this delivery service, yet these Cheeto Puffs came in by the thousands. PLEASE HELP. The deliveries have not stopped. We have run out of kitchen space and each room in my house now has a Cheeto Puff designated corner. DO NOT DOWNLOAD. HELP ME","title":"Relentless Cheeto Puff Delivery","isEdited":false,"userName":"volleyball ","rating":1}},{"id":"6114548827","type":"user-reviews","attributes":{"date":"2020-06-24T02:50:05Z","review":"I really wanted to see what all the excitement was about and educate myself on American politics...but....all I found.... was f-fa-fak-🤢... can’t even finish. SMH 🤦‍♀️, I really thought I would get to see the GRANDIOSE trump in action but it started glitching and showing things like “xenophobic”, “racist”, “sexist” and I just couldn’t take anymore of those DEFINITELY NOT TRUE f-fa-fak🤮 news.","title":"A true masterpiece of horror","isEdited":false,"userName":"Lizdeny7","rating":1}},{"id":"6106759615","type":"user-reviews","attributes":{"date":"2020-06-22T04:06:54Z","review":"This app isn't helpful at all in informing me of anything. If i google trump events or was on his emailing list, id already get all this info. All the news is bias and many of the segments are easily disproved with a google search. He just wants your location and info. Its kinda ridiculous","title":"Literally terrible","isEdited":false,"userName":"Ford.Gun.America","rating":1}},{"id":"6072180224","type":"user-reviews","attributes":{"date":"2020-06-13T20:43:06Z","review":"I would’ve given a better review, but I was honestly hoping it was going to be like one of those Kardashian apps where he gives us exclusive videos into his daily life. What are his favorites for the month of May? What self tanner does he use for that Cheeto Orange?? And gosh darn it what does he eat in a day????","title":"Not the content we need","isEdited":false,"userName":"A Dame To Kill For","rating":1}},{"id":"6103233194","type":"user-reviews","attributes":{"date":"2020-06-21T06:23:28Z","review":"I love this app. Great info about what the campaign is doing and the events they are holding. Really easy to make donations too.","title":"Fantastic App","isEdited":false,"userName":"WA State 4 Trump","rating":5}},{"id":"6071449403","type":"user-reviews","attributes":{"date":"2020-06-13T16:11:04Z","review":"The app kept crashing as I was trying to put in all of my info, almost as if my iPhone was trying to warn me to not download. The worst part is the developer’s spelling and grammar: It says “keep America great” but they misspelled Amerikkka :/ would give zero stars if I could.","title":"Too many glitches, kept crashing","isEdited":false,"userName":"Cuhristee","rating":1}}]}