{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21780","data":[{"id":"6173458512","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:31:43Z","isEdited":false,"title":"Horrible","review":"I can not believe the waiting on this app I waited 1 hour just so i can see what he is about to say bad do not get and if you did delete at all costs not only is it slow it also takes up so much Data it is a waste of time and there was a glitch that made the skin a disgusting Oompa Loompa orange like so disgusting🤮","userName":"trump is the best nhitwpoat"}},{"id":"6173452578","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:29:49Z","isEdited":false,"title":"Awful harmful app","review":"As I was using this app it played music whenever I excited out that was very gross and I got in trouble. It takes random screenshots when I’m off the app. And is took 2 days to download and when I got on I got a virus on my phone that deleted my contacts and the music was soo bad and loud it killed my guinea pig of stress AND I CANT DELETE THE APP","userName":"syugjsbf"}},{"id":"6173450864","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:29:13Z","isEdited":false,"title":"Disappointing","review":"This app is incredibly disappointing. I was honestly hoping for more but at the same time I wasn’t expecting much. The layout and format of the app is disastrous, it’s an utter mess. There is t much use for the app. Google is much easier to use than this junk. If I could rate this app a 0 I would\n\nso disappointing 😡","userName":"kiwi ✨"}},{"id":"6173443523","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:26:39Z","isEdited":false,"title":"Do Not Get","review":"This app took me days to download and when it finally did it would crash almost every time i tried to go on it. it is extremely slow and will always glitch out. i cannot believe how bad this app is i do NOT recommend getting it the worst experience i have ever had.","userName":"hsbsjekskwned"}},{"id":"6173441397","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:25:57Z","isEdited":false,"title":"Karen","review":"This app is so slow that when I asked for its manager and it just completely shut off. It took forever to download and it wasn’t even the right app I was trying to download subway surfers and somehow got this crap.  terrible management. SUPER RUDE. Not kid friendly. And most definitely not subway surfer. You’ll be hearing from my lawyers 😤😤😤😤","userName":"jujuba2689"}},{"id":"6173422482","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:19:37Z","isEdited":false,"title":"DO NOT DOWNLOAD","review":"If I could give this app negative stars I would. It took me 5 1/2 hours to download and it made my phone blow up. Before that it made it all glitchy and some of the text turned from English to Russian. After it blew up Donald Trump came out of the ashes and punted my baby across my house and burned my house down. Never again... worst app ever.","userName":"inehbriated sex kitten"}},{"id":"6173421400","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:19:15Z","isEdited":false,"title":"HORRIBLE","review":"This app is such a useless app. I tried buying a trump hat “ for a friend “ and when I tried buying the hat, it made the purchase, but didn’t tell me when the hat was coming, the shipping and total, and worse of all. I never got my hat. I ordered this hat 2 months ago and they said it would be here the week after I ordered it.","userName":"\"donaldtrumpstanaccount\""}},{"id":"6173417319","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:17:52Z","isEdited":false,"title":"Horrendous app","review":"I downloaded this app in hopes of following my dear presidents updates but that doesn’t seem to be the case. It took forever to download. The app glitches continuously and never allowed me to view anything. I am extremely disappointed in the presidents product of this app. 10/10 DO NOT recommend. Very dissapointed.","userName":"cecilia rocker"}},{"id":"6173413529","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:16:35Z","isEdited":false,"title":"I do NOT recommend","review":"Hello I would just like to inform that this app has various glitches and bugs. Because of those glitches, and bugs, this app made my phone crash VARIOUS times. I tried to figure out the solution but when i deleted the app my phone was back to normal. 0/10 do not recommend.","userName":"ImIkaika"}},{"id":"6173387380","type":"user-reviews","attributes":{"rating":1,"date":"2020-07-08T19:07:17Z","isEdited":false,"title":"This app is not it","review":"This app is horrible when I downloaded it my screen went black and it took 5 minutes to come back. This app is so freaking trash and I do not recommend this to anyone. This gets a 1 star review on my behalf. Read the reviews before you download it trust me it will make your life better.","userName":"RTN052108"}}]}