{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=6970","data":[{"id":"6176979141","type":"user-reviews","attributes":{"date":"2020-07-09T14:39:02Z","isEdited":false,"userName":"kels2222222222222","review":"This gave me no information, it was glitchy and would constantly crash, and the app itself is completely worthless. Don’t wast your time, your better off talking to him yourself. My iPhone 8 got a virus from this app, which I later had to go to the Apple store and pay $300 to fix it. I AM BEYOND DISAPPOINTED AT THIS POINT. This app needs to be immediately removed from this store. It is misleading and a piece of junk. As a Trump supporter I am begging to switch my sides if the president had anything to do with this app. \n\n- Karen Barthallameuw","rating":1,"title":"Terrible app"}},{"id":"6176952282","type":"user-reviews","attributes":{"date":"2020-07-09T14:31:50Z","isEdited":false,"userName":"Owl 1 2 3","review":"I don’t even know where to start. There are too many issues with the app. I would open the app and it would immediately return to the home screen. During the few times it actually worked, the app would glitch and the screen would scroll by itself. I also just didn’t like seeing a rotten racist orange on my screen. This is app is terrible and it needs so much work that it’s probably not even worth it. I would just delete the app entirely if I could.","rating":1,"title":"Just plain awful."}},{"id":"6176942796","type":"user-reviews","attributes":{"date":"2020-07-09T14:29:18Z","isEdited":false,"userName":"wavyybarbecue","review":"THIS APP IS TERRIBLE. AS SOON AS I DOWNLOADED IT, IT TRACKED MY LOCATION AND SENT 200 TURTLES TO MY APARTMENT. I FELT THREATENED .OVER THE TOP TERRIBLEEE. I dont know how y’all support a r@pist, misogynist, racist, homophobic, transphobic, and islamophobic orange peel. \nThis app should most definitely be removed from the app store. There is nothing good about it. it doesn’t benefit anyone and only people who truly use it are the millennials who support “blue lives matter” .. whatever that means lol. Apple store is supposed to be for things that are actually useful. And this is not supposed to be tracking my location whatsoever. i was in a very life threatening situation.","rating":1,"title":"🐢🐢!"}},{"id":"6176935305","type":"user-reviews","attributes":{"date":"2020-07-09T14:27:19Z","isEdited":false,"userName":"Haley the minecraft lover","review":"I got this app because I love Oranges. But then I saw something horrible.. a ROTTEN ORANGE. I am so scared- my dog died just from me opening the app. So when I was crying about my dog little Cheetos came out and started coming at me. 😓\nThey tried Stabbing me with there little crusty Crumbs. I was so scared and I’m not sure if I can handle another four years of Trumps Cheetos Minions stealing my Apples and painting then Orange- \n😒 I started to eat the Cheetos but then they changed a photo on my Phone and I saw it. It was a Big Cheeto and he was Naked. He had a Shrimp pp. it was smaller then a 2 inch bird. I died after that.","rating":1,"title":"MY DOG!"}},{"id":"6176923319","type":"user-reviews","attributes":{"date":"2020-07-09T14:24:12Z","isEdited":false,"userName":"Cheeto got to go","review":"Much like trump and his campaigns, this app is one of the most disgusting, least productive, pieces of trash I have ever used. It also directly encourages racism, violences, and spreading hate through the whole country while also silencing those who are fighting for their rights. It’s also horrible to look at. The fist thing you see is this fat, ugly, white/orange, nasty Cheeto looking thing that again spews nothing but garbage. Highly recommend not getting the app but leaving and honest review. We will not be silenced, and we will continue to fight.","rating":1,"title":"Terrible but not surprised"}},{"id":"6176715688","type":"user-reviews","attributes":{"date":"2020-07-09T13:29:37Z","isEdited":false,"userName":"PterJ","review":"Hi, I don’t have a phone number, so I can’t use the app. This is offensive to anyone without phones, and this is discrimination at its finest—almost worst than slavery, and I’m black! Anyways this mobile game is no Subway Surfers or Where’s My Water?, but it’s a better movie than Ratatoing. I’m not sure who Trump is, tbh, but I think the president of America, Africa, and California needs to get their act together. I don’t remember the point of this, but cancel LovelyPeaches, tuck Frump, stream ChloexHalle’s Ungodly Hour, and vote for Joe Biden and whatever he plans to do as president.","rating":1,"title":"Bee Movie Script: Act 1 🐝🐝"}},{"id":"6176640289","type":"user-reviews","attributes":{"date":"2020-07-09T13:09:45Z","isEdited":false,"userName":"hbarefoot13","review":"this is app is a disgrace to the AppStore i can’t help but hold some sort of detest against apple for not banning this garbage yet. let’s start with the fact that the app itself took a week to download, after the fact my phone began to crash spermatically. after being lucky enough to get my iPhone under control long enough for me to DELETE the app i received a phone call from my bank telling me my card information had been compromised. also this app gave me HIV.","rating":1,"title":"if i could leave -5 stars best believe i WOULD"}},{"id":"6176565424","type":"user-reviews","attributes":{"date":"2020-07-09T12:49:34Z","isEdited":false,"userName":"sam.thompson23","review":"I downloaded the app in hopes of getting some cool merch, but then, all of a sudden, my phone starts blasting the star spangled banner at me. I throw the phone down in fear, and something straight out of a horror movie, the phone starts scrolling itself. It goes to his twitter page where it reveals all the misogynistic, xenophobic, and racist comments he’s made (oh god it was A LONG list, this guy is highkey intolerant as hell). Then my phone started smoking. I believe Chump owes me a brand new IPhone for my troubles, and a box full of MAGA hats so I can burn every last one one of them.","rating":1,"title":"Uh oh. Stinky."}},{"id":"6176407769","type":"user-reviews","attributes":{"date":"2020-07-09T12:06:17Z","isEdited":false,"userName":"BananaPantsKittyCat","review":"The minute I opened this app, it crashed immediately. Every other app I tried to open would crash as well, and it's embarrassing that our president would let such an app do these things to our devices and still go unnoticed. I was quick to delete the app from my cell phone, but it continues to act buggy. The performance of this app is at the lowest quality, and I do not believe it should continue being on this App store and ruining other fine people's devices.","rating":1,"title":"Awful quality. 🤬"}},{"id":"6176298787","type":"user-reviews","attributes":{"date":"2020-07-09T11:35:25Z","isEdited":false,"userName":"Dœgg","review":"This Application is completely horrific. First of all, it took me around three hours in order to download. Next I was bombarded by all these ads and propaganda against Democrats, Which completely destroys my opinions on politics. Despite being a Trump supporter I am disappointed in the way this app is designed and presented to the public. This is a threat to our society but also our nation as a whole. I hope Apple remove this from the App Store and sets boundaries to prevent horrible apps like this from being on the market.","rating":1,"title":"Absolutely horrfic 🤬"}}]}