{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25050","data":[{"id":"6174724929","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:44:31Z","userName":"SomethingUnique1836","rating":1,"title":"Fake app","review":"This is complete junk. It must have been created by the Democrats to fool us, seriously stay away. It is full of lies and fake news. Not only that is slows your phone down, sends tons of notifications full of nonsense, and wants way to much access to your personal data."}},{"id":"6174718748","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:42:38Z","userName":"TarderSauce;3","rating":1,"title":"This app is absolutely, horrible, disgusting, and makes me want to vomit","review":"My pet bird was stolen because of this god forsaken app. My screen cracked as soon as I opened the app because of how UGLY the mascot of this app is, I think it’s a Cheeto? I’m not really sure because the graphics were really bad. Overall bad quality and I miss my pet bird."}},{"id":"6174696940","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:36:03Z","userName":"hekbfuend","rating":1,"title":"HORRIBLE APP","review":"this app is the epitome of just horribleness. i cant even believe people made this. it hacked into my phone which hacked into my laptop and all of the electrical things in my house and made them attack me!! it also stole my nudes and gave them directly to president trump so he could beat his baby meat. i’m so disappointed"}},{"id":"6174686949","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:33:02Z","userName":"rawrr 🦖","rating":1,"title":"TERRIBLE APP","review":"after downloading the app my phone started glitching out like crazy! i got spammed with texts and calls, its lagged my phone so badly i had to pay $50 to get it fixed. once i got my phone back i deleted this app and the problem went away entirely. i dont think its a coincidence."}},{"id":"6174683367","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:32:01Z","userName":"Noeybear9000","rating":1,"title":"this app stole my entire house","review":"i cannot believe after buying this app i walked into my house and it was empty and the only thing left was a note saying who had commented this visions crime. This app will steal all of your\nsilverware. This app will steal all of your clothes, and most of your wallpaper. I cannot believe this"}},{"id":"6174678814","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:30:39Z","userName":"a rational and caring person","rating":1,"title":"No fake hair place recommend!","review":"I got this app because of my high hopes for the trump campaign but then I realized that the White House was too stained by the greasy lil’ fingers of our bigly president. His KFC has gone too far and it’s time to get him out so that he can’t do any more damage and we as a country can recover from this giant mistake."}},{"id":"6174677985","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:30:25Z","userName":"Tim G. Florida","rating":1,"title":"This app is terrible!","review":"I immediately got glitches when opening the app! I would recommend fixing all the bugs and glitches that I’ve also seen other reviews mention, or just taking the app off of the app store! Truly a terrible app."}},{"id":"6174671381","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:28:28Z","userName":"Kierstan484","rating":1,"title":"Not worth it to be completely honest","review":"I downloaded this app in hopes of keeping up with our amazing leader but then it started acting weird. Like calling me rude names and harassing me after it found out I was a female and was continuously sexist towards me all I wanted was to support our awesome president. I don’t recommend this app."}},{"id":"6174670442","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:28:12Z","userName":"jasminesTRUTH","rating":1,"title":"Why hasn’t this man been impeached yet?","review":"Donald trump is freaking HORRIBLE first he’s in on sex trafficking children AND NOW He’s going to ban Tik tok just because of the Chinese gov like honestly nobody cares! For all we care we are about to move to China because America is HORRIBLE because of Donald trump and I have his app a try TRASH PURE TRASH at this point I want to ban Donald trump and his app DELETE THIS APP"}},{"id":"6174652557","type":"user-reviews","attributes":{"isEdited":false,"date":"2020-07-09T02:23:04Z","userName":"curlyhairdontcarr","rating":1,"title":"TRASH DONT DOWNLOAD","review":"Despicably horrible im so disappointed in our president trump but cannot say its the first time app closes by itself and shows this incredible orange man on my screen at times with a blonde wig to be precise i advise u not to download and this app should be taken down it floods me with bad memories and anxiety whenever i see it love, trumpie2020dead"}}]}