{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=138560","data":[{"id":"6179720874","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:48Z","title":"Not one of those kiddos.","review":"I absolutely love my president,but this app is the worst!It hacked my phone and I couldn’t download anything else!!!I am really disappointed because I wanted to know what my president was doing to better our country.this application is very slow and bad.i think it deleted all of my pictures and messed up my text application.DO NOT DOWNLOAD!!!!!!THIS IS A CHEAT IT DOESNT EVEN DO ANYTHING.","isEdited":false,"userName":"qertuhvhh","rating":1}},{"id":"6179720555","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:42Z","title":"WORST APP EVER","review":"DO NOT DOWNLOAD","isEdited":false,"userName":"bernie 2021","rating":1}},{"id":"6179720262","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:36Z","title":"Loud noise coming from phone after downloading","review":"I heard there was an app for Trump supporters and I got super excited because the texting service wasn’t working for me. However, when I opened the app, and looked through the available options, my phone screen turned off. It then proceeded to began blaring “Trump 2020” in a deep voice. The noise from my phone caused my mother to lose her hearing. It plagued us day and night for over a week. I could not sleep, eat, or simply relax in my house without the noise constantly playing in the background. I tried to turn my phone off, but the app possessed it. My ears bleed, I hear it in my thoughts now, the drone a never ending reminder of this app. My mother moved away from the house, and now I live alone only to hear “Trump 2020” endlessly blaring from my phone. It rings in my ears. I have tried to break my phone, burn it, anything to end my suffering. Alas, it did not. I set it on a little boat and sent it off to sea. Now, the fish in the middle of the Pacific must live with the intolerable noise, the echoing voice of “Trump 2020”. I have downloaded the app on my Ipad once more, only to leave a one star review for it leaving my life in shambles.","isEdited":false,"userName":"Peggy Ann Sue","rating":1}},{"id":"6179720008","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:30Z","title":"HORRIBLE","review":"This app just kept on spamming my phone and made my phone crash and shut off MULTIPLE TIMES. Don’t use it, so annoying.","isEdited":false,"userName":"xxxcgr","rating":1}},{"id":"6179719987","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:29Z","title":"ew no, please delete this😾","review":"i don’t know why anyone would want this HORRIBLE app, it takes ages to download and the app keeps glitching. definitely do not \nrecommend.","isEdited":false,"userName":"ashl3y whitt","rating":1}},{"id":"6179719710","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:23Z","title":"Tik tok needs to stay","review":"Even though I support trump 2020 I think it a bad idea to ban tik tok he is just gonna make everyone so mad at him even more and all the kids are gonna make there parents say trump deleted this app. And if China is actually spying on us through this app how are they even spying on us it’s just kids and teens making videos or dancing how is that spying. So I’m not gamma hate trump but just don’t delete the app or everyone gonna hate u but while then this app is ok if ya want too look at news but ya no delete it if he deletes tik tok (btw I’m 20) Period.!","isEdited":false,"userName":"tik tok dot","rating":1}},{"id":"6179719356","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:16Z","title":"well, this is tragic innit?","review":"where do i begin uwu. this app instantly flooded my phone with viruses that kept have p*rn pop ups! but i’m not surprised because we have you as president. i say will the fullest heart that this app is even worse than life 360. more nauseating!!! owo! even the sound of your putrid voice makes me sick to my tummy yummy. so thanks but no❤️","isEdited":false,"userName":"bestieasff","rating":1}},{"id":"6179719286","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:14Z","title":"Just don’t download this app","review":"Yo, it’s simple. Don’t download it. When I downloaded it to see what was on it, my phone glitched out and static noise coming from the speakers. It got progressively louder for about 10 minutes until it stopped and my phone seamed like it went back to normal. But when I was checking to see if anything changed, I realized that all of my emails were gone, and about like half of my 3000 photos got deleted. I don’t know what’s up, but DO NOT DOWNLOAD THIS APP!","isEdited":false,"userName":"jsi yansichs","rating":1}},{"id":"6179719203","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:12Z","title":"🤢","review":"Worst I have seen in my entire live and follow my tiktok @destinybaez581 has to plug it lol 😊💖","isEdited":false,"userName":"ya hhf","rating":1}},{"id":"6179719159","type":"user-reviews","attributes":{"date":"2020-07-10T06:07:11Z","title":"No","review":"Cheeto","isEdited":false,"userName":"h zbchflvs hlh jnf. ms","rating":1}}]}