{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=43860","data":[{"id":"6172474259","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"No good.","userName":"Grace2310000","review":"The app made my phone glitch and it wouldn’t allow me to delete it for a while. I originally downloaded it to understand what homie was up to but didn’t do that for me. Anyway it’s no good.","date":"2020-07-08T14:29:03Z"}},{"id":"6172472940","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"A horrible president comes with a horrible app.","userName":"Agehudkenehrudwkbr","review":"Trump said he was going to do so much for our country and make it great but did none of that. He only made the country worse.","date":"2020-07-08T14:28:41Z"}},{"id":"6172448786","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"THIS APP TRACKS YOU❗️❗️❌","userName":"May 13th 2020","review":"this app tracks you and can see where you are and who you are 24/7 even when not in use. it can even be given the possibility to hack your phone. please rate bad‼️‼️","date":"2020-07-08T14:22:11Z"}},{"id":"6172439623","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"I have to put my number in","userName":"maryrosemiller","review":"Really I just wanted to see what it was about but then I had to put my phone number in. Not gunna happen I don’t give that out to anyone","date":"2020-07-08T14:19:42Z"}},{"id":"6172385302","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Do not use it (I’m from TikTok)","userName":"jsjeiebhsushdbdisjbsjsjs","review":"This is the worst app in the App Store. It made me try and download it many many many times. Then it made me do many things that I don’t think were necessary.","date":"2020-07-08T14:05:06Z"}},{"id":"6172370255","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"1 Star","userName":"spilling_taes_tea","review":"This app has only shown me reasons on why o shouldn’t vote for Donald trump \nIt’s just proves how racist he is and how he’s not caring for the people of America \nPeople are suffering \nPeople are dying \nAnd this is all bc of trump bc he won’t make a change in our country \nAmerica isn’t going to become great with Donald trump the citizens of America need to stand up and do something about it and that’s exactly what we’re going to do","date":"2020-07-08T14:01:05Z"}},{"id":"6172363143","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Horrible","userName":"JessRazz","review":"It’s poorly organized and it doesn’t give out any actual information. It’s a waste of space and I hardly recommend this to anyone. \n\n-Gen Z","date":"2020-07-08T13:59:09Z"}},{"id":"6172359844","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Stop this thing","userName":"lararreyna","review":"Who made this seriously trump you racist you be looking different shades you know Hispanics are yellow and you yellow but worst so you Hispanic please think before downloading don’t do it , it ain’t worth it.","date":"2020-07-08T13:58:12Z"}},{"id":"6172301029","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Sir👀","userName":"jessica1697","review":"“ Let me tell you what I wish I'd known, when I was young and dreamed of glory. You have no control who lives, who dies, who tells your story”\n\nBET you didn’t think zoomers would be ruining your name yet again.","date":"2020-07-08T13:42:00Z"}},{"id":"6172297247","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Screw you orange racist pedo president","userName":"Biden 2020 periodt","review":"Immediately as I opened the app the vibes threw me off. The app radiates racist energy. I could find no valid reason to continue on with the use of the app. It is pointless. Would not recommend. Btw y’all vote November 4th❤️","date":"2020-07-08T13:40:54Z"}}]}