{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=131070","data":[{"id":"6174419906","type":"user-reviews","attributes":{"rating":1,"review":"So first the name horrify me. Like what an incredibly stupid name for a app. I can’t even got into detail on how this app is BAD like kids will be reading this. So I am warning you ⚠️⚠️⚠️⚠️⚠️DO NOT GET THIS.ok bye✨✨✨✨✨🧚🏽‍♀️🧚🏽‍♀️🧚🏽‍♀️🧚🏽‍♀️","userName":"uh no❤️","date":"2020-07-09T01:16:08Z","title":"I wish I can give a 0❤️","isEdited":false}},{"id":"6174419452","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded it cause I was like hey I wanna support my AMAZING, RACIST, HOMOPHOBIC, TRANSPHOBIC, president🏳️‍🌈. But before I could open the app my nonexistent cat got ran over by a spaceship. I quickly run to try and save him but it was too late. I cried for hours and then I was like you know what would make me feel better? If I opened the app. And I did and I kept crying cause we have a dumbass president in power🥺🥺. I miss Obama!!! ✊🏾🏳️‍🌈","userName":"itissir","date":"2020-07-09T01:16:00Z","title":"Worst app here","isEdited":false}},{"id":"6174419409","type":"user-reviews","attributes":{"rating":1,"review":"I opened this app just to see the fattest Oompa Loompa -1000000/10 don’t download","userName":"hdbdhdjsbdudnx","date":"2020-07-09T01:15:59Z","title":"👁👄👁","isEdited":false}},{"id":"6174418679","type":"user-reviews","attributes":{"rating":1,"review":"First off I just wanted to say I think this app is horrible in every spit image way see a butt naked man in a Cheeto costume with peach pal skin it’s disgusting to see such horror on this app   Second off I wanted to say this app has hacked my iPad in so many ways this app is terrible third off I wanted let any one lease know not to download this app also there has been hated comments against BML and the racism this app has I a officially \n Am really unsafe and. Unsatisfied With this trump 2020 app I refuse to give five star when this app rating show be a negative zero and I will vote on December 3rd for trump to not be president I hope this gives affordable Affection to all the other people wanting to try this app please don’t","userName":"cookiecrumblesweets","date":"2020-07-09T01:15:47Z","title":"This app is the worse I’ve seen in 2020","isEdited":false}},{"id":"6174418666","type":"user-reviews","attributes":{"rating":1,"review":"I am a 383738 year old man and I  accidentally downloaded this app instead of angry birds 2 and when I opened it I saw a horrible old Cheeto with yellow cheese on the top of it it was so disgusting that my pet dragon 🐉 saw it and it’s eyes 👀 popped inside its skull so it wouldn’t have to see the ugly man Cheeto, I told my sister and she didn’t believe me abs before I could stop her 🛑 she looked at the pictures and then melted away. Now she is gone and my dragon is gone too became when I went to go check on it all I saw was dust. So now I have to go buy a new sister and a new dragon!!! This app is a disgrace and we need to take it down immediately!!!! Now it’s time to download the real angry birds 2.","userName":"Rumerbunny","date":"2020-07-09T01:15:47Z","title":"Buying a new dragon 🐉 and a new sister!","isEdited":false}},{"id":"6174418470","type":"user-reviews","attributes":{"rating":1,"review":"We're no strangers to love\n\nYou know the rules and so do I\n\nA full commitment's what I'm thinking of\n\nYou wouldn't get this from any other guy\n\nI just wanna tell you how I'm feeling\n\nGotta make you understand\n\nNever gonna give you up\n\nNever gonna let you down\n\nNever gonna run around and desert you\n\nNever gonna make you cry\n\nNever gonna say goodbye\n\nNever gonna tell a lie and hurt you\n\nWe've known each other for so long\n\nYour heart's been aching, but\n\nYou're too shy to say it\n\nInside, we both know what's been going on\n\nWe know the game and we're gonna play it\n\nAnd if you ask me how I'm feeling\n\nDon't tell me you're too blind to see\n\nNever gonna give you up\n\nNever gonna let you down\n\nNever gonna run around and desert you\n\nNever gonna make you cry\n\nNever gonna say goodbye\n\nNever gonna tell a lie and hurt you\n\nNever gonna give you up\n\nNever gonna let you down\n\nNever gonna run around and desert you\n\nNever gonna make you cry\n\nNever gonna say goodbye\n\nNever gonna tell a lie and hurt you\n\n(Ooh, give you up)\n\n(Ooh, give you up)\n\nNever gonna give, never gonna give\n\n(Give you up)\n\nNever gonna give, never gonna give\n\n(Give you up)\n\nWe've known each other for so long\n\nYour heart's been aching, but\n\nYou're too shy to say it\n\nInside, we both know what's been going on\n\nWe know the game and we're gonna play it\n\nI just wanna tell you how I'm feeling\n\nGotta make you understand\n\nNever gonna give you up\n\nNever gonna let you down\n\nNever gonna run around and desert you\n\nNever gonna make you cry\n\nNever gonna say goodbye\n\nNever gonna tell a lie and hurt you\n\nNever gonna give you up\n\nNever gonna let you down\n\nNever gonna run around and desert you\n\nNever gonna make you cry\n\nNever gonna say goodbye\n\nNever gonna tell a lie and hurt you\n\nNever gonna give you up\n\nNever gonna let you down\n\nNever gonna run around and desert you\n\nNever gonna make you cry\n\nNever gonna say goodbye\n\nNever gonna tell a lie and hurt you","userName":"blue_kokujoudai","date":"2020-07-09T01:15:43Z","title":"A Rickroll","isEdited":false}},{"id":"6174418481","type":"user-reviews","attributes":{"rating":1,"review":"disgusting pictures of a hot cheeto spray tan little weiner. did not ask to see the nudes. also asked to for me to send pictures of my 5 month old child. pedophilia is a common subject","userName":"perlaaaaaaaaa","date":"2020-07-09T01:15:43Z","title":"this app stole all my information and then gave my phone and all my devices a virus","isEdited":false}},{"id":"6174418350","type":"user-reviews","attributes":{"rating":1,"review":"ᗷᕼᑌᗴᔕᒍYᗴᔕ 🤷sometimes✨i🙁don't😢wanna😱be😼happy🧚don't✋hold😇it🤪against😈me🙆","userName":"Sanai Andrea","date":"2020-07-09T01:15:41Z","title":"lol eat my 💩","isEdited":false}},{"id":"6174417635","type":"user-reviews","attributes":{"rating":1,"review":"Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop  Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop  Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop  Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop  Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop  Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop  Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop  Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop  Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop Poop","userName":"i just idk","date":"2020-07-09T01:15:27Z","title":"poopy fart","isEdited":false}},{"id":"6174417517","type":"user-reviews","attributes":{"rating":1,"review":"This app is horrible!! It glitches all the time and sometimes I can’t tell if I’m seeing trump or a Cheeto puff with fuzzy mold on it! 🤮 I definitely don’t recommend this app to anyone who is not a psychopath. This app Is AWFUL!! children don’t need to see this nastiness, it should be taken down immediately!! I feel like I’m blind after what I’ve seen!! This is the worst app to to every surface the apple App Store ever!!!","userName":"unchdjf gmskkf","date":"2020-07-09T01:15:25Z","title":"Wish I could rate this -10000000","isEdited":false}}]}