{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=15840","data":[{"id":"6178643655","type":"user-reviews","attributes":{"title":"absolutely horrid.","date":"2020-07-09T23:40:44Z","userName":"A. Alesh","review":"The minute I downloaded the app, my phone started glitching and at one point even crashed for about an hour. When It turned on again i would get virus warnings and could hear a strange buzzing sound through my speakers, my sister told me someone might be listening through my phone and after deleting the app the buzzing stopped. DO NOT GET THIS APP!!!","rating":1,"isEdited":false}},{"id":"6178597543","type":"user-reviews","attributes":{"title":"July 23","date":"2020-07-09T23:22:39Z","userName":"➡️oneerection⬅️","review":"You're insecure,\nDon't know what for,\nYou're turning heads when you walk through the door,\nDon't need make-up,\nTo cover up,\nBeing the way that you are is enough,\n\nEveryone else in the room can see it,\nEveryone else but you\n\nBaby you light up my world like nobody else,\nThe way that you flip your hair gets me overwhelmed,\nBut when you smile at the ground it ain't hard to tell,\nYou don't know,\nOh, oh,\nYou don't know you're beautiful,\nIf only you saw what I can see,\nYou'd understand why I want you so desperately,\nRight now I'm looking at you and I can't believe,\nYou don't know,\nOh, oh,\nYou don't know you're beautiful,\nOh, oh,\nThat's what makes you beautiful","rating":1,"isEdited":false}},{"id":"6178550655","type":"user-reviews","attributes":{"title":"Made my phone crash","date":"2020-07-09T23:04:18Z","userName":"Geidheodbfifi","review":"Prior to downloading this app my phone displayed an error message. I went to the Apple store and had to get a new phone. I downloaded the app again and the same thing happened. I’m now on my third iPhone this week and I will not let anyone else I know download this app. Extremely disappointed. I expected better from Trump.","rating":1,"isEdited":false}},{"id":"6178545501","type":"user-reviews","attributes":{"title":"The Worst App to Exist","date":"2020-07-09T23:02:16Z","userName":"Ethanbjbjbjbjbj","review":"I was just hoping to get some useful information about my beloved president but it took me 24+ hours to download and then it kept sending me notifications every time Trump had a bowel movement, when I was looking for more information geared toward the president and his 2020 campaign. Very disappointed. This may be enough for him to lose my previously unwavering support.","rating":1,"isEdited":false}},{"id":"6178472474","type":"user-reviews","attributes":{"title":"Horrible","date":"2020-07-09T22:33:15Z","userName":"mcauleydr25","review":"It took days to download and then my phone crashed. Just for me to have to redownload it then it refused to let me in the app when i tried to use my already used phone number but then said it was already used when I tried to reregister. Everything was slow and it put my phone down. Would rate 0 stars if i could.","rating":1,"isEdited":false}},{"id":"6178465549","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD THIS","date":"2020-07-09T22:30:30Z","userName":"danny devitos son","review":"I used to absolutely love our beautiful orange cranberry. I downloaded this app of gold ❤️ then all of the sudden, a scary orange blonde monster appeared and said his name was Trump. I was so scared, his zombie wife Melinsomnia came out and started looking pale and smirked at me. I was so nervous because then this disgusting flag came up, it had the colors of Satan! It was red and an evil blue. I had to look at our manny flag to feel safe again. DO NOT download this app! Please.","rating":1,"isEdited":false}},{"id":"6178405412","type":"user-reviews","attributes":{"title":"my phone smelled bad after downloading this app!","date":"2020-07-09T22:07:06Z","userName":"bananapeels204","review":"the app took about 3 days to download and when it finally downloaded horrible smelling green gas poured out of my phone speakers, and i heard trumps voice echoing china!!!! my phone started to shut down randomly all the time and my battery was drained really fast and the smell didn’t go away. i couldn’t get rid of the app and it would also get really hot! i decided to go to tiktok which is apparently being deleted from the app store (i didn’t  have it downloaded) and the minute i opened it my phone went back to normal!!! please dont download this app and download tiktok !!! leave tiktok a 5 star review","rating":1,"isEdited":false}},{"id":"6178403951","type":"user-reviews","attributes":{"title":"Traumatize 😬☠️","date":"2020-07-09T22:06:30Z","userName":"295?!","review":"I’m scared for life now, after I download this app I put my phone number in and then my phone started to blow up with trump supporters saying that they will turn me into another orange Cheeto if I don’t spread the word about trump 2020. I am currently in my basement hiding scared  they are going to find me but then the walls started to appear with marks saying trump 2020 or 🎃 support our president 🍊I’m so scared I do not recommend this app 💀","rating":1,"isEdited":false}},{"id":"6178398704","type":"user-reviews","attributes":{"title":"Yuge waste of tech","date":"2020-07-09T22:04:30Z","userName":"Idontliketobeawake","review":"This app is just the worst app of all the apps. We have bad apps here in America, more than any other country, I’ve seen the data, we have the worst apps. But this app is the worst app of all the apps. I would know, I’m an expert on apps. This app Tr**ps all other apps for the worst app. Trust me, it’s a bad app. If we stop making apps like this, there will be fewer negative reviews. It’s science, I know. Trust me. Yuge waste of money. Yuge.","rating":1,"isEdited":false}},{"id":"6178393556","type":"user-reviews","attributes":{"title":"Extremely Dissatisfied","date":"2020-07-09T22:02:33Z","userName":"maddie121100","review":"I downloaded this app to learn more about the Trump campaign and the location of upcoming rallys. However, it keeps making my phone crash. Whenever I open the app, it often closes immediately and my phone begins to restart. I can’t believe I won’t be able to learn more about this extremely interesting presidential candidate 🙃","rating":1,"isEdited":false}}]}