{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31880","data":[{"id":"6172230386","type":"user-reviews","attributes":{"isEdited":false,"title":"Do not download!","date":"2020-07-08T13:22:18Z","userName":"Horsefan11","rating":1,"review":"I wanted to download just to see what would happen, but when I did I heard the crash of thunder outside my window and soon after lightning struck close by my house!! I do NOT recommend this app if you don’t want to cause a lightning storm🥺"}},{"id":"6172216265","type":"user-reviews","attributes":{"isEdited":false,"title":"never get this app","date":"2020-07-08T13:18:26Z","userName":"maddiecleomeyer","rating":1,"review":"i decided to download this app to give our president one more chance. it was all okay until i left my phone open to the app on the countertop when i went to use the bathroom. my pet parrot looked on my phone and when i came out he turned orange with bright yellow hair. i was appalled. the only logical thing to do was to take the parrot outside and feed it to my pet lion. if you want to lose your beloved parrot then sure get the app. but this app cost me my one true love."}},{"id":"6172212014","type":"user-reviews","attributes":{"isEdited":false,"title":"It’s a trick","date":"2020-07-08T13:17:14Z","userName":"cow print face mask","rating":1,"review":"When I first downloaded this app i expected it to be for grown ups. But once i opened I saw a big clown on the front and realized that this isn’t a grownups app, this is for children. I was completely and utterly fooled and should not have waisted my time downloading it."}},{"id":"6172207224","type":"user-reviews","attributes":{"isEdited":false,"title":"Black Lives Matter","date":"2020-07-08T13:15:58Z","userName":"Kaligh L","rating":1,"review":"For starters this app made my phone glitch so badly and all it talks about is how trump is better than everyone else and that is not true now I highly recommend that you do NOT download this app for the sake of your phone"}},{"id":"6172173401","type":"user-reviews","attributes":{"isEdited":false,"title":"Worst app ever!","date":"2020-07-08T13:06:38Z","userName":"Mtabff","rating":1,"review":"When I downloaded this I already had low expectations. And app for a campaign? Only trump stans would ever download it so what’s the point? The whole app is filled with fake, one sided news. Trump is a hypocrite who is scared and inexperienced. If I could give this zero stars then I would"}},{"id":"6172162269","type":"user-reviews","attributes":{"isEdited":false,"title":"Horrible App","date":"2020-07-08T13:03:34Z","userName":"......,.,,..,,","rating":1,"review":"This app gave me a virus, so bad I had to get a new device!!! THE AUDACITY!! It deleted all of my pictures with POC and gave me new random racist pictures, crazy.... I wanted this app to see if I could learn more about my president, but instead... I had to get a new phone. Very disappointed."}},{"id":"6172151104","type":"user-reviews","attributes":{"isEdited":false,"title":"DO NOT GET","date":"2020-07-08T13:00:25Z","userName":"HaleyAlberson","rating":1,"review":"i got this app and then all the sudden my phone literally glitched out. it was so weird... siri even started playing and I SWEAR she sounded possessed and was all like “oranges matter too, i have feelings”... once i deleted the app, my phone worked fine. do not recommend."}},{"id":"6172116261","type":"user-reviews","attributes":{"isEdited":false,"title":"Terrible","date":"2020-07-08T12:50:24Z","userName":"sv*5#$b,#","rating":1,"review":"It glitches out my phone and one week later I found missing files on my device I suspect this stole it or did something either way don’t vote for him he is a rapist and racist and a terrible person in general"}},{"id":"6172090695","type":"user-reviews","attributes":{"isEdited":false,"title":"Making trumps even worse","date":"2020-07-08T12:43:00Z","userName":"SkyeLyn1","rating":1,"review":"Trump has already not been a good choice for president but this app makes it even worse. Everyone also says the media is lying, but the media shows video of him so I do not liked trump before this soooo....."}},{"id":"6172087622","type":"user-reviews","attributes":{"isEdited":false,"title":"✨TERRIBLE✨","date":"2020-07-08T12:42:07Z","userName":"aapqien","rating":1,"review":"I was expecting nothing more then a top tier app from are amazing president. I wanted to download it to support our totally not racist American orange 🧚💖🥳, But as soon as I opened the app, pop up adds started to show up EVERYWHERE! Yeah, POPUP ADS!\nThe app was barely useable because ads kept showing up, as I said EVERWHERE!"}}]}