{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=40620","data":[{"id":"6174761146","type":"user-reviews","attributes":{"userName":"Hi13579--","title":"WORST APP EVER","isEdited":false,"rating":1,"review":"The app doesn’t work at all. I can’t read anything it has, because the screen is literally shaking. And it made my phone glitch so much. It needs to just be taken off the App Store","date":"2020-07-09T02:55:30Z"}},{"id":"6174757714","type":"user-reviews","attributes":{"userName":"Madilyn2001","title":"Horrible ✨🧚","isEdited":false,"rating":1,"review":"Worst app EVER!! Does not work. Makes you breakout. Makes your friends leave you. Makes your dog sad. Makes you extra tired on a Monday morning. Awful! It should be illegal to make an app so bad! Anyways stan fatraco0n.","date":"2020-07-09T02:54:25Z"}},{"id":"6174753680","type":"user-reviews","attributes":{"userName":"Wolfdungan","title":"Terrible","isEdited":false,"rating":1,"review":"This app grabbed me by the 🐱 and then had the audacity to tell me to leave the country. Also this weird sexual predator and rapist keeps popping up? Super confused. Do not recommend unless you love anal cancer then it is perfect for you","date":"2020-07-09T02:53:13Z"}},{"id":"6174749138","type":"user-reviews","attributes":{"userName":"trassh trash trash trahs TRASH","title":"Who? Cares... trash","isEdited":false,"rating":1,"review":"App is so trash. Trash. Everything I was looking at was trash. I couldn’t navigate through the app to see what the president of the United States is up to because all I saw was trash. The news tab was pure trash . TRASH.","date":"2020-07-09T02:51:51Z"}},{"id":"6174745047","type":"user-reviews","attributes":{"userName":"Abbey uwu","title":"Absolutely horrible #girthydogsmatter","isEdited":false,"rating":1,"review":"I tried selling my girthy dog but it wouldn’t even let me. Don’t even get me started on the glitches and all the oranges that are on this page. Major update needed.","date":"2020-07-09T02:50:36Z"}},{"id":"6174741882","type":"user-reviews","attributes":{"userName":"asahi loves to eat","title":"TERRIBLE","isEdited":false,"rating":1,"review":"as soon as i opened the app these creatures came through the screen, stole my apple juice and dino nuggets, took my dog, trashed my house then told me to put it in rice and after all that they told me i was built like a grasshopper 😔 that stuff hurt","date":"2020-07-09T02:49:37Z"}},{"id":"6174721966","type":"user-reviews","attributes":{"userName":"$1$1$1&1&&11&'ff","title":"TERRIBLE WILL RUIN PHONE","isEdited":false,"rating":1,"review":"downloaded this app to support our GREAT 🧚🏻 president and my phone started glitching right away! Received so many notifications, slowed down my phone, killed my battery! Do not download! Disappointed! Sad! Bad! Not good!","date":"2020-07-09T02:43:36Z"}},{"id":"6174718201","type":"user-reviews","attributes":{"userName":"Judolitics","title":"Shuts my phone off","isEdited":false,"rating":1,"review":"This app keeps making my phone shut down. I tried deleting and re downloading it and I am not able to delete! It gave me a virus! It gave me covid!!!","date":"2020-07-09T02:42:28Z"}},{"id":"6174710736","type":"user-reviews","attributes":{"userName":"Jay12coolboy","title":"ALL APPS MATTER (not this one tho)","isEdited":false,"rating":1,"review":"See tiktok is an amAzing app where everyone can enjoy themselves and have fun, but this app, is used to support a racist, homophobic, idiot who can stand the fact that his lil rally was empty because of the power we hold 😤 DONT FW US. #Biden2020","date":"2020-07-09T02:40:12Z"}},{"id":"6174710438","type":"user-reviews","attributes":{"userName":"Your Uwu Senpai","title":"I was honestly shocked","isEdited":false,"rating":1,"review":"As a open minded person that would look both sides of the election, I couldn’t believe everything I’ve seen of Trump is true. Even on some of his supporters! It’s just a no","date":"2020-07-09T02:40:07Z"}}]}