{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=27970","data":[{"id":"6174966649","type":"user-reviews","attributes":{"date":"2020-07-09T03:57:03Z","rating":1,"review":"I was absolutely horrified to see it ask for my phone number. I feel that my personal information was at risk. It could sense I was a person of color and started glitching and the screen went RED ‼️ I am so appalled and offended by this. This app needs to be removed IMMEDIATELY!!! I BEG YOU DO NOT DOWNLOAD THIS APP‼️🤢🤢🤢🤮🤮🤮","userName":"The_Barbz","isEdited":false,"title":"Worst app ever invented"}},{"id":"6174941054","type":"user-reviews","attributes":{"date":"2020-07-09T03:49:01Z","rating":1,"review":"I thought this was just going to be a solely politics app, but when I opened it, I was terrified. The app raided my house and abducted my whole family! Now I have nothing left. Please be careful if you download this app because it’s very dangerous! If I could give the app zero stars, I would.","userName":"frdi's Ipod","isEdited":false,"title":"Bad App"}},{"id":"6174930013","type":"user-reviews","attributes":{"date":"2020-07-09T03:45:36Z","rating":1,"review":"I thought being a leader of a country meant to support others and not judge anyone and just have peace but guess what... NOPE our us president had to build a wall which ended with separating families and he said stuff about blacks and other things it’s just so absurd","userName":"rebecaadelaney457","isEdited":false,"title":"Poor using"}},{"id":"6174923743","type":"user-reviews","attributes":{"date":"2020-07-09T03:43:43Z","rating":1,"review":"I am so disappointed with this app. I really just expected so much more, well not really to be honest. It gave my phone a virus, I had to buy a new one. Also, it won’t run at all, due to the constant notifications. Just get rid of the app. It’s useless.","userName":"jessamberb","isEdited":false,"title":"horrible app."}},{"id":"6174894203","type":"user-reviews","attributes":{"date":"2020-07-09T03:34:54Z","rating":1,"review":"I’ve had a phone from the second I was born and have never had such a terrible app I downloaded it and it broke my phone then my dog was attacked by the ghost the app left I’ve never been so disappointed and dissatisfied in an app and it’s creators and purpose my fridge exploded and the oven ate my pizza I hate this app DONT DOWNLOAD WORST APP EVER!!!!!","userName":"Puppy$$$","isEdited":false,"title":"WORST APP IVE EVER DOWNLOADED"}},{"id":"6174872635","type":"user-reviews","attributes":{"date":"2020-07-09T03:28:41Z","rating":1,"review":"Why would I need to put my phone number in? I mean I just wanted to see what it was about and instantly I’m feeling telemarketer to...take last centuries sales tactics and tuck away with last centuries human rights stances and leave em where they belong. Way the heck gone.","userName":"Chunkymonkey2400","isEdited":false,"title":"Is there a rating below 1 star?"}},{"id":"6174849843","type":"user-reviews","attributes":{"date":"2020-07-09T03:21:58Z","rating":1,"review":"If I could give this app 0 stars, I would. Not only is it incredibly slow, it also comes with a great deal of glitches and is overall a terrible app. If you plan on downloading this app, I’m warning you right now, don’t waste your time.","userName":"donnie is a white supremacist","isEdited":false,"title":"🤢🤮"}},{"id":"6174848153","type":"user-reviews","attributes":{"date":"2020-07-09T03:21:27Z","rating":1,"review":"When the app was forcible pushed onto my phone in 2016, but it has gotten significantly worse in recent months. Its full of viruses! The developers said they were gonna fix it but instead they are stopping testing to improve their PR. It was terrible the first time DO NOT DOWNLOAD FOR A SECOND TERM!","userName":"Katiebear416","isEdited":false,"title":"Full of viruses!"}},{"id":"6174842588","type":"user-reviews","attributes":{"date":"2020-07-09T03:19:49Z","rating":1,"review":"This app contains extremely explicit content to individuals of all ages. The distasteful and abhorrent content shown on this app is EMBARRASSING. I am beseeching that those younger than the age of 18 will download at risk, because your eyes may be scarred. Donald Trump is a rapist, racist, homophobic, sexist, and many more horrifying things that are a threat to humanity and he NEEDS to be stopped.","userName":"Elalesmitch","isEdited":false,"title":"I am HORRIFIED."}},{"id":"6174835868","type":"user-reviews","attributes":{"date":"2020-07-09T03:17:50Z","rating":1,"review":"Downloaded this app and my phone immediately started glitching so bad. I have never had issues with my phone before. May need to buy a new $1000 phone😒 don’t download this unless you want to break your phone.","userName":"kayyyyyyyyy66772936","isEdited":false,"title":"Ruined my phone."}}]}