{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=31400","data":[{"id":"6178364604","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"i downloaded this app so i could see how trump is making america great again but nowhere could i find anything about that. also the picture that i saw when i first opened the app was an orange🍊 holding up a fist? which confused me because he doesn’t support the black community. the app also asked for my phone number which i am not comfortable sharing. this app needs to get taken down because it’s not helping at all.😬","userName":"itzz.alexa","date":"2020-07-09T21:51:24Z","title":"such a bad app🤮"}},{"id":"6178336391","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I downloaded this app just to see a video of not one but two dancing hot cheetos, I immediately closed the app. I soon received a notification that 100 euros would be deducted from my account! We don’t even use euros! Save yourself! Just vote for Biden!","userName":"Hot Cheeto Virus!!!","date":"2020-07-09T21:40:33Z","title":"Gave My Phone A Hot Cheeto Virus"}},{"id":"6178320249","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I have never downloaded such a horrible political app in my life! I would 10/10 not ever get again. It crashes all the time and every time I open the app I feel a big wave of disgust for even downloading the app in the first place. DONT DOWNLOAD IT OR YOU WILL GET SICK!","userName":"Christmas1234567890😜","date":"2020-07-09T21:34:31Z","title":"Bad bad bad"}},{"id":"6178253411","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I was completely astounded to download this app and find that there was absolutely nothing that mentions how much the president hates women, BIPOC, immigrants, or the LGBTQ+ community! As a REAL republican myself, I demand that the president support that anti-minority movement with his whole chest, as I do! I hate people who are not straight white cis males! I am a woman! I HATE MYSELF!","userName":"apslol","date":"2020-07-09T21:10:02Z","title":"REAL REPUBLICANS HATE THIS APP"}},{"id":"6178251364","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"mr orange man soon came to me in vision after downloading app he told me if I didn’t write this review he would eat my first born donkey him threatened me and made my phone blow up in my sisters grandmas pet monkeys hand killing his twin brother who is also a cat. Please help get this terrible app off the App Store.","userName":"nsnankaizksmsm","date":"2020-07-09T21:09:17Z","title":"mr orange man bad"}},{"id":"6178234518","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This app should not be allowed in the app store. It is the worst app known to man and the things that are on this app is HORRID. This should be removed from the app store IMMEDIATELY. I can not fathom enough how terrible this app is. Apple if you read these please, PRETTY PLEASE, remove this app at once.","userName":"axelgrease123","date":"2020-07-09T21:03:11Z","title":"tiktok made me do it"}},{"id":"6178216565","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I downloaded this app because I looooove and support Mr trump our fearless leader but for some reason the app won’t open. I’ve deleted and downloaded this app at least a dozen times and it won’t open on my IPhone 11 Pro. What’s the deal?","userName":"CosmicAuthority","date":"2020-07-09T20:56:50Z","title":"Very poorly designed and coded"}},{"id":"6178206167","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"When I first got the app it was good but then it was spamming me, the spam was telling me to do racist thing, I am Mexican and I do have stand with racism, so I have been ignoring it and it has just been spamming so I deleted it and it is just a horrible app\n\n                                            DO NOT GET","userName":"poooooooooooooooooo tastik","date":"2020-07-09T20:53:08Z","title":"Spam"}},{"id":"6178204554","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I downloaded this app to learn more but there is absolutely no where to get more information. It’s all propaganda. The user experience was so poor and the app crashed on me 3 times in ten minutes. Sad! The most tremendously bad app of all time.","userName":"Joshhdjdjdj","date":"2020-07-09T20:52:32Z","title":"Worst App Ever!!!"}},{"id":"6178173225","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"Just opening the app immediately made me feel like I was going to vomit. The energy I get from just trump in general makes me SICK. Even when my little brother sees this man, he can’t go anywhere for the rest of the day because he’s “too nauseous.”","userName":"trumprevoltsme","date":"2020-07-09T20:41:38Z","title":"Just REVOLTING"}}]}