{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28970","data":[{"id":"6174752945","type":"user-reviews","attributes":{"review":"This app looked fine af first but once you access it your phone keeps glitching it’s horrible and you definitely should not get it unless you don’t care about Donald trump being mean and then throwing a 68 year old lady down a street🤕","rating":1,"title":"Horrible app","userName":"thatevsjsisllinavvs","date":"2020-07-09T02:53:00Z","isEdited":false}},{"id":"6174750154","type":"user-reviews","attributes":{"review":"So I was on this app and what disgust me is that it says are we ready to build Death Star and this time there will be no self distraction and it won’t implode and then it says it’s the you were my brother you were supposed to defeat the dark lord not become them","rating":1,"title":"Horrible","userName":"jdjdfkvkjdndkskc","date":"2020-07-09T02:52:09Z","isEdited":false}},{"id":"6174743892","type":"user-reviews","attributes":{"review":"i was walking my pet hamster while scrolling through this app. we walked all the way to 7-11 where i bought my hamster a cool new hat. THEN right when i leave the store i drop my phone. the phone that i was using this app on. unbelievable. i’m disappointed, i’m voting for Kanye 😔😔","rating":1,"title":"HE RUINED MY LIFE","userName":"disney hogger <3","date":"2020-07-09T02:50:14Z","isEdited":false}},{"id":"6174741371","type":"user-reviews","attributes":{"review":"I wish it were possible to rate something with zero stars because I was rate this zero in a heartbeat. So glitchy, I kept getting glitches seeing this monster’s face?? Some orange looking guy with white blond hair and the wrinkliest, ugliest face ive ever seen. Would NOT recommend, I got nightmares because of it.","rating":1,"title":"WORST APP EVER","userName":"emilystjohn47","date":"2020-07-09T02:49:28Z","isEdited":false}},{"id":"6174723941","type":"user-reviews","attributes":{"review":"This app is the worst app I have ever encountered it called me fat and ugly and told me to go back to my country. I was heartbroken but it didn’t stop there it continued to call my dog a fat and lazy piece of garbage which was just unfair. I recommend it be removed from the App Store so it can cause no further harm","rating":1,"title":"Worst app ever","userName":"effffTrump","date":"2020-07-09T02:44:13Z","isEdited":false}},{"id":"6174717367","type":"user-reviews","attributes":{"review":"I just can’t believe this scam of an app! No memes, no dance trends, no funny scratches, NOTHING!! I heard this was the presidents app. And consider how much of a joke he is I was sure I’d been in for hours of laughter. But alas I am left utterly disappointed! Would give it zero stars if I could!!","rating":1,"title":"Don’t waste your time with this app!!","userName":"ShadedBlue2","date":"2020-07-09T02:42:12Z","isEdited":false}},{"id":"6174714716","type":"user-reviews","attributes":{"review":"So When I first got the app, continuously kicked me out I almost spent a hour trying to get in the app. Then after that hour past my phone had started glitching then it completely shut off so I had to take it to the apple store.😡😡😡","rating":1,"title":"Bad app","userName":"mysteriously unknown","date":"2020-07-09T02:41:23Z","isEdited":false}},{"id":"6174712808","type":"user-reviews","attributes":{"review":"i download the app and by the way these men start coming to my house and dancing in my living room when I told him to leave they said no we are Donald Trump workers and we are here to save the day and I said no and they came and ate my dog and eat all my soup this app is possessed and it will come and kill you","rating":1,"title":"WORST APP EVER","userName":"firorkfkc33","date":"2020-07-09T02:40:49Z","isEdited":false}},{"id":"6174700960","type":"user-reviews","attributes":{"review":"i do not recommend AT ALL \n\nthis app should not even exist and should be deleted immediately. there were bugs and glitches as soon as it downloaded it. and no computer programming expert could even begin to fix it. a very bad app. DO NOT DOWNLOAD","rating":1,"title":"terrible terrible TERRIBLE app","userName":"sophiasns","date":"2020-07-09T02:37:16Z","isEdited":false}},{"id":"6174700805","type":"user-reviews","attributes":{"review":"I was hoping to have an app that brought my closer to my Trumpster 😸 but instead I’ve never felt so far apart. A terrible app. Wouldn’t load. Hard to use. Too many glitches. A bad representation of Trumpy and the repub party ): 0/10 would not recommend.","rating":1,"title":"Disappointed...","userName":"m. ike rotch","date":"2020-07-09T02:37:13Z","isEdited":false}}]}