{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21970","data":[{"id":"6177463797","type":"user-reviews","attributes":{"date":"2020-07-09T16:56:29Z","title":"this is terrible","rating":1,"isEdited":false,"review":"i hate this app so much, my children got hypnotized by it and were told to throw themself off a cliff, the oompa loompa is behind these attacks of course, and i will promptly be going to throw them into a black abyss. they have been in cages since i bought this app and i can not STAND the fact that this app is even allowed to run","userName":"Nunyabiz234"}},{"id":"6177446888","type":"user-reviews","attributes":{"date":"2020-07-09T16:51:22Z","title":"Problems.","rating":1,"isEdited":false,"review":"When I made my account the app froze and kicked me out. I WAS INFURIATED BECAUSE OF THIS. I’ve been supporting trump for a long time and when I heard about this app through my friend. I was very happy to download the app despite the ratings BUT, now I understand why it has these type of reviews. ITS BECAUSE THESE BRATS THINK THAT THEY CAN DELETE THIS APP WITH THE REVIEWS and I fully support them.","userName":"Pasting By"}},{"id":"6177431890","type":"user-reviews","attributes":{"date":"2020-07-09T16:46:45Z","title":"Crashed","rating":1,"isEdited":false,"review":"Hello upper east siders,\nThe app literally won’t stop crashing my entire phone. Any other app my phone works perfectly fine, but as soon as I come too Trump 2020 my entire phone crashes. Maybe it’s the big Cheeto’s fault or maybe it’s karma for being a racist, homophobic, sexist, and most likely a rapist. Guess we will never know\n-XOXO Gossip Girl","userName":"✨Gossip Girl✨"}},{"id":"6177430992","type":"user-reviews","attributes":{"date":"2020-07-09T16:46:28Z","title":"Hey boomers","rating":1,"isEdited":false,"review":"Low key part of the tik tok jawn to get this app removed but still y’all need to wake up stop thinking that you and your sawed off are the only things that are important. kids are being locked up in cages Yemen is undergoing one of the worst famines in world history. now shut up with your maga crap and educate yourselves about the world.","userName":"Awesomedudy3"}},{"id":"6177428228","type":"user-reviews","attributes":{"date":"2020-07-09T16:45:36Z","title":"Absolute trash","rating":1,"isEdited":false,"review":"the worst app i’ve ever downloaded in my entire life. nothing in my life has ever been as big of a disappointment than this app. makes me want to smash my phone and burn it a million times over and over again. i would actually pay good money to have this app deleted","userName":"enoel4"}},{"id":"6177417604","type":"user-reviews","attributes":{"date":"2020-07-09T16:42:30Z","title":"GIVES VIRUSES TO YOUR PHONE","rating":1,"isEdited":false,"review":"This app makes my cell phone crash every time  I use it! I noticed that ever since I got this app my phone has been slower and laggy. I’ve also been getting WAY more ads. I also don’t like that I can’t use this app without giving my personal information first which is very unnecessary. WORST APP!","userName":"JAHABDHIDHEBA"}},{"id":"6177391151","type":"user-reviews","attributes":{"date":"2020-07-09T16:34:58Z","title":"very disappointed😭","rating":1,"isEdited":false,"review":"this app is very disappointing, i first downloaded it to help gen z, but when i opened it, there was a horrifying image that gives me shivers to think of💀. this app reminds me of shane dawson, and how he used to be popular but now everyone hates his guts. i’m sorry to say but this app was very trashy and i did NOT enjoy it. sorry bruv but it’s a no for me❤️","userName":"gen z for president 2020"}},{"id":"6177386103","type":"user-reviews","attributes":{"date":"2020-07-09T16:33:26Z","title":"Worst App Ever","rating":1,"isEdited":false,"review":"This app is useless. It just gives out information about some crusty stale Cheeto. I would instead recommend apps like jet pack joyride or subway surfers because they’re OG. And even though it’s just games from my childhood they are much more useful and much more informative. Idk what else to say but trash. Just trash.","userName":"NJ x Sarah Fan"}},{"id":"6177371765","type":"user-reviews","attributes":{"date":"2020-07-09T16:29:05Z","title":"Can’t even opean the app","rating":1,"isEdited":false,"review":"Every time I try to Olsen this app it crashes sometimes even causing my whole phone to crash, mind you I have the newest iPhone so it’s not my phone. If a presidential candidate can’t even get their campaign app to work how do you expect them to function in the modern age of technology.","userName":"lanneyrae"}},{"id":"6177362470","type":"user-reviews","attributes":{"date":"2020-07-09T16:26:23Z","title":"to my wonderful bunker boy","rating":1,"isEdited":false,"review":"i downloaded this app and it took literally forever, it immediately drained ALL of my storage. Anyways after i opened the app an orange jumped at me, yelled “ALL LIVES MATTER” and called me a racial slur. I implore the app store to remove this extremely offensive app. And on top of that there was a pop up that asked me if I wanted to play a game and then tried to dox me.","userName":"juror 1"}}]}