{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=17000","data":[{"id":"6178209714","type":"user-reviews","attributes":{"review":"He deserves no apps nothing because he is a racists sexist pig and should’ve never had the CHANCE to run this country not only that but this app is horrible bugs everywhere confusing as well and shouldn't be in the app store for people to buy i’m pretty sure they’re collecting confidential information from peoples phone without permission terrible terrible app.","userName":"yo moms yo","rating":1,"date":"2020-07-09T20:54:22Z","isEdited":false,"title":"TAKE IT OFF"}},{"id":"6178198996","type":"user-reviews","attributes":{"review":"There are little pop ups of mono and terrible terrible things that is giving people’s info out it’s terrible HE IS banning TikTok and it makes people mad tik tok makes everybody Way more positive  throughout this \nPandemic they also asked for my credit card information and asked my home address I feel that it’s to personal and disgusting.","userName":"TERRIBLE k","rating":1,"date":"2020-07-09T20:50:35Z","isEdited":false,"title":"This is a terrible app!!"}},{"id":"6178193676","type":"user-reviews","attributes":{"review":"This app kept putting out a smell that was soo weird it must be part of the new apple update. I am soo confused it smelled like rotten Cheetos. Also it took a week to download and I have the iPhone XR and usually it takes 30 seconds for an app to download. Then when it did download all the info was in another language, I think it was the language fascist sexist and racist. Help!","userName":"liora brp","rating":1,"date":"2020-07-09T20:48:43Z","isEdited":false,"title":"It was smelly"}},{"id":"6178173471","type":"user-reviews","attributes":{"review":"When I downloaded the app, seemed all fine and dandy. I was so excited to have the app to support our GrEat leader! But after having the app for only a few minutes, my phone started to crash! It did not matter where I was on my phone, just having the app continued to crash. So I had to delete this app and I’m sad now...Please fix this bug! LoVE wHaT TRuMp is DoiNg! 🤪","userName":"Ac_B","rating":1,"date":"2020-07-09T20:41:44Z","isEdited":false,"title":"Worst app EVER!"}},{"id":"6178162631","type":"user-reviews","attributes":{"review":"So I’m only writing this because he said he is gonna take away Tiktok. Which he doesn’t understand he’s not just taking a app. He’s taking away jobs, creativity, inspiration, laughs, stories, a boredom cure, and most of all, a family. So many people have put money and time into tiktok and for him to just take it away like that isn’t ok and is gonna hurt SO many people.","userName":"TikTok.Best","rating":1,"date":"2020-07-09T20:38:01Z","isEdited":false,"title":"DONT TAKE AWAY TIKTOK"}},{"id":"6178148509","type":"user-reviews","attributes":{"review":"Upon opening this app it immediately asked me for my number and email. Um. Weird. At least get to know me first before you’re asking all this personal info. After that it kept showing me all these fake and uninformative pics and stories about the president. If I wanted to know about the president I’d download the PRESIDENT app. This is the DRUMPF app. Get it right. 1 star.","userName":"bernardsanders","rating":1,"date":"2020-07-09T20:33:08Z","isEdited":false,"title":"Not bad (take out the not 🧚‍♀️💫🥰)"}},{"id":"6178121408","type":"user-reviews","attributes":{"review":"I am so sorry to Earth and the humans. I never thought I could make such a mistake making this human. I tried giving y’all a little spice but it turned out it was to much. Yes I did get help from my buddy the Devil yo make Donald but I thought it would be good to put good and evil together because again no one is perfect but the Devil betrayed me and put all his evilness in him I am so sorry please forgive me. :(((","userName":"child...anways want some food","rating":1,"date":"2020-07-09T20:23:57Z","isEdited":false,"title":"GOD"}},{"id":"6178112052","type":"user-reviews","attributes":{"review":"I had high hopes for this app considering it’s funded by and made to support the president of my country. Yet it was so disappointing to see the amount of unorganized sections that wouldn’t load and an extraordinary amount of grammatical errors. Confused on how we’re supposed to make america great again when the president can’t have a great app in the first place...","userName":"kayla_rae132","rating":1,"date":"2020-07-09T20:20:52Z","isEdited":false,"title":"Don’t have high expectations."}},{"id":"6178082191","type":"user-reviews","attributes":{"review":"Really disappointed me, it made my phone crash everytime I opened up the app. Made it crash so bad that all my contacts and photos were deleted. Extremely infuriated, expected a lot more from our president.  Normally Im all for our wonderful  amazing racist rapist queerphobic pig of a president but I strongly do not recommend getting this app... Would give 0 stars if I could.","userName":"jowhoen","rating":1,"date":"2020-07-09T20:10:58Z","isEdited":false,"title":"TERRIBLE APP"}},{"id":"6178081594","type":"user-reviews","attributes":{"review":"I downloaded this because why not??? This is our wonderful lovely president and we must support. But it’s just a god awful app, and I can’t believe the audacity of the things I’ve read. How woman deserve to be assaulted? How we shouldn’t ever had rights !!! Trump think us women should be punished just for being women??? What an awful orange man he doesn’t deserve money or an app. Don’t download waste of time.","userName":"idontwannamakeone","rating":1,"date":"2020-07-09T20:10:45Z","isEdited":false,"title":"Sucksss"}}]}