{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=104100","data":[{"id":"6177552067","type":"user-reviews","attributes":{"review":"I don’t like the app but I wanted to share a Hamilton song to inspire you to fight for what you believe in so here you go:\n\nNon Stop:\nAfter the war I went back to New York\nA-After the war I went back to New York\nI finished up my studies and I practiced law\nI practiced law, Burr worked next door\nEven though we started at the very same time\nAlexander Hamilton began to climb\nHow to account for his rise to the top?\nMan, the man is\nNon-stop\nGentlemen of the jury, I'm curious, bear with me\nAre you aware that we're making hist'ry?\nThis is the first murder trial of our brand-new nation\nThe liberty behind\nDeliberation (Non-stop)\nI intend to prove beyond a shadow of a doubt\nWith my assistant counsel\nCo-counsel\nHamilton, sit down\nOur client Levi Weeks is innocent\nCall your first witness\nThat's all you had to say\nOkay\nOne more thing\nWhy do you assume you're the smartest in the room?\nWhy do you assume you're the smartest in the room?\nWhy do you assume you're the smartest in the room?\nSoon that attitude may be your doom (aww)\nWhy do you write like you're running out of time?\nWrite day and night like you're running out of time?\nEv'ry day you fight, like you're running out of time\nKeep on fighting\nIn the meantime\nNon-stop\nCorruption's such an old song that we can sing along in harmony\nAnd nowhere is it stronger than in Albany\nThis colony's economy's increasingly stalling and\nHonestly, that's why public service\nSeems to be calling me (he's just non-stop)\nI practiced the law, I practic'ly perfected it\nI've seen injustice in the world and I've corrected it\nNow for a strong central democracy\nIf not, then I'll be Socrates\nThrowing verbal rocks\nAt these mediocrities (aww)\nHamilton, at the constitutional convention\nI was chosen for the constitutional convention\nThere as a New York junior delegate\nNow what I'm going to say may sound indelicate (aww)\nGoes and proposes his own form of government (what?)\nHis own plan for a new form of government (what?) \nTalks for six hours\nThe convention is listless\nBright young man\nYo, who the f is this?\nWhy do you always say what you believe?\nWhy do you always say what you believe?\nEv'ry proclamation guarantees free ammunition for your enemies\nWhy do you write like it's\nGoing out of style?\nWrite day and night like it's\nGoing out of style?\nEv'ry day you fight like it's\nGoing out of style\nDo what you do\nAlexander?\nAaron Burr, sir\nIt's the middle of the night\nCan we confer, sir?\nIs this a legal matter?\nYes, and it's important to me\nWhat do you need?\nBurr, you're a better lawyer than me\nOkay\nI know I talk too much, I'm abrasive\nYou're incredible in court\nYou're succinct, persuasive\nMy client needs a strong defense\nYou're the solution\nWho's your client?\nThe new U.S. Constitution?\nNo\nHear me out\nNo way\nA series of essays, anonymously published\nDefending the document to the public\nNo one will read it\nI disagree\nAnd if it fails?\nBurr, that's why we need it\nThe constitution's a mess\nSo it needs amendments\nIt's full of contradictions\nSo is independence\nWe have to start somewhere\nNo\nNo way\nYou're making a mistake\nGood night\nHey\nWhat are you waiting for?\nWhat do you stall for? (what?)\nWe won the war\nWhat was it all for?\nDo you support this constitution?\nOf course\nThen defend it\nAnd what if you're backing the wrong horse?\nBurr, we studied and we fought and we killed\nFor the notion of a nation we now get to build\nFor once in your life, take a stand with pride\nI don't understand how you stand to the side\nI'll keep all my plans\nClose to my chest (wait for it, wait for it, wait)\nI'll wait here and see\nWhich way the wind\nWill blow\nI'm taking my time\nWatching the\nAfterbirth of a nation\nWatching the tension grow\nI am sailing off to London\nI'm accompanied by someone\nWho always pays\nI have found a wealthy husband who will keep\nMe in comfort for all my days\nHe is not a lot of fun, but there's no one who\nCan match you for turn of phrase\nMy Alexander\nAngelica\nDon't forget to write\nLook at where you are\nLook at where you started\nThe fact that you're alive is a miracle\nJust stay alive, that would be enough\nAnd if your wife could share a fraction of your time\nIf I could grant you peace of mind\nWould that be enough?\nAlexander joins forces with James Madison and John Jay to write a series of essays \nDefending the new United States constitution\nEntitled The Federalist papers\nThe plan was to write a total of twenty-five essays\nThe work divided evenly among the three men\nIn the end, they wrote eighty-five essays, in the span of six months\nJohn Jay got sick after writing five\nJames Madison wrote twenty-nine\nHamilton wrote the other fifty-one\nHow do you write like you're\nRunning out of time?\nWrite day and night like you're\nRunning out of time?\nEv'ry day you fight\nLike you're\nRunning out of time\nLike you're\nRunning out of time\nAre you\nRunning out of time? \nHow do you write like tomorrow won't arrive?\nHow do you write like you need it to survive?\nHow do you write ev'ry second you're alive?\nEv'ry second you're alive? Ev'ry second you're alive?\nThey are asking me to lead\nI am doing the best I can\nTo get the people that I need\nI'm asking you to be my right hand man\nTreasury or State?\nI know it's a lot to ask\nTreasury or State?\nTo leave behind the world you know\nSir, do you want me to run the Treasury or State department?\nTreasury\nLet's go\nAlexander\nI have to leave\nAlexander\nLook around, look around at how lucky we are to be alive right now\nHelpless\nThey are asking me to lead\nLook around, isn't this enough?\nHe will never be satisfied\nHe will never be satisfied\nSatisfied\nSatisfied\nHe will never be satisfied\nSatisfied\nSatisfied\nHistory has its eyes on you\nI am not throwin' away my shot\nI am not throwin' away my shot\nI am\nAlexander Hamilton\nI am not throwin' away my shot\n\nBoooo, it won’t let me copy and paste more songs but let me leave you with this- never let anyone cloud your voice, never let anyone stop you from taking action in what you believe in, we can make a difference if we rise up together! 😊","rating":1,"userName":"geek-girl-28","isEdited":false,"title":"no thank you","date":"2020-07-09T17:23:28Z"}},{"id":"6177541406","type":"user-reviews","attributes":{"review":"Last week I was recommended this app from a close family friend of my husbands.  I was expecting a 5 star app, simply because it was made for and from our president, Donald Cheeto Trump. What I was meet with took me back completely. As I am typing this a singular tear drop runs down my cold, rosy, face. When I open the app I saw a toolbar with the word artisan crafted  fan fictions written on it. As a 48 year-old anime lover I immediately clicked on it. What I was met with completely took me back and utter and complete shock the fan fiction is as follows;\n\n  “Today I went to the bakery by my house. Just like every day. Except this time I saw HIM. The person I suspect to be my sole mate. His long wispy yellow hair was blowing from the ceiling fans, his pot belliedStomach was flopping over his belt. I have never seen anything more attractive in my life. I never expected to see him again never in my life. But then at noon today at work I saw him enter. He was the new hire. And he shared a desk cluster with me. As it turns out his personality was just distracted as his looks.  He love to get a pointless arguments about human rights, and when else failed he just started talking about economics. Everything about him was so attractive. I never expected him, at the end of the day, to ask me out to golfing game. As. A. Date. I couldn’t believe it. I had only known this man for less than a day. And he too, loved me. So I picked up the prettiest golfing skirt tank top visor and shoes I could find and when I met him thereHe was wearing a sweat stained white polo with sweat stained matching white shirt socks shoes and visor. Little did I know he was so rich that he had for the people to play for him. I was able to talk to him. I did end of the day right when the sun was about to say over the mountains in the background, he leaned over to kiss me when I asked for his name he said Donald Cheeto TrumpI’ve never heard of a name more attractive than that. As I leaned in to kiss him he whispered into my ear. “I...am.... a white suprematist...” The end” \n\nnow I don’t know about you but I don’t know why this liberal propaganda was on my president’s 2020 campaign app. These liberals must be stopped before they can do real damage. These liberals are ridiculous I cannot believe they decided to hack into Donald Cheeto trumps campaign app and leave this sentence: he is a white supremacist at the end of a disgusting fanfiction it should not be for any man’s eyes although that sentence is true it’s still repulsed me. And for this reason I had to delete the app burn my phone and throw the ashes into a nearby river IThen had a funeral for it because all of my nieces nephews and grandchildren’s photos were on it. I am typing this from my 2002 silver premium Nintendo refrigerator.I do not recommend this app for any sane human. it disgusted me. \n\nAnyways Trump 2020 (not really though eww)\n\nOh and it crashed my phone over night (for real) so yah that’s it","rating":1,"userName":"OFFENSIVE FANFICTION","isEdited":false,"title":"Distasteful fanfiction","date":"2020-07-09T17:20:08Z"}},{"id":"6177539285","type":"user-reviews","attributes":{"review":"a racist person does not deserve their own app.","rating":1,"userName":"Sadie1122","isEdited":false,"title":"eww","date":"2020-07-09T17:19:28Z"}},{"id":"6177524268","type":"user-reviews","attributes":{"review":"worst app ever. HE IS TRYING TO BAN TIKTOK! NO SIR! HE CANT GET PAST GEN Z WITHOUT A FIGHT!","rating":1,"userName":"Misscope36","isEdited":false,"title":"doesn’t even deserve one star!","date":"2020-07-09T17:14:48Z"}},{"id":"6177509242","type":"user-reviews","attributes":{"review":"nasty and disrespectful. this app supports hate crimes and should be banned 😾","rating":1,"userName":"kuween9978","isEdited":false,"title":"horrible","date":"2020-07-09T17:10:05Z"}},{"id":"6177495740","type":"user-reviews","attributes":{"review":"✨Please stop ✨","rating":1,"userName":"ur mom 👁👄👁","isEdited":false,"title":"No","date":"2020-07-09T17:05:57Z"}},{"id":"6177484739","type":"user-reviews","attributes":{"review":"Boooo boooo","rating":1,"userName":"Dj855885","isEdited":false,"title":"I hate this app don't band tiktok please","date":"2020-07-09T17:02:37Z"}},{"id":"6177482541","type":"user-reviews","attributes":{"review":"no  just no❤️. makes me want to eat tide pods again ✨🧚🏼‍♀️🦋🐛","rating":1,"userName":"isabeltheawesome15","isEdited":false,"title":"no ❤️","date":"2020-07-09T17:01:57Z"}},{"id":"6177470121","type":"user-reviews","attributes":{"review":"That’s it, that’s the review","rating":1,"userName":"@Hey_its_miriam_","isEdited":false,"title":"Trash","date":"2020-07-09T16:58:17Z"}},{"id":"6177465332","type":"user-reviews","attributes":{"review":"Somebody once told me the world is gonna roll me\nI ain't the sharpest tool in the shed\nShe was looking kind of dumb with her finger and her thumb\nIn the shape of an \"L\" on her forehead\nWell, the years start coming and they don't stop coming\nFed to the rules and I hit the ground running\nDidn't make sense not to live for fun\nYour brain gets smart but your head gets dumb\nSo much to do, so much to see\nSo what's wrong with taking the backstreets?\nYou'll never know if you don't go\nYou'll never shine if you don't glow\nHey now, you're an all star\nGet your game on, go play\nHey now, you're a rock star\nGet the show on, get paid\nAnd all that glitters is gold\nOnly shooting stars break the mold\nIt's a cool place, and they say it gets colder\nYou're bundled up now, wait 'til you get older\nBut the meteor men beg to differ\nJudging by the hole in the satellite picture\nThe ice we skate is getting pretty thin\nThe water's getting warm so you might as well swim\nMy world's on fire, how 'bout yours?\nThat's the way I like it and I'll never get bored\nHey now, you're an all star\nGet your game on, go play\nHey now, you're a rock star\nGet the show on, get paid\nAll that glitters is gold\nOnly shooting stars break the mold\nSomebody once asked\nCould I spare some change for gas?\n\"I need to get myself away from this place\"\nI said, \"Yep, what a concept\nI could use a little fuel myself\nAnd we could all use a little change\"\nWell, the years start coming and they don't stop coming\nFed to the rules and I hit the ground running\nDidn't make sense not to live for fun\nYour brain gets smart but your head gets dumb\nSo much to do, so much to see\nSo what's wrong with taking the backstreets?\nYou'll never know if you don't go (go!)\nYou'll never shine if you don't glow\nHey now, you're an all star\nGet your game on, go play\nHey now, you're a rock star\nGet the show on, get paid\nAnd all that glitters is gold\nOnly shooting stars break the mold\nHey now\nHey now\nHey, hey, hey now\nHey now\nHey now, you're an all star\nHey now, you're an all star\nHey now, you're an all star\nOnly shooting stars break the mold","rating":1,"userName":"gesidikn","isEdited":false,"title":"Wewooo","date":"2020-07-09T16:56:55Z"}}]}