{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=46350","data":[{"id":"6177007977","type":"user-reviews","attributes":{"rating":1,"title":"It crashed","review":"It was so terrible it crashed my phone and now I can’t use it for anything and it needs to be repaired but I’m not sure how or what’s wrong","isEdited":false,"userName":"Eric Frence","date":"2020-07-09T14:46:48Z"}},{"id":"6176998336","type":"user-reviews","attributes":{"rating":1,"title":"App is terrible","review":"The app is terrible in every sense. Poorly thought out. Poorly designed. Poor functionality. Not user friendly. Sad.","isEdited":false,"userName":"Concerned Latino","date":"2020-07-09T14:44:14Z"}},{"id":"6176980515","type":"user-reviews","attributes":{"rating":1,"title":"spam","review":"this app is the worst it kept making my phone crash and freeze and i would try and restart it but it nothing would work it kept on freezing and glitching out of the app. this is truly one of the worst apps i have ever seen on the app store i would not recommend getting you can’t even use the app dump trump!","isEdited":false,"userName":"j isn hsld","date":"2020-07-09T14:39:24Z"}},{"id":"6176974763","type":"user-reviews","attributes":{"rating":1,"title":"Abysmal","review":"Just the worst! Bad design, slow to load, the app itself is useless and has poor execution regardless of political opinion. Not surprised, just disappointed.","isEdited":false,"userName":"A. Y. 🤩","date":"2020-07-09T14:37:50Z"}},{"id":"6176967361","type":"user-reviews","attributes":{"rating":1,"title":"DONT DOWNLOAD!!! BAD!!!","review":"this app is terrible, it attacks so many different groups of people. there’s this orange man always popping up on my screen and it doesn’t even work to begin with. worst app ever made.","isEdited":false,"userName":"Skajskxjxn","date":"2020-07-09T14:35:49Z"}},{"id":"6176954622","type":"user-reviews","attributes":{"rating":1,"title":"Misleading Information","review":"I still believe in TRUMP 2020, but some information in the app was very misleading. There were also some glitches. I wish there was a better TRUMP 2020 app.","isEdited":false,"userName":"August.D","date":"2020-07-09T14:32:27Z"}},{"id":"6176941844","type":"user-reviews","attributes":{"rating":1,"title":"Pretty sure the anti christ made this app","review":"Can’t believe this app! Crashes and crashes! Made by big orang man who hate children! How! Bad bad bad! Don’t download. This app literally murdered a litter of kittens!!!!! HOW. NOT OKAY. What has our world COME TO.","isEdited":false,"userName":"Gpapants","date":"2020-07-09T14:29:03Z"}},{"id":"6176932800","type":"user-reviews","attributes":{"rating":1,"title":"eww","review":"i literally think this app is cursed when i downloaded it weird emails started popping off in my inbox and then i started getting weird people and accounts following me on all my platforms even ones where my name wasn’t there and they weren’t connected and i feel like there is someone watching me all the time","isEdited":false,"userName":"bewildered breanna","date":"2020-07-09T14:26:40Z"}},{"id":"6176926966","type":"user-reviews","attributes":{"rating":1,"title":"Disgusting app🤮","review":"DON’T VOTE FOR TRUMP OR KANYE FOR PRESIDENT. I don’t know why this is an app but let’s not use it. When you first open the app it just wants your phone number and I’m sure it’s just going to spam your phone until November🙄","isEdited":false,"userName":"brkskejrndkkdo","date":"2020-07-09T14:25:09Z"}},{"id":"6176899477","type":"user-reviews","attributes":{"rating":1,"title":"Challenging interface","review":"The app is challenging to navigate through. The design of the app is below sub par. Would love to never see this app on my phone again.","isEdited":false,"userName":"Michaela Campina","date":"2020-07-09T14:18:00Z"}}]}