{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=210","data":[{"id":"6177468826","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Disgusting","review":"I first downloaded this app because I wanted to see what the great 🍊Cheeto puff🍊 planned on doing for his campaign. As soon as I opened up the app all of my Ecuadorian flags suddenly turned into “trump 2020” flags and I was so confused (it gets worse) against my better judgement I started to make an account but then I heard voices in my head telling me to do racist, and sexist activities, and as I continued the voices got stronger and stronger and my as a mixed raced WOMAN I was firmly against these requests. Eventually the sounds of Chads And Karens became so unbearable I had to swiftly gather up all of my mental strength and remove the app before I was completely taken over by the orange and his hateful, white supremacists agenda. After I came to realize I lost brain cells just from downloading the app. Now I realize why it seems like his followers have little to no brain activity. I think we should start a petition to make sure trump supporters get the therapy that they need and have him pay for the damages... but that’s a discussion for another time. All in all I don’t recommend this app or supporting him in anyway unless you decide that you want to be ignorant for the rest of your life.","date":"2020-07-09T16:57:55Z","userName":"bunny🐉"}},{"id":"6176501667","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"WORST APP EVER.","review":"I wish that this app never existed. It took 27 days to download. When I opened the app, my phone exploded! I can’t even go on other apps either because if I do, a white van filled with bears, armed with guns, of course, comes to my house and said if I don’t vote for Trump then they’d play the national anthem in my ear while I was trying to sleep, and they’d steal my house. And I don’t mean they’d just move in, they were professionals! Professionals don’t just “move in”! They threatened to pick up my house and take it to a hidden base under the White House where they’d hold me captive until I voted for him! They don’t even have good food! It’s nasty, cold oatmeal from the previous week! I’m here to tell you all to NOT download this app unless you want your phone to explode, your house stolen, and for trump to  be the president once more! BAD BAD BAD! BAD APP! THIS APP IS WORSE THAN APPS FROM YOUTUBERS FOR KIDS! I’m angry 😡 this app is the most annoying app that I’ve ever seen in app apps apps that I don’t know about it haha is the way to do it bruh is the way to get rid of it and it is a terrible app for me to download it and I don’t have to use it anymore because I have a problem with it because I do.","date":"2020-07-09T12:32:02Z","userName":"Elbow Mcgee"}},{"id":"6176411671","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"TIKTOK","review":"So, as you may know Trump is going insane. I  downloaded this app because I wanted to try to get the president’s attention. Here is a message from A LOT OF PEOPLE: Donald Trump, we get it. You work a lot considering you are your own race and you are constantly setting the bar for the future of Orangers. Your also trying to be the best president you can be, but let’s face it. You are just not meant to run our country. YOU ARE TAKING AWAY OUR BELOVED TIKTOK. That is not right, yes it may be MADE in China, but the USA’s part of TikTok is run by US citizens. Don’t take away our TikTok THAT will make you LOOSE A LOT of votes during the election. There’s also probably going to be a new disease that will be called “Lack of TikTok.” PLEASE reconsider the fact that your not the only one with opinions and thoughts on things. There are other people in the country too. To be honest I don’t want to vote for you anymore since TikTok is getting banned. I’m disappointed in you Trump. President’s are suppose to listen to their country not just do everything how they want it. Can’t wait to see who the new president will be because I can promise you that nobody is going to vote for you anymore🤷‍♂️ sorry not sorry dude.","date":"2020-07-09T12:07:19Z","userName":"Dissapointed in Trump"}},{"id":"6174960113","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"WORST APP EVERRRRRRRRRRR","review":"I wish I could give this lower than one star but unfortunately I can’t. 😭😔 So I was sleeping and this app woke me up and it ate my cat!!! I miss my cat every day and I wish I was lying. Anyways, this horrid app went outside and DESTROYED my beautiful garden that I have been working on for a DECADE! Like how could you destroy years of hard work?!?! I’m so annoyed I could crush this app into pieces smaller than atoms! I HATE THIS APP SO MUCH! Like can Apple delete this app? Ok, so after that the app just spun around, made a tornado, and DESTRUCTED MY FREAKING HOUSE! BRUH, LIKE CMON HAVE A HEART! I CANT WITH THIS APP! Lastly, this app ate me and I haven’t been digested in the acid yet, but I have my phone in here and I’m writing this! WHY THE HECK DO YOU THINK YOU CAN EAT HUMANS! IM DONE! Little does this app know I have a pocket knife, so I’m gonna cut and kill this app like how you are trying to kill THE BEST APP EVER! (Btw it’s Tiktok 😏) I will never let you ban my favorite app/social media out there! It has bring me joy and happiness through the hard times! During quarantine I’ve been bored but Tiktok has made me the better person I am today. HALF OF TIKTOK IS LITERALLY AMERICAN SO IF YOU BAN IT FROM US, EVERYONE WILL HATE YOU! Thank you for your time 🙄","date":"2020-07-09T03:54:57Z","userName":"queenoftiktokzafzaf"}},{"id":"6174697735","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"DØ NÖT DÔWŃŁŒD","review":"I was scouring the App Store looking for the GREATEST APP EVER and I came across the Official Trump App, and I was A S T O U N D E D. It was so beautiful I cried on my bathroom floor for 37 minutes. So I was so excited I was almost too scared to see what this amazing app. When I did, I was greeted with this magnificent TRUMP 2020 lettering, but what came next what horrifying. It cut to black and it had a start button. I hit the start button obviously and on the screen was a frog playing in a pool of black tar with squirrels running rabid around it while “I Wish I Was In Dixie Land” was playing in the background and as it kept playing I tried to exit out but my phone shut off and left a Trump 2020 screen on my phone. My phone wouldn’t turn back on and it just kept playing Minion from Despicable Me remixes of Taylor Swift. But not like new Taylor swift it’s that 2009 should’ve been on Disney Channel Taylor Swift. Anyways, after that I started hearing voices that just talk about Trump all day. They just told me that Trump supports anti potato policies. My phone still hasn’t turned back on, it just says Trump 2020. I’m currently writing this from my LG refrigerator door. 2/10 don’t vibe with it. Or the voices.","date":"2020-07-09T02:36:18Z","userName":"Baddie Tundy"}},{"id":"6174567868","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"terrified my child","review":"I wanted to get my young daughter into politics at a young age so that she could hone her craft of debunking liberal views but I’ve found that this app has extremely harmed her within the few minutes she had it downloaded. when she first opened the app she said that what she saw was something similar to a deformed jug of sunny d with one little ball on it and that it was one of the most terrifying things she has ever seen. Tears were streaming down her face as she described what she saw to me and i was quick to delete the app from her ipad. A couple of days after the incident she ran inside our house wailing with tears streaming down her cheeks yet again after playing outside with her friend. apparently her friend told her that this app was cursed and whoever downloaded it had one month maximum to live. her friend also told her that her second cousin died two days after downloading the app. i usually never believe in paranormal stuff, but when my daughter told me this i got chills up and down my spine and i felt very heavy negative energy in that moment, please, whatever you do NEVER download this app and DO NOT vote for trump in this is upcoming election.","date":"2020-07-09T01:59:05Z","userName":"Belkidsocool"}},{"id":"6177712744","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"a virus","review":"I saw this app and decided it was interesting enough to warrant a download. Unluckily for me this was actually just a virus. after two days of having this app on my phone my phone started to get glitchy, keep in mind I had only gotten this phone a week ago as my old one broke. I thought nothing of it at first but later during the day it started to get worse and worse. An icon of Donald Trump's ugly mug started appearing in the lower righthand corner of my phone. My phone later started emitting a strange buzzing noise, it was making me so dizzy I actually threw up. I also think in the midst of that horrendous buzzing I heard Trump's voice repeatedly whispering the all too infamous phrase \"Make America Great Again.\" I tried to delete the app multiple times but each time my phone would pop up with an error message. It stated \"Do you really want to do that?\" I couldn't use my phone properly because the vast majority of sites and apps became blocked. I had wipe my phone but it wouldn't let me do so from my settings. I had to download a software on my laptop and wipe it that way. Don't download this app, if I could put down zero stars I would.","date":"2020-07-09T18:14:32Z","userName":"Sam Boultin"}},{"id":"6177667092","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Horrible app! It’s spyware of malware.","review":"Do not download it. Unbelievable that an app for a president’s campaign could be this horrible! Also, it ruined my iPhone X. My phone keeps crashing all of my other apps and causing my phone to shut down all of a sudden. I’m not sure if there is malware incorporated into the app, but it sure seems like it. Some of my contacts started to get texts and emails from the Trump campaign, too. All of my friends are mad because they did not sign up for those texts or emails. I think it’s stealing information from my phone or something very sketchy. Sometimes, when I’m on my phone, it sounds like someone is listening to my voice calls. I wish I could give this app a rating of 0, but that’s not permitted. I feel like I’m being spied on illegally but the Trump campaign now. I think I’m going to have to get a new phone. I deleted the app, but the problems are persisting. Scary! I did not want to have to buy the iPhone 11, but now I have to and spend money I don’t have. I don’t know what else to do though. I hope the malware does not copy over to my new phone. Be aware of these issues before you download this app.","date":"2020-07-09T18:00:25Z","userName":"Greeneyed75"}},{"id":"6176611841","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"DO NOT RECOMMEND AT ALL!!","review":"I definitely don’t recommend getting this app if you’re looking into it. When I first opened the app it almost immediately crashed on me. I tried to open it again and this time I got partly through the registration process before it crashed again. Suddenly, I got a text. From whom you may ask? Trump himself. He used my phone number that I put in during the registration process to TEXT me himself. This is really creepy considering I’m a minor. What a pedo. Anyways, he texts me BEGGING me to give this app a five star review and to buy his merch. I was like “no, and no”. Everything seemed to be normal for a few minutes and I was about to delete the app until I got another notification saying “Your order has been placed.” I was confused until I clicked on the notification. Then I was shocked! I apparently had ordered $488,630 worth of Trump merch. And that is EXCLUDING shipping. I wondered who did this, but then I quickly realized. It was Trump. He was the one begging me to buy merch anyways! He must’ve hacked into my phone and gathered all of my personal info. Hopefully I can find a way to cancel the order before I end up in debt!\n\n#Biden2020 :))","date":"2020-07-09T13:02:09Z","userName":"Megan._"}},{"id":"6175596012","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Please do not download","review":"I downloaded this app because I wanted to help support this mans campaign but after 3 whole days it never downloaded. After it finally did it straight up told me that it was stealing all my info!! Now I trust in trump so I assumed he needed all my information so I let it slide, but then I got a personal phone call from Donald trump himself. As a long time fan I answered and was so excited, “hello mr President” I said eager to hear his voice, he asked me if I was home alone and I said yea that’s when he replied “Let me come over and make a quick cameo like in Home Alone 2” 😳😳😳 I was instantly terrified. I hung up and blocked the number I tried deleting the app but it didn’t let me. He kept messaging me on all types of social media and then made fake accounts when I blocked him. He sent me inappropriate videos and pictures, I was horrified. After weeks of seeing all those terrible things he sent me, weeks of me telling him to stop, he finally said “fine have it your way” and called me the n word. Worst experience of my life and now I have no money or house and am now getting deported because he couldn’t take no for an answer. :(","date":"2020-07-09T07:45:03Z","userName":"squeeeezy"}}]}