{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=22930","data":[{"id":"6174043645","type":"user-reviews","attributes":{"rating":1,"title":"OMG the worst","userName":"Pkgbvjvfvjh","isEdited":false,"review":"So I got the app and then out of nowhere trump pulls gun on me and drop kicked my grandma in the face and stole her wallet. Not to mention it stole my fridge and my microwave. I saw a few reviews saying it would be I didn’t think it would happened but the moment it downloaded I went to get a snack and my fridge and microwave were both just gone.","date":"2020-07-08T23:04:38Z"}},{"id":"6174027376","type":"user-reviews","attributes":{"rating":1,"title":"No✨💕😘","userName":"DMeier5950","isEdited":false,"review":"So first of all I think that there is some kind of bug in it where all u see is oranges so idk but after scrolling through I threw up so it’s a danger to society. It confuses Privileged white country guys into thinking their opinion is valid and I just don’t think this app is acceptable . I will definitely be handing this over to the Karen’s 🤔","date":"2020-07-08T22:58:32Z"}},{"id":"6174027156","type":"user-reviews","attributes":{"rating":1,"title":"Horrified","userName":"Will0197","isEdited":false,"review":"I was sitting on the couch playing with my sock puppets when My pizza roles fell out of the oven and crawled away!!! I turned my crocs into sport mode and zoomed after them but it was no use they all got away. When I turned around a Cheeto flopped down from the handle with the exact physical characteristics of said man displayed in this app. Absolutely distraught!!","date":"2020-07-08T22:58:27Z"}},{"id":"6174024831","type":"user-reviews","attributes":{"rating":1,"title":"App review","userName":"karen renolds","isEdited":false,"review":"Literally the worst app on here!!! Google should take it down now! It kept crashing and glitching and then as I was sitting on my bed my phone started making a sound. As I turn to look my camera is bright red, indicating that the president is watching us threw this app how disgusting!! Literally sickening to my stomach I hate this app!","date":"2020-07-08T22:57:33Z"}},{"id":"6174020840","type":"user-reviews","attributes":{"rating":1,"title":"DISGUSTING","userName":"Noel016","isEdited":false,"review":"So I just downloaded this app and right when I opened it I realized something, it MADE MY PHONE STINK. You’re probably thinking aww yeah it’s just bc it’s trump but that’s not what I mean, I mean it made my phone smell like literal garbage🤢🤢 don’t ask me how they did it all I can say is I have to throw my phone away now cuz it’s so bad it made me gag and there’s no relief. Don’t get🤢","date":"2020-07-08T22:56:06Z"}},{"id":"6174019398","type":"user-reviews","attributes":{"rating":1,"title":"didn’t work for everyone","userName":"cc stacy","isEdited":false,"review":"The app was working fine for me and I had no issues with it. However every time my boyfriend tried it, the app would shut down or brake. As soon as it saw his face it’s like it stopped working, just for him. Idk he’s black so maybe I should have seen it coming…","date":"2020-07-08T22:55:32Z"}},{"id":"6174015961","type":"user-reviews","attributes":{"rating":1,"title":"This app shot my grandma","userName":"Phat_Latino_Cock","isEdited":false,"review":"I dowloaded this app simply for pornographic use, but after weeks of unsatisfying experiences I came to realize what it was truly capable of. I, Garth Brooks, can personally attest that I saw THIS APP standing above my screaming grandmother with a gun. She is now in the hospital in critical condition. She is my best friend. Or was... If you love your grandma, im begging you, please, please don’t download this app.","date":"2020-07-08T22:54:17Z"}},{"id":"6174006363","type":"user-reviews","attributes":{"rating":1,"title":"Horrendous app. Worst decision ever","userName":"Justin919","isEdited":false,"review":"This app completely took over my phone. It kept glitching and stopped working. On top of that it also slept with my wife and also my best friend. Due to this horrible app, I have no one left in my life that I care about. Downloading this monster was the worst decision of my life. I wish I never did it","date":"2020-07-08T22:50:39Z"}},{"id":"6174002302","type":"user-reviews","attributes":{"rating":1,"title":"Insulting to a new level","userName":"Leelasmommy","isEdited":false,"review":"I downloaded this app hoping to pay respects to our deceased commander in chief but instead received a load of fake news! This app personally victimized me and my first born child. I hope others will see this review and think twice about downloading this app. Prepare to be served with a load of bs!","date":"2020-07-08T22:49:06Z"}},{"id":"6174001853","type":"user-reviews","attributes":{"rating":1,"title":"I wish there was a button to rate it under 1 star","userName":"Caitxoxoxo","isEdited":false,"review":"There simply aren’t enough words in the English dialect to explain how repulsing this app is. From the little time i’ve spent on this app it’s easy to conclude that it not only should, but NEEDS to be taken down. The ratings speak for themselves. Waste of space, 0/5.","date":"2020-07-08T22:48:55Z"}}]}