{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36870","data":[{"id":"6134043747","type":"user-reviews","attributes":{"review":"i hate this app so much omg it took wayyyyyyyy too long to download and then after i downloaded it before i even OPENED it my cat ran out of my house and she still hasn’t come back. then one i opened it my HOUSE CAUGHT ON FIRE?? TRUMP IS SATAN I KNOW IT","isEdited":false,"userName":"Alicia_Pedersen","title":"hate it hate it hate it hate it hate it hate it","rating":1,"date":"2020-06-29T01:52:40Z"}},{"id":"6126459101","type":"user-reviews","attributes":{"review":"I went on here, it was encouraging me to vote for Trump, I thought this was the Trump casino app. What a shame, I just wanted a bipartisan casino app to gamble my child’s college tuition on. Looks like your tuition is safe another day Kyle, just one more day.","isEdited":false,"userName":"youcantevenspellprague","title":"Would rate 0 if I could","rating":1,"date":"2020-06-27T03:39:08Z"}},{"id":"6109475779","type":"user-reviews","attributes":{"review":"Trump 2020🧚💕but on a gravestone🌹🌷❤️🧚\nI was a girl in the village doing alright\nThen I became a princess overnight\nNow I gotta figure out how to do it right\nSo much to learn and see\n\nUp in the castle with my new family\nIn a school that's just for royalty\nA whole enchanted world is waiting for me\nI'm so excited to be\n\n(Sofia the First)\nI'm finding out what being royal's all about\n(Sofia the First)\nMaking my way it's an adventure everyday\n\n(Sofia)\nIt's gonna be my time\n(Sofia)\nTo show them all that I'm\nSofia the First!","isEdited":false,"userName":"Duck Frump123","title":"Duck Frump","rating":1,"date":"2020-06-22T19:44:34Z"}},{"id":"6084272627","type":"user-reviews","attributes":{"review":"Downloaded the app to support the Cheeto King but was greeted by Donald Trump photo permanently on my iPhone. Couldn’t do anything. Tried closing the app, restarting... just a Trump photo on my phone. Poor performance and made me spend another 1000","isEdited":false,"userName":"菁草","title":"Hacking my device?","rating":1,"date":"2020-06-16T19:48:11Z"}},{"id":"6085065494","type":"user-reviews","attributes":{"review":"People will soon be woke, they’ll see the truth.. Trump and his administration are doing great things. Trump 2020 | Q","isEdited":false,"userName":"Than[Q]","title":"Our Revolution","rating":5,"date":"2020-06-17T00:37:28Z"}},{"id":"6075777401","type":"user-reviews","attributes":{"review":"Very misleading information. I Ltd advertised as a n app for the good of America. I only see ignorance, bugs, pests, it constantly freezes and gets stuck. Not progressive at all and I don’t recommend . Needs to be removed","isEdited":false,"userName":"iElsa","title":"Terrible","rating":1,"date":"2020-06-14T18:49:00Z"}},{"id":"6069200130","type":"user-reviews","attributes":{"review":"This app glorified taking away human rights, and the freedom of expression. This app is encouraging hate crimes, and influencing genocide, and targeting communities that rightfully should be respected, and thanked for all they do for the American country. Donald Trump should be the one kissing the people’s boots, not the other way around.","isEdited":false,"userName":"JT1!","title":"Worst App Ever","rating":1,"date":"2020-06-13T03:30:18Z"}},{"id":"6067837270","type":"user-reviews","attributes":{"review":"TERRIBLE, HORRIBLE, APP. this app is tremendously deplorable. Ginormous failure of an app. This app is a HUGE waste of storage on your phone. It’s embarrassing, truly embarrassing. Have you seen the other apps? THERE ARE SO MANY. millions of other apps out there and you want this one? This app is TERRIBLE!","isEdited":false,"userName":"lakieloo","title":"App is fake news","rating":1,"date":"2020-06-12T18:31:07Z"}},{"id":"6067700522","type":"user-reviews","attributes":{"review":"Thank god for this app, it allows me to have access to racist, sexist, bigoted information on my favorite soggy carrot boy right at my finger tips. So grateful that my grandkids taught me how to use this app so that I’m able to be breastfed more propaganda on the daily:) trump 2020!","isEdited":false,"userName":"karen593","title":"So convenient!","rating":1,"date":"2020-06-12T17:40:58Z"}},{"id":"6067645030","type":"user-reviews","attributes":{"review":"I thought this app would help me become a billionaire by showing me how to us the American public to do get me more money. but the app just used me to make itself better! I feel personally attacked by this app","isEdited":false,"userName":"Pardodo","title":"smh","rating":1,"date":"2020-06-12T17:21:11Z"}}]}