{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=139010","data":[{"id":"6179662491","type":"user-reviews","attributes":{"review":"On my 12th birthday next year. He told me 69 was his favorite color. And that orange was his favorite song. And on Christmas in the summer time he went skydiving on the grass with a dead dodo bird. He said Thank you to the dead maid. Lest next month","title":"This is horrible","rating":1,"date":"2020-07-10T05:46:41Z","userName":"dead dodo bird","isEdited":false}},{"id":"6179662454","type":"user-reviews","attributes":{"review":"Very bad app. DONT know where to start. I really expected more. ALL of my information got hacked. And i mean all of it. DO NO GET!!!","title":"If i could give this Zero stars i would.😡","rating":1,"date":"2020-07-10T05:46:40Z","userName":"Larenbabe","isEdited":false}},{"id":"6179662229","type":"user-reviews","attributes":{"review":"After downloading this app I have realized the only thing Trump is good for is an ingredient for my orange juice 💖🥰🌹","title":"Mr orange","rating":1,"date":"2020-07-10T05:46:36Z","userName":"peni$ba$$s","isEdited":false}},{"id":"6179662221","type":"user-reviews","attributes":{"review":"This is the worst app. Probably one of the worst apps. This app is the WORST! Cheina could do better. ChEiNa!","title":"ZERO STARS","rating":1,"date":"2020-07-10T05:46:36Z","userName":"swgamonster","isEdited":false}},{"id":"6179662100","type":"user-reviews","attributes":{"review":"It is not good （╹◡╹）that is all I have to say","title":"Listen don’t get this app","rating":1,"date":"2020-07-10T05:46:33Z","userName":"human that is cool","isEdited":false}},{"id":"6179662060","type":"user-reviews","attributes":{"review":"As soon as I entered the app I was spammed with all these messages from the Chinese’s government this app is fake do not download","title":"DO NOT DOWNLOAD","rating":1,"date":"2020-07-10T05:46:33Z","userName":"Amiffy_","isEdited":false}},{"id":"6179661745","type":"user-reviews","attributes":{"review":"if i could put zero stars i would this is the bad app terrible i don’t recommend it at all don’t waste your time because you will be DISAPPOINTED","title":"awful","rating":1,"date":"2020-07-10T05:46:26Z","userName":"locoman124","isEdited":false}},{"id":"6179661599","type":"user-reviews","attributes":{"review":"Wow this app is horrible. It freezes all the time. I’ve been getting inappropriate spam emails ever since I downloaded this. I also hate that I keep getting pictures of this fat orange man popping up when I open the app. When I downloaded the app and opened it for the first time I saw a picture of a big orange baby in a suit burning the American flag. It was honestly very disgusting to see someone that people call “president” burn our beautiful flag. I hope this app is taken down or something because it’s not only made my email messed up but my whole phone. It’s been glitching and it even changed my wallpaper to the Manny flag these dumb tik tokers seem to love. Did not expect this from Donald. Don’t get this. Hopefully Donald learns his lesson, you can’t just make a terrible app because you think you’re the president. Also side note, who names their kid Donald.....","title":"TERRIBLE 🤢","rating":1,"date":"2020-07-10T05:46:23Z","userName":"CourtneyCroz","isEdited":false}},{"id":"6179661569","type":"user-reviews","attributes":{"review":"OThis was way too long to download and people are were so rude if I spoke out in against  issue I had with what Trump had done they tried to hack my account and did it but I luckily backed up my account on my email and signing up they asked such personal things 0 out of 10 I do not recommend for any reason possible","title":"Absolutely horrendous","rating":1,"date":"2020-07-10T05:46:22Z","userName":"pug-pug_pug","isEdited":false}},{"id":"6179661490","type":"user-reviews","attributes":{"review":"it’s took 2 weeks to download! and when it did it took me 4 days for me to make it work. then when i went to sign up it asked for my address, my credit card number, and my social security number!!!! i pressed skip then it took all my information. this app is terrible and i do not recommend it AT ALL.","title":"WORST APP EVER","rating":1,"date":"2020-07-10T05:46:21Z","userName":"oksksnsn","isEdited":false}}]}