{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=143210","data":[{"id":"6179237592","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:27Z","review":"It’s just not worth","title":"Not the best app","isEdited":false,"rating":1,"userName":"was un de"}},{"id":"6179237553","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:26Z","review":"i downloaded this app to keep up with #maga2020 instead of getting FAKE NEWS from sources like 🤢CNN or 🤮new york times🤮 but i got trapped in my bunker :( the door locked behind me and ive been stuck for weeks please help me or at least tell my story. here goes\nNow this is a story all about how\nMy life got flipped turned upside down\nAnd I'd like to take a minute, just sit right there\nI'll tell you how I became the prince of a town called Bel-Air\n\n[Verse 2]\nIn West Philadelphia born and raised\nOn the playground is where I spent most of my days\nChilling out, maxing, relaxing all cool\nAnd all shooting some b-ball outside of the school\nWhen a couple of guys who were up to no good\nStarted making trouble in my neighborhood\nI got in one little fight and my mom got scared\nAnd said \"You're moving with your auntie and uncle in Bel-Air\"\nI begged and pleaded with her day after day\nBut she packed my suitcase and sent me on my way\nShe gave me a kiss and then she gave me my ticket\nI put my Walkman on and said \"I might as well kick it\"\nFirst class, yo, this is bad\nDrinking orange juice out of a champagne glass\nIs this what the people of Bel-Air living like?\nHmm, this might be all right\nBut wait, I hear they're prissy, bourgeois, and all that\nIs this the type of place that they should send this cool cat?\nI don't think so, I'll see when I get there\nI hope they're prepared for the Prince of Bel-Air\n\n[Verse 3]\nWell, uh\nThe plane landed and when I came out\nThere was a dude, looked like a cop, standing there with my name out\nI ain't trying to get arrested yet, I just got here\nI sprang with the quickness like lightning, disappeared\nI whistled for a cab and when it came near\nThe license plate said 'Fresh' and it had dice in the mirror\nIf anything I could say that this cab was rare\nBut I thought \"Nah, forget it, yo, Holmes, to Bel-Air!\"\n\n[Verse 4]\nI pulled\nUp to a house about seven or eight\nAnd I yelled to the cabbie \"Yo', Holmes, smell ya later\"\nLooked at my kingdom, I was finally there\nTo sit on my throne as the Prince of Bel-Air","title":"instructions unclear, i am trapped in my bunker","isEdited":false,"rating":1,"userName":"hypernxva"}},{"id":"6179237486","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:25Z","review":"NOOOOO THIS DELETED ALL MY PHONE INFO AND HACKED ITTTT!!! ALSO THE BIG ORANGE MAN CAME TO MY HOUSE AND STOLE MY PARENTS BECAUSE THEY WERE BROWN!! HE PUT MY MUFFIN IN THE FREEZER TOO 😿😿😾","title":"NOOOOOOOOO","isEdited":false,"rating":1,"userName":"kaighleigh ann 💞"}},{"id":"6179237462","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:24Z","review":"This app has so many flaws it should be taken down immediately. It destroyed my phone and nearly destroyed my life. I’ve never thought that an app like this could potentially be the death of me.","title":"Awful.","isEdited":false,"rating":1,"userName":"NextNoel"}},{"id":"6179237286","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:20Z","review":"Gave me false information and was flat out lying to the American people. Also was giving the spotlight to a racist man known as our president who should have never been elected. Terrible app don’t think anyone should download it.","title":"Waist of space and fake news","isEdited":false,"rating":1,"userName":"maxwitek"}},{"id":"6179237179","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:18Z","review":"I don’t like the quality. Very laggy and crashes.","title":"So bad it is wack","isEdited":false,"rating":1,"userName":"petermademono"}},{"id":"6179237016","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:15Z","review":"Full of bugs and possibly a scam","title":"Garbage","isEdited":false,"rating":1,"userName":"LilBoiBleu"}},{"id":"6179236938","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:13Z","review":"I really tried to download this app and for some reason the ignorance overloaded my phone and it exploded with phrases like white power I was highly confused but yeah it’s pretty trash!!!","title":"Trump 2020","isEdited":false,"rating":1,"userName":"Orange panda 914"}},{"id":"6179236673","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:08Z","review":"My son jimmy who is 5 years old could make a better app and he’s 5! I went on this app today to see all the sexist, racist, homophobic stuff and it didn’t even work properly! Trump is an orange scum bag, he doesn’t even know how to make an app properly!","title":"WORST APP EVER!","isEdited":false,"rating":1,"userName":"Salty/Avs"}},{"id":"6179236709","type":"user-reviews","attributes":{"date":"2020-07-10T03:22:08Z","review":"Society is a platypus","title":"Nope","isEdited":false,"rating":1,"userName":"TURTLELUVA060501"}}]}