{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=106410","data":[{"id":"6177272246","type":"user-reviews","attributes":{"userName":"WeNeedThisDream","isEdited":false,"rating":1,"date":"2020-07-09T16:00:51Z","title":"💜 Dr. Martin Luther King Jr.  August 28, 1963. Lincoln Memorial in Washington D.C.💜","review":"I am happy to join with you today in what will go down in history as the greatest demonstration for freedom in the history of our nation. \n\nFive score years ago a great American in whose symbolic shadow we stand today signed the Emancipation Proclamation. This momentous decree came as a great beckoning light of hope to millions of Negro slaves who had been seared in the flames of withering injustice. It came as a joyous daybreak to end the long night of their captivity. \n\nBut one hundred years later the Negro is still not free. One hundred years later the life of the Negro is still sadly crippled by the manacles of segregation and the chains of discrimination. \n\nOne hundred years later the Negro lives on a lonely island of poverty in the midst of a vast ocean of material prosperity. \n\nOne hundred years later the Negro is still languishing in the comers of American society and finds himself in exile in his own land. \n\nWe all have come to this hallowed spot to remind America of the fierce urgency of now. Now is the time to rise from the dark and desolate valley of segregation to the sunlit path of racial justice. Now is the time to change racial injustice to the solid rock of brotherhood. Now is the time to make justice ring out for all of God's children. \n\nThere will be neither rest nor tranquility in America until the Negro is granted citizenship rights. \n\nWe must forever conduct our struggle on the high plane of dignity and discipline. We must not allow our creative protest to degenerate into physical violence. Again and again we must rise to the majestic heights of meeting physical force with soul force. \n\nAnd the marvelous new militarism which has engulfed the Negro community must not lead us to a distrust of all white people, for many of our white brothers have evidenced by their presence here today that they have come to realize that their destiny is part of our destiny. \n\nSo even though we face the difficulties of today and tomorrow I still have a dream. It is a dream deeply rooted in the American dream. \n\nI have a dream that one day this nation will rise up and live out the true meaning of its creed: 'We hold these truths to be self-evident; that all men are created equal.\" \n\nI have a dream that one day on the red hills of Georgia the sons of former slaves and the sons of former slave owners will be able to sit together at the table of brotherhood. \n\nI have a dream that one day even the state of Mississippi, a state sweltering with the heat of injustice, sweltering with the heat of oppression, will be transformed into an oasis of freedom and justice. \n\nI have a dream that little children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character. \n\nI have a dream today. \n\nI have a dream that one day down in Alabama, with its vicious racists, with its Governor having his lips dripping with the words of interposition and nullification, one day right there in Alabama little black boys and black girls will be able to join hands with little white boys and white girls as sisters and brothers. \n\nI have a dream today. \n\nI have a dream that one day every valley shall be exalted, every hill and mountain shall be made low, the rough places plains, and the crooked places will be made straight, and before the Lord will be revealed, and all flesh shall see it together. \n\nThis is our hope. This is the faith that I go back to the mount with. With this faith we will be able to hew out of the mountain of despair a stone of hope. With this faith we will be able to transform the genuine discords of our nation into a beautiful symphony of brotherhood. With this faith we will be able to work together, pray together; to struggle together, to go to jail together, to stand up for freedom forever, )mowing that we will be free one day. \n\nAnd I say to you today my friends, let freedom ring. From the prodigious hilltops of New Hampshire, let freedom ring. From the mighty mountains of New York, let freedom ring. From the mighty Alleghenies of Pennsylvania! \n\nLet freedom ring from the snow capped Rockies of Colorado! \n\nLet freedom ring from the curvaceous slopes of California! \n\nBut not only there; let freedom ring from the Stone Mountain of Georgia! \n\nLet freedom ring from Lookout Mountain in Tennessee! \n\nLet freedom ring from every hill and molehill in Mississippi. From every mountainside, let freedom ring. \n\nAnd when this happens, when we allow freedom to ring, when we let it ring from every village and hamlet, from every state and every city, we will be able to speed up that day when all of God's children, black men and white men, Jews and Gentiles, Protestants and Catholics, will be able to join hands and sing in the words of the old Negro spiritual, \"Free at last! Free at last! Thank God almighty, we're free at last!\""}},{"id":"6177266969","type":"user-reviews","attributes":{"userName":"goddammitmotherfriker","isEdited":false,"rating":1,"date":"2020-07-09T15:59:18Z","title":"ugh bad","review":"this is the most horrible app in the intire world #looooser ok see ya"}},{"id":"6177199362","type":"user-reviews","attributes":{"userName":"👁👄👁🤩","isEdited":false,"rating":1,"date":"2020-07-09T15:39:43Z","title":"horrible","review":"no❤️"}},{"id":"6177182223","type":"user-reviews","attributes":{"userName":"sokier","isEdited":false,"rating":1,"date":"2020-07-09T15:34:52Z","title":"gen z for the win","review":"horrible"}},{"id":"6177066268","type":"user-reviews","attributes":{"userName":"🐼🐼👠🧚🏻‍♀️","isEdited":false,"rating":1,"date":"2020-07-09T15:02:36Z","title":"No ❤️ plz no ❤️","review":"This app is ✨s c a r y ✨ the amount on content for Christian straggots is appalling 😞✋😳🤮. PROPAGANDA. PROPAGANDA. ✨😗\n\nThanks BBY ❤️✨"}},{"id":"6177065851","type":"user-reviews","attributes":{"userName":"hghsbshduahs","isEdited":false,"rating":1,"date":"2020-07-09T15:02:30Z","title":"Awful 🥰","review":"um chile anyways so..."}},{"id":"6177063839","type":"user-reviews","attributes":{"userName":"841776","isEdited":false,"rating":1,"date":"2020-07-09T15:01:57Z","title":"Worst app ever","review":"The worst app ever."}},{"id":"6177039410","type":"user-reviews","attributes":{"userName":"Maddie1028","isEdited":false,"rating":1,"date":"2020-07-09T14:55:18Z","title":"app no good","review":"no good app i give it low rating app bad"}},{"id":"6177033051","type":"user-reviews","attributes":{"userName":"hsidheiwowoxn","isEdited":false,"rating":1,"date":"2020-07-09T14:53:36Z","title":"no","review":"horrible app"}},{"id":"6176962078","type":"user-reviews","attributes":{"userName":"✨🍊TRUMP IS A HOE🍊✨","isEdited":false,"rating":1,"date":"2020-07-09T14:34:26Z","title":"✨🍊orange🍊✨","review":"All I am is a man\nI want the world in my hands\nI hate the beach\nBut I stand in California with my toes in the sand\nUse the sleeves of my sweater\nLet's have an adventure\nHead in the clouds but my gravity's centered\nTouch my neck and I'll touch yours\nYou in those little high waisted shorts, oh\nShe knows what I think about\nAnd what I think about\nOne love, two mouths\nOne love, one house\nNo shirt, no blouse\nJust us, you find out\nNothing that wouldn't wanna tell you about no\n'Cause it's too cold whoa\nFor you here and now\nSo let me hold whoa\nBoth your hands in the holes of my sweater\nAnd if I may just take your breath away\nI don't mind if there's not much to say\nSometimes the silence guides our minds to\nSo move to a place so far away\nThe goosebumps start to raise\nThe minute that my left hand meets your waist\nAnd then I watch your face\nPut my finger on your tongue\n'Cause you love the taste yeah\nThese hearts adore,\nEvery other beat the other one beats for\nInside this place is warm\nOutside it starts to pour\nComing down\nOne love, two mouths\nOne love, one house\nNo shirt, no blouse\nJust us, you find out\nNothing that I wouldn't wanna tell you about, no no\n'Cause it's too cold whoa\nFor you here\nAnd now\nSo let me hold whoa\nBoth your hands in the holes of my sweater\n'Cause it's too cold whoa\nFor you here and now\nSo let me hold whoa\nBoth your hands in the holes of my sweater\nWhoa, whoa\nWhoa, whoa, whoa\nWhoa, whoa\n'Cause it's too cold whoa\nFor you here and now\nSo let me hold whoa\nBoth your hands in the holes of my sweater\nIt's too cold whoa\nFor you here and now\nSo let me hold whoa\nBoth your hands in the holes of my sweater\nIt's too cold,\nIt's too cold\nThe holes of my sweater"}}]}