{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=35870","data":[{"id":"6174665347","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"this app made my whole phone glitch and completely broke it. do NOT recommend. really wish it would’ve worked though because i just really really love trump. it’s a darn shame. 😌✨","userName":"fuckdonaldtrump✨","date":"2020-07-09T02:26:45Z","title":"absolute garbage"}},{"id":"6174651589","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I got this app so I could support our President during this 2020 campaign but once I opened it had so many problems it’s glitched and it lagging so much. I expected much more from our dear president so please don’t get this app.","userName":"sarah555white","date":"2020-07-09T02:22:46Z","title":"This app is Unacceptable❗️❗️❗️❗️❗️"}},{"id":"6174646958","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This app is horrible everyone rate 1 star because it will go into your phone info and track you and they could come to your house and kill you and it gets your name, age, and all your info!!!","userName":"Mrs.zoooooooooooom","date":"2020-07-09T02:21:29Z","title":"Nasty app"}},{"id":"6174636616","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"this app is just horrible. it crashes your whole phone every few minutes. this app is not at all what i expected. extremely upsetting considering i was really looking forward to having this app and keeping up with it. i can no longer do that. in fact i was never able to. i would rate this app -5 starts but unfortunately i cannot do that. horrible.","userName":"kvegax","date":"2020-07-09T02:18:30Z","title":"so disappointed"}},{"id":"6174637657","type":"user-reviews","attributes":{"rating":5,"isEdited":false,"review":"I believe this app is an amazing app for the people of America who believe in hearing the truth and knowing the truth! Trump 2020 All The Way!","userName":"sbown21","date":"2020-07-09T02:18:48Z","title":"Trump 2020"}},{"id":"6174635310","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This app is destructive and very offense to all communities it barely even works and will possibly give you malware and hack you, stealing you’re personal information. please delete this from your devices and even from the app store!","userName":"stellar wisp","date":"2020-07-09T02:18:07Z","title":"DANGEROUS AND TERRIBLE"}},{"id":"6174633917","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"This app makes your device act crazy. I am completely sure that this app is broken. Do not waste your precious space or time on this. The app is just as Bad as the Founder himself. I hope this app gets deleted or shut down. #Notmypresident #BLM #FKTRUMP","userName":"Alex13454","date":"2020-07-09T02:17:44Z","title":"WORST APP IN ENTIRE HISTORY"}},{"id":"6174629469","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"I wanted to support this walking Cheeto but this app glitches and I think it took my information! My phone screen shotted without me doing it and ever since then I’ve been getting robo calls!!! I will be deleting!!!!!","userName":"Breana Stokes","date":"2020-07-09T02:16:29Z","title":"Worst app ever!!!!!"}},{"id":"6174622082","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"The app is trash nobody likes it and whenever I try to open it he crashes my telephone more than half the time it doesn’t even open open not getting it ever it’s trash","userName":"aiden.travieso","date":"2020-07-09T02:14:24Z","title":"Horrible"}},{"id":"6174621729","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"review":"When I was trying to toast my bread the app kept telling me all doughs matter so I had to kindly tell the app to stop because the breads feelings might get hurt but it kept Insisting that all doughs matter.. 10/10 wouldn’t recommend this app at all","userName":"RazariaM","date":"2020-07-09T02:14:17Z","title":"DO NOT DOWNLOAD  WORST EVER"}}]}