{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=45040","data":[{"id":"6174344356","type":"user-reviews","attributes":{"rating":1,"userName":"karen😷(where a mask)","title":"THIS APP IS HORRIBLE🤢🤮","review":"When I opened the app it seemed nice at first then it started glitching and latter it hacked into to my phone this app is very disturbing The us need to remove it just like their trying to do tiktok this app is disturbing and disgusting 🤮","date":"2020-07-09T00:52:32Z","isEdited":false}},{"id":"6174343524","type":"user-reviews","attributes":{"rating":1,"userName":"love0_0","title":"Racist Cheeto","review":"This is the most horrible app out there! I just opened the app and saw a racist, homophobic, rapist, sexist, transphobic, and orange Cheeto person holding a fist up! This app should be deleted. It’s is very inappropriate and horrible to the eyes. Apple take it down pleaseeee!","date":"2020-07-09T00:52:15Z","isEdited":false}},{"id":"6174335497","type":"user-reviews","attributes":{"rating":1,"userName":"tiktok uer","title":"Hiyoko Saionji","review":"Eww, its a Cheeto...I’d prefer a gummy! His orange skin tone reminds me of Hajime...I don’t like that...Hajime can be a creep! I’m pretty sure he watched me and Mahiru get a bath together 😡 wry creepy... 0/10 will NOT be opening this app again. This trump guy is weird and ugly! He’s probably a loser irl to!","date":"2020-07-09T00:49:36Z","isEdited":false}},{"id":"6174331074","type":"user-reviews","attributes":{"rating":1,"userName":"@crxnda","title":"Its a no from me","review":"Downloaded the app and it glitched like crazy. next thing you know its like watching annoying orange all over again. my dog is sniffin cracc and my toe is up my nose. dont get this app","date":"2020-07-09T00:48:07Z","isEdited":false}},{"id":"6174316696","type":"user-reviews","attributes":{"rating":1,"userName":"Tweetermm","title":"This app is smelly fart","review":"So when I downloaded the app to tell me it was done it farted it smelled awful so I ran myself to the Home Depot to get a chili cheese dog from sonic I just ended up deleting the app it’s just a horrible app it smells to.","date":"2020-07-09T00:43:21Z","isEdited":false}},{"id":"6174314503","type":"user-reviews","attributes":{"rating":1,"userName":"NASTY CHEETO!!!","title":"horrible and disgusting","review":"as soon as i opened the app it started glitching and pictures of this big cheeto started popping up when i had tried to refresh it only got worse and his getting a spray tan popped up and it was made into my lock screen and many photos of it popped up in my gallery 🤮 i then had nightmares as night because of this","date":"2020-07-09T00:42:33Z","isEdited":false}},{"id":"6174303972","type":"user-reviews","attributes":{"rating":1,"userName":"ashley friend 28","title":"disgusting.","review":"i am constantly disgusted by his actions as president. i wanted to see what bunker boy would put on his trump 2020. anyways this app is disgusting it makes me want to barf 🤮. i opened the app to see a nasty fat orange cheeto. it was extremely inappropriate and nasty. i would rate this app in the negatives but that isn’t allowed. so please don’t download this app. all this ugly man does is lie and ignores the actual problems in this country.","date":"2020-07-09T00:39:00Z","isEdited":false}},{"id":"6174301756","type":"user-reviews","attributes":{"rating":1,"userName":"da2ofspades","title":"Cheeto Man Scares Me 🤮","review":"He is ugly and orange and it scares me to even think about it.  I can’t believe that the App Store would actually allow a Cheeto to have its own app.I really think they should take this down. Trump 2020. But in the TRASH. 😡","date":"2020-07-09T00:38:14Z","isEdited":false}},{"id":"6174291518","type":"user-reviews","attributes":{"rating":1,"userName":"jebahdof","title":"Please do not get this app","review":"I downloaded this app and it caused my wrist to break in half now i can’t hold my phone for months. Do not make the same mistake I made by downloading this app","date":"2020-07-09T00:34:52Z","isEdited":false}},{"id":"6174291250","type":"user-reviews","attributes":{"rating":1,"userName":"teump smells 1838","title":"DO NOT GET","review":"I open up the app and see this Cheeto telling me all lies. Then he starts dancing a sight no one should see. I can’t even sleep at night anymore. Only get this app to leave a bad review. I am traumatized for life.","date":"2020-07-09T00:34:47Z","isEdited":false}}]}