{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=36050","data":[{"id":"6173408948","type":"user-reviews","attributes":{"date":"2020-07-08T19:15:01Z","title":"horrible app","userName":"Qjreoppu","rating":1,"isEdited":false,"review":"This app is absolutely horrible and it took weeks to download and when it finally did download it didn’t work and it was horrible. Do not recommend."}},{"id":"6173406423","type":"user-reviews","attributes":{"date":"2020-07-08T19:14:08Z","title":"The WORST APP EVER!!","userName":"g.a.v.a.n","rating":1,"isEdited":false,"review":"I have downloaded many apps that are bunked glitched all that but everything about this app is just terrible! I don’t see any reason why this app should even be available it should deleted at once!!!!!!!"}},{"id":"6173397496","type":"user-reviews","attributes":{"date":"2020-07-08T19:11:01Z","title":"DO NOT GET THE APP","userName":"Evelyn_011","rating":1,"isEdited":false,"review":"When I downloaded this app it made my phone glitch really bad and it started to over heat and my phone exploded so now I’m writing this review on a different device after my phone exploded my couch caught on fire and now I have nowhere to sit DO NOT GET THE APP!"}},{"id":"6173372407","type":"user-reviews","attributes":{"date":"2020-07-08T19:01:59Z","title":"This app Horrendous","userName":"caught.lacken","rating":1,"isEdited":false,"review":"It took two weeks to download and when it did it put my house on fire it’s just horrible and it almost KILLED me like seriously this app the danger to society and our youth it needs to be taken down!"}},{"id":"6173351719","type":"user-reviews","attributes":{"date":"2020-07-08T18:54:49Z","title":"HORRIBLE!!!!","userName":"omg yeahhhh","rating":1,"isEdited":false,"review":"This is app is terrible it continues to crash and call me slurs like “rapist”, “drug lord” and so much more i am very disappointed, because i thought it would be welcoming but in reality it is quite the opposite. i hope this app gets taken down for good."}},{"id":"6173343274","type":"user-reviews","attributes":{"date":"2020-07-08T18:51:52Z","title":"TERRIBLE APP","userName":"suggestion101101101","rating":1,"isEdited":false,"review":"If I could I’d give negative stars, made my phone glitch really bad should’ve listened to the other reviews and aside from that like the other review said i was unable to use my phone for a week and additionally ninjas showed up. DO NOT DOWNLOAD"}},{"id":"6173332272","type":"user-reviews","attributes":{"date":"2020-07-08T18:47:59Z","title":"Awful","userName":"loljokelmao","rating":1,"isEdited":false,"review":"Okay so first every time i even tries to open the app it would instantly kick me out. I downloaded this app to support my orange skinned president but how can i if this app doesn't work. 0/10 would not recommend. 🍊"}},{"id":"6173327439","type":"user-reviews","attributes":{"date":"2020-07-08T18:46:20Z","title":"Awful app","userName":"itsme.brooke","rating":1,"isEdited":false,"review":"This app is awful it kept glitching and it wouldn’t load. It gave my phone a virus that I had to get removed, I would like you to pls take this app down bc it is ruining our phones. Please and thank you."}},{"id":"6173323301","type":"user-reviews","attributes":{"date":"2020-07-08T18:44:56Z","title":"Terrible app 👎🏼","userName":"ang3l857","rating":1,"isEdited":false,"review":"The thing is I don’t think he will make America great again because of whats happening right now. When I got the app I saw a nasty orange thing on the picture and I got so scared I had nightmares for weeks. 🤢 At first I thought it was a Cheeto."}},{"id":"6173317773","type":"user-reviews","attributes":{"date":"2020-07-08T18:43:07Z","title":"Fascist","userName":"NoahGT123","rating":1,"isEdited":false,"review":"Donald Trump is a dirty fascist that is running this country into the ground. He’s a sick racists homophobic bigot that deserves rot in prison for the rest of his like and for the horrible horrible things he has done. I hope someday he will pay for his actions. His administration and the entire GOP is full of corrupt greedy criminals. Bernie 2020"}}]}