{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25610","data":[{"id":"6173853104","type":"user-reviews","attributes":{"rating":1,"review":"I got on the app to just have a good time and who do i see? an orange cheeto man trying to harass me into buying his peepee. I am truly disgusted and horrified by this app, and my mother actually threw up after seeing, i wish i could bleach my eyes. Gordon Ramsey would not be proud, i am truly disgusted an i wish to never see that orange bish again.","date":"2020-07-08T21:53:36Z","title":"heck no","isEdited":false,"userName":"ponponshrimp"}},{"id":"6173848052","type":"user-reviews","attributes":{"rating":1,"review":"This app crashed my phone several times. It would not even turn on for an entire hour, that is because I deleted the app from my MacBook. Horribly disappointed. I expected better from President Trump. I’m starting to even question why I support him.","date":"2020-07-08T21:51:40Z","title":"Horrible","isEdited":false,"userName":"Kyla Bledsoe"}},{"id":"6173811793","type":"user-reviews","attributes":{"rating":1,"review":"When I first got this app it took hours to load and then when it did download, my own mother passed away at the sight of the app and my grandma broke her ankles, I believe it was the app that made these things happened. This app body shamed my dogs until they were crying and then peed on my floor. Unforgivable!!!!","date":"2020-07-08T21:37:41Z","title":"Disgusting","isEdited":false,"userName":"AlexLovesVideoGames ;)"}},{"id":"6173776092","type":"user-reviews","attributes":{"rating":1,"review":"This app is one of the most glitchy apps I’ve ever seen, the reviews were correct, this app took 3 weeks to download and when I finally opens the app, all I hear is the gummy bear song on repeat. Even when I close the app, it keeps on repeating “look for the gummy bear album in stores on November 13th”","date":"2020-07-08T21:24:07Z","title":"WTH","isEdited":false,"userName":":/;):))"}},{"id":"6173766176","type":"user-reviews","attributes":{"rating":1,"review":"This app completely ruined my mamas phone, along with bugs and viruses it turned her camera roll full of child pornography and trump related images. She was absolutely appalled by the contents of the app as well. I would rate it a zero if I could. We might be suing for the emotional trauma and the broken property.","date":"2020-07-08T21:20:31Z","title":"App offended my grandma","isEdited":false,"userName":"lexi lake"}},{"id":"6173758738","type":"user-reviews","attributes":{"rating":1,"review":"This app is terrible I opened it and all of a sudden all of my information for my contacts, my pictures, and all my private things were on Google all of a sudden and people randomly had my information this is a terrible app do not get it.","date":"2020-07-08T21:17:44Z","title":"Leaked info","isEdited":false,"userName":"alien food"}},{"id":"6173758709","type":"user-reviews","attributes":{"rating":1,"review":"It’s hard to explain how bad this app is it charges me every time I try to press something it’s given me multiple viruses on my phone. It’s taking all the storage on my phone it fill my camera roll with pictures of trump and it’s just horrible.","date":"2020-07-08T21:17:43Z","title":"terrible, disgusting, no-good,terrible app","isEdited":false,"userName":"yeodgd"}},{"id":"6173756701","type":"user-reviews","attributes":{"rating":1,"review":"Deadasss it took almost a whole 24 hours to download the app then when I finally had it the app would crash and kick me out after 3 seconds in it. I can’t believe that it still exist and what a waste of time, storage and time it was \nCero stars if I could 😒","date":"2020-07-08T21:16:57Z","title":"this is unacceptable","isEdited":false,"userName":"baudeliere"}},{"id":"6173748725","type":"user-reviews","attributes":{"rating":1,"review":"WORST APP EVVVVEEERRR!!!! I thought this was a music app to teach my kids about brass instruments! Instead, all it did was sexualize them and tried to get them to purchase firearms!!!😡🤬 I WANT THIS APP GONE!!! The worst part about it is that my kids never learned about trumpets and because of the hate taught on this app they are now literally racist, sexist, & homophobic!!!","date":"2020-07-08T21:14:06Z","title":"App review","isEdited":false,"userName":"De-fund-the-Po-Lice"}},{"id":"6173747971","type":"user-reviews","attributes":{"rating":1,"review":"dude the download took like 8 hours and once I got in the loading screen was on for literally 4.1 hours!!!! And it’s all glitches out and sometimes I get random pictures of trump on my screen for no good reason and that’s not good, his quotes in the app all have the n word on it and I think it’s racist","date":"2020-07-08T21:13:49Z","title":"TRASH","isEdited":false,"userName":"Cherry_Co1a"}}]}