{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=52080","data":[{"id":"6174240546","type":"user-reviews","attributes":{"title":"disappointing","userName":"Buglet911","isEdited":false,"date":"2020-07-09T00:17:14Z","rating":1,"review":"kinda funny to open the app and see a bunker boy cheeto man holding up the black power fist even though he is the biggest racist. the app itself is gross. which makes sense because it is for a homophobic, woman hating, sexual predator. deleted this app immediately due to the horrible person it was made for. i also don’t like transphobic pigs. #settleforbiden"}},{"id":"6174234657","type":"user-reviews","attributes":{"title":"Ewwwww 🦟🦗🦟","userName":"12344433322","isEdited":false,"date":"2020-07-09T00:15:08Z","rating":1,"review":"I hate TrUmP!! I don’t want TikTok to be ban, but I want you to be banned from being our president!! TikTok is a great app and it shouldn’t be taken down!! If you want to get votes than DONT bam TikTok!! But you won’t get votes anyways."}},{"id":"6174232974","type":"user-reviews","attributes":{"title":"THIS APP IS INAPPROPRIATE","userName":"T27boss","isEdited":false,"date":"2020-07-09T00:14:29Z","rating":1,"review":"One day i woke up and i was like mmmmm.... i love politics so much so ima download this app. I was frightened to see this morbidly obese orange getting a spray tan NAKED when I opened the app. I immediately told Susan, Nancy, Karen, and Cynthia about this app. IF YOU ARE A SUBURBAN MOM DO NOT LET YOUR CHILD DOWNLOAD THIS."}},{"id":"6174231510","type":"user-reviews","attributes":{"title":"🤢🤮TERRIBLE","userName":"boooobjenydyw","isEdited":false,"date":"2020-07-09T00:13:55Z","rating":1,"review":"This app immediately opened up to an ugly orange man jumping up and down. It looked like he was doing a very rude interpretation of a dance but it was not well choreographed. I would not get this app ever again"}},{"id":"6174225515","type":"user-reviews","attributes":{"title":"DELETE THIS APP","userName":"_dandelud","isEdited":false,"date":"2020-07-09T00:11:42Z","rating":1,"review":"I heard apple does this thing where if an app has less than 1 star it would get deleted. In that case this app should be cancelled and the clown along with it."}},{"id":"6174223595","type":"user-reviews","attributes":{"title":"I AM OFFENDED.","userName":"666FTD666","isEdited":false,"date":"2020-07-09T00:11:00Z","rating":1,"review":"As soon as i opened this app, a message popped up telling me that i should bury myself alive because i am a women. Following that message was a photo of a naked orange oompa loompa. I am disgusted and offended. This app need to be removed NOW."}},{"id":"6174223600","type":"user-reviews","attributes":{"title":"Hate it!!","userName":"17268382","isEdited":false,"date":"2020-07-09T00:11:00Z","rating":1,"review":"Absolutely a waste of digital technology supports a disgusting person and is better off being off the App Store!!"}},{"id":"6174213942","type":"user-reviews","attributes":{"title":"TERRIBLE!!!","userName":"francesmblevins","isEdited":false,"date":"2020-07-09T00:07:25Z","rating":1,"review":"not only did i keep seeing an orange for some reason, but i also kept getting terrible pictures of fat cheetos!! this app was HORRIBLE! don’t download!!! chile.... anyways😻😻😻"}},{"id":"6174211558","type":"user-reviews","attributes":{"title":"Really bad.","userName":"bidenisntgreateither","isEdited":false,"date":"2020-07-09T00:06:30Z","rating":1,"review":"Terrible, this isn't TikTok. Downloaded it by mistake thinking this was Donald's replacement for TikTok but apparently not, still giving it a 1 star to get it off the app tho"}},{"id":"6174206499","type":"user-reviews","attributes":{"title":"Inappropriate","userName":"Homo Phobe","isEdited":false,"date":"2020-07-09T00:04:38Z","rating":1,"review":"Who’s gonna tell him this isn’t OnlyFans My good conservative slightly racist homophobic eyes are appalled by seeing my president in such an unseemly way Also note for the president Orange isn’t your color"}}]}