{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21880","data":[{"id":"6132922636","type":"user-reviews","attributes":{"title":"The set up","userName":"Kaitln Bennett","isEdited":false,"date":"2020-06-28T18:23:29Z","rating":1,"review":"Mr donald ummm i am having trouble navigating your app and it is just so out dated. i mean sis you are the so-called PrEsIdEnT of this country and you couldn’t hire someone to do the graphics and make the the set up more organized and play test it? I MEAN SIR! if you can’t even run an app then how do you plan to run a country?? YOU GOT IMPEACHED! give up bro. it’s really not worth the hassle"}},{"id":"6122856329","type":"user-reviews","attributes":{"title":"Causes cancer and the deterioration of cognitive function","userName":"MelaninTrump123","isEdited":false,"date":"2020-06-26T05:36:30Z","rating":1,"review":"My wife got cancer from uses this app too much and so did I, my three kids, and my cat. It also turned our brains into mush so now we are in a vegetative state and cannot think for ourselves. Also, downloading this app made all my guns stop working and the local McDonald’s ran out of cheeseburgers ☹️"}},{"id":"6122849641","type":"user-reviews","attributes":{"title":"Absolutely awful","userName":"tia.daviss","isEdited":false,"date":"2020-06-26T05:33:54Z","rating":1,"review":"Might honestly be the absolute ✨🧚🏽‍♂️worst🧚🏽‍♂️✨ app I have ever used. The whole design of the app is terrible🤮🥰 I wish I could take the sight of it out of my memory. Not only is it just ugly but it’s slow and useless. There is no point in even having this app. Do not waste your time with the ~garbage~ you call an app."}},{"id":"6120536736","type":"user-reviews","attributes":{"title":"Sells your private information","userName":"Roberta Frost","isEdited":false,"date":"2020-06-25T14:57:03Z","rating":1,"review":"The app is beautiful! I’m disappointed that it asks for your phone number and credit card information in order to use it. I don’t know how this is allowed. This information can be used to be sold to 3rd parties that you did not consent to. Please fix this."}},{"id":"6081808946","type":"user-reviews","attributes":{"title":"Extremely disappointed","userName":"iloveyoudonald","isEdited":false,"date":"2020-06-16T07:08:50Z","rating":1,"review":"I downloaded this app with high hopes, but I opened it up to be immediately asked for my credit card information. I should have known they would have never given away pictures of daddy Donald's shrimp penis for free. Very disappointed. I recommend trying a different app."}},{"id":"6065497112","type":"user-reviews","attributes":{"title":"I’m disappointed in daddy","userName":"Talia015","isEdited":false,"date":"2020-06-12T04:28:16Z","rating":1,"review":"One early morning I was doing LSD and started hallucinating. Soon after daddy Donnie visited and told me to download this app and it would be the end of all of my problems. I was proven wrong when I opened it and found out it was Scientology now I am stuck and can not escape. Don't fall down this never ending rabbit hole I AM WARNING YOU, STAY AWAY‼️‼️"}},{"id":"6063790822","type":"user-reviews","attributes":{"title":"Feet pics??","userName":"thepinninglover","isEdited":false,"date":"2020-06-11T17:05:20Z","rating":1,"review":"I downloaded this app to refresh my day with some good news and updates on Trump’s presidency and the upcoming election. Instead I was met with hundreds of pictures of feet. I don’t know if this is a glitch, but I mean hUNdreds of feet pics. I get that Trump is into that sort of thing, but there are children on this app and I don’t approve."}},{"id":"6057205889","type":"user-reviews","attributes":{"title":"WATCH OUT DONT BUY","userName":"122447890621cjb","isEdited":false,"date":"2020-06-10T03:35:55Z","rating":1,"review":"A horribly scary app; I downloaded this app to support MY president and was horribly misled and scarred for life. This app will track your data and read your information WITHOUT permission. It started texting my friends and family and deleting any and all pictures not politically related. Would give it 0 stars if I could."}},{"id":"6050194022","type":"user-reviews","attributes":{"title":"Still in this time,hour,day,second am still traumatized😟","userName":"EW CHEETOS😟","isEdited":false,"date":"2020-06-08T10:10:50Z","rating":1,"review":"Smh so when I first open the app I saw a weird looking Cheeto not sure if it was a Cheeto tho it looked VERY orange and old,I was so scared I think am now traumatized.I really DO NOT recommend this app if your not a racist,homophobic,white,old,dusty,musty person thank you for your time this was MY honest opinion."}},{"id":"5964848161","type":"user-reviews","attributes":{"title":"Finally","userName":"Fidgit33","isEdited":false,"date":"2020-05-19T09:21:39Z","rating":5,"review":"A way to have a our president communicate with us without the media and their lies"}}]}