{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=9910","data":[{"id":"6175315275","type":"user-reviews","attributes":{"userName":"I LOVE THIS STORE APPPPPPPP :)","date":"2020-07-09T05:57:15Z","rating":1,"title":"Astronomically terrible app 🤢","review":"Bro, when I opened the app a wall started to form to keep me out just because I’m Hispanic 🥺 then lil orange leprechauns tried to take everything I own to give it to the man since I am not orange 🍊enough. The leprechauns also don’t welcome me into toupee city because they need room for the big belly snow bunnies 🐰. Why the big snow bunnies?? When we can fit more fairies from the land of equality rather then having the day people eat up all the food in my fridge 🙄.","isEdited":false}},{"id":"6175219913","type":"user-reviews","attributes":{"userName":"Guy magnite","date":"2020-07-09T05:20:25Z","rating":1,"title":"A Disappointment","review":"I am a true fan of Trump and the work he has done to truly save our country but this app is the worst! I am so sad that this app is associated with Trump. It’s a disgrace. After downloading it crashed my phone twice and every time i tried to use it would just shut down. I started getting really weird and vulgar adds and text messages that were unrelated to his campaign but after deleting the app they have stopped.","isEdited":false}},{"id":"6175073548","type":"user-reviews","attributes":{"userName":"ravenlanise","date":"2020-07-09T04:30:46Z","rating":1,"title":"THIS APP IS HORRIBLE","review":"this app stole all my information. stole my credit card information spent all the money. then app the audacity to ask me to by his merch. not to forgot the time the app leaked my address and i was robbed the next day!! THEY STOLE EVERYTHING!! my family is now poor. this app should be removed forever. its a piece of garbage!  i have never been so upset in my life. this app also threw my little brother in a pit of fire for no reason. just horrible this app gets a 1/5 stars. DISGUSTING.","isEdited":false}},{"id":"6175057808","type":"user-reviews","attributes":{"userName":"TracieCams","date":"2020-07-09T04:25:53Z","rating":1,"title":"App is bad, President is worse","review":"I mean, just when you thought it couldn’t get any worse than having Donald Trump as president, here comes this terrible app. Now, my teen daughter is pregnant, my dog died, and my husband left me for a man. There’s also a huge murder hornet nest outside my front door. I’d wear a mask and a protective suit to go somewhere, but then I’d just be like those snowflake libtards who are giving up their constitutional rights! Just like the Covid-19 hoax, this app is FAKE NEWS! Do not recommend!","isEdited":false}},{"id":"6174975957","type":"user-reviews","attributes":{"userName":"GetGreatGaming","date":"2020-07-09T04:00:00Z","rating":1,"title":"DON'T DOWNLOAD THIS APP","review":"This app told me to drink bleach and then my pet dino believed it, so it drank bleach outside and recorded it on my phone and then collapsed onto my house, but my stove was on so my house caught fire. And then my house and everything inside it (except my phone) burnt down, including the other 7 pet dinos I had that were in the house. So now I only have 1 dino and 1 phone to leave this review. \n\nThis is a warning to all of the other people out there with a house!! Don't get the app!","isEdited":false}},{"id":"6174917796","type":"user-reviews","attributes":{"userName":"madiv14","date":"2020-07-09T03:41:56Z","rating":1,"title":"how dare you","review":"this app stops all appliances in your house. my pet finger monkey went to warm up some pizza rolls from the freezer and it was off!! We thought maybe our freezer was broken so he went to the microwave and it was off too! My light works just fine so I know it’s not a power outage. Not only are my appliances off but my pet dinosaur tried to go to the store and my car wouldn’t start! This app is cursed and i strongly suggest it gets removed from the app store!","isEdited":false}},{"id":"6174914747","type":"user-reviews","attributes":{"userName":"neji 🥺🥺","date":"2020-07-09T03:41:01Z","rating":1,"title":"🏳️‍🌈","review":"as SOON a as i opened the app, i got hit with a stinky wave of racism, fascism, white supremacy, and SO much more! sadly i have damaged my lungs but am unable to get help because of the healthcare system :( and all of the corona cases that we did a HORRIBLE job dealing with. now i must lay under my rainbow flag (with my mask on of course) and sign trans rights + blm petitions while i pray to satan that i get better. this definitely earns a 1 STAR RATING in my book! (that i actually read through unlike SOME people with the bible)","isEdited":false}},{"id":"6174891952","type":"user-reviews","attributes":{"userName":"Rita La mata","date":"2020-07-09T03:34:16Z","rating":1,"title":"WORST APP IN HISTORY","review":"I wanted to get a slice of cheese from the dishwasher but when I went to get my cheese all I found was a bar of water on the shelf! So I decided to go to the doctors office to get some cheese but when I walked in all I found was paper plates! So I asked the dog that washed the floors of the ceiling and they said that the cheese was all in cups now in the clouds so I when outside and asked Elon Musk if he could fly me in a rainbow to Toyota Prius but he said no so I was robbed of my cheese! And now I’m a strip of unicorn bacon with cheese.","isEdited":false}},{"id":"6174890819","type":"user-reviews","attributes":{"userName":"smtat0","date":"2020-07-09T03:33:55Z","rating":1,"title":"App doesn’t work?","review":"This app crashes all the time. I tried looking up solutions to this problem but fellow Trump supporters kept telling me that all the apps on my phone mattered and that I shouldn’t just be worried about this one crashing. Also they said that Apple was going to rebuild the app and that they were going to pay for it too? I’m not sure what to believe anymore so I deleted the app and recommend you stay away from it period.","isEdited":false}},{"id":"6174873233","type":"user-reviews","attributes":{"userName":"Jillian Bittner","date":"2020-07-09T03:28:50Z","rating":1,"title":"Terrible app","review":"Do NOT get this app. It steals your cows, plumbing, and even your CLOTHES. I was taking my cow on a walk, as you do, and when I got back to my house, my cow had disappeared, my clothes were gone, and all of my plumbing had been removed. The only possible culprit is this app. I even have evidence. RIGHT WHEN I GOT HOME my security app gave me a notification warning me that a dangerous, racist, homophobic, sexist, child rapist was nearby. Now I think we can ALL figure out who that was…","isEdited":false}}]}