{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28680","data":[{"id":"6172898939","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:29:54Z","review":"The title explains itself but oh my is it worse when you get into it. Nasty dirty slow app. Useless and annoying, notifications after notifications, and they used my phone number to spam me with even more useless things.","userName":"Michael Jimin Smith","title":"Worst Public Bathroom Ever"}},{"id":"6172898572","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:29:47Z","review":"Trump has been a disgrace to the world and for him to put this app here just makes me angry. All he has done is killed many Americans because he thought the coronavirus wasn’t a big deal. He doesn’t know anything he just wants to rule the us and be rich","userName":"fxgtchjfcbnjg","title":"Black lives matter"}},{"id":"6172890712","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:27:22Z","review":"after downloading this app, it gave off the impression that this app was better than others when it actually wasn’t! all apps are equal but this one deserves to be taken down. plus, as soon as i downloaded this app, my fish ran away!! don’t do it!!","userName":"aannnoonnn","title":"ALL APPS MATTER ‼️‼️‼️"}},{"id":"6172874709","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:22:35Z","review":"If I could I would rate this a zero out of ten I would because it took week to download and I had to take my phone to the shop to get it fixed because it glitched my phone  and i hate bugs and It literally showed a bunch of dredful bugs and I hated it DO NOT GET THIS APP🧚🏽","userName":"karenlovesjesus07","title":"Hated this app"}},{"id":"6172872091","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:21:45Z","review":"First of all every time I clicked the app it took hours for the page to load and I kept on popping up with weird images then my dog got scared and pooped on the carpet. Also it took forever to download having this app is just a waste of time.","userName":"😡☹️👎👎☹️","title":"Horrible"}},{"id":"6172863788","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:19:13Z","review":"THIS APP IS THE WORST. It took way to long to download and began glitching as soon as I got on the app. It made a weird noise that I think might have killed my cat. The app is just horrible. I also think this app might be used to spy on us but i don’t know... so it needs to be taken off this app store immediately.","userName":"Kraz4apps","title":"PLEASE DONT DOWNLOAD!!"}},{"id":"6172853684","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:16:12Z","review":"This app was so slow to downloaded. Had to stop and redownload. Many times. I wanted to support this but he need to fix all the issues on this app. It dosnt work will with the older phone. It’s also a confusing app. Like what is this app for. No explanations of anything. VERY SLOW LIKE HIM LOL","userName":"karen 12627387366291","title":"This is not a good app"}},{"id":"6172849321","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:14:53Z","review":"Once I opened this app, I felt an earthquake and started seeing lava explode out my window. Out popped the devil and he asked me to sell my soul? Is that part of the deal? Did y’all come across this? Would not recommend 0/5 stars. \nAlso, I did not go through with signing.","userName":"Meckle","title":"Phone died"}},{"id":"6172847263","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:14:15Z","review":"Trump has real small peepee and he is bad in bed. It like a croissant. Barro- I mean my son and I dont like the way it move when it he walk around house no clothes. It very orange. Also he and Penance are having side fling. When I find out he feed me rat for week and dropkick me🙈😭\n\nThis is NOT Melanin Trump, this is concerned citizen.","userName":"Apple costumer sdgjkich","title":"Trump has a small peepee"}},{"id":"6172833635","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-08T16:10:14Z","review":"Don’t get me wrong at the beginning I was all for a fruit like an orange to become president but then the orange became stuck in a peach 🍑 what kind of thing is that I do not support peaches. So disappointed this app didn’t help at all terrible eww disgusting worst app ever wouldn’t recommend to my worst enemy. Sooo disappointed","userName":"melany094","title":"🧚‍♂️✨✨🦄"}}]}