{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=37050","data":[{"id":"6177049954","type":"user-reviews","attributes":{"userName":"Pelosinancy","review":"Other than obvious issues, the app actually did randomly make my phone shut down multiple times.","date":"2020-07-09T14:58:10Z","isEdited":false,"rating":1,"title":"Very glitchy"}},{"id":"6177045123","type":"user-reviews","attributes":{"userName":"bellacuk","review":"i got scared when i opened this app because i saw an orange oompa loompa appear on my screen as soon as i opened the app. the government should be taken seriously and not put this creature on the app as a joke, because it isn’t funny!","date":"2020-07-09T14:56:51Z","isEdited":false,"rating":1,"title":"THIS APP IS AWFUL!!!"}},{"id":"6177044916","type":"user-reviews","attributes":{"userName":"no123no456","review":"after taking a week to download this app constantly crashed, slowed my phone down and took up WAY TOO MUCH STORAGE. it must be taken down so tell that 🍊orange🍊he has bigger things to worry abt than banning tik tok","date":"2020-07-09T14:56:48Z","isEdited":false,"rating":1,"title":"This app is awful"}},{"id":"6177019632","type":"user-reviews","attributes":{"userName":";3¥£€><~","review":"He needs to stop taking an app down that a lot of people use a lot of people on that app are making jobs Bc of it he needs to keep TikTok on as an app.","date":"2020-07-09T14:49:58Z","isEdited":false,"rating":1,"title":"He is taking an app that could make jobs one day"}},{"id":"6177015025","type":"user-reviews","attributes":{"userName":"Sara willowe","review":"I was very excited to get the app! Then it all went down hill when I opened it 🧚‍♂️ it’s very disappointing, disorganized, and borderline not good. Don’t get the app it’s not worth it yall ❣️ I’m very disappointed in our president, or orange 🧡Oki Chile anyways this app ain’t it.","date":"2020-07-09T14:48:43Z","isEdited":false,"rating":1,"title":"No ❤️"}},{"id":"6176996025","type":"user-reviews","attributes":{"userName":"Pugs lovely","review":"It’s the worst app you could ever get because it’s really scary also trump makes you like him which gives me even less respect for him, overall I think it’s the worst app ever and people need to NEVER get it. 0/10 😳🤡😤🤢🤮🤧😷😾👿👺💩🙅🏿‍♂️🙅🏾‍♀️","date":"2020-07-09T14:43:38Z","isEdited":false,"rating":1,"title":"HORRIBLE"}},{"id":"6176978733","type":"user-reviews","attributes":{"userName":"BIGc45276","review":"I first downloaded this app as a joke with low expectations. As soon as the app opened i knew it didn’t even come close to my expectations. This is easily no problem the worst app I have ever used.","date":"2020-07-09T14:38:55Z","isEdited":false,"rating":1,"title":"Worst app I have Ever Used"}},{"id":"6176963684","type":"user-reviews","attributes":{"userName":"Belle a Boo","review":"This app keeps crashing my phone and I can deal with a little, but when it happens every time I open the app it's ridiculous.","date":"2020-07-09T14:34:51Z","isEdited":false,"rating":1,"title":"Keeps crashing my phone"}},{"id":"6176957587","type":"user-reviews","attributes":{"userName":"Lexis Henry","review":"WORST APP EVERR!!!! It took forever to download, and when I got it, this picture of an Oompa Loompa popped up? I’m not sure what this has to do with trump but I don’t like it. Very laggy, doesn’t give updates about the wall, and very badly decorated app!!!!! DO NOT GET THIS APP!!! It’s not worth your time","date":"2020-07-09T14:33:15Z","isEdited":false,"rating":1,"title":"Tik tok😍😍"}},{"id":"6176957065","type":"user-reviews","attributes":{"userName":"poopeater🥴","review":"Hello, this app is terrible. Took 2 weeks to download and it was so glitchy when I opened the app. And it barely tell’s you much I find it a waste of space in this app. Can’t wait for it to be deleted.","date":"2020-07-09T14:33:07Z","isEdited":false,"rating":1,"title":"👁👃👁"}}]}