{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=29850","data":[{"id":"6177990380","type":"user-reviews","attributes":{"review":"As an avid Trump supporter since day one, I was utterly disappointed by this app. It infected my phone with a virus and now all three of my children have COVID-19. We don’t wear masks because God wouldn’t want that, so this app must be the only explanation. I urge you not to download this app.","title":"So disappointed","date":"2020-07-09T19:40:48Z","isEdited":false,"rating":1,"userName":"Nanette V."}},{"id":"6177989987","type":"user-reviews","attributes":{"review":"Honestly, this is the worst app I’ve ever owned. It shared pictures of my family (particularly my adopted black cousin) to the mafia, and now they’re after us! I cannot believe that this app in support of our president would do such a thing. Anyway, brb gotta go fight off some mafia lackeys","title":"Dumb app","date":"2020-07-09T19:40:40Z","isEdited":false,"rating":1,"userName":"Fyodor B"}},{"id":"6177965265","type":"user-reviews","attributes":{"review":"If I could give zero stars I would. This app features fake news throughout all of their content. Also I have to give trump my phone number to sign up for an account? Seems like just another American spy tactic","title":"0/10","date":"2020-07-09T19:32:41Z","isEdited":false,"rating":1,"userName":"Emily_Brinkman"}},{"id":"6177945372","type":"user-reviews","attributes":{"review":"i don’t understand how people can put up with this, DO NOT DOWNLOAD!!!! it’s spam, and it’s just overall just not a necessity! why would you use up storage from this app! just no, this app is terrible!","title":"would give 0 starts if i could, just terrible!","date":"2020-07-09T19:26:16Z","isEdited":false,"rating":1,"userName":"✨not your business silly✨"}},{"id":"6177908833","type":"user-reviews","attributes":{"review":"I was so excited to get this app and then all of a sudden it started having so many adds. It doesn’t give what it says it gives and I don’t recommend getting this app. It’s a waste of time","title":"It doesn’t do what it says","date":"2020-07-09T19:14:15Z","isEdited":false,"rating":1,"userName":"nshdjdvfjjdsb"}},{"id":"6177898767","type":"user-reviews","attributes":{"review":"This app is horrible. One of the biggest let downs. It had way too much hype. Honestly just a huge waste of my time. Never even want to look at this app again. Truly ruined my year.","title":"Never been more disappointed","date":"2020-07-09T19:10:58Z","isEdited":false,"rating":1,"userName":"dsjsjjsjsjs"}},{"id":"6177867672","type":"user-reviews","attributes":{"review":"i opened the app to see a disgusting cheeto greeting me 😓 i usually like cheetos but this one was so rude and terrible. it’s like they purposefully don’t want people on this app. then i showed my TWO YEAR OLD sister and now we have to go to the hospital because she passed out from the sight 😠 this app is dangerous","title":"HORRENDOUS","date":"2020-07-09T19:01:00Z","isEdited":false,"rating":1,"userName":"Tik Tok am i right"}},{"id":"6177864955","type":"user-reviews","attributes":{"review":"I had opened the app after downloading because I wanted to appreciate my lovely president but the app kept crashing and eventually at one point asked for my credit card info after a couple of minutes I got a notification saying Donald just spent 200$ on V bucks. I AM OUTRAGED I SHOULD HAVE VOTED FOR THE WOMAN FOR CRYING OUT LOUD!!!","title":"OUTRAGEOUS","date":"2020-07-09T19:00:10Z","isEdited":false,"rating":1,"userName":"idlwhyimherebutokiguess"}},{"id":"6177829963","type":"user-reviews","attributes":{"review":"i downloaded it trying to have some fun ya know looking at president stuff ya know🤩 and suddenly my whole phone just crashed and started having a whole breakdown. now i was thinking maybe it wasnt the app so i deleted it and everything was fine butthen i re downloaded it and my phone started malfunctioning again plz fix this🥳😳🥺well not rly i just need this to say its real also do you think its bc im mexican? that it wont let me on the app im just 🤔","title":"horrible so disappointed 😔","date":"2020-07-09T18:49:39Z","isEdited":false,"rating":1,"userName":"maddie6109"}},{"id":"6177787653","type":"user-reviews","attributes":{"review":"i used to love trump and fully supported maga but when i opened the app and i saw a troompa loompa staring into my soul, if a child saw that image, they would for sure need therapy for the rest of their life. the image burned itself into my brain and i can’t see anything. i tried walking down my stair case to get the bleach to wash my eyes out and a slipped and fell onto my head and crushed my three dogs. i will never like trump ever again. even typing his name is causing my distress.","title":"this app has caused emotional distress","date":"2020-07-09T18:37:04Z","isEdited":false,"rating":1,"userName":"Bunnygirl7990"}}]}