{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=32960","data":[{"id":"6173591946","type":"user-reviews","attributes":{"review":"Made my phone glitch and then when I opened the app there was this very loud pitch noise that made my ears bleed and all the glass in my house is broken. Whatever you do, do not download this app!! It will break your phone and everything glass in your house!!","title":"Cheeto man","rating":1,"date":"2020-07-08T20:17:30Z","userName":"manGxguja","isEdited":false}},{"id":"6173587874","type":"user-reviews","attributes":{"review":"This is the war stop in the world it killed my cat I downloaded it and my cat started glitching since my cat is allergic to oranges so now I have to struggle with the death of my cat because of this dumb app I give this a one star rating it was the worst app in the world never get it OK bye","title":"Killed my cat","rating":1,"date":"2020-07-08T20:16:05Z","userName":"i have std","isEdited":false}},{"id":"6173575500","type":"user-reviews","attributes":{"review":"i downloaded the app and a trump supporter came to my house wearing a trump mask and sprinkled poison ivy all around our house. we’re running out of food but we can’t leave because now there’s even more trump supporters surrounding our house chanting trump2020 and throwing maga hats at us.","title":"DO NOT DOWNLOAD","rating":1,"date":"2020-07-08T20:11:48Z","userName":"xGiraffeQueenx","isEdited":false}},{"id":"6173571994","type":"user-reviews","attributes":{"review":"The app took 3 hours to download, I have good WiFi so the amount of time it took to download this app is crazy. The app kept on glitching and kicking me out every 2 minutes. This app is incredibly slow. Terrible app.","title":"This is an honest review","rating":1,"date":"2020-07-08T20:10:36Z","userName":"Jenny becerson","isEdited":false}},{"id":"6173558788","type":"user-reviews","attributes":{"review":"This is the absolute worst app ever it took so long to download and once i got it my phone got a virus and kept turning off 100% do not recommend it takes so long to type this cause my phone keeps turning off","title":"HORRIBLE","rating":1,"date":"2020-07-08T20:06:06Z","userName":"hahsjdjdjudhdc","isEdited":false}},{"id":"6173550927","type":"user-reviews","attributes":{"review":"It barely worked it took absolutely FOREVER to download and overall poorly made and hard to run I will never download this app again also gen z for the win we got this","title":"Wish I could give zero stars","rating":1,"date":"2020-07-08T20:03:28Z","userName":"Jazzygirl15","isEdited":false}},{"id":"6173542999","type":"user-reviews","attributes":{"review":"The moment I downloaded the app a SWAT team broke down the door and started to destroy my home. I tried to get them to stop, but they would not. The only way I managed to stop them was to delete the app and burn my iPhone. 1 star. Do not download.","title":"Terrible","rating":1,"date":"2020-07-08T20:00:46Z","userName":"SirJoshPosh","isEdited":false}},{"id":"6173536812","type":"user-reviews","attributes":{"review":"So I was on Tik tok and I saw this video about how good this app was do yk I just had to check it out 👁👄👁 so I downloaded it and I saw a CHEETO on my phone screen that just wouldn’t go away. Everytime I opened the app it was just this monstrosity of a picture that terrified me and my homegirls","title":"Chile-","rating":1,"date":"2020-07-08T19:58:42Z","userName":"BEIFNEJCN","isEdited":false}},{"id":"6173533581","type":"user-reviews","attributes":{"review":"This is a horrible app saying that only one country matters! It took so long to download and has so much fake news on it. This app should be deleted off the App Store because I feel bad for whoever is getting this app!","title":"All countries matter!!","rating":1,"date":"2020-07-08T19:57:36Z","userName":"Flow33333333333333333","isEdited":false}},{"id":"6173524865","type":"user-reviews","attributes":{"review":"this is honestly the worst app i’ve ever used. couldn’t even be on there for 2 minutes before it started crashing. tried restarting the app and my phone repeatedly, but it’s still not working. WOULD NOT RECOMMEND ❌❌❌","title":"worst app ever!! 🤢","rating":1,"date":"2020-07-08T19:54:37Z","userName":"Grace739973((189:$","isEdited":false}}]}