{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=141350","data":[{"id":"6179433347","type":"user-reviews","attributes":{"title":"Not a good app","userName":"MichaelZA1986","rating":1,"review":"Was not happy with the interface of this app. Was hard to navigate and not user friendly. Pages took a long time to load. Needs improvements.","isEdited":false,"date":"2020-07-10T04:28:55Z"}},{"id":"6179433315","type":"user-reviews","attributes":{"title":"periodt","userName":"420poopy","rating":1,"review":"HORRIBLE","isEdited":false,"date":"2020-07-10T04:28:54Z"}},{"id":"6179433186","type":"user-reviews","attributes":{"title":"VIRUS WARNING","userName":"gen z bru-","rating":1,"review":"this app made my phone completely glitch out. my phone was working perfectly fine before i downloaded it and ever since i downloaded it, my phone will randomly start to “tap” on random things on my screen. i’m pretty sure it brought a virus into my phone and i just wanted to put a fair warning out here to all my fellow app store users. downloading this app was a huge mistake and unless you want your icloud to get as damaged as mine, please do not download the app. it is horrible.","isEdited":false,"date":"2020-07-10T04:28:52Z"}},{"id":"6179433211","type":"user-reviews","attributes":{"title":"✨t o m f o o l e r y✨","userName":"bruh what's good","rating":1,"review":"AWFUL. This app took almost a week to download and then when it did it kept crashing. This is app is absolutely horrendous just like BUNKER BOY‼️","isEdited":false,"date":"2020-07-10T04:28:52Z"}},{"id":"6179433094","type":"user-reviews","attributes":{"title":"DO NOT DOWNLOAD‼️","userName":"s6ixn9ine","rating":1,"review":"First of all, the app took at least 69 days to download. And then would only let me open the app if I donated $300 to Trump’s dog’s college tuition. I tried calling the customer service line and all it said was. “No good. Very bad. Trash.” This app is No good. Very Bad Trash","isEdited":false,"date":"2020-07-10T04:28:50Z"}},{"id":"6179432997","type":"user-reviews","attributes":{"title":"Don’t get this","userName":"Remi Leblanc","rating":1,"review":"I think it is connected to a virus because I got an email from my electronic security and they said that my phone had virus! Bad app!","isEdited":false,"date":"2020-07-10T04:28:48Z"}},{"id":"6179433034","type":"user-reviews","attributes":{"title":"Help","userName":"willyboy2004","rating":5,"review":"I’m here because unlike most of the uneducated people I actually want to help our president instead of put him down and the app was great it took 5 seconds to download and was a easy setup.","isEdited":false,"date":"2020-07-10T04:28:49Z"}},{"id":"6179432903","type":"user-reviews","attributes":{"title":"Bad","userName":"Samanta K","rating":1,"review":"He took away my pet walking fish 😞 😔","isEdited":false,"date":"2020-07-10T04:28:47Z"}},{"id":"6179432798","type":"user-reviews","attributes":{"title":"WORST APP!! DO NOT GET!!","userName":"Joe_mama.6969","rating":1,"review":"THIS APP TOOK 5 HOURS TO DOWNLOAD AND THEN SENT A VIRUS THROUGHOUT MY PHONE!! IT IS A COMPLETE SCAM AND IF YOU DOWNLOAD IT YOU WILL GET HACKED!! HELP!! THIS APP IS ALSO VERY HARD TO USE AND HORRIBLE QUALITY!! TERRIBLE SERVICE!!","isEdited":false,"date":"2020-07-10T04:28:44Z"}},{"id":"6179432792","type":"user-reviews","attributes":{"title":"DISGUSTANG","userName":"Cameron.t.lewis2021","rating":1,"review":"Oh my lorrrddddtt. The ugly ass Oompa Loompa in the Oval Office suggested I download this app, it took 3 years to download and then I open the app to see pictures of these libtards preaching about human rights and free health care. TRUMP IS A SOCIALIST!!!!! He’s trying to brain wash you with his leftist treason talk. I also heard that he’s a child predator 😔. Sorry trumpies don’t download this horrific app.","isEdited":false,"date":"2020-07-10T04:28:44Z"}}]}