{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=5670","data":[{"id":"6174586725","type":"user-reviews","attributes":{"date":"2020-07-09T02:04:26Z","isEdited":false,"review":"right when you open the app you’re greeted with a picture of a child molester. i’m not kidding, this is disturbing. i threw up shortly after opening the application and have been sick ever since. i can barely move and i was rushed to the ER after a heart attack that the doctors confirmed was caused by the app. The doctors even told me face to face that when they opened the app they instantly had a seizure and they have been getting patience dealing with the same thing. some people are having strokes aswell and the app has 4 current confirmed kills in my local hospital alone.","userName":"hoboboi27","title":"Absolutely horrific!!!","rating":1}},{"id":"6174453708","type":"user-reviews","attributes":{"date":"2020-07-09T01:26:23Z","isEdited":false,"review":"When I downloaded the app I saw a nasty looking cheeto like the kind you drop on the floor and forgot about it and somehow rolls the fridge and that’s been there for five months. all I wanted to do see our lovely president because I never got to see him before 😪 every time someone try’s to show me a picture of all I see is a cheeto puff. so as you can tell I was highly disappointed when I opened the app, Also when I open the app it said I had 5 left to live! so if your reading this please invite our lovely president to my funeral. Thank you- Little brown girl 👧🏽","userName":"Hot Cheeto.","title":"Worse app ever!!!😡","rating":1}},{"id":"6174397975","type":"user-reviews","attributes":{"date":"2020-07-09T01:09:32Z","isEdited":false,"review":"I downloaded this app expecting to find a mentally and physically stimulating game such as subway surfers but I was utterly shocked to see a racist, homophobic, transphobic, xenophobic, islamophobic, sexist, misogynistic, pedophilic, white supremacist asking for my vote?! No way Jose. I swear I could smell the stench of white privilege and ignorance make its way throughout my house. The almost toxic vapors were becoming too much for me to bear and I sprinted outside for the first time in 10 years. This app is not only a threat to people mentally but it could also kill you. Do not download it is terrible and a waste of money and time and storage. Good bye.","userName":"nj_06","title":"Entirely Inappropriate","rating":1}},{"id":"6174362386","type":"user-reviews","attributes":{"date":"2020-07-09T00:58:33Z","isEdited":false,"review":"to start things off i am deeply offended buy what this disgusting, ugly piece of crap has done to this country, it’s people and the what we stand for. i was disgusted when i opened this app to see this ugly mans face right away. i immediately started gagging and vomiting and was later exited into the hospital for “uncontrollable vomiting” this app should be sued. it made me literally sick when i saw his face and now i’m deathly ill. this app is horribly made and i can’t even navigate it because it was created by an alien. i hate everything about it. DO NOT GET THIS APP IT WILL RUIN YOUR LIFE!!!\n#blm #saytheirnames #nojusticenopeace","userName":"SYLVIA HEGLUND","title":"NO, NO, AND NO AGAIN🤢🤮🤕","rating":1}},{"id":"6174319019","type":"user-reviews","attributes":{"date":"2020-07-09T00:44:05Z","isEdited":false,"review":"I was disgusted when I opened this app, I found out the “T” supports a racist dirtbag and not transgender lives. Thumbs down to that👎. After being severely disappointed I continue on to find that the app is glitchy and a pure waste of space on my homepage. \n\nDOWNLOAD AT YOUR OWN RISK!!! I would NOT be suprised if a virus is attached to this sorry excuse of an app! Apsolute garbage. \n\nThe only thing I appreciated was it took the time to congratulate Mike Pence for coming out during pride month. Other then that though this app is terrible. Please consider taking this app OFF the App Store and the person it supports OUT of office❤️","userName":"pipealicious","title":"AWFUL🤢","rating":1}},{"id":"6174294445","type":"user-reviews","attributes":{"date":"2020-07-09T00:35:47Z","isEdited":false,"review":"As soon as I opened the app I had the sudden urge to vomit 🤮run 🏃‍♂️and hide all at the same time. The app then crashed presumably because the universe itself wanted to reject such a awful mobile device virus. But when the app finally opened I was overwhelmed in a tsunami of hateful propaganda which any human being should be offended by and even more horrible I had to look at some ugly, overweight orange with a birds nest on its head and absurdly small hands. Overall the app was pointless and should never  of been allowed into office I mean on the App Store.","userName":"Chris the Pole vaulter","title":"I have never had such a horrible app in my life","rating":1}},{"id":"6174259357","type":"user-reviews","attributes":{"date":"2020-07-09T00:23:43Z","isEdited":false,"review":"I simply do not understand what came into the mind of the US President when deciding to ignore all scientific evidence on the corona virus and causing there to be now 3 million cases. Imagine caring more about money and your rich white fat friends more than innocent lives! Oh wait I can’t, because I’m not a horrible human being; which Trump truly, truly cannot say. All I have to say is that if the country is ever led by someone as idiotic as him again, then I hope that aliens joins forces with the other countries and destroy the US (this is a satirical joke). Thank you for nothing bunker boy!!!!! ✨Hearts and kisses ☺️😘🥰✨","userName":"Lover Kinda","title":"what was the reason","rating":1}},{"id":"6174164954","type":"user-reviews","attributes":{"date":"2020-07-08T23:49:31Z","isEdited":false,"review":"this app is just no. i have no words as to how awful this is. right as i opened it i saw THE most hideous picture anybody could ever see. this app provides false information about the cheeto president. my younger sibling saw the images on my the app and she screamed and started to cry. if you are interested in downloading this app DO NOT EVER DOWNLOAD IT. it has the most disturbing images i have ever seen and it is completely inappropriate. i feel very very uncomfortable and this is the worst app ever. i will definitely not vote for the cheeto ever. this app should be taken down to preserve the innocence in everybody. this app is T E R R I B L E.","userName":"thegaang","title":"HORRIFYING","rating":1}},{"id":"6174156130","type":"user-reviews","attributes":{"date":"2020-07-08T23:46:14Z","isEdited":false,"review":"First of all, this app takes forever to load and is incredibly glitchy when it does. If you go to report the problem, it will ask for a donation to fix it and to build the wall (why bother, Mexico closed the border already and I thought that Mexico was going to pay for the wall not us) Then if I try to force close the app, it will start screaming the most obscene racist and sexist things Cheeto Puff has ever said and the only way I got it to stop was by restarting my phone and deleting the app. Don’t bother with this crap. Just like his administration, this app is a failure","userName":"Carter4216","title":"HORRIBLE APP","rating":1}},{"id":"6174152255","type":"user-reviews","attributes":{"date":"2020-07-08T23:44:42Z","isEdited":false,"review":"i can’t even put into words how bad this app is.... SIKE i can. this app called me all sorts of racist things and when i opened it i got this overwhelming smell of cheetos, it was DISGUSTING!!! this NEEDS to be TAKEN OFF THE APP STORE IMMEDIATELY or a lot of people are going to be upset with you apple! anywho back to why the app is so bad, it took all of my information and sent it to the gov and then they sent it to Area 51. i don’t know about you but I DONT WANT ALIENS HAVING MY INFORMATION ughh. i am so disappointed and i want a refund immediately! \ni suggest you take this off the app store as soon as possible, i wish i could give this ZERO STARS","userName":"rotten smelly cheeto","title":"WORST APP","rating":1}}]}