{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=3050","data":[{"id":"6176962169","type":"user-reviews","attributes":{"date":"2020-07-09T14:34:27Z","rating":1,"title":"Haha... no❤️","userName":"Panic765","review":"Sooo I opened this app only to be disturbed by the gruesome wild orangutan/Cheeto/ rotten orange staring at me. I was so shook that I began to barf all over my cat who was sitting on my lap. She got up and looked at my phone and IM TELLING U SHE WENT BLIND. I quickly picked her up and cleaned her eyes with some bleach and she was all good again. Meanwhile, I heard the stinky grown orangutan spitting RACIST words through my phone, I went over and tried to leave the app but it wouldn’t let me. My phone was possessed with 🍊 I had to get a whole new phone and even the store clerks eyes went from 👁👄👁 to ➖👄➖ \nDo not get this ugly, nasty ,stinky, smelly, barf worthy, pervert looking app. You will be gravely disappointed. My cat and I barely survived 😖 It really deserves 0 stars because it’s such ✨ trash ✨","isEdited":false}},{"id":"6176959889","type":"user-reviews","attributes":{"date":"2020-07-09T14:33:51Z","rating":1,"title":"Three Reasons Why You Shouldn’t Download","userName":"Gernteg","review":"First off, there are too many exclamation points. Very distracting. There is also a clown holding up his fist when I open the app and it scared me a little and made me uncomfortable.\n\nSecondly, it demanded for a mobile phone number which I am not comfortable with providing. Really though, if this app would want to be more efficient and user friendly, signing up with an email would be a good move. But of course the Trump administration wouldn’t think of that :)\n\nLastly, the slogan on the front “Keep America Great” is propaganda and false advertising. Just a piece of advice: something can’t “keeping being great” when it’s already completely and utterly unjust to so many people.","isEdited":false}},{"id":"6176814484","type":"user-reviews","attributes":{"date":"2020-07-09T13:55:39Z","rating":1,"title":"DO NOT GET IT!!!","userName":"Tig_bittie","review":"This app took several days to download. After this app finally downloaded, I opened the app to something horrifying. I saw an orange man staring at me asking for my phone number! I was horrified 😱I immediatly deleted the app becuase I was scarred for life. The next day I was sleeping in bed when I awakened to a loud banging at my door. My heart was racing as I creeped to the door. When I opened the door there was a trump doll holding a letter outside of my doorway. I am deathly afraid of dolls. When I opened yhe letter, it read. “Dear resident, your behavior towards me is unacceptable. If you want to live you will redownload the app and vote trump 2020. If you don’t, suffer the consequences.” -trump. Im in a pickle. I have decided to not give in the this Cheeto man. If I die, just know this is why.","isEdited":false}},{"id":"6176516126","type":"user-reviews","attributes":{"date":"2020-07-09T12:36:04Z","rating":1,"title":"Good app, but steals data!","userName":"DoodleNinja (Spoiled Kid)","review":"When you first download the app it brings you to a home screen upon entering ASKING FOR YOUR PHONE NUMBER!!!! This is DATA THEFT! Who knows what they’re planning on using this for. Before you know it, your number will be sold off to some hacking plant and used as a scammer number. ATROCIOUS!! Also, the man in the picture is holding up a black lives matter fist, which is super progressive but he doesn’t actually support BLM. HE’S LEADING US ON!!!! The FAKE NEWS is trying to sell us this propaganda, but we’re smart and won’t fall for it. To the creators—> please update this app and STOP STEALING OUR PRIVATE INFORMATION! I will also be reporting this app to my local national government office because of its CRIMES AGAINST THE SAFETY of Trump supporters and US citizens everywhere.","isEdited":false}},{"id":"6176508246","type":"user-reviews","attributes":{"date":"2020-07-09T12:33:52Z","rating":1,"title":"Abysmal App. Should be ASHAMED!","userName":"MtheMonster","review":"The creators of this application designed, by far, the WORST-looking, BARELY functioning, ATROCIOUS-TO-THE-EYES-OF-GOD-AND-SATAN-HIMSELF thing ever bestowed upon humanity. The UI and UX of this stuff is below the likes of a novel. A literal book has better technology than the app can offer. I was appalled by the first screen, my eyes naturally got exponentially blinder the longer I looked at it and now I have pisspoor vision. Thanks, Trump. 2020 took my 20/20 eyes and that’s because of this app. It’s not even an exaggeration to say that this app is worse than the year itself- in fact, it’s an understatement. Downloading it gave my phone the equivalent of 7 human sexually-transmitted diseases. Delete it and save others from the terrible fate of ever getting it in the first place.","isEdited":false}},{"id":"6176248005","type":"user-reviews","attributes":{"date":"2020-07-09T11:20:07Z","rating":1,"title":"extremely violating","userName":"brandy kaksbshsosoa","review":"i was super excited to support Mr. president himself DONALD J TRUMP💯😤 but i became extremely uncomfortable when they told me i would need to give up MY RIGHTS to MY PÜ$SŸ or c00chiê if you will😭 it said that if i was råpêd and about to have a lil trump jr, i wouldn't be able to safely get rid of it! i am 9 yrs old and that would means i'd need to stick A COAT HANGER in my VÃGIÑÁ while doctors withhold the technology to safely remove the clump of cells from MY BØDY. i think we should just cut off everybody's peñis and sew it back on when they get married🧚‍♀️✨🍆🪓 besides this one feture that was probably \"tAkEn Oüt oF cOnTeXt\" the app works great!! i am now a racist, homophobic, transphobic, xenophobic, sex offender! just like daddy trump!! i really hope he is proud of me🥺🖤\nalso some bugs need to be fixed😁","isEdited":false}},{"id":"6176195091","type":"user-reviews","attributes":{"date":"2020-07-09T11:04:00Z","rating":1,"title":"Bee movie script","userName":"memorable!!!!!","review":"Horrible do not recommend for ANYONE to get it when I first downloaded the app it took several days to download even tho I had 50 go worth of storage free? It’s very glitchy. Hacks all your Apple ID, your gmail, bank account etc. Was very slow mind you and it overheats your phone very very very quickly I was only on the app to convince my republican friends and family go vote for trump but then this happened. Mind you it spreads a lot of false information about democratic candidates and republicanism and has racist jokes and homophobic jokes in it. Asked a lot of personal questions like my gender, beliefs, race. I don’t recommend anyone to get this app I repeat it is awful and should be taken down immediately!!!","isEdited":false}},{"id":"6176173890","type":"user-reviews","attributes":{"date":"2020-07-09T10:57:28Z","rating":1,"title":"ABSOLUTELY TERRIBLE","userName":"Gacha Lovva","review":"This app took 7 months to download and right when it finally downloaded, it asked me for my phone number! I cannot believe our president is asking someone else for their phone number when he already has a wife. Unforgivable...\n\nAnyway, A couple minutes after I downloaded this app, great misfortune was brought upon me. My dog became lesbian, Caillou broke into my house, my TV became a mafia, Lil Huddy became black, and now I forgot my native language. I think the picture when you open the app is cursed. I’m not sure why there’s a musty Cheeto in the front page, but it honestly triggered my cacophobia.\n\nOh yeah, and believe it or not, this is not the game  where you run from a cop, dodging trains and collecting coins. Sorry to disappoint","isEdited":false}},{"id":"6175965499","type":"user-reviews","attributes":{"date":"2020-07-09T09:51:08Z","rating":1,"title":"WORST APP EVER (killed my family :/ )","userName":"🧚🏼‍♀️💫💖","review":"I was super excited for this app!! but then it took over 5 hours to download and by that point I was a little concerned. When I opened it, everything seemed fine, until suddenly, my phone blew up in my hands! I now have no phone nor hands :/ as they have been blown up. Suddenly, just after that, a SWAT team wearing MAGA hats showed up at my front door. I tried to let them in, but as I had no hands they had to kick my door in. They took my family hostage and said if I didn’t leave a five star review for the app they would kill them! Obviously this is a gross violation of free speech, so I refused, and they killed my family!! please help get the app off the App Store, for everyone’s safety.","isEdited":false}},{"id":"6175748884","type":"user-reviews","attributes":{"date":"2020-07-09T08:38:25Z","rating":1,"title":"TRUMP SUPPORTERS BEWARE","userName":"donaldtrumpisachildpredator","review":"Like many of the patriotic Americans looking to “better” this country, and discovered this app. I highly advise you to turn away, and possibly look into text alerts, although I found the same issue there with endless inappropriate spam. The app took FOREVER to load onto my cellphone, and upon opening it and looking around IMMEDIATE SPAM, and requests for my phone number and picture of my ID, now I don’t know is this is some canvassing technique, but after declining that the app immediately requested my credit card info and social. And that when ID HAD ENOUGH. I attempted to delete the app, but upon doing so my phone blacked out, and I immediately received VILE MESSAGES AND DEATH THREATS. Unacceptable, although not very surprising","isEdited":false}}]}