{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=28810","data":[{"id":"6177977623","type":"user-reviews","attributes":{"rating":1,"review":"-4/10 do not recommend. It was slow, it had been glitching. I don’t think trump knows what a good app is cause this sure isn’t it. Was hoping I could get the app to keep up with things but it ended up being the exact opposite.","userName":"Crybaby 😭🍼","date":"2020-07-09T19:36:42Z","title":"Horrible app","isEdited":false}},{"id":"6177956096","type":"user-reviews","attributes":{"rating":1,"review":"I downloaded the app and it immediately asked for my phone number I believe that is an invasion of my privacy. I scared for my own well being the fact that the president wants my number makes me feel queasy and nauseous. Do not download the app at all costs!!!!","userName":"PeachyPear404","date":"2020-07-09T19:29:46Z","title":"Oompa Loompa","isEdited":false}},{"id":"6177950293","type":"user-reviews","attributes":{"rating":1,"review":"this app is terrible and disgusting. it’s all full of false information and i honestly never thought that an app could be THIS bad. please DO NOT get this app it is the worst app i have ever downloaded. as soon as i opened the app i was bombarded and suffocated with all of trumps lies.","userName":"1-800 ur fav","date":"2020-07-09T19:27:52Z","title":"absolutely awful.","isEdited":false}},{"id":"6177883587","type":"user-reviews","attributes":{"rating":1,"review":"Delete this mf app! It is terrible. All it does is spread racist propaganda and enforces a bad agenda! RUSSIA AND CHINA ARE 100% BEHIND THIS APP. If I could have given this 0 stars I would have. As soon as I opened it I saw an ugly Cheeto pop up on the screen!!! I wish I could become Helen Keller after seeing that.","userName":"genzrunsthismfcountry","date":"2020-07-09T19:06:00Z","title":"make the App Store great again","isEdited":false}},{"id":"6177878100","type":"user-reviews","attributes":{"rating":1,"review":"i got this app to see all the fake news that’s being spread on it and it was just filled with LIES. probably one of the worst apps of all time. i would not recommend getting this app unless your a horrible person.","userName":"oa0516","date":"2020-07-09T19:04:14Z","title":"useless and stupid like the man himself","isEdited":false}},{"id":"6177859912","type":"user-reviews","attributes":{"rating":1,"review":"Absolutely horrible and had technical issues as soon as I downloaded it. I expected so much more and honestly if this is the type of quality being put out by a candidate, then I think it’s time to reconsider who I’m voting for","userName":"Eve2112","date":"2020-07-09T18:58:34Z","title":"DISAPPOINTED","isEdited":false}},{"id":"6177856312","type":"user-reviews","attributes":{"rating":1,"review":"I was so excited about this app but it keeps crashing my phone. I tried using it but the content just made me depressed and disappointed. I tried to show it to my family and now they despise me. This app is terrible. Don’t download.","userName":"Ricktnarnia","date":"2020-07-09T18:57:28Z","title":"Destructive","isEdited":false}},{"id":"6177804479","type":"user-reviews","attributes":{"rating":1,"review":"the app crashed my phone when i opened the app, and i had to take it to the apple store to get it fixed. This app has a lot of problems (just like our president) and should be taken down before more phones get crashed","userName":"Trump Supporter 1","date":"2020-07-09T18:42:09Z","title":"DO NOT BUY APP","isEdited":false}},{"id":"6177804284","type":"user-reviews","attributes":{"rating":1,"review":"This whole app is such a charade, it’s nothing short of just a way to stroke our presidents ego, there’s no useful information on events and the app is god awful to use, it crashes and it has bugs and glitches galore, absolutely useless app","userName":"sherif2","date":"2020-07-09T18:42:06Z","title":"Awful","isEdited":false}},{"id":"6177786289","type":"user-reviews","attributes":{"rating":1,"review":"I was promised great things from this app but I was catfished. The people from one direction didn’t show up at my house like I was promised. This app was very low quality anyway. The gps tracking system for the boys led me to a swamp. I couldn’t handle the lies so I deleted it. Work on your app ✨orange man✨","userName":"reana_rere","date":"2020-07-09T18:36:40Z","title":"Angry. Grrr.","isEdited":false}}]}