{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21800","data":[{"id":"6173259506","type":"user-reviews","attributes":{"userName":"lanii0920","rating":1,"isEdited":false,"title":"app caused brain damage","date":"2020-07-08T18:24:22Z","review":"this app is very bad i can’t believe it’s even on the app store !!! this app glitches out and started flashing and blinking and caused my sister to have a seizure from the flashing lights when there wasn’t even a flashing lights warning 😡😡 i swear i would she trump if i could his orange looking self ! Biden 2020 ... trump there’s a special spot in hell for you !!!"}},{"id":"6173255017","type":"user-reviews","attributes":{"userName":":)layla:)","rating":1,"isEdited":false,"title":"Worst app!!! Do not download!!!","date":"2020-07-08T18:22:52Z","review":"I never leave reviews for apps, but I made an exception for this one. Completely trash, terrible, absolutely awful. Glitches my phone so badly!!! And now it won’t even delete—it’s like, we already deleted it, but now it wants to stay on my phone for ANOTHER four years! Definitely do not get."}},{"id":"6173250632","type":"user-reviews","attributes":{"userName":"nobody what so ever","rating":1,"isEdited":false,"title":"very difficult","date":"2020-07-08T18:21:23Z","review":"First things first, as soon as i opened the app, my whole phone started glitching out, it was lagging hard. Then when i actually got to use it, it didnt help a lot...it was difficult to use and you cant really understand much. This app wasnt very helpful to me, im sorry but i would give this app a 1 star review."}},{"id":"6173250502","type":"user-reviews","attributes":{"userName":"sarah marley","rating":1,"isEdited":false,"title":"WORST","date":"2020-07-08T18:21:20Z","review":"this is the worst app ever it took a week to down load and once it did i got bad luck and caught the corona virus bc of it i also HAD a dog and see how i said had well turns out this app has a curse as well and my dog got possessed and starting flying up in the air he ran off soon after so idk where he went but do not get this app it’s cursed"}},{"id":"6173222670","type":"user-reviews","attributes":{"userName":"eden viles","rating":1,"isEdited":false,"title":"trump can choke","date":"2020-07-08T18:12:09Z","review":"this is for trump you dusty cheeto puff. i hope your racism comes back a slaps you right in the head and knocks your dollar store wig right off your saggy ignorant head. there is no good reason to vote for your disrespectful to women pee sized brain self. you probably wont even be able to read and comprehend most of the words on here but no matter. maybe your slaves you got hidden, all the families you ripped apart, your wife that is clearly in so much pain but i dont blame her, or even your son that you probably abuse along with the other children that you raped. anyways have a good day sweetie🙃"}},{"id":"6173217391","type":"user-reviews","attributes":{"userName":"sally the orange","rating":1,"isEdited":false,"title":"orange🍊","date":"2020-07-08T18:10:24Z","review":"i was on this app just looking around and i heard something in my closet..i got up and looked around and i saw one single orange sitting in one of my shoes. i laid back down and went back on it and heard ANOTHER noise. the orange moved...to the end of my bed. the orange then proceeded to drag me by my toes into its mouth and turned me into an orange. dont download this, ill never be the same..🍊🍊"}},{"id":"6173214652","type":"user-reviews","attributes":{"userName":"Trump stink stinks","rating":1,"isEdited":false,"title":"Killed my fish when i was walking it","date":"2020-07-08T18:09:32Z","review":"I was casually walking my fish and then i opened up the app to rate it bad and my fish saw my phone and thought i was a trump supporter and died from shock and i can never get my fish back and when i got back home to fold my dishes my dishes ran away when they saw the app on my phone this is unacceptable"}},{"id":"6173180391","type":"user-reviews","attributes":{"userName":"AmericaIsMyHomeAndiLOVEIT","rating":1,"isEdited":false,"title":"Disappointed","date":"2020-07-08T17:58:19Z","review":"This app should not be allowed in the U.S.!!! It tracks me everywhere I go! Today at the grocery store, it sent me an alert about how I should buy Lysol and inject it to my blood to protect myself from COVID-19. I was so confused. I did it anyway. Now I'm at the ER with an extremely chance of dying!! Thanks Trump, because of you my phone won't charge!!! 😡"}},{"id":"6173178995","type":"user-reviews","attributes":{"userName":"I said what i had to say","rating":1,"isEdited":false,"title":"Horrible","date":"2020-07-08T17:57:52Z","review":"I was never a support and never will be one. He is trying to manipulate people and will kill anyone who gets in his way. He is the worst president I’ve even seen so far. He’s maybe a recreation of hitler. He never made America great again. He took away almost everyone’s right. I still can’t believe people actually like him."}},{"id":"6173178604","type":"user-reviews","attributes":{"userName":"Corybiggar","rating":1,"isEdited":false,"title":"Keeps opening browser to “mein kampf”??","date":"2020-07-08T17:57:44Z","review":"Downloaded this app to try and get updates about the election, but every link I clicked on hyperlinked to the translated version of Hitler’s “mein kampf.” I kept thinking that this was some kind of mistake until I saw the audiobook option was narrated by trump himself with an introduction by Mike pence? Very disappointed. Garbage app, do not install."}}]}