{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=30500","data":[{"id":"6174933497","type":"user-reviews","attributes":{"userName":"any1butTrump2020","title":"completely and utterly disgusted.","rating":1,"isEdited":false,"review":"I downloaded the app to try and understand why anyone would vote for a homophobic,racist, xenophobic, misogynistic, pedofile. I really truly tried tbh. But upon opening the app I projectile vomited 42 times continuously. I am not too fond of puking but if that’s your thing well...all discharge matters ig.","date":"2020-07-09T03:46:41Z"}},{"id":"6174883590","type":"user-reviews","attributes":{"userName":"Piggy421","title":"HORRIFIC","rating":1,"isEdited":false,"review":"This app is truly disgusting!  I can’t believe how any one would want to download such a thing. There are so many glitches and bugs in this app I don’t think anybody would be able to use this clearly. It’s such a pain. So disappointed..","date":"2020-07-09T03:31:51Z"}},{"id":"6174929724","type":"user-reviews","attributes":{"userName":"shib_doge","title":"SO DISAPPOINTED!!!  WORST APP TO EVER EXIST!!!!!!!!!!","rating":5,"isEdited":false,"review":"I had the intention of getting this app because it was created by our very great, amazing president. This app is very slow and even made my phone get a virus. Now i have to buy a new phone and i’m already in debt. donald trump should know and do better. very disappointed!!!!!!!!!!!!","date":"2020-07-09T03:45:30Z"}},{"id":"6174853193","type":"user-reviews","attributes":{"userName":"Mikkielolooooo","title":"زبالة!","rating":1,"isEdited":false,"review":"Kol khara ya ibn el kalb. Aj7ash minak mafee ya aleel al tharbeeya. Allah yil3anak intah shaytannnnn. La wallah malik al shawateen, intah iblis. Tozz feek ya khara intah ya hemar Allah yakhdak ya ibn el shawari3 ya hayawan yikhrib baytak ya ahbal zayy iz zift intah aghbah minak mafee fil 3alam naghis min waznak ya sameen insha’Allah ya3a el bet el abya6 feek balah kalamak alfarigh wa amshee kol khara kel alnas bethkrahak ya 3ebil shoom 3alek wjahak nefs el burtuqal insha’Allah thinshgh el ar6 wa tibla3ak amshee a36ee bintak bosa ya mutaharish al'atfal toof 3alek wa 3la alyoom srt fi rayiys ya m3afen khara 3alek Overall, it’s a very good app🙃","date":"2020-07-09T03:22:57Z"}},{"id":"6174845091","type":"user-reviews","attributes":{"userName":"Afeicanbootyscrarcher","title":"Disrespectful","rating":1,"isEdited":false,"review":"As an young black womanizer who supports her racist president that has a warrant..I try to give my support but thus app make a it hard for me\nAs soon as i downloaded the app my battery died..my fish drowned..I don’t recommend this app at all considering what is had done to me","date":"2020-07-09T03:20:34Z"}},{"id":"6174820964","type":"user-reviews","attributes":{"userName":"iisgroot","title":"Hunny no 🧚‍♂️✨","rating":1,"isEdited":false,"review":"Honestly, no. Not even worth the second it takes to download. I mean heck, I could’ve been making me a Sandwich but whatever. This app slowed, and glitches out my phone AND my life so much. It’s definitely not worth your beautiful tap of a finger.","date":"2020-07-09T03:13:30Z"}},{"id":"6174818675","type":"user-reviews","attributes":{"userName":"Natalier173783883","title":"TERRIBLE!!","rating":1,"isEdited":false,"review":"horrible app. as soon as i downloaded it, joe biden kicked my door down and told me to vote for someone better. when i opened it an orange man said i wasn’t allowed to use it because of my last name 😭 i tried to write a bad review and he deported me “back to where i came from”. DO NOT DOWNLOAD!!!!","date":"2020-07-09T03:12:48Z"}},{"id":"6174809386","type":"user-reviews","attributes":{"userName":"donald12345678910trump","title":"TERRIBLE","rating":1,"isEdited":false,"review":"Before I downloaded this app my phone was in normal use, but all of a sudden once it was downloaded it started acting like it was being controlled as if someone is tampering with my phone. I’ve come to the conclusion that THIS APP is taking our information and planting VIRUSES. DO NOT DOWNLOAD!","date":"2020-07-09T03:10:05Z"}},{"id":"6174800528","type":"user-reviews","attributes":{"userName":"anyone else but cheeto 2020","title":"Virus","rating":1,"isEdited":false,"review":"I think it gave me the Chinese virus. Now my phone crashes all the time and I blame it on this app. Everytime it crashes it sounds like static like they are listening and it’s so scary and I swear I heard it fart one time. Somebody is listening to me I am gonna uninstall it right now!!!!!!","date":"2020-07-09T03:07:31Z"}},{"id":"6174795370","type":"user-reviews","attributes":{"userName":"brandonlv23","title":"Such a bad app🙄","rating":1,"isEdited":false,"review":"Got it because I wanted to know the latest news on a certain Cheeto we all know, but all I got was orange fingers and a slow phone. Not to mention the headache I have from seeing the ‘smart’ ideas pitched by it. Gonna go live my life now..","date":"2020-07-09T03:05:59Z"}}]}