{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=55550","data":[{"id":"6172603299","type":"user-reviews","attributes":{"userName":"miacali_","rating":1,"review":"It took me foreverrrrr to download I just wanted to support trump as many ways as possible but when I finally opened the app IT KEPT ON GLITCHING 😕 so I deleted it","date":"2020-07-08T15:04:51Z","isEdited":false,"title":"Horrible"}},{"id":"6172598785","type":"user-reviews","attributes":{"userName":"grassiecaff","rating":1,"review":"I thought I was downloading the fascist bible but it turned out to be a knockoff version of stupidity. I think I lost brain cells the moment I downloaded this app.","date":"2020-07-08T15:03:38Z","isEdited":false,"title":"This app is the worst"}},{"id":"6172588390","type":"user-reviews","attributes":{"userName":"roblox mighty","rating":1,"review":"Take this app down it won’t even load it has bad connection and it ain’t my phone","date":"2020-07-08T15:00:48Z","isEdited":false,"title":"This is the worst app"}},{"id":"6172585056","type":"user-reviews","attributes":{"userName":"poppystarlol","rating":1,"review":"This app is absolutely the worst. I downloaded this app so that i can be informed on Donald Trump and the app mad my phone glitch and I kept getting kicked off the app.","date":"2020-07-08T14:59:52Z","isEdited":false,"title":"Review"}},{"id":"6172569936","type":"user-reviews","attributes":{"userName":"hclinton","rating":1,"review":"this app ruined my software, took away my rights, ignored a virus that’s now causing havoc, screwed my wife, brainwashed my children, and caused me to have three strokes in a row. this app needs to be not only removed, but thrown off of a cliff like a nazi thelma and louise. i’m demanding payment from the developers for all the intense trauma therapy i’m going to need.","date":"2020-07-08T14:55:41Z","isEdited":false,"title":"ruined my phone"}},{"id":"6172558658","type":"user-reviews","attributes":{"userName":"antifa✨✨✨✨✨","rating":1,"review":"i got this app to support my pedofile racist homo/transphobic piece of garbage president, but it is so hard to use this app!!! it took like 85 years to open and when it finally did i screamed because there was a racsit on the screen, then my grandma saw and she died. if i could give it a zero out of 5 i would.","date":"2020-07-08T14:52:34Z","isEdited":false,"title":"i just love my president but this ain’t it"}},{"id":"6172540018","type":"user-reviews","attributes":{"userName":"Shiomango","rating":1,"review":"It’s a waste of storage and brain cells. Please for your own sake do not download this. It’s so glitchy and my phone is barely 1 year old.","date":"2020-07-08T14:47:18Z","isEdited":false,"title":"Do NOT download this- it’s a waste"}},{"id":"6172530812","type":"user-reviews","attributes":{"userName":"tyler the creator🏌🏽‍♂️","rating":1,"review":"this app made my phone glitch HORRIBLY! my phone has 3 viruses that were not found before i downloaded this app.","date":"2020-07-08T14:44:46Z","isEdited":false,"title":"sad"}},{"id":"6172525122","type":"user-reviews","attributes":{"userName":"beetlejuice for president 2020","rating":1,"review":"At his rally’s every single person there is white. No person of color. Plus I just want to take down this app","date":"2020-07-08T14:43:09Z","isEdited":false,"title":"Hitler 2.0"}},{"id":"6172503180","type":"user-reviews","attributes":{"userName":"lolu omg","rating":1,"review":"This app has been acting very strange and stupid. I thought it would give me more in-site about the president of the United States but it has given me more reasons to vote blue. I DO NOT RECOMMEND THIS APP WHAT SO EVER.","date":"2020-07-08T14:36:55Z","isEdited":false,"title":"Horrible app"}}]}