{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=138160","data":[{"id":"6179784653","type":"user-reviews","attributes":{"review":"This app did not live up to my expectations","userName":"thisappcausedmesomichdistress","isEdited":false,"date":"2020-07-10T06:32:29Z","title":"-5/10","rating":1}},{"id":"6179784589","type":"user-reviews","attributes":{"review":"“Gen Z don’t go down without a fight” -Booker","userName":"why do i need a nickname tho😂","isEdited":false,"date":"2020-07-10T06:32:28Z","title":"GEN Z 2020 Fix America!","rating":1}},{"id":"6179784485","type":"user-reviews","attributes":{"review":"THIS APP IS ABSOLUTELY MISLEADING AND DANGEROUS! Immediately after downloading, my phone crashed and deleted all my photos :( It also spreads misinformation about Tr*mp! I had originally gotten the app to keep myself updated on political happenings, but I was disappointed to find that it completely wrecked my phone! Now, I can’t see the battery icon, and am still unable to reinstall apps. Also, my keyboard is acting up. Even a review as short as this took me almost 15 minutes to write. None of this was happening before I downloaded this app. 0/5 STARS THIS APP IS GARBAGE DONT BUY IT","userName":"anactualhonestreview","isEdited":false,"date":"2020-07-10T06:32:26Z","title":"THE WORST APP EVER","rating":1}},{"id":"6179784383","type":"user-reviews","attributes":{"review":"this app is just horrible .....\nI was curious to see and please save yourself buying a new phone because this made my phone glitch and shut it off. I know it was from this app because i was using it at that time. also if u r looking to get this app don’t because y support such a bad president 😐. this should be removed from the app store.","userName":"isndvdvab","isEdited":false,"date":"2020-07-10T06:32:23Z","title":"just don’t","rating":1}},{"id":"6179783950","type":"user-reviews","attributes":{"review":"This app is a joke. If I wanted to see pictures of orangutans and Cheeto dust I would have searched for them, not downloaded an entire app! What a waist of time and space...shame on you for creating such an offensive app.","userName":"R.I.P TROOMPA LOOMPA","isEdited":false,"date":"2020-07-10T06:32:12Z","title":"Worst app I’ve ever downloaded","rating":1}},{"id":"6179783936","type":"user-reviews","attributes":{"review":"HEYYYY I think this app is ✨inappropriate✨ and not needed.  Definitely needs to be taken down ❤️ xo","userName":"🌏world changer🌏","isEdited":false,"date":"2020-07-10T06:32:12Z","title":"WELCOME 🥰😍","rating":1}},{"id":"6179783827","type":"user-reviews","attributes":{"review":"This app is quite possibly the most complicated app I’ve ever downloaded.  I have never had this type of experience with an app before.  First, it crashed 8 times before I could even get into the sign in screen.\n\nThe questions it asked were very difficult to understand and I did not appreciate it.  Once I finally answered the various questions to the best of my ability, the app crashed AGAIN.  This is absolutely outrageous.  \n\nI went to look at Trumps plans for education, climate change, and equal protection, but I kept receiving an error message, almost as if there wasn’t a plan.  I don’t know if this portion of the app is not yet designed but I would think it should be since this has been on the App Store for quite awhile now.  \n\nOverall, I am just very disappointed in the app and I expected better.","userName":"cynicalSloth","isEdited":false,"date":"2020-07-10T06:32:09Z","title":"I wish I could give this 0 stars.","rating":1}},{"id":"6179783457","type":"user-reviews","attributes":{"review":"No","userName":"please dont i cant take it","isEdited":false,"date":"2020-07-10T06:32:01Z","title":"👎","rating":1}},{"id":"6179783325","type":"user-reviews","attributes":{"review":"Crashed my iPhone repeatedly!! Deleted it and reinstalled and continued to crash my phone. Turned my phone off and back on and still running sluggishly. Other apps are running slowly as well, making me think it’s interfering with other apps as well. Don’t like the idea of it getting information on me from all my other apps or banking apps. Feels too risky to keep using it. Will be deleting off my phone.","userName":"Schuylerivey","isEdited":false,"date":"2020-07-10T06:31:58Z","title":"Terrible!!","rating":1}},{"id":"6179783304","type":"user-reviews","attributes":{"review":"Hey. Please DO NOT download this. It’s software is WAY out of date and and made my phone crash. I honestly just wanted to keep up with the news of what’s happening in america right now, but it kept kicking me out. My phone occasionally glitches now and sometimes apps kick me out, not sure if that’s because i’ve been running them or not. But they never did that before downloading this. I do not recommend this app at all.","userName":"Fireshinei","isEdited":false,"date":"2020-07-10T06:31:58Z","title":"badddd","rating":1}}]}