{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=81160","data":[{"id":"6177877572","type":"user-reviews","attributes":{"userName":"🙀😼😻😺😽😸🤡","date":"2020-07-09T19:04:04Z","review":"Just very bad man idk what to tell you. Took a week to load.","rating":1,"isEdited":false,"title":"1/10 DO NOT RECOMMEND"}},{"id":"6177877472","type":"user-reviews","attributes":{"userName":"mykchael goobiner","date":"2020-07-09T19:04:02Z","review":"this app is truly disgusting. it took a whole week to download🤢🤢","rating":1,"isEdited":false,"title":"HORRIBLE APP"}},{"id":"6177876706","type":"user-reviews","attributes":{"userName":"Mazmad","date":"2020-07-09T19:03:47Z","review":"so he thought he could get rid of our apps and we will get rid of his lol","rating":1,"isEdited":false,"title":"HORRIBLE PRESIDENT"}},{"id":"6177824609","type":"user-reviews","attributes":{"userName":"Jillian g.","date":"2020-07-09T18:48:03Z","review":"i found ut my great president made an app so i downloded it. unfortunatelt, the contents of this app are so horrible that my daughter reading over my shoulder had a seizure. on the way to the hospital, we got pulled over (we cant afford an ambulance). the police officer saw my black husband and my half black daughter in the back and assumed that he was kidnapping us! my husband was tased for holding a banana in his hand and now hes having seizures too? i finished driving to the hospital and brought them in and the doctors said they would have to perform a surgery on my daughter for something in her brain! my husband was just to be monitored overnight with a small concussion. the surgery costed $112k and i work as a teacher so i cant afford to pay it. my husband is out of work because of covid-19, so we only have our retirement funds. turns out, our daughter DIED after surgery because of her brain. she was pronounced brain dead and we pulled the plugs because we dont have enough money. my husband seems to be getting better, but with the death of our daughter, i dont think anything will get better anytime soon. anyway, i went to delete this app and accidentally clicked on it. the flash of light caused my husband to fall into another seizure, but this time when we got to the hospital, he had a bunch of meds to keep him alive. he didnt survive. now i am sitting in my house with my stupid donald trump app and he killed my entire family. im disgusted and hurt. now i am going to speak out against police brutality and am settling for biden: we dont need the orange cheeto ugly man to be president again.","rating":1,"isEdited":false,"title":"very horrible, is killing me."}},{"id":"6177807447","type":"user-reviews","attributes":{"userName":"Whidbey owlish","date":"2020-07-09T18:43:01Z","review":"Hard pass","rating":1,"isEdited":false,"title":"It’s a no from me"}},{"id":"6177807083","type":"user-reviews","attributes":{"userName":"Diobhan","date":"2020-07-09T18:42:55Z","review":"This app stole all of my money and my data I’d be safer on tik tok!","rating":1,"isEdited":false,"title":"Absolutely horrible app"}},{"id":"6177794561","type":"user-reviews","attributes":{"userName":"jdus'whdksbwu","date":"2020-07-09T18:39:10Z","review":"It was unbearable","rating":1,"isEdited":false,"title":"There is too much spam"}},{"id":"6177783615","type":"user-reviews","attributes":{"userName":"Mira Astra","date":"2020-07-09T18:35:52Z","review":"i tried to download the app but it just keeps kicking me out if the app. it just kept crashing.","rating":1,"isEdited":false,"title":"ridiculous"}},{"id":"6177782233","type":"user-reviews","attributes":{"userName":"zayda meisner hfhff","date":"2020-07-09T18:35:27Z","review":"this App is the worst thing","rating":1,"isEdited":false,"title":"terrible"}},{"id":"6177780677","type":"user-reviews","attributes":{"userName":"reeeitsgoodreee","date":"2020-07-09T18:34:58Z","review":"I hate this app when I opened it their was an oompa lompa lookin thing on the cover and the oompa lompa that I saw is deleting TikTok so","rating":1,"isEdited":false,"title":"Oompa lompa"}}]}