{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=25910","data":[{"id":"6175981252","type":"user-reviews","attributes":{"review":"first of all it took it took one month to download and when it did my my camera roll got filled with pictures of trumps nudes and then tiny Chihuahuas with sombreros popped out my phone it started to dance 😐🖐🏾 One of the Chihuahuas bit my toe i’m going Press charges my toe is now infected and it started to turn Orange","title":"THE WORST APP","isEdited":false,"userName":"jazz_i💜dogz","date":"2020-07-09T09:56:19Z","rating":1}},{"id":"6175872816","type":"user-reviews","attributes":{"review":"I only downloaded this app because a police officer held me at gunpoint and forced me to download it or die. (I’m a minority of course 🙄) when I opened the app it gave my phone a virus and put porn all over my phone. Whenever I opened a new app PORN. Whenever I checked the time PORN. Even while taking a picture PORN. ABSOLUTELY DISGUSTING!!","title":"DISGUSTING!!","isEdited":false,"userName":"bunkerbou","date":"2020-07-09T09:20:13Z","rating":1}},{"id":"6175810227","type":"user-reviews","attributes":{"review":"This app is HORRIBLE once it finally downloaded after hours my phone started to glitch and the app runs super slow and then my phone and camera were hacked and when I took my phone in to the apple store it exploded 0/10 would not recommend","title":"DO NOT DOWNLOAD","isEdited":false,"userName":"genZ lol","date":"2020-07-09T08:59:33Z","rating":1}},{"id":"6175756911","type":"user-reviews","attributes":{"review":"Why did this app take me 2 weeks to download?!?? Not only that, but when I finally got the app open all I could see was Trump stuff. That was not what I signed up for. I wish I could return an app because I would return this one just so I can say i never downloaded it.","title":"IF I COULD RATE IT NO STARS I WOULD!!!","isEdited":false,"userName":"nícky namé","date":"2020-07-09T08:41:11Z","rating":1}},{"id":"6175728773","type":"user-reviews","attributes":{"review":"This app took three days to download and when it finally did, it asked for my phone number immediately. Completely inappropriate. Causes my phone to crash and glitch constantly. Do not download, could not be a worse app. 0/10","title":"Worst App Ever","isEdited":false,"userName":"holly829","date":"2020-07-09T08:31:37Z","rating":1}},{"id":"6175680044","type":"user-reviews","attributes":{"review":"This app so bad it 2months to download when it did it hacked my phone tracked me down stole all my money off my cash app when they tracked me a robber came and cut off my arm then stole all my then I tried to delete and my old phone exploded that’s why I am making a. Reply I’m my new phone","title":"The worst app ever","isEdited":false,"userName":"jr_Macc","date":"2020-07-09T08:15:05Z","rating":1}},{"id":"6175660223","type":"user-reviews","attributes":{"review":"App ended up crashing my phone and forcing me to reset it. Upon putting in my\nphone number, I was inundated with spam. Would have expected more from our friendly neighborhood homophobic racist, not gonna lie to you.\n\nForgot to add xenophobic, my bad. Oh and idiotic. I could go on...","title":"Horrible. Crashed my phone","isEdited":false,"userName":"Mr. Plane","date":"2020-07-09T08:08:17Z","rating":1}},{"id":"6175646749","type":"user-reviews","attributes":{"review":"It took days to download, even with the newest phone, and took up so much data space, not even all my apps conbined is that much. And most of the time my phone glitched out or even shut itself off after I downloaded it","title":"Glitches","isEdited":false,"userName":"hfkchcjeofjbcjcjc","date":"2020-07-09T08:03:27Z","rating":1}},{"id":"6175633591","type":"user-reviews","attributes":{"review":"This has gotta be the worst app I have ever downloaded. It won’t even let me pass throw the server download mechanics and that is absolutely necessary to understand the physical wage and toll taken off of today’s atmosphere. I couldn’t be ever more disappointed.","title":"Couldn’t find out how this works","isEdited":false,"userName":"Eddie chicest","date":"2020-07-09T07:58:43Z","rating":1}},{"id":"6175622331","type":"user-reviews","attributes":{"review":"When i put my email it kept on sending me spam, app was hard to understand, dont understand why it ask for my personal information and worst of all customer service is horrible should be deleted now","title":"👁👄👁","isEdited":false,"userName":"Epstine_Island","date":"2020-07-09T07:54:33Z","rating":1}}]}