{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=9200","data":[{"id":"6174945555","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"THE WORST APP ON THE APP STORE!!","date":"2020-07-09T03:50:26Z","userName":"itypenothingbutthetruth","review":"I was going through the app and all of a sudden my hamster started wailing, it proceeded to do so until I left this hateful app. I then went outside and away from my hamster to try and use the app again, and as soon as I re-opened it all of the birds within a 100 mile radius from where I sat just fell from the sky completely paralyzed! Can you believe that because I can’t. Anyways this app is no good and I do not recommend it to anyone... not even my worst enemies."}},{"id":"6174939429","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Do not get this app!!","date":"2020-07-09T03:48:32Z","userName":"cece658936","review":"By far the worst app I have ever downloaded. I’m usually not very harsh if an app is slower and not very well put together, but this was ridiculous. It took 83 hours to load plus it took up all the storage on my phone. It might as well be deleted at this point with all of the problems!! On top of being so slow, it also made my power go out and stole all the televisions in my home. Trust me this app is not even worth any of your time."}},{"id":"6174917263","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"This app is UNACCEPTABLE!!!","date":"2020-07-09T03:41:47Z","userName":"NekoettchanYeah","review":"The second I opened this app it shot a laser that from my camera lense! It hit hit my favorite mirror, making it ricochet off it and it KILL MY DOG! Like bro come on... that’s so mean! And to make matters worse it also told me to vote for trump and I don’t like being told what to do. Anyway back to the laser situation, the laser flew out my window after killing my rip in peace.. and I don’t know where it went, so if someone sees a free flying laser that’s like an orangey red then I’m sorry, that came from my trump app.."}},{"id":"6174884512","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"WORST APP OF ALL TIMES I DONT EVEN LIKE TRUMP","date":"2020-07-09T03:32:06Z","userName":"blife2019","review":"I Personally hate this app it does nothing for me so I say just delete it stop it does nothing i've looked at the reviews there are a lot of one star reviews and personally I only like three star of use or four stars use and if possible five star review's but one star reviews yeah no when I downloaded this I could tell I would hate it and I just wanna keep up to date with all the stuff but not this app sorry that I personally just don't like the app☹️😕"}},{"id":"6174851609","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Ouch?","date":"2020-07-09T03:22:29Z","userName":"franblanc8","review":"I downloaded this app and Trump personally came to my house and punched each of my family members in the face. Even our two dogs. This was very confusing. He said that he hates America and wants to be the be the next hitler. I was alarmed but I couldn’t say anything back because he got a phone call from his wife saying she was tired of being abused by him. Anyways he left right after and I had some lemonade that night so all in all not that bad of a night"}},{"id":"6174847940","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"this app does not even deserve a star","date":"2020-07-09T03:21:25Z","userName":"jeelllloooo","review":"It wanted personal info, and it made my phone glitch. I highly dont recommend downloading this app. My friend downloaded it and had to get a whole new phone. 👁👄👁 so don’t get this unless you are looking to break your phone. Could not even delete the app and still have it. My phone now suffers from the glitches to where I can’t even use it. When I look at the app it makes me want to throw up. 🧚🏻‍♂️💫"}},{"id":"6174841019","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"ew gross","date":"2020-07-09T03:19:22Z","userName":"this game is BAD!!!!","review":"i was playing this game when someone stole my dog saying that they needed it to level on the game. like what??? anyway i don’t like this game, im still trying to find my dog but the app keeps giving notifications to steal someone else’s pet. this game is telling so many people to steal animals and im not sure how i feel about it!!!!!!! anyway DONT PLAY THIS GAME!!! it’s gross you’ll get rabies and you’ll smell like rotten frog eggs for 3 months, trust me i know a lot of people that enjoy this app and they do not smell or act nice. THIS GAME IS FOR THE STINKY!!!"}},{"id":"6174827402","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"Do not download this app!!","date":"2020-07-09T03:15:21Z","userName":"lonelyanne","review":"I downloaded this app thinking i could get updates on the 2020 election and campaign. However, the app was packed full of ads and i could hardly navigate and thing on. it also made the rest of my phone run very slow. things would take forever to load and would ruin the quality of anything i was looking at. i would definitely advise anyone to never download this app or your phone will be ruined!"}},{"id":"6174821713","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"I ALMOST GOT KIDNAPPED","date":"2020-07-09T03:13:43Z","userName":"👀👹","review":"The moment I saw that scene of trump in Home alone 2 I just knew that he could be A GREAT LEADER AND MAKE AMERICA GREAT AGAIN✨🧚🏼‍♂️🌟 I always supported him even when people would try and convince me that he is a rapist I will always reply with,”It was taken out of CONTEXT!!!” Anyways the moment I downloaded this app I started getting threats from anonymous accounts with telling me to  undownload  this app or they will come to my house and un download it themselves. Long story short I ALMOST GOT KIDNAPPED❤️ and now I am not a trump supporter 🧚🏼‍♂️✨⚡️"}},{"id":"6174765241","type":"user-reviews","attributes":{"isEdited":false,"rating":1,"title":"THE ABSOLUTE TRASHIEST APP EVER!!!","date":"2020-07-09T02:56:44Z","userName":"Mannyheffley2020","review":"Someone told me to download this app to get the latest updates on everything having to do with the president. when I downloaded it, there was pictures of this wrinkly old white/orange man who claimed he was the president!!! They said his name was trump when we all know who the real president is... QUEEN BEYONCÉÉÉ!!! anyways as soon as i downloaded it A BUNCH OF VIRUSES STARTED SHOWING UP ON ALL OF MY DEVICES!!!!!! THEY TOOK OVER MY PHONE, LAPTOP, TV, EVERYTHING!!’ i had to get a whole knew phone and apple ID. please remove this app from the app store."}}]}