{"next":"/v1/catalog/us/apps/1135325440/reviews?l=en-US&offset=21230","data":[{"id":"6177166837","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T15:30:29Z","title":"AHHH✨🧚‍♂️","userName":"the.yellow.","review":"I just don’t understand the point of having this app when he already has a website it would be much easier to just keep the website and not the app, like what if the supporter doesn’t have storage yk. You should always think about others🧚‍♂️😊 so that’s why I believe this was a very BAD app"}},{"id":"6177094421","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T15:10:26Z","title":"Service >:(","userName":"yuriiiiiiiiiiiiiiiiiiiiii","review":"The service as in customer service is awful they don’t care about anything you say. Also the app crashes too often. Fix it. I may add that the plans don’t seem like they were thought about I believe that the plans are mostly stupid that is all"}},{"id":"6177047199","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T14:57:25Z","title":"no❤️","userName":"sksjdjjf","review":"i downloaded this app because i wanted to support our local cheeto man ✨ however as soon as i opened the app i was possessed by the cheeto man!!! he took over my body and started encouraging me to say racist and sexist things 🤮 i had to go to my local church to get an exorcist but they kicked me out because the cheeto man showed them his disgusting pig like nudes 🥰 so than i traveled all the way to the antártica where i found a penguin that would help me. i showed him the app and he got possessed by the cheeto man too!!!!! 0/10 would recommend this app unless you want a similar experience 😖(im still possessed btw)"}},{"id":"6177043928","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T14:56:31Z","title":"✨gross person running a gross app🙈","userName":"stmergdf","review":"✨I hate it✨when i opened the app i saw a bright orange cheeto puff staring into my soul and burning lasers through my phone! i fixed it with ramen but then when I opened it again i saw a bunch of cheetos doing a satanic ritual saying all hail onions and gravy. I WAS SO OFFENDED. THEY SACRAFICED A CHILD! then i saw the cult eating president obama and then i saw george washington’s nudes!! never buy this app again‼️"}},{"id":"6177023242","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T14:50:53Z","title":"Needless to say, I’m disappointed","userName":"allithealleycat","review":"Wow. As an American, I expect to have certain rights. No sooner do I download the app, the app asks me for my phone number. What are they going to do with my personal data? I took a pass. Maybe leave an option to use EMAIL. Deleted immediately. I don’t recommend to any Americans who care about their Liberty."}},{"id":"6176996620","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T14:43:48Z","title":"Worst app in the Apple store","userName":"Tobyy69","review":"When I downloaded the app it showed a screen saying “welcome to the dark side” and I was so appalled by this because it had assumed that I had watched Star Wars (I have not), and I realized that if it had assumed that I’ve seen star wars then it must have assumed my gender in which I take great offense to. Literally the worst app the Apple store can have."}},{"id":"6176994245","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T14:43:08Z","title":"Horrible, extremely dissapointed","userName":"waylonjake06","review":"Please do not waste your time on this app. To start things off, the loading screens took SO long, even on my literally brand new iPhone 11. There’s also so many ads, I honestly feel better off just using twitter and I advise that you to do the same, this app is pure sketch."}},{"id":"6176970343","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T14:36:37Z","title":"AWFUL","userName":"Schsfghhhfdaassaghk","review":"When I opened it I was called ugly and when I tried to find information it was all biased and racist!!!! It said we need to keep america great but if anyone were to look at America they would know it’s a dumpster fire on the way to hell❤️ anyway keeps crashing should be taken off the App Store Oompa Loompas shouldn’t have apps :/"}},{"id":"6176969337","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T14:36:20Z","title":"sksksksksk","userName":"K3NN3DI3GG","review":"uh sir why would you possibly even think that we wouldn’t fight for tiktok. tiktok has been a safe place and a home for us teens. and your mad about that. it’s disappointing that you even want to get rid of tiktok because of what we did to your rally. it’s fine tho. we are not going down without a fight. tiktok is OUR app."}},{"id":"6176961758","type":"user-reviews","attributes":{"rating":1,"isEdited":false,"date":"2020-07-09T14:34:21Z","title":"disappointed.","userName":"isabella yeah❤️","review":"as soon as i downloaded this app and opened my eyes went blank, like i was completely utterly blind. the sight of the cheeto on my screen made my eyes stop working all of a sudden, it was the scariest moment of my life THIS IS A WARNING TO EVERYONE DOWNLOADING THE APP!!!!! IT HAS VERY SEVERE SIDE EFFECTS AND IT CAN CAUSE NAUSEA AND BLINDNESS. if you struggle with this please do not download it MY VISION HAS GOTTEN BETTER BUT IT IS STILL VERY BLURRY. TAKE THIS APP DOWN NOW IT IS A DANGER TO SOCIETY!!!!!!"}}]}